//=============================================================================
// VisuStella MZ - Items & Equips Core
// VisuMZ_1_ItemsEquipsCore.js
//=============================================================================

var Imported = Imported || {};
Imported.VisuMZ_1_ItemsEquipsCore = true;

var VisuMZ = VisuMZ || {};
VisuMZ.ItemsEquipsCore = VisuMZ.ItemsEquipsCore || {};
VisuMZ.ItemsEquipsCore.version = 1.52;

//=============================================================================
/*:
* @target MZ
* @plugindesc [RPG Maker MZ] [Tier 1] [Version 1.52] [ItemsEquipsCore]
* @author VisuStella
* @url http://www.yanfly.moe/wiki/Items_and_Equips_Core_VisuStella_MZ
* @orderAfter VisuMZ_0_CoreEngine
*
* @help
* ============================================================================
* 介绍
* ============================================================================
*
* 项目与装备核心对RPG Maker MZ的物品和装备专用场景（包括商店）进行了改进，
* 并改善了它们的处理方式。通过更多的物品类别、更好的参数控制、规定等，
* 游戏开发者能够控制游戏物品的关键方面。
*
* 主要功能包括但不限于以下内容：
*
* * 修改物品场景、装备场景和商店场景的外观。
* * 将物品分类为独特和多种类别。
* * 物品场景和商店场景现在将显示物品的详细信息。
* * 新功能！可以在游戏中显示最近获得的物品上的NEW！标记。
* * 装备备注标签，用于调整超出编辑器限制的参数。
* * 装备规定，用于调整可以和不可以解除装备和/或优化的插槽类型。
* * 装备类型处理提供了对装备配置的更多控制。
* * 商店出售的物品可以根据开关隐藏/显示。
* * 商店出售的物品可以通过备注标签调整价格。
*
* ============================================================================
* 要求
* ============================================================================
*
* 此插件适用于RPG Maker MZ。在其他版本的RPG Maker中将无法运行。
*
* ------ 一级插件 ------
*
* 此插件是一个一级插件。请将其放置在插件管理器列表中低一级别的其他插件之下
* （例如：0、1、2、3、4、5）。这样可以确保您的插件与VisuStella MZ库的其他部分
* 兼容性最佳。
*
* ============================================================================
* 主要变更：新的硬编码功能
* ============================================================================
*
* 此插件为RPG Maker MZ的功能添加了一些新的硬编码功能。以下是它们的列表。
*
* ---
*
* 装备类型处理
*
* - 角色不再具有统一的装备插槽设置。职业可以通过使用备注标签进行不同的装备类型配置，
* 从而使相同名称的装备类型被视为同一类型，而不是不同类型。这意味着如果您有两个“饰品”
* 插槽，无论是通过备注标签还是通过数据库 > 类型标签的形式，它们都可以装备相同类型的
* 饰品。
*
* - “更换装备”事件命令现在已更新以反映这一新变化。在处理装备更换时，更改的插槽将会
* 切换到匹配类型的第一个空插槽。如果角色的所有匹配插槽类型都已装备，那么装备将替换
* 最后一个可用的插槽。
*
* ```

*
* ---
*
* 商店状态窗口
*
* - 商店场景中的状态窗口原本非常简陋，几乎没有显示任何信息。通过此插件的新功能进行了改变。
* 虽然商店状态窗口的内容可以通过插件参数进行自定义，但这是一个不可逆转的改变，而且对玩家
* 来说变得更好，因为它为围绕游戏物品的重要信息提供了非常需要的信息。
*
* ---
*
* 核心引擎兼容性：现代控制
*
* - 如果将VisuStella核心引擎添加到您的游戏中，并启用了现代控制功能，那么物品菜单场景、
* 装备菜单场景和商店菜单场景的控制方式将有所改变。
*
* - 物品菜单场景将自动激活物品列表窗口，使用左/右（用于单列）或Page Up/Page Down
* （用于多列）来在物品类别之间导航。在尝试出售物品时，商店菜单场景也会类似操作。
*
* - 装备菜单场景将自动激活装备插槽窗口，并在向上移动到命令窗口时才激活它。
*
* ---
*
* ============================================================================
* VisuStella MZ兼容性
* ============================================================================
*
* 尽管此插件与VisuStella MZ插件库的大多数插件兼容，但它与特定插件或特定功能不兼容。
* 本节将突出显示与此插件不兼容的主要插件/功能，或者强调如何使某些功能兼容。
* 
* ---
* 
* VisuMZ_1_BattleCore
* 
* 如果安装了BattleCore插件，则无法通过Items and Equips Core插件参数更改物品和装备
* 核心的商店状态窗口中的“Damage Multiplier”或“Healing Multiplier”词汇。
* 
* 取而代之的是，请转到BattleCore的插件参数，Damage Settings，Damage Styles，并调整
* “Damage Multiplier”或“Healing Multiplier”文本的风格版本。
* 
* 为什么要这样做？因为并非所有的伤害风格都基于“乘数”，因此为了向玩家传达正确的信息，
* 每种伤害风格都有自己的词汇，以提高准确性。
* 
* 如果您忘记了这一点，当您访问物品和装备核心的插件参数时，它还会在参数描述中提醒您
* 应该在哪里进行更改。
* 
* ---
*
* VisuMZ_2_WeaponSwapSystem
*
* VisuStella MZ的Items and Equips Core中的自定义装备插槽功能允许您添加额外的武器插槽。
* 现在最多可以为每个角色设置一个武器插槽。这需要这样做才能使武器交换系统可行。
*
* ---
*
* ============================================================================
* 注释标签
* ============================================================================
*
* 以下是通过此插件添加的注释标签。如果此插件已关闭或不存在，这些注释标签将无法在游戏中使用。

* 
* ---
*
* === 通用 ===
* 
* 这些注释标签在整体上影响物品、武器和护甲。
*
* ---
*
* <Max: x>
*
* - 使用对象：物品、武器、护甲注释标签
* - 确定此物品可以持有的最大数量。
* - 将“x”替换为一个数字值，以确定最大数量。
*
* ---
*
* <Color: x>
* <Color: #rrggbb>
*
* - 使用对象：物品、武器、护甲、技能注释标签
* - 确定游戏内菜单中对象的颜色。
* - 将“x”替换为描述窗口文本颜色的数字值。
* - 将“#rrggbb”替换为十六进制颜色代码以获取更自定义的颜色。
*
* ---
*
* <Category: x>
*
* - 使用对象：物品、武器、护甲注释标签
* - 将物品分类到某个/多个类别以与插件参数设置“Category:x”配合使用。
* - 将“x”替换为一个类别名称，以将此物品标记为该类别。
*
* ---
*
* <Categories>
*  x
*  x
* </Categories>
*
* - 使用对象：物品、武器、护甲注释标签
* - 将物品分类到某个/多个类别以与插件参数设置“Category:x”配合使用。
* - 每个“x”都替换为一个类别名称，以将此物品标记为该类别。
*
* ---
* 
* <Conserve: x%>
* 
* - 使用对象：物品
* - 使用该物品时，具有一定概率不消耗该物品。
* - 将“x”替换为表示成功保存物品的百分比概率的数字。
* - 如果物品不能被消耗，则保存机会将始终为100%。
* 
* ---
*
* === 物品可访问性注释标签 ===
*
* 以下注释标签允许您根据开关选择何时可以/不能使用物品。
*
* ---
*
* <Enable Switch: x>
*
* <Enable All Switches: x,x,x>
* <Enable Any Switches: x,x,x>
*
* - 使用对象：物品注释标签
* - 根据开关确定物品的启用状态。
* - 将“x”替换为开关ID，以确定物品的启用状态。
* - 如果使用“所有”注释变体，则物品将被禁用，直到所有开关都开启。然后它将被启用。
* - 如果使用“任意”注释变体，则如果任何开关开启，则物品将被启用。否则，它将被禁用。
*
* ---
*
* <Disable Switch: x>
*
* <Disable All Switches: x,x,x>
* <Disable Any Switches: x,x,x>
*
* - 使用对象：物品注释标签
* - 根据开关确定物品的启用状态。
* - 将“x”替换为开关ID，以确定物品的启用状态。
* - 如果使用“所有”注释变体，则物品将被启用，直到所有开关都开启。然后它将被禁用。
* - 如果使用“任意”注释变体，则如果任何开关开启，则物品将被禁用。否则，它将被启用。
*
* ---
*
* === JavaScript 注释标签：物品可访问性 ===
*
* 以下是为具有 JavaScript 知识的用户制作的注释标签，用于确定是否可以通过代码访问物品。
*
* ---
*
* <JS Item Enable>
*  code
*  code
*  enabled = code;
* </JS Item Enable>
*
* - 使用对象：物品注释标签
* - 根据 JavaScript 代码确定物品的启用状态。
* - 如果此禁用为仅限于的角色，那么它将不会显示在物品列表中，除非安装了 VisuStella 战斗核心。
*   - 如果安装了 VisuStella 战斗核心，则所有战斗范围的物品都会显示，即使它们被禁用。
* - 将“code”替换为确定物品启用状态的代码。
* - “enabled”变量返回一个布尔值（true/false），以确定物品是否启用。
* - “user”变量指的是使用该物品的角色。
* - “item”变量指的是正在检查的物品。
* - 必须满足所有其他物品条件才能使用此代码。
*
* ---
*
* === 装备注释标签 ===
*
* 以下注释标签提供与装备相关的效果，包括决定哪些装备插槽可以给予类别以及分配给武器和护甲的基本参数变化。
*
* ---
*
* <Equip Slots>
*  slotName
*  slotName
*  slotName
* </Equip Slots>
*
* - 使用对象：职业注释标签
* - 更改该职业的装备插槽配置。
* - 将“slotName”替换为来自数据库 > 类型的装备类型名称。这是区分大小写的。
* - 根据需要插入或移除任意数量的“slotName”装备类型。
*
* ---
*
* <param: +x>
* <param: -x>
*
* - 使用对象：武器、护甲注释标签
* - 更改装备物品的基本参数值。
* - 将“param”替换为以下任意一个：'MaxHP'、'MaxMP'、'ATK'、'DEF'、'MAT'、'MDF'、'AGI'、'LUK'，以更改该特定参数的值。
*   - 这些注释标签不适用于X参数、S参数或任何自定义参数。这些注释标签仅适用于基本参数。
* - 将“x”替换为要设置的参数值。
* - 这允许您绕过数据库编辑器的数字限制。

*
* ---
* 
* <Equip Copy Limit: x>
* 
* - 使用对象：武器、护甲注释标签
* - 设置角色可以装备此装备的最大副本数。
* - 将“x”替换为一个数字值，以确定副本限制。
* - 可以通过事件命令和/或脚本调用绕过此限制。
* - 使用示例：尽管有空的配饰槽，但角色只能同时装备一个“独一无二的戒指”，因为戒指带有 <Equip Copy Limit: 1> 注释标签。
* 
* ---
* 
* <Equip Weapon Type Limit: x>
* 
* - 使用对象：武器注释标签
* - 一旦达到限定数量，此武器不能与同类型的其他武器同时装备。
* - 将“x”替换为一个数字值，以确定武器类型限制。
* - 可以通过事件命令和/或脚本调用绕过此限制。
* - 使用示例：一名双持武士只能装备一把剑和一把匕首，但永远不能同时装备两把剑或两把匕首，因为所有剑和匕首都有 <Equip Weapon Type Limit: 1> 注释标签。
* 
* ---
* 
* <Equip Armor Type Limit: x>
* 
* - 使用对象：护甲注释标签
* - 一旦达到限定数量，此护甲不能与同类型的其他护甲同时装备。
* - 将“x”替换为一个数字值，以确定护甲类型限制。
* - 可以通过事件命令和/或脚本调用绕过此限制。
* - 使用示例：人们不能同时装备两个手套配饰，因为手套是“手套”护甲类型，每个手套物品都有 <Equip Armor Type Limit: 2> 注释标签。
* 
* ---
* 
* <Party Artifact>
* <Troop Artifact>
* 
* <Stackable Party Artifact>
* <Stackable Troop Artifact>
* 
* - 使用对象：护甲注释标签
* - 此护甲根本不能被装备。但是，只要存在于队伍的库存中，其参数加成和特性将全局应用于整个队伍或敌群（取决于注释标签）。
* - 添加两个注释标签以影响两个群体。
* - 普通版本的注释标签仅适用一次，无论队伍库存中的副本数量如何。
* - 可堆叠版本的注释标签将根据队伍库存中的副本数量多次叠加奖励和特性。
* - 此物品在战斗测试的设置阶段不会添加。
*   - 如果要添加该物品，请手动执行。
* 
* ---
* 
* <Equip For Class Only: x>
* <Equip For Classes Only: x, x, x>
* <Equip For Class Only: name>
* <Equip For Classes Only: name, name, name>
* 
* - 使用对象：武器、护甲注释标签
* - 此装备只能由主类为“x”的成员佩戴。如果列出了多个类别，则至少一个必须是角色的主类。
* - 将“x”替换为所需类别的ID号。
* - 对于“name”变体，将“name”替换为角色需要拥有才能装备该物品的类别名称。
* 
* ---
* 
* <Equip Requirements>
*  requirement
*  requirement
*  requirement
* </Equip Requirements>
* 
* - 使用对象：武器、护甲注释标签
* - 定义角色必须满足的要求，以便装备该装备物品。
* - 未能满足这些要求将导致装备自动卸下。
*   - 请注意，在某些情况下，这不会立即发生。像开关这样的事物将需要角色满足其缓存清除才能触发自动卸下。
*   - 触发缓存清除的一些方法包括更改角色的HP/MP，或者为角色添加然后移除状态（最好是没有真实效果的未使用状态）。
* - 将“requirement”替换为以下设置之一：
* - 添加多个“requirement”行以添加更多要求。
* 
*   要求：
*
*   param > x
*   param >= x
*   param === x
*   param <= x
*   param < x
*   - 将“param”替换为“level”、“maxhp”、“maxmp”、“atk”、“def”、“mat”、“mdf”、“agi”或“luk”中的任何一个，以更改该特定参数的值。
*   - 这将使装备物品要求角色的基本参数大于（>）、大于或等于（>=）、等于（===）、小于或等于（<=）或小于（<）。
*   - 这不是总参数值，只是基本参数。
*   - 基本参数通过用户的类别参数值计算，以及通过永久性统计增加获得的任何奖励。
*
*   learned skill: x
*   learned skill: name
*   - 这将使装备物品要求角色已学习技能“x”。
*   - 如果使用“name”，优先级将给予数据库中具有最高ID的技能。
*   - 角色需要已学习技能。这意味着如果通过特性添加了技能到角色的工具包中，它将不会计数。
*
*   switch: x
*   - 这将要求开关X开启。
*   - 如果没有，装备物品将不能佩戴。
*   - 插入多个以添加更多要求的开关。
* 
*   ***注意 1***
*   这些装备要求中没有“class: x”。相反，请使用上面列出的<Equip For Class Only: x>注释标签。
* 
*   ***注意 2***
*   对于想知道“仅唯一”的人来说，这在此插件中不存在。相反，请使用上面列出的<Equip Copy Limit: x>注释标签。
* 
*   示例 A:
* 
*     <Equip Requirements>
*     level >= 20
*     </Equip Requirements>
* 
*     - 要求用户至少达到20级才能装备。
* 
*   示例 B:
* 
*     <Equip Requirements>
*     atk >= 50
*     def <= 50
*     </Equip Requirements>
*     - 要求用户至少具有50基础攻击力才能装备。
*     - 要求用户基础防御力不超过50才能装备。
* 
* ---
* 
* <Added EType: x>
* <Added ETypes: x, x, x>
* 
* - 使用对象：护甲注释标签
* - 仅适用于护甲，不适用于武器！
* - 允许一件护甲属于多个EType。这意味着手套可以装备为“武器”或“配饰”。
* - 将“x”替换为要添加到ETypes列表中的EType的ID号。
*   - 插入多个“x”条目以添加多个EType ID。

* 
* ---
* 
* <Cursed>
* 
* - 用于：武器、护甲备注标签
* - 如果该武器或护甲被装备，玩家不能手动移除，直到它被净化。
* - 要移除它，必须通过事件命令、脚本调用或通过本插件提供的净化相关插件命令。
* - 一旦净化，除非具有净化变形，否则该武器或护甲将被取消装备。
*   - 如果新转化的武器/护甲可以装备，它将保留在角色的装备槽中。
* - 如果使用了VisuMZ_2_WeaponSwapSystem，为了允许自由武器交换，武器不能被诅咒。
*   如果安装了VisuMZ_2_WeaponSwapSystem，则武器不会被诅咒。
* 
* ---
* 
* <净化变形: id>
* <净化变形: 名称>
* 
* - 用于：武器、护甲备注标签
* - 如果在<Cursed>武器或护甲上存在此备注标签，那么在角色接受净化时，该武器或护甲将会转化为另一个物品。
* - 将'id'替换为表示转化后武器/护甲的ID号。
* - 将'name'替换为表示转化后武器/护甲的名称文本。
* - 武器只能转化为武器。
* - 护甲只能转化为护甲。
* 
* ---
* 
* === JavaScript备注标签：装备 ===
* 
* 以下是为了具有JavaScript知识的用户而设计的备注标签，用于通过代码调整参数。
* 
* ---
* 
* <JS参数>
*  MaxHP = 代码;
*  MaxMP = 代码;
*  攻击 = 代码;
*  防御 = 代码;
*  魔法攻击 = 代码;
*  魔法防御 = 代码;
*  敏捷 = 代码;
*  幸运 = 代码;
* </JS参数>
* 
* - 用于：武器、护甲备注标签
* - 使用JavaScript来确定基本参数的值，基于用于计算其值的代码。
* - 变量'MaxHP'、'MaxMP'、'攻击'、'防御'、'魔法攻击'、'魔法防御'、'敏捷'和'幸运'用于确定参数的最终值。此变量区分大小写。
* - 如果参数不存在，则其值将被视为+0。
* 
* ---
* 
* === 状态窗口备注标签 ===
* 
* 以下备注标签将影响商店状态窗口信息。如果显示的数据不符合您的口味或不足，可以使用以下备注标签进行更改。
* 
* ---
* 
* <状态信息>
*  键：数据
*  键：数据
*  键：数据
* </状态信息>
* 
* - 用于：技能、物品备注标签
* - 如果您不喜欢显示的生成数据，可以使用此备注标签来显示您想要的内容。
* - 将'键'替换为以下选项之一：
*   - 消耗品
*   - 数量
*   - 场合
*   - 范围
*   - 速度
*   - 成功率
*   - 重复
*   - 命中类型
*   - 元素
*   - 伤害倍增器
*   - HP恢复
*   - MP恢复
*   - TP恢复
*   - HP伤害
*   - MP伤害
*   - TP伤害
*   - 用户TP增益
*   - 增加效果
*   - 移除效果
* - 将'data'替换为您希望在视觉上显示的文本数据。您可以使用文本代码。
* - 这仅影响已可见的信息条目，不会使其他类别突然出现。
* - 根据需要插入或删除“键：数据”行。
* 
* ---
* 
* <自定义状态信息>
*  键：数据
*  键：数据
*  键：数据
* </自定义状态信息>
* 
* - 用于：技能、物品
* - 如果您希望为您的物品显示自定义类别和数据，而商店状态窗口信息未提供，您可以使用此备注标签添加自己的条目。
* - 将'键'替换为您希望的确切标签文本。您可以使用文本代码。
* - 将'data'替换为您希望的确切文本数据。您可以使用文本代码。
* - 根据需要插入或删除“键：数据”行。
* 
* ---
* 
* <商店图片名称: 文件名>
* 
* - 用于：技能、物品、武器、护甲备注标签
* - 为状态窗口启用商店图片。如果启用，此图像可以在物品场景、商店场景和技能场景中看到。
* - 如果不使用此备注标签，则不会显示图像。
* - 将'文件名'替换为游戏项目img/pictures/文件夹中要使用的图形的文件名。文件名区分大小写。不包括文件名扩展名在备注标签中。
* - 使用支持的备注标签确定图像出现的位置。如果不使用，则默认为背景，适合窗口尺寸，居中于窗口中间。
* 
* ---
* 
* <商店图片层级: 背景>
* <商店图片层级: 前景>
* 
* - 用于：技能、物品、武器、护甲备注标签
* - 确定图形将绘制在哪一层。
* - 如果选择背景层，则图像将显示在数据文本后面。
* - 如果选择前景层，则图像将显示在数据文本前面。
* - 如果不使用此备注标签，则默认为背景层。
* 
* ---
* 
* <商店图片最大宽度: x>
* <商店图片最大高度: y>
* <商店图片最大尺寸: x, y>
* 
* - 用于：技能、物品、武器、护甲备注标签
* - 确定图像的最大宽度和/或高度。
* - 这意味着图像将按比例缩放到该宽度或高度，只要其他所有内容不超出边界。
* - 将'x'和'y'替换为表示图像可以达到的最大尺寸的数字值，单位为像素。
* - 如果不使用这些备注标签，则图像将自动缩放为商店状态窗口的尺寸。
* 
* ---
* 
* <商店图片对齐: 左>
* <商店图片对齐: 中>
* <商店图片对齐: 右>
* 
* - 用于：技能、物品、武器、护甲备注标签
* - 调整图像的水平对齐方式。
* - 左、中、右确定图像在水平方向上的对齐方式，如果图像在窗口宽度内无法水平对齐。
* - 如果未使用任何这些备注标签，则图像将默认为'中'对齐。
* 
* ---
* 
* <商店图片位置: 顶部>
* <商店图片位置: 中间>
* <商店图片位置: 底部>
* 
* - 用于：技能、物品、武器、护甲备注标签
* - 调整图像的垂直位置。
* - 顶部、中间、底部确定图像在垂直方向上的位置，如果图像在窗口高度内无法垂直对齐。
* - 如果未使用任何这些备注标签，则图像将默认为'中间'位置。
* 
* ---
* 
* <商店图片偏移X: +x>
* <商店图片偏移X: -x>
* 
* <商店图片偏移Y: +y>
* <商店图片偏移Y: -y>
* 
* <商店图片偏移: +x, +y>
* <商店图片偏移: -y, -y>
* 
* - 用于：技能、物品、武器、护甲备注标签
* - 调整图像在商店状态窗口中的X和Y位置。
* - X偏移调整横向位置，单位为x像素。
*   - 正数向右。
*   - 负数向左。
* - Y偏移调整纵向位置，单位为y像素。
*   - 正数向下。
*   - 负数向上。
* - 将'x'和'y'替换为要偏移图像的像素值。需要使用'+'和'-'符号。
* - 如果未使用这些备注标签，则不会进行偏移。
* 
* ---
* 
* <商店图片透明度: x>
* <商店图片透明度: x%>
* 
* - 用于：技能、物品、武器、护甲备注标签
* - 调整所使用图像的透明度。
* - 使用'x'而不是'x%'时，使用介于0和255之间的数字。
*   - 越接近0，图像越透明。
*   - 越接近255，图像越不透明。
* - 使用'x%'而不是'x'时，使用介于0%和100%之间的数字。
*   - 越接近0%，图像越透明。
*   - 越接近100%，图像越不透明。
* 
* ---
* 
* === 商店菜单备注标签 ===
* 
* 这些备注标签调整了商店菜单内价格管理以及根据开关状态确定某些物品是否可见等功能。
* 
* ---
* 
* <价格: x>
* 
* - 用于：物品、武器、护甲备注标签
* - 调整此物品的购买价格。
* - 将'x'替换为表示所需购买价格的数字。
* - 这允许您绕过RPG Maker MZ编辑器的999,999限制。
* 
* ---
* 
* <可出售>
* <不可出售>
* 
* - 用于：物品、武器、护甲备注标签
* - 使该物品始终可出售或不可出售。
* - 这可以绕过游戏内部的硬编码，防止价格为0的物品能够出售。
* - 这可以绕过游戏内部的硬编码，始终允许价格值的物品能够出售。
* 
* ---
* 
* <出售价格: x>
* 
* - 用于：物品、武器、护甲备注标签
* - 将出售价格更改为与默认金额不同的值。
* - 将'x'替换为表示所需出售价格的数字。
* 
* ---
* 
* <显示商店开关: x>
* 
* <显示商店所有开关: x,x,x>
* <显示商店任意开关: x,x,x>
* 
* - 用于：物品、武器、护甲备注标签
* - 根据开关确定商店项目的可见性。
* - 将'x'替换为开关ID，以确定商店项目的可见性。
* - 如果使用了'所有'备注标签变体，则在所有开关打开之前，项目将隐藏。然后，它将显示。
* - 如果使用了'任意'备注标签变体，则如果任何开关打开，则显示项目。否则，将隐藏项目。
* 
* ---
* 
* <隐藏商店开关: x>
* 
* <隐藏商店所有开关: x,x,x>
* <隐藏商店任意开关: x,x,x>
* 
* - 用于：物品、武器、护甲备注标签
* - 根据开关确定商店项目的可见性。
* - 将'x'替换为开关ID，以确定商店项目的可见性。
* - 如果使用了'所有'备注标签变体，则在所有开关打开之前，项目将显示。然后，它将隐藏。
* - 如果使用了'任意'备注标签变体，则如果任何开关打开，则隐藏项目。否则，将显示项目。
* 
* ---
* 
* <不可出售开关: x>
* 
* <不可出售所有开关: x,x,x>
* <不可出售任意开关: x,x,x>
* 
* - 用于：物品、武器、护甲备注标签
* - 根据开关确定商店项目的可出售性。
* - 将'x'替换为开关ID，以确定商店项目的可出售性。
* - 如果使用了'所有'备注标签变体，则在所有开关打开之前，项目不能出售。否则，可以出售。
* - 如果使用了'任意'备注标签变体，则如果任何开关打开，则项目不能出售。否则，可以出售。
* 
* ---
* 
* <购买打开开关: x>
* <购买打开开关: x,x,x>
* 
* - 用于：物品、武器、护甲备注标签
* - 当在商店场景中购买此物品、武器或护甲时，打开开关“x”。
* - 将'x'替换为要打开的开关ID。
*   - 插入多个“x”值以在购买时打开多个开关。
* 
* ---
* 
* <购买关闭开关: x>
* <购买关闭开关: x,x,x>
* 
* - 用于：物品、武器、护甲备注标签
* - 当在商店场景中购买此物品、武器或护甲时，关闭开关“x”。
* - 将'x'替换为要关闭的开关ID。
*   - 插入多个“x”值以在购买时关闭多个开关。
* 
* ---
* 
* <销售打开开关: x>
* <销售打开开关: x,x,x>
* 
* - 用于：物品、武器、护甲备注标签
* - 当在商店场景中出售此物品、武器或护甲时，打开开关“x”。
* - 将'x'替换为要打开的开关ID。
*   - 插入多个“x”值以在出售时打开多个开关。
* 
* ---
* 
* <销售关闭开关: x>
* <销售关闭开关: x,x,x>
* 
* - 用于：物品、武器、护甲备注标签
* - 当在商店场景中出售此物品、武器或护甲时，关闭开关“x”。
* - 将'x'替换为要关闭的开关ID。
*   - 插入多个“x”值以在出售时关闭多个开关。
* 
* ---
* 
* === JavaScript备注标签：商店菜单 ===
* 
* 以下是为具有JavaScript知识的用户制作的备注标签。这些备注标签主要针对购买和销售价格。
* 
* ---
* 
* <JS购买价格>
*  代码
*  代码
*  价格 = 代码;
* </ JS购买价格>
* 
* - 用于：物品、武器、护甲备注标签
* - 替换'代码'以确定购买'价格'项目。
* - 将最终购买价格插入“价格”变量中。
* - '项目'变量指的是正在购买的项目。
* 
* ---
* 
* <JS销售价格>
*  代码
*  代码
*  价格 = 代码;
* </ JS销售价格>
* 
* - 用于：物品、武器、护甲备注标签
* - 替换'代码'以确定销售'价格'项目。
* - 将最终销售价格插入“价格”变量中。
* - '项目'变量指的是正在出售的项目。

*
* ---
*
* ============================================================================
* 插件命令
* ============================================================================
*
* 以下是随插件提供的插件命令。它们可以通过“插件命令”事件指令访问。
*
* ---
* 
* === 角色插件命令 ===
* 
* ---
*
* 角色: 更改装备槽位
* - 强制更改角色的装备槽位。
* - 这些更改将在职业变更时保持不变。
*
*   角色ID:
*   - 选择要影响的角色ID。
*
*   装备槽位:
*   - 插入您希望角色拥有的装备槽位。
*   - 这些条目区分大小写。
*
* ---
*
* 角色: 重置装备槽位
* - 重置角色的所有强制装备槽位。
* - 装备槽位将根据角色当前职业重新确定。
*
*   角色ID:
*   - 选择要影响的角色ID。
*
* ---
* 
* === 净化插件命令 ===
* 
* ---
* 
* 净化: 目标角色
* - 从目标角色身上净化任何被诅咒的武器或护甲。
* - 不能在战斗中使用。
* 
*   角色ID:
*   - 选择要影响的角色ID。
* 
* ---
* 
* 净化: 整个队伍
* - 从整个队伍中净化任何被诅咒的武器或护甲。
* - 不能在战斗中使用。
* 
* ---
* 
* === 商店插件命令 ===
* 
* ---
*
* 商店: 高级设置
* - 更便捷地配置商店的库存。
* - 警告：不允许特定事件价格。
*
*   步骤1: 物品ID
*   - 选择要添加的物品ID范围。
*
*   步骤2: 武器ID
*   - 选择要添加的武器ID范围。
*
*   步骤3: 护甲ID
*   - 选择要添加的护甲ID范围。
*
*   步骤4: 仅限购买？
*   - 将商店设为仅能购买？
* 
*   可选项:
* 
*     黑名单
*     - 从商店中排除的类别列表。
*     - 如果为空则不使用。使用 <类别: x> 标记类别。
* 
*     白名单
*     - 商店中允许的类别列表。
*     - 如果为空则不使用。使用 <类别: x> 标记类别。
*
* 此插件命令主要用作编辑器中“商店处理”事件指令的替代品，因为后者需要逐个添加物品，非常繁琐。这个插件命令通过允许使用ID范围来确定哪些物品可用来减轻这一问题。

*
* ---
*
* ============================================================================
* 插件参数：物品菜单设置
* ============================================================================
*
* 物品菜单设置允许您调整物品菜单场景中关键对象和窗口的具体操作方式。
*
* ---
*
* 通用窗口
*
*   使用更新的布局：
*   - 是否使用此插件提供的更新的物品菜单布局？
*   - 这将自动启用状态窗口。
*   - 这将覆盖核心引擎窗口设置。
*
*   布局样式：
*   - 如果使用更新的布局，您希望如何设计菜单场景？
*     - 上方帮助，左侧输入
*     - 上方帮助，右侧输入
*     - 下方帮助，左侧输入
*     - 下方帮助，右侧输入
*
* ---
*
* 列表窗口
* 
*   列数：
*   - 最大列数。
*   - 如果您使用VisuStella MZ核心引擎和“现代控件”插件参数，请阅读相关部分，了解在同时使用多列物品时如何切换类别的操作方式。
*
* ---
*
* 物品数量
*
*   物品最大：
*   武器最大：
*   护甲最大：
*   - 物品、武器和/或护甲的默认最大数量。
* 
*   数量格式：
*   - 显示物品数量的方式。
*   - %1 - 物品数量
*
*   字体大小：
*   - 物品数量的默认字体大小。
*
* ---
*
* 商店状态窗口
* 
*   在物品菜单中显示？：
*   - 是否在物品菜单中显示商店状态窗口？
*   - 如果启用了更新的布局，则此选项可用。
*
*   调整列表窗口？：
*   - 如果使用商店状态窗口，是否自动调整物品列表窗口？
* 
*   背景类型：
*   - 为此窗口选择背景类型。
*     - 0 - 窗口
*     - 1 - 暗淡
*     - 2 - 透明
*
*   JS：X、Y、W、H：
*   - 用于确定物品菜单中此状态窗口尺寸的代码。
*
* ---
*
* 按钮辅助窗口
*
*   切换类别：
*   - 用于切换类别的按钮辅助文本。
*   - 适用于VisuStella MZ核心引擎的按钮辅助窗口。

*
* ---
*
* ============================================================================
* 插件参数：物品类别
* ============================================================================
*
* 物品类别同时出现在物品菜单场景和商店菜单场景（仅在出售命令下）。这些插件参数使您能够添加您想要显示的特定类别，移除您不需要的类别，并将它们与图标关联起来。
*
* ---
*
* 列表
*
*   类别列表
*   - 物品/商店菜单中显示的物品类别列表。
* 
*     类型：
*     - 物品/商店菜单中显示的物品类别列表。
*     - 使用数字或文本替换x。
*     - AllItems（所有物品）、RegularItems（常规物品）、KeyItems（关键物品）
*     - HiddenItemA（隐藏物品A）、HiddenItemB（隐藏物品B）
*     - Consumable（可消耗）、Nonconsumable（不可消耗）
*     - AlwaysUsable（总是可用）、BattleUsable（战斗可用）、FieldUsable（场地可用）、NeverUsable（从不可用）
*     - AllWeapons（所有武器）、WType:x（武器类型：x）
*     - AllArmors（所有护甲）、AType:x（护甲类型：x）、EType:x（装备类型：x）
*     - Category:x（类别：x）
* 
*     图标：
*     - 此类别使用的图标。
*     - 使用0表示无图标。
* 
*     可见性开关：
*     - 必须打开此开关才能显示类别。
*     - 使用0表示无需开关要求。
* 
*     排序方式：
*     - 在Scene_Item和Scene_Shop中如何排序此类别。
*
*   样式：
*   - 您希望如何绘制类别窗口中的条目？
*   - 仅文本：仅显示文本。
*   - 仅图标：仅显示图标。
*   - 图标 + 文本：先显示图标，然后是文本。
*   - 自动：根据单元格大小确定更适合使用哪种方式。
*
*   文本对齐
*   - 决定文本对齐方式。
*
* ---
*
* 词汇
*
*   隐藏物品A
*   隐藏物品B
*   可消耗
*   不可消耗
*   总是可用
*   战斗可用
*   场地可用
*   从不可用
*   - 物品菜单中这些类别的名称。
*
* ---
*
* ============================================================================
* 插件参数：NEW！标签
* ============================================================================
*
* 每当玩家获得新物品时，在浏览显示该物品的菜单时，可以在物品图标的顶部放置一个NEW！标签。这是现代RPG中的一个便利功能，帮助玩家了解他们最近获得的物品。以下是用于调整游戏中如何处理NEW！标签的插件参数。
*
* ---
*
* NEW！标签
* 
*   使用NEW！标签？：
*   - 是否使用NEW！标签？
* 
*   图标：
*   - 用于表示NEW！文本的图标索引。
*   - 使用0表示不绘制任何图标。
* 
*   文本：
*   - 在NEW！标签上显示的文本。
* 
*     字体颜色：
*     - 使用#rrggbb自定义颜色或从窗口皮肤中选择文本颜色的常规数字。
* 
*     字体大小：
*     - NEW！文本使用的字体大小。
* 
*   淡化限制：
*   - 在反转之前的不透明上限是多少？
* 
*   淡化速度：
*   - NEW！标签的淡化速度是多少？
* 
*   X偏移量：
*   - NEW！标签的X位置偏移量。
* 
*   Y偏移量：
*   - NEW！标签的Y位置偏移量。
*
* ---
*
* ============================================================================
* 插件参数：装备菜单设置
* ============================================================================
*
* 这些插件参数调整了装备菜单场景，从使用更新和现代化的布局，更改其他窗口的样式，到装备菜单场景的其他关键视觉方面。这里的其他设置允许您根据某些规定调整装备的操作方式。
*
* ---
*
* 通用
* 
*   使用更新的布局：
*   - 是否使用此插件提供的更新的装备布局？
*   - 这将覆盖核心引擎窗口设置。
* 
*     参数字体大小：
*     - 参数值使用的字体大小。
* 
*     显示菜单肖像？：
*     - 如果安装了主菜单核心，是否显示菜单肖像而不是角色的面孔在状态窗口中？
* 
*     JS：肖像上部：
*     - 如果可用菜单肖像，此代码用于在状态窗口中绘制上部数据。
* 
*     JS：面孔上部：
*     - 如果使用面孔，此代码用于在状态窗口中绘制上部数据。
* 
*     JS：参数下部：
*     - 决定如何在状态窗口中绘制参数的代码。
*
*   布局样式：
*   - 如果使用更新的布局，您希望如何设计菜单场景？
*     - 上方帮助，左侧输入
*     - 上方帮助，右侧输入
*     - 下方帮助，左侧输入
*     - 下方帮助，右侧输入
* 
*   状态窗口宽度：
*   - 使用非更新的装备菜单布局时状态窗口的通常宽度。
* 
*   显示背景矩形？：
*   - 显示较暗颜色的背景矩形以更好地显示信息？
* 
*     背景矩形颜色：
*     - 使用#rrggbb自定义颜色或从窗口皮肤中选择文本颜色的常规数字。
* 
*   诅咒装备弹出：
*   - 当角色装备诅咒武器/护甲时出现文本弹出。
*   - 允许使用文本代码。
*   - 需要VisuMZ_0_CoreEngine！
*   - 留空表示不使用。
*   - %1 - 角色，%2 - 装备，%3 - 图标。
*
* ---
*
* 命令窗口
* 
*   样式：
*   - 您希望如何在命令窗口中绘制命令？
*   - 仅文本：仅显示文本。
*   - 仅图标：仅显示图标。
*   - 图标 + 文本：先显示图标，然后是文本。
*   - 自动：根据单元格大小确定更适合使用哪种方式。
* 
*   文本对齐：
*   - 命令窗口的文本对齐方式。
* 
*   装备图标：
*   - 用于装备命令的图标。
* 
*     帮助描述：
*     - 选择此命令时使用的帮助描述。
*     - 允许文本代码。
* 
*   添加优化命令？：
*   - 在命令窗口中添加“优化”命令？
* 
*     帮助描述：
*     - 选择此命令时使用的帮助描述。
*     - 允许文本代码。
* 
*     优化图标：
*     - 用于优化命令的图标。
* 
*   添加清除命令？：
*   - 在命令窗口中添加“清除”命令？
* 
*     帮助描述：
*     - 选择此命令时使用的帮助描述。
*     - 允许文本代码。
* 
*     清除图标：
*     - 用于清除命令的图标。
*
* ---
*
* 移除装备
* 
*   图标：
*   - 用于装备移除的图标。
* 
*   文本：
*   - 用于装备移除的文本。
* 
*   使用SHIFT快捷键？：
*   - 将“Shift”按钮作为快捷键添加到移除物品？
*
* ---
*
* 规则
* 
*   装备-调整HP/MP：
*   - 更改装备后根据MaxHP/MaxMP值调整HP/MP差异。
* 
*   不可移除类型：
*   - 必须始终装备物品且不可为空的装备类型ID。
* 
*   非优化类型：
*   - 在优化装备时将忽略的装备类型ID。
*
* ---
*
* 按钮辅助窗口
*
*   SHIFT：移除：
*   - 用于SHIFT移除快捷方式的按钮辅助文本。
*   - 适用于VisuStella MZ核心引擎的按钮辅助窗口。

*
* ---
*
* ============================================================================
* 插件参数：商店菜单设置
* ============================================================================
*
* 这些插件参数允许您调整商店菜单场景的多个选项。这些选项包括启用更新和现代化的布局，调整各种关键视觉方面的显示方式，以及确定在购买或销售物品时价格如何受影响（供编码者使用）。
*
* ---
*
* 通用
* 
*   使用更新的布局：
*   - 是否使用此插件提供的更新的商店布局？
*   - 这将覆盖核心引擎窗口设置。
*
*   布局样式：
*   - 如果使用更新的布局，您希望如何设计菜单场景？
*     - 上方帮助，左侧输入
*     - 上方帮助，右侧输入
*     - 下方帮助，左侧输入
*     - 下方帮助，右侧输入
*
* ---
* 
* 开关：
* 
*   开关：购买：
*   - 在商店场景购买物品会将此开关设置为打开。
*   - 商店场景关闭时，开关会恢复为关闭。
* 
*   开关：出售：
*   - 在商店场景销售物品会将此开关设置为打开。
*   - 商店场景关闭时，开关会恢复为关闭。
* 
* ---
*
* 命令窗口
* 
*   隐藏不可用？：
*   - 隐藏所有不可用命令，例如商店设为仅购买？
* 
*   样式：
*   - 您希望如何在命令窗口中绘制命令？
*   - 仅文本：仅显示文本。
*   - 仅图标：仅显示图标。
*   - 图标 + 文本：先显示图标，然后是文本。
*   - 自动：根据单元格大小确定更适合使用哪种方式。
* 
*   文本对齐：
*   - 命令窗口的文本对齐方式。
* 
*   购买图标：
*   - 购买命令使用的图标。
* 
*   出售图标：
*   - 出售命令使用的图标。
* 
*   取消图标：
*   - 取消命令使用的图标。
* 
*   重命名“取消”：
*   - 为商店菜单场景重命名“取消”为更合逻辑的名称。
*
* ---
*
* 价格
* 
*   出售价格比率：
*   - 默认的出售价格比率。
* 
*   JS：购买价格：
*   - 在最终确定购买价格之前对购买价格进行的修改。
* 
*   JS：出售价格：
*   - 在最终确定销售价格之前对销售价格进行的修改。
*
* ---
*
* 按钮辅助窗口
*
*   小增量：
*   大增量：
*   - 用于更改购买/出售数量的文本。
*   - 适用于VisuStella MZ核心引擎的按钮辅助窗口。
*
* ---
*
* ============================================================================
* 插件参数：商店状态窗口
* ============================================================================
*
* 这些插件参数专注于商店状态窗口，并确定其数据的显示方式。
*
* ---
*
* 通用
* 
*   窗口宽度：
*   - 状态窗口的通常宽度。
* 
*   参数字体大小：
*   - 用于参数更改的字体大小。
* 
*   半透明不透明度：
*   - 用于半透明窗口对象的不透明度设置。
* 
*   显示背景矩形？：
*   - 显示较暗颜色的背景矩形以更好地显示信息？
* 
*     背景矩形颜色：
*     - 使用#rrggbb自定义颜色或从窗口皮肤中选择文本颜色的常规数字。
*
* ---
*
* 装备数据
* 
*   已装备：
*   - 用于显示角色无法装备物品的标记。
* 
*   无法装备：
*   - 用于显示角色无法装备物品的标记。
* 
*   延迟毫秒数：
*   - 延迟预览更新的毫秒数（MS）？
*   - 这是为了仅限装备时防止延迟峰值。
* 
*   无变化：
*   - 用于显示未发生任何变化的标记。
* 
*   JS：绘制装备数据：
*   - 用于在商店状态窗口中绘制装备数据的代码。
*
* ---
*
* 物品数据
* 
*   最大状态/增益图标数：
*   - 可显示的最大图标数，用于添加/移除状态/增益。
* 
*   倍增标准：
*   - 计算伤害倍增器时的常数标准，用于过滤随机值。
* 
*   JS：绘制物品数据：
*   - 用于在商店状态窗口中绘制物品数据的代码。
*
* ---
*
* 词汇
* 
*   可消耗：
*   场合：
*   范围：
*   速度：
*   成功率：
*   重复次数：
*   命中类型：
*   元素：
*   伤害类型：
*   效果：
*   - 用于这些数据条目的词汇。
*   - 其中一些插件参数有子条目。
* 
*   注意：关于伤害标签
* 
*   如果安装了Visu_1_BattleCore，则优先考虑其伤害风格设置。显示的标签基于该特定技能或物品的伤害风格设置。
* 
*   转到Battle Core > 插件参数 > 伤害设置 > 样式列表 >
*   选择您想编辑的伤害风格 > 伤害标签，并在那里更改您喜欢的文本设置。

*
* ---
*
* ============================================================================
* 使用条款
* ============================================================================
*
* 1. 可以在免费或商业游戏中使用这些插件，前提是必须通过VisuStella.com和/或任何其他官方批准的VisuStella来源合法获取。
*    如果有例外情况或特殊情况禁止使用，将在VisuStella.com上列出。
* 
* 2. 在您的游戏中，必须给予此插件中在“制作人员”部分列出的所有制作人员适当的鸣谢，或以集体名义列为“VisuStella”。
* 
* 3. 您可以编辑源代码以满足您的需求，但不得声称这些源代码属于您。如果对插件进行了任何更改，VisuStella也不对插件负责，
*    也不对用户提供的自定义代码（包括高级JavaScript标签和/或允许自定义JavaScript代码的插件参数）的工作负责。
* 
* 4. 您不得重新分发这些插件，也不得将此插件的代码用作自己的代码。这些插件及其代码仅可从VisuStella.com和其他
*    官方/批准的VisuStella来源下载。您可以在VisuStella.com上找到官方/批准来源的列表。
* 
* 5. VisuStella对于由于意外使用、与VisuStella MZ库外插件的不兼容问题、未更新的插件版本、以及第三方制作的兼容性补丁的正确运行
*    不负责任。VisuStella对于由用户提供的自定义代码（包括高级JavaScript标签和/或允许JavaScript代码的插件参数）引起的错误也不负责。
* 
* 6. 如果需要通过与VisuStella无关的第三方进行兼容性补丁，并涉及使用VisuStella MZ库中的代码，必须与VisuStella成员联系并得到
*    批准。该补丁将作为免费下载提供给公众，并且不能用于牟利，包括佣金、众筹和/或捐款。
*
* ============================================================================
* 制作人员
* ============================================================================
* 
* 如果您在使用此插件，需在您的游戏中列出以下人员的名字：
* 
* Team VisuStella
* * Yanfly
* * Arisu
* * Olivia
* * Irina
*
* ============================================================================
* 变更记录
* ============================================================================
* 
* 版本 1.52：2024年5月16日
* * 文档更新！
* ** 帮助文件已更新以适应新功能。
* * 新功能！
* ** Irina 添加的新插件参数：
* *** 参数 > 物品类别 > 类别列表 > 类别 > 按 ID 或名称排序：
* **** 现在可以按照ID或名称排序特定的物品类别。
* **** 仅在物品场景和商店场景中可用。
* * 优化更新！
* ** 插件性能应更为优化。
* 
* 版本 1.51：2023年12月14日
* * Bug修复！
* ** 修复了一种情况下解除装备物品可能导致崩溃的问题。修复由Arisu完成。
* ** 修复了<Proxy: id>未正确提供代理物品的bug。修复由Arisu完成。
* 
* 版本 1.50：2023年11月16日
* * Bug修复！
* ** <JS购买价格>和<JS出售价格>现在应该能正常工作了。修复由Irina完成。
* * 文档更新！
* ** 帮助文件已更新以适应新功能。
* * 优化更新！
* ** 插件性能应更为优化。
* * 新功能！
* ** Arisu 添加的新标签：
* *** <Cursed>
* **** 如果装备此武器或护甲，玩家无法手动解除装备，直到净化为止。
* **** 要移除它，必须通过事件命令、脚本调用或此插件提供的净化相关插件命令。
* **** 一旦净化，武器或护甲将变为未装备状态，除非有净化转换。
* **** 如果新转换的武器/护甲可以装备，则将保留在角色的装备槽中。
* **** 如果使用VisuMZ_2_WeaponSwapSystem，武器将不会被诅咒，以允许自由的武器交换。
* *** <Purify Transform: id>
* *** <Purify Transform: name>
* **** 如果在<Cursed>武器或护甲上存在此标签，则在角色接受净化时，该武器或护甲将转化为另一种物品。
* ** Arisu 添加的新插件命令：
* *** 净化：目标角色
* **** 净化目标角色的所有诅咒武器或护甲。
* *** 净化：整个队伍
* **** 净化整个队伍的所有诅咒武器或护甲。
* ** 在装备场景插件参数中添加了“诅咒装备弹出窗口”。
* *** 当角色装备诅咒武器/护甲时，会出现文本弹出窗口。
* ** 在商店状态窗口插件参数中添加了“盟友或敌人”或“敌人或盟友”范围。
* *** 如果未使用，默认为“1盟友”或“1敌人”，与往常一样。由Irina添加。
* 
* 版本 1.49：2023年10月12日
* * Bug修复！
* ** 修复了一种情况下武器类型的问题，即使角色无法装备它们（尽管它们会被禁用），仍然列出所有武器类型的装备菜单。由Olivia完成。
* * 文档更新！
* ** 帮助文件已更新以适应新功能。
* * 新功能！
* ** Olivia 和AndyL赞助的新标签：
* *** <Added EType: x>
* *** <Added ETypes: x, x, x>
* **** 仅适用于护甲，不适用于武器！
* **** 允许护甲属于多个装备类型。这意味着手套可以装备为“武器装备”或“配饰”。
* 
* 版本 1.48：2023年9月14日
* * Bug修复！
* ** 修复了非更新布局的帮助窗口位置错误的问题。由Irina完成。
* * 优化更新！
* ** 当武器和护甲在数据库中的数量超过2000时，插件应该更为优化。
* 
* 版本 1.47：2023年7月13日
* * Bug修复！
* ** 修复了商店状态窗口显示不正确的移除增益和减益的bug。由Olivia完成。
* * 兼容性更新！
* ** 添加了未来插件的兼容功能。
* * 文档更新！
* ** 帮助文件已更新以适应新功能。
* * 功能更新！
* ** 动态商店清单的更改现在在列表更改时更新，而不是再次进入和退出商店。由Arisu完成。
* ** Arisu 和AndyL赞助的新标签效果：
* *** <Conserve: x%>
* **** 给予物品使用时的一定几率，不消耗该物品。
* *** <Buy Turn On Switches: x, x, x>
* *** <Buy Turn Off Switches: x, x, x>
* *** <Sell Turn On Switches: x, x, x>
* *** <Sell Turn Off Switches: x, x, x>
* **** 购买/出售具有这些标签的物品、武器或护甲时，打开/关闭开关“x”。
* *** Arisu 添加的新插件参数：
* **** 参数 > 设置 > 商店状态窗口 > 装备数据 > 延迟MS：
* ***** 延迟预览更新的毫秒数（MS）？
* ***** 这是为了只有装备时避免延迟卡顿。
* 
* 版本 1.46：2023年6月15日
* * Bug修复！
* ** 修复了未使用更新布局或无Options Core自定义UI放置时，帮助窗口和输入模式不正确调整的问题。由Arisu完成。
* 
* 版本 1.45：2023年5月18日
* * Bug修复！
* ** 修复了装备槽名称以空格结尾时可能导致装备槽无法正常识别的bug。
* 
* 版本 1.44：2023年4月13日
* * 文档更新！
* ** 帮助文件已更新以适应新功能。
* * 新功能！
* ** Arisu 和Anon赞助的新标签效果：
* *** <Equip For Class Only: x>
* *** <Equip For Classes Only: x, x, x>
* *** <Equip For Class Only: name>
* *** <Equip For Classes Only: name, name, name>
* **** 此装备只能由列出的职业穿戴。
* *** 新增的<Equip Requirements>标签。
* **** 定义角色需要满足的多个条件，才能穿戴该装备物品。
* **** 详细信息请参阅帮助文件，了解可以添加的要求类型。
* 
* 版本 1.43：2023年3月16日
* * Bug修复！
* ** 神器护甲现在应在获取后更新和刷新队伍成员的缓存。由Olivia完成。
* 
* 版本 1.42：2023年2月16日
* * Bug修复！
* ** 现在如果代理物品被设置为循环引用其他代理物品，将不再导致无限循环。修复由Arisu完成。
* 
* 版本 1.41：2022年12月15日
* * 兼容性更新！
* ** 添加了未来插件的兼容功能。
* * 文档更新！
* ** 帮助文件已更新以适应新功能。
* * 新功能！
* ** Arisu 和Anon赞助的新插件参数：
* *** Equip Scene > Equip Command > 帮助描述
* *** Equip Scene > Optimize Command > 帮助描述
* *** Equip Scene > Clear Command > 帮助描述
* **** 选择这些命令时使用的帮助描述。
* 
* 版本 1.40：2022年10月20日
* * 功能更新！
* ** 对于商店状态窗口，在有多个装备槽的类型（如配饰）中比较装备时，插件现在将首先检查空的装备槽，然后进行计算。
*    否则，将使用该类型的第一个可用装备槽，而不考虑已装备的物品。由Arisu更新。
* * 优化更新！
* ** 插件应该运行更为优化。
* 
* 版本 1.39：2022年9月29日：
* * 功能更新！
* ** 更改数据库中的装备类型时，不再会影响到已缓存的装备ID的角色。由Arisu更新。
* 
* 版本 1.38：2022年3月3日
* * 文档更新！
* ** 帮助文件已更新以适应新功能。
* * 新功能！
* ** Olivia 和Anon赞助的新机制和标签效果：
* *** <Party Artifact>
* *** <Troop Artifact>
* *** <Stackable Party Artifact>
* *** <Stackable Troop Artifact>
* **** 仅适用于护甲！此护甲不能装备。但仅需在队伍的库存中，其参数和特性将全局应用于整个队伍或敌群（取决于标签）。
* **** 正常版本的标签只在队伍库存中找到的副本数一次应用。
* **** 堆叠版本的标签将根据在队伍库存中找到的副本数量多次堆叠参数和特性。
* **** 此物品不会在战斗测试的设置阶段添加。
* ***** 如果要添加该物品，请手动添加。
* 
* 版本 1.37：2021年12月23日
* * 兼容性更新
* ** 创建了代理物品在任何适用系统和扩展插件中使用的基础。由Arisu更新。
* 
* 版本 1.36：2021年12月2日
* * 功能更新！
* ** 对于使用核心引擎中的自定义参数，并且参数不全大写的用户，插件将自动为您进行全大写处理，以防止错误。由Olivia更新。
* 
* 版本 1.35：2021年11月18日
* * 兼容性更新！
* ** 如果禁用了此插件的更新场景，项目中项目、装备和商店场景的帮助窗口位置现在应该位于VisuMZ Core Engine计算的指定位置，
*    而不是RMMZ默认位置。由Irina更新。
* 
* 版本 1.34：2021年10月28日
* * 功能更新
* ** 为使用旧数据的项目添加了故障安全检查，以防止因起始装备不存在而导致游戏无法打开。由Arisu更新。
* 
* 版本 1.33：2021年8月6日
* * 文档更新！
* ** 从<状态信息>中删除了“武器”和“护甲”的“用于”说明。这是一个无意的文档错误。
* 
* 版本 1.32：2021年7月23日
* * Bug修复！
* ** 修复了切换到具有不对齐装备槽类型的职业时可能导致护甲复制的bug。由Arisu完成。
* 
* 版本 1.31：2021年7月9日
* * 功能更新！
* ** 为价格操作的JavaScript添加了失败安全检查，以防止价格可能下降到0以下。由Arisu完成。
* 
* 版本 1.30：2021年7月2日
* * 文档更新！
* ** 在帮助文件中为以下内容添加了额外的说明：
*    插件参数 > 物品菜单设置 > 列表窗口 > 列数
* *** 如果使用VisuStella MZ Core Engine和“现代控制”插件参数，请阅读此部分，以了解在同时使用多列物品时如何切换类别。
*    
* 
* 版本 1.29：2021年6月25日
* * 兼容性更新
* ** 与RPG Maker MZ 1.3.0+的兼容性更新。
* * 功能更新！
* ** 更改数据库中装备类型时，不再影响到具有缓存的装备ID的角色。由Arisu更新。
* 
* 版本 1.28：2021年6月4日
* * 优化更新！
* ** 插件应该运行更为优化。
* 
* 版本 1.27：2021年5月21日
* * Bug修复！
* ** 在装备场景中，当在物品到槽窗口内使用鼠标右键时，将不再退出装备场景。修复由Yanfly完成。
* 
* 版本 1.26：2021年4月30日
* * 文档更新！
* ** 帮助文件已更新以适应新功能。
* ** “VisuStella MZ兼容性”增加了VisuMZ_1_BattleCore部分，关于伤害倍增和治疗倍增词汇设置以减少常见问题。
* * 新功能！
* ** Irina和Archeia赞助的新标签效果：
* *** <Shop Picture Name: filename>
* *** <Shop Picture Layer: x>
* *** <Shop Picture Max Width: x>
* *** <Shop Picture Max Height: y>
* *** <Shop Picture Max Dimensions: x, y>
* *** <Shop Picture Alignment: x>
* *** <Shop Picture Position: y>
* *** <Shop Picture Offset X: +x>
* *** <Shop Picture Offset X: -x>
* *** <Shop Picture Offset Y: +y>
* *** <Shop Picture Offset Y: -y>
* *** <Shop Picture Offset: +x, +y>
* *** <Shop Picture Offset: -x, -y>
* *** <Shop Picture Opacity: x>
* *** <Shop Picture Opacity: x%>
* **** 添加来自游戏项目的img/pictures/文件夹中的图像，以显示在商店状态窗口中。
* 
* 版本 1.25：2021年4月23日
* * 文档更新！
* ** 为<param: +x>和<param: -x>标签添加了明确说明：
* *** 这些标签不适用于X参数、S参数或任何自定义参数。这些标签仅适用于基本参数。
* 
* 版本 1.24：2021年4月16日
* * Bug修复！
* ** 现在将角色的装备槽更改为超过原始数量将不再出现由于重复的槽类型而导致的错误。修复由Arisu完成。
* ** 完全出售物品现在应刷新帮助窗口以显示新选定物品的帮助说明。由Arisu完成。
* * 优化更新！
* ** 装备场景的不可移动装备限制现在优化得更好。由Olivia完成。

* 
版本 1.23: 2021年4月2日
优化更新！
** 插件应该运行更为优化。
版本 1.22: 2021年3月26日
文档更新！
** 添加了“VisuStella MZ兼容性”部分，详细说明与VisuMZ_4_BreakShields插件的兼容性。
版本 1.21: 2021年3月5日
功能更新！
** 在战斗测试期间，自定义装备槽已禁用，以获得更精确的结果。
版本 1.20: 2021年2月26日
文档更新！
** 帮助文件更新，适应新功能。
新功能！
** 由Irina赞助，添加了新的插件参数：
*** 插件参数 > 商店菜单设置 > 开关 > 购买开关
*** 插件参数 > 商店菜单设置 > 开关 > 出售开关
**** 在商店场景中购买/出售物品时，将这些开关设为开启状态。
**** 当商店场景打开时，开关会恢复为关闭状态。
**** 这些开关可在“商店处理”事件命令后使用，以确定玩家是否购买了物品、购买并出售了物品、仅出售了物品，或者什么都没有。
版本 1.19: 2021年1月29日
文档更新！
** 帮助文件更新，适应新功能。
新功能！
** 由Irina添加的新标签：
*** <装备复制限制: x>
**** 设置角色可以同时装备此装备的最大副本数。用例示例：角色只能同时装备一个“独一无二的戒指”，即使有空的配饰槽，因为戒指带有<装备复制限制: 1>标签。
*** <装备武器类型限制: x>
**** 一旦达到限定数量，此武器将无法与相同类型的其他武器同时装备。用例示例：双持战士只能装备一把剑和一把匕首，但不能同时装备两把剑或两把匕首，因为剑和匕首都带有<装备武器类型限制: 1>标签。
*** <装备护甲类型限制: x>
**** 一旦达到限定数量，此护甲将无法与相同类型的其他护甲同时装备。用例示例：角色不能同时装备两个手套配饰，因为手套属于“手套”护甲类型，并且每个手套物品都带有<装备护甲类型限制: 2>标签。
版本 1.18: 2021年1月15日
Bug修复！
** 按下“Shift”以移除装备现在应刷新状态窗口，不像以前那样。由Olivia完成。
文档更新！
** 帮助文件更新，适应新功能。
新功能！
** 添加了新的插件参数
*** 插件参数 > 物品菜单设置 > 背景类型
版本 1.17: 2021年1月1日
Bug修复！
** 现在应该能正确地装备装备。由Yanfly修复。
版本 1.16: 2020年12月25日
Bug修复！
** 装备调整HP/MP现在应该正常工作。由Yanfly修复。
文档更新！
** 为<JS物品启用>添加更多明确说明，指出如果安装了VisuStella Battle Core，则所有战斗范围物品都可见，但如果在其他情况下禁用，则不一定启用。
版本 1.15: 2020年12月18日
Bug修复！
** RPG Maker MZ Bug修复：单独角色基础上无法使用的物品不再被团队基础上的可用性覆盖到战斗。由Yanfly修复。
文档更新！
** 为<JS物品启用>添加更多明确说明，指出如果唯一不能使用该角色是在队伍中，则也会从可见物品中移除可用物品。
版本 1.14: 2020年12月11日
兼容性更新！
** 为未来插件添加了兼容性功能。
版本 1.13: 2020年12月4日
文档更新！
** 添加了新功能的文档！
新功能！
** 由Arisu添加的新的插件命令！
*** 角色：更改装备槽
*** 角色：重置装备槽
**** 这些插件命令允许您强制更改角色可用的装备槽，而不管其类别提供的槽如何，以及重置它们。
版本 1.12: 2020年11月15日
优化更新！
** 插件应该运行更为优化。
版本 1.11: 2020年11月8日
Bug修复！
** 商店状态窗口中的字体大小比例现在将缩放到一个硬编码值，以防止较小的字体大小扩展图标大小。由Arisu修复。
功能更新！
** 商店菜单中的货币显示现在会根据插件参数设置反映它们的显示方式。由Arisu更新。
版本 1.10: 2020年11月1日
功能更新！
** 与核心引擎的现代控件兼容性不再启用物品类别窗口和子类别使用Home/End键。
版本 1.09: 2020年10月25日
Bug修复！
** “所有物品”类别现在应该显示“物品”文本。由Irina修复。
** WType、AType和EType类别现在可以正常显示文本。由Irina修复。
版本 1.08: 2020年10月18日
兼容性更新！
** 插件应更加兼容。
版本 1.07: 2020年10月11日
Bug修复！
** 窗口装备状态中的X参数和S参数不再显示非百分比差异，如果原始值不是整数值。由Yanfly修复。
版本 1.06: 2020年10月4日
Bug修复！
** 选择物品事件命令现在将显示默认列数，而不是使用插件参数设置的任何设置。
版本 1.05: 2020年9月27日
Bug修复！
** 使用更新的商店布局时，离开出售选项不再导致虚拟窗口出现。
文档更新！
** “使用更新布局”插件参数现在增加了这样的条款：“这将覆盖核心引擎窗口设置。”以减少混乱。由Irina添加。
版本 1.04: 2020年9月13日
Bug修复！
** 按下Shift快速移除装备现在不应再导致游戏崩溃。这也将清除帮助窗口文本。由Arisu修复。
版本 1.03: 2020年9月6日
Bug修复！
** 如果优化和清除命令都已移除，并且使用现代控件，则在槽窗口列表顶部按向上键将不会转到窗口。由Yanfly修复。
** 如果优化和清除命令都已移除，则窗口将不再出现，并且槽窗口将向上移动以填充任何空白空间。由Yanfly修复。
新功能！
** 添加了新的插件参数在新功能！标签中，让您调整字体样式。
** 添加了在装备菜单场景设置中禁用背景矩形和/或更改其颜色的新插件参数。
** 添加了在商店状态窗口设置中禁用背景矩形和/或更改其颜色的新插件参数。
版本 1.02: 2020年8月30日
文档修正！
** 添加：关于伤害标签的注意事项
*** 如果安装了Visu_1_BattleCore，则优先使用其伤害样式设置。显示的标签基于该特定技能或物品的伤害样式设置。
*** 转到战斗核心 > 插件参数 > 伤害设置 > 样式列表 > 选择您想编辑的伤害样式 > 伤害标签并在那里更改文本设置。
*** 由Yanfly添加的文档更新。
版本 1.01: 2020年8月23日
添加了防止不存在的装备（因为数据库条目已被删除）作为初始装备被装备的应急措施。由Olivia修复。
版本 1.00: 2020年8月20日
完成插件！
*
* @ --------------------------------------------------------------------------
*
* @command Separator_Purify
* @text -
* @desc -
*
* @ --------------------------------------------------------------------------
*
@command PurifyActors
@text 净化：目标角色
@desc 净化目标角色的任何被诅咒的武器或护甲。
不能在战斗中使用。
@arg Actors
@text 角色ID(s)
@type actor[]
@desc 选择要影响的角色ID(s)。
@default ["1"]
@ --------------------------------------------------------------------------
@command PurifyParty
@text 净化：整个队伍
@desc 净化整个队伍的任何被诅咒的武器或护甲。
不能在战斗中使用。
@ --------------------------------------------------------------------------
@command Separator_Shop
@text -
@desc -
@ --------------------------------------------------------------------------
@command BatchShop
@text 商店：高级设置
@desc 更容易组合商店的库存。
警告：不允许事件特定价格。
@arg Step1
@text 第一步：物品ID
@arg Step1Start
@text 起始范围
@parent Step1
@type item
@desc 选择要开始的物品ID。
@default 1
@arg Step1End
@text 结束范围
@parent Step1
@type item
@desc 选择要结束的物品ID。
@default 4
@arg Step2
@text 第二步：武器ID
@arg Step2Start
@text 起始范围
@parent Step2
@type weapon
@desc 选择要开始的武器ID。
@default 1
@arg Step2End
@text 结束范围
@parent Step2
@type weapon
@desc 选择要结束的武器ID。
@default 4
@arg Step3
@text 第三步：护甲ID
@arg Step3Start
@text 起始范围
@parent Step3
@type armor
@desc 选择要开始的护甲ID。
@default 1
@arg Step3End
@text 结束范围
@parent Step3
@type armor
@desc 选择要结束的护甲ID。
@default 4
@arg PurchaseOnly
@text 第四步：仅购买？
@type boolean
@on 仅购买
@off 可出售
@desc 设置商店为仅允许购买？
@default false
@arg Optional
@arg Blacklist
@text 黑名单类别
@parent Optional
@type string[]
@desc 在商店中拉黑的类别列表。
如果为空则不使用。使用<类别：x>标记类别。
@default []
@arg Whitelist
@text 白名单类别
@parent Optional
@type string[]
@desc 商店中允许的类别列表。
如果为空则不使用。使用<类别：x>标记类别。
@default []
@ --------------------------------------------------------------------------
@command Separator_End
@text -
@desc -
@ --------------------------------------------------------------------------
@ ==========================================================================
@ 插件参数
@ ==========================================================================
@param BreakHead
@text --------------------------
@default ----------------------------------
@param ItemsEquipsCore
@default 插件参数
@param ATTENTION
@default 阅读帮助文件
*
* @param BreakSettings
* @text --------------------------
* @default ----------------------------------
*
* @param ItemScene:struct
* @text 物品菜单设置
* @type struct<ItemScene>
* @desc 修改物品菜单场景设置。

* @default {"General":"","EnableLayout:eval":"true","LayoutStyle:str":"upper/left","ListWindow":"","ListWindowCols:num":"1","ItemQt":"","MaxItems:num":"99","MaxWeapons:num":"99","MaxArmors:num":"99","ItemQuantityFmt:str":"×%1","ItemQuantityFontSize:num":"22","ShopStatusWindow":"","ShowShopStatus:eval":"true","ItemSceneAdjustItemList:eval":"true","ItemMenuStatusRect:func":"\"const width = this.statusWidth();\\nconst height = this._itemWindow.height;\\nconst x = Graphics.boxWidth - width;\\nconst y = this._itemWindow.y;\\nreturn new Rectangle(x, y, width, height);\"","ButtonAssist":"","buttonAssistCategory:str":"Switch Category"}
*
* @param Categories:struct
* @text 物品类别
* @parent ItemScene:struct
* @type struct<Categories>
* @desc 更改在物品/商店菜单中显示的类别。

* @default {"MainList":"","List:arraystruct":"[\"{\\\"Type:str\\\":\\\"FieldUsable\\\",\\\"Icon:num\\\":\\\"208\\\"}\",\"{\\\"Type:str\\\":\\\"BattleUsable\\\",\\\"Icon:num\\\":\\\"218\\\"}\",\"{\\\"Type:str\\\":\\\"NeverUsable\\\",\\\"Icon:num\\\":\\\"302\\\"}\",\"{\\\"Type:str\\\":\\\"AllWeapons\\\",\\\"Icon:num\\\":\\\"97\\\"}\",\"{\\\"Type:str\\\":\\\"EType:2\\\",\\\"Icon:num\\\":\\\"128\\\"}\",\"{\\\"Type:str\\\":\\\"EType:3\\\",\\\"Icon:num\\\":\\\"131\\\"}\",\"{\\\"Type:str\\\":\\\"EType:4\\\",\\\"Icon:num\\\":\\\"137\\\"}\",\"{\\\"Type:str\\\":\\\"EType:5\\\",\\\"Icon:num\\\":\\\"145\\\"}\",\"{\\\"Type:str\\\":\\\"KeyItems\\\",\\\"Icon:num\\\":\\\"195\\\"}\"]","Style:str":"icon","TextAlign:str":"center","Vocabulary":"","HiddenItemA:str":"Special Items","HiddenItemB:str":"Unique Items","Consumable:str":"Consumable","Nonconsumable:str":"Nonconsumable","AlwaysUsable:str":"Usable","BattleUsable:str":"Battle","FieldUsable:str":"Field","NeverUsable:str":"Materials"}
*
* @param New:struct
* @text NEW! 标签
* @parent ItemScene:struct
* @type struct<NewLabel>
* @desc 更改 NEW! 标签在游戏项目中的应用方式。

* @default {"Enable:eval":"true","Icon:num":"0","Text:str":"NEW!","FontColor:str":"17","FontFace:str":"Verdana","FontSize:str":"16","FadeLimit:num":"360","FadeSpeed:num":"4","OffsetX:num":"0","OffsetY:num":"4"}
*
* @param EquipScene:struct
* @text 装备菜单设置
* @type struct<EquipScene>
* @desc 调整有关装备菜单场景的设置。

* @default {"General":"","EnableLayout:eval":"true","ParamValueFontSize:num":"22","MenuPortraits:eval":"true","DrawPortraitJS:func":"\"// Declare Variables\\nconst lineHeight = this.lineHeight();\\nconst padding = this.itemPadding();\\nconst x1 = padding;\\nconst x2 = this.innerWidth - 128 - padding;\\n\\n// Draw Menu Image\\nthis.drawItemActorMenuImage(this._actor, 0, 0, this.innerWidth, this.innerHeight);\\n\\n// Draw Data\\nthis.drawActorName(this._actor, x1, lineHeight * 0);\\nthis.drawActorClass(this._actor, x1, lineHeight * 1);\\nthis.drawActorIcons(this._actor, x1, lineHeight * 2);\\nthis.drawActorLevel(this._actor, x2, lineHeight * 0);\\nthis.placeBasicGauges(this._actor, x2, lineHeight * 1);\"","DrawFaceJS:func":"\"// Declare Variables\\nconst lineHeight = this.lineHeight();\\nconst gaugeLineHeight = this.gaugeLineHeight();\\nconst x = Math.floor(this.innerWidth / 2);\\nconst limitHeight = this.innerHeight - (this.actorParams().length * lineHeight);\\nconst actorX = Math.floor((x - ImageManager.faceWidth) / 2);\\nconst actorY = Math.max(0, Math.floor((limitHeight - ImageManager.faceHeight) / 2));\\nlet dataHeight = lineHeight * 3;\\ndataHeight += gaugeLineHeight * ($dataSystem.optDisplayTp ? 3 : 2);\\nconst dataY = Math.max(0, Math.floor((limitHeight - dataHeight) / 2));\\n\\n// Draw Data\\nthis.drawActorFace(this._actor, actorX, actorY, ImageManager.faceWidth, ImageManager.faceHeight);\\nthis.drawActorIcons(this._actor, actorX + 16, actorY + ImageManager.faceHeight - lineHeight);\\nthis.drawActorName(this._actor, x, dataY + lineHeight * 0);\\nthis.drawActorLevel(this._actor, x, dataY + lineHeight * 1);\\nthis.drawActorClass(this._actor, x, dataY + lineHeight * 2);\\nthis.placeBasicGauges(this._actor, x, dataY + lineHeight * 3);\"","DrawParamJS:func":"\"// Declare variables\\nconst params = this.actorParams();\\nconst lineHeight = this.lineHeight();\\nconst padding = this.itemPadding();\\nconst baseX = 0;\\nconst baseY = this.innerHeight - params.length * lineHeight;\\nconst baseWidth = this.innerWidth;\\nconst valueFontSize = this.paramValueFontSize();\\n\\n// Calculate Widths\\nlet paramNameWidth = Math.max(...params.map(param => this.textWidth(TextManager.param(param))));\\nparamNameWidth += padding * 2;\\nif (this.isUseParamNamesWithIcons()) {\\n    paramNameWidth += ImageManager.iconWidth + 4;\\n}\\nlet arrowWidth = this.rightArrowWidth();\\nconst totalDivides = this.innerWidth >= 500 ? 3 : 2;\\nlet paramValueWidth = Math.floor((baseWidth - paramNameWidth - arrowWidth) / totalDivides);\\nparamNameWidth = baseWidth - (paramValueWidth * totalDivides) - arrowWidth;\\n\\n// Draw Parameters\\nlet x = baseX;\\nlet y = baseY;\\nlet value = 0;\\nlet diffValue = 0;\\nlet alter = 2;\\nfor (const paramId of params) {\\n    // Draw Param Name\\n    this.drawItemDarkRect(x, y, paramNameWidth, lineHeight, alter);\\n    this.drawUpdatedParamName(paramId, x, y, paramNameWidth);\\n    this.resetFontSettings();\\n    x += paramNameWidth;\\n\\n    // Draw Param Before\\n    this.contents.fontSize = valueFontSize;\\n    this.drawItemDarkRect(x, y, paramValueWidth, lineHeight, alter);\\n    this.drawUpdatedBeforeParamValue(paramId, x, y, paramValueWidth);\\n    this.resetFontSettings();\\n    x += paramValueWidth;\\n\\n    // Draw Arrow\\n    this.drawItemDarkRect(x, y, arrowWidth, lineHeight, alter);\\n    this.drawRightArrow(x, y);\\n    x += arrowWidth;\\n\\n    // Draw Param After\\n    this.contents.fontSize = valueFontSize;\\n    this.drawItemDarkRect(x, y, paramValueWidth, lineHeight, alter);\\n    this.drawUpdatedAfterParamValue(paramId, x, y, paramValueWidth);\\n    x += paramValueWidth;\\n\\n    // Draw Param Change\\n    if (totalDivides > 2) {\\n        this.drawItemDarkRect(x, y, paramValueWidth, lineHeight, alter);\\n        this.drawUpdatedParamValueDiff(paramId, x, y, paramValueWidth);\\n    }\\n\\n    // Prepare Next Parameter\\n    x = baseX;\\n    y += lineHeight;\\n    alter = alter === 2 ? 1 : 2;\\n}\"","LayoutStyle:str":"upper/right","StatusWindowWidth:num":"312","DrawBackRect:eval":"true","BackRectColor:str":"19","CursedTextPopup:json":"\"%1 is cursed by %3%2!\"","Command":"","CmdStyle:str":"auto","CmdTextAlign:str":"center","CmdIconEquip:num":"136","equipCmdDesc:json":"\"Pick and choose equipment to change.\"","CommandAddOptimize:eval":"true","optimizeCmdDesc:json":"\"Equip the strongest available equipment.\"","CmdIconOptimize:num":"137","CommandAddClear:eval":"true","clearCmdDesc:json":"\"Remove all available equipment.\"","CmdIconClear:num":"135","RemoveEquip":"","RemoveEquipIcon:num":"16","RemoveEquipText:str":"Remove","ShiftShortcutKey:eval":"true","Rulings":"","EquipAdjustHpMp:eval":"true","NonRemoveETypes:arraynum":"[]","NonOptimizeETypes:arraynum":"[]","ButtonAssist":"","buttonAssistRemove:str":"Unequip"}
*
* @param ShopScene:struct
* @text 商店菜单设置
* @type struct<ShopScene>
* @desc 更改商店菜单场景设置。

* @default {"General":"","EnableLayout:eval":"true","LayoutStyle:str":"upper/left","Command":"","CmdHideDisabled:eval":"true","CmdStyle:str":"auto","CmdTextAlign:str":"center","CmdIconBuy:num":"208","CmdIconSell:num":"314","CmdIconCancel:num":"82","CmdCancelRename:str":"Exit","Prices":"","SellPriceRate:num":"0.50","BuyPriceJS:func":"\"// Declare variables\\nlet item = arguments[0];\\nlet price = arguments[1];\\n\\n// Return the finalized price\\nreturn price;\"","SellPriceJS:func":"\"// Declare variables\\nlet item = arguments[0];\\nlet price = arguments[1];\\n\\n// Return the finalized price\\nreturn price;\"","ButtonAssist":"","buttonAssistSmallIncrement:str":"-1/+1","buttonAssistLargeIncrement:str":"-10/+10"}
*
* @param StatusWindow:struct
* @text 商店状态窗口
* @parent ShopScene:struct
* @type struct<StatusWindow>
* @desc 更改物品状态窗口设置。

* @default {"General":"","Width:num":"352","ParamChangeFontSize:num":"22","Translucent:num":"64","DrawBackRect:eval":"true","BackRectColor:str":"19","EquipData":"","AlreadyEquipMarker:str":"E","CannotEquipMarker:str":"-","EquipDelayMS:num":"240","NoChangeMarker:str":"-","DrawEquipData:func":"\"// Set Variables\\nconst lineHeight = this.lineHeight();\\nconst paramheight = this.gaugeLineHeight() + 8;\\nlet x = 0;\\nlet y = 0;\\nlet width = this.innerWidth;\\nlet height = this.innerHeight;\\nlet hw = Math.floor(width / 2);\\nlet hx = x + width - hw;\\n\\n// Draw Item Name, Type, and Quantity\\nthis.drawItemName(this._item, x + this.itemPadding(), y, width - this.itemPadding() * 2);\\nthis.drawItemDarkRect(x, y, width);\\ny += lineHeight;\\nif (this.drawItemEquipType(x, y, hw)) y += 0;\\nif (this.drawItemQuantity(hx, y, hw)) y += lineHeight;\\n\\n// Draw Parameter Names\\nconst params = this.actorParams();\\nconst backY = y;\\ny = height - (params.length * paramheight) - 4;\\nlet paramX = x;\\nlet paramWidth = 0;\\nlet tableY = y;\\nfor (const paramId of params) {\\n    paramWidth = Math.max(this.drawParamName(paramId, x + 4, y + 4, width), paramWidth);\\n    y += paramheight;\\n}\\n\\n// Draw Actor Data\\nconst actorMax = $gameParty.maxBattleMembers();\\nconst actorWidth = Math.floor((width - paramWidth) / actorMax);\\nparamWidth = width - (actorWidth * actorMax);\\nfor (const actor of $gameParty.battleMembers()) {\\n    const index = $gameParty.battleMembers().indexOf(actor);\\n    const actorX = paramX + paramWidth + (index * actorWidth);\\n    this.changePaintOpacity(actor.canEquip(this._item));\\n    this.drawActorCharacter(actor, actorX + (actorWidth / 2), tableY);\\n    let actorY = tableY;\\n\\n    // Draw Parameter Changes\\n    for (const paramId of params) {\\n        const diffY = actorY - ((lineHeight - paramheight) / 2);\\n        this.drawActorParamDifference(actor, paramId, actorX, diffY, actorWidth);\\n        actorY += paramheight;\\n    }\\n}\\n\\n// Draw Back Rectangles\\nthis.drawItemDarkRect(paramX, backY, paramWidth, tableY - backY);\\nfor (let i = 0; i < actorMax; i++) {\\n    const actorX = paramX + paramWidth + (i * actorWidth);\\n    this.drawItemDarkRect(actorX, backY, actorWidth, tableY - backY);\\n}\\nfor (const paramId of params) {\\n    this.drawItemDarkRect(paramX, tableY, paramWidth, paramheight);\\n    for (let i = 0; i < actorMax; i++) {\\n        const actorX = paramX + paramWidth + (i * actorWidth);\\n        this.drawItemDarkRect(actorX, tableY, actorWidth, paramheight);\\n    }\\n    tableY += paramheight;\\n}\"","ItemData":"","ItemGeneral":"","MaxIcons:num":"8","MultiplierStandard:num":"1000000","DrawItemData:func":"\"const lineHeight = this.lineHeight();\\nlet x = 0;\\nlet y = 0;\\nlet width = this.innerWidth;\\nlet height = this.innerHeight;\\nlet hw = Math.floor(width / 2);\\nlet hx = x + width - hw;\\n\\n// Draw Item Name and Quantity\\nthis.drawItemName(this._item, x + this.itemPadding(), y, width - this.itemPadding() * 2);\\nthis.drawItemDarkRect(x, y, width);\\ny += lineHeight;\\n\\n// Draw Main Item Properties\\nif (this.drawItemConsumable(x, y, hw)) y += 0;\\nif (this.drawItemQuantity(hx, y, hw)) y += lineHeight;\\nif (this._item.occasion < 3) {\\n    y = this.drawItemDamage(x, y, width);\\n    y = this.drawItemEffects(x, y, width);\\n}\\ny = this.drawItemCustomEntries(x, y, width);\\n\\n// Draw Remaining Item Properties\\nif (this._item.occasion < 3) {\\n    if (this.drawItemOccasion(x, y, hw)) y += 0;\\n    if (this.drawItemScope(hx, y, hw)) y += lineHeight;\\n    if (this.drawItemHitType(x, y, hw)) y += 0;\\n    if (this.drawItemSuccessRate(hx, y, hw)) y += lineHeight;\\n    if (this.drawItemSpeed(x, y, hw)) y += 0;\\n    if (this.drawItemRepeats(hx, y, hw)) y += lineHeight;\\n}\\n\\n// Fill Rest of the Window\\nthis.drawItemDarkRect(x, y, width, height - y);\"","Vocabulary":"","LabelConsume:str":"Consumable","Consumable:str":"✔","NotConsumable:str":"✘","Occasions":"","Occasion0:str":"Anytime Use","Occasion1:str":"Battle-Only","Occasion2:str":"Field-Only","Occasion3:str":"-","Scope":"","Scope0:str":"No Target","Scope1:str":"1 Foe","Scope2:str":"All Foes","Scope3:str":"Random Foe","Scope4:str":"2 Random Foes","Scope5:str":"3 Random Foes","Scope6:str":"4 Random Foes","Scope7:str":"1 Ally","Scope8:str":"Alive Allies","Scope9:str":"Dead Ally","Scope10:str":"Dead Allies","Scope11:str":"User","Scope12:str":"Any Ally","Scope13:str":"All Allies","Scope14:str":"Everybody","BattleCore":"","ScopeRandomAny:str":"%1 Random Units","ScopeRandomEnemies:str":"%1 Random Foes","ScopeRandomAllies:str":"%1 Random Allies","ScopeAlliesButUser:str":"Other Allies","ScopeAllyOrEnemy:str":"Ally/Enemy","ScopeEnemyOrAlly:str":"Enemy/Ally","LabelSpeed:str":"Speed","Speed2000:str":"Fastest","Speed1000:str":"Faster","Speed1:str":"Fast","Speed0:str":"Normal","SpeedNeg999:str":"Slow","SpeedNeg1999:str":"Slower","SpeedNeg2000:str":"Slowest","LabelSuccessRate:str":"Accuracy","LabelRepeats:str":"Hits","LabelHitType:str":"Type","HitType0:str":"Neutral","HitType1:str":"Physical","HitType2:str":"Magical","LabelElement:str":"Element","ElementWeapon:str":"\\I[97]Weapon","ElementNone:str":"\\I[160]No Element","DamageType":"","DamageType1:str":"%1 Damage Multiplier","DamageType2:str":"%1 Damage Multiplier","DamageType3:str":"%1 Recovery Multiplier","DamageType4:str":"%1 Recovery Multiplier","DamageType5:str":"%1 Drain Multiplier","DamageType6:str":"%1 Drain Multiplier","Effects":"","LabelRecoverHP:str":"%1 Recovery","LabelRecoverMP:str":"%1 Recovery","LabelRecoverTP:str":"%1 Recovery","LabelSelfGainTP:str":"User %1","LabelDamageHP:str":"%1 Damage","LabelDamageMP:str":"%1 Damage","LabelDamageTP:str":"%1 Damage","LabelApply:str":"Applies","LabelRemove:str":"Removes"}
*
* @param BreakEnd1
* @text --------------------------
* @default ----------------------------------
*
* @param End Of
* @default 插件参数
*
* @param BreakEnd2
* @text --------------------------
* @default ----------------------------------
*
*/
/* ----------------------------------------------------------------------------
 * 物品菜单场景设置
 * ----------------------------------------------------------------------------
 */
/*~struct~ItemScene:
 *
 * @param General
 * @text 通用设置
 *
 * @param EnableLayout:eval
* @text 使用更新的布局
* @parent General
* @type boolean
* @on 使用
* @off 不使用
* @desc 使用此插件提供的更新的物品菜单布局吗？
* 这将覆盖核心引擎窗口设置。
* @default true
 *
 * @param LayoutStyle:str
 * @text 布局样式
 * @parent General
 * @type select
 * @option 上部帮助，左侧输入
 * @value upper/left
 * @option 上部帮助，右侧输入
 * @value upper/right
 * @option 下部帮助，左侧输入
 * @value lower/left
 * @option 下部帮助，右侧输入
 * @value lower/right
 * @desc 如果使用更新的布局，您希望如何设置菜单场景布局？
 * @default upper/left
 *
 * @param ListWindow
 * @text 列表窗口
 *
 * @param ListWindowCols:num
 * @text 列数
 * @parent ListWindow
 * @type number
 * @min 1
 * @desc 最大列数。
 * @default 1
 *
 * @param ItemQt
 * @text 物品数量
 *
 * @param MaxItems:num
 * @text 物品最大数量
 * @parent ItemQt
 * @desc 默认的物品最大数量。
 * @default 99
 *
 * @param MaxWeapons:num
 * @text 武器最大数量
 * @parent ItemQt
 * @desc 默认的武器最大数量。
 * @default 99
 *
 * @param MaxArmors:num
 * @text 防具最大数量
 * @parent ItemQt
 * @desc 默认的防具最大数量。
 * @default 99
 *
 * @param ItemQuantityFmt:str
 * @text 数量格式
 * @parent ItemQt
 * @desc 如何显示物品数量。
 * %1 - 物品数量
 * @default ×%1
 *
 * @param ItemQuantityFontSize:num
 * @text 字体大小
 * @parent ItemQt
 * @desc 物品数量的默认字体大小。
 * @default 22
 *
 * @param ShopStatusWindow
 * @text 商店状态窗口
 *
 * @param ShowShopStatus:eval
 * @text 在物品菜单中显示？
 * @parent ShopStatusWindow
 * @type boolean
 * @on 显示
 * @off 不显示
 * @desc 在物品菜单中显示商店状态窗口吗？
* 如果启用了更新的布局，则启用此功能。
* @default true
 *
 * @param ItemSceneAdjustItemList:eval
 * @text 调整列表窗口？
 * @parent ShopStatusWindow
 * @type boolean
 * @on 调整
 * @off 不调整
 * @desc 如果使用商店状态窗口，是否自动调整物品菜单中的物品列表窗口？
 * @default true
 *
 * @param ItemMenuStatusBgType:num
 * @text 背景类型
 * @parent ShopStatusWindow
 * @type select
 * @option 0 - 窗口
 * @value 0
 * @option 1 - 昏暗
 * @value 1
 * @option 2 - 透明
 * @value 2
 * @desc 选择此窗口的背景类型。
 * @default 0
 *
 * @param ItemMenuStatusRect:func
 * @text JS: X, Y, W, H
 * @parent ShopStatusWindow
 * @type note
 * @desc 用于确定物品菜单中此状态窗口尺寸的代码。
 * @default "const width = this.statusWidth();\nconst height = this._itemWindow.height;\nconst x = Graphics.boxWidth - width;\nconst y = this._itemWindow.y;\nreturn new Rectangle(x, y, width, height);"
 *
 * @param ButtonAssist
 * @text 按钮辅助窗口
 *
 * @param buttonAssistCategory:str
 * @text 切换类别
 * @parent ButtonAssist
 * @desc 用于切换类别的按钮辅助文本。
 * 对于 VisuStella MZ 的核心引擎按钮辅助窗口。
 * @default 切换类别
 *

/* ----------------------------------------------------------------------------
 * 物品类别
 * ----------------------------------------------------------------------------
 */
/*~struct~Categories:
 *
 * @param MainList
 * @text 列表
 * 
 * @param List:arraystruct
 * @text 类别列表
 * @parent MainList
 * @type struct<Category>[]
 * @desc 物品/商店菜单中显示的物品类别列表。
 * @default ["{\"Type:str\":\"RegularItems\",\"Icon:num\":\"208\"}","{\"Type:str\":\"AllWeapons\",\"Icon:num\":\"97\"}","{\"Type:str\":\"AllArmors\",\"Icon:num\":\"137\"}","{\"Type:str\":\"KeyItems\",\"Icon:num\":\"195\"}"]
 *
 * @param Style:str
 * @text 类别样式
 * @parent MainList
 * @type select
 * @option 仅文字
 * @value text
 * @option 仅图标
 * @value icon
 * @option 图标 + 文字
 * @value iconText
 * @option 自动
 * @value auto
 * @desc 您希望在类别窗口中如何绘制类别条目？
 * @default icon
 *
 * @param TextAlign:str
 * @text 文字对齐
 * @parent MainList
 * @type combo
 * @option 左对齐
 * @option 居中
 * @option 右对齐
 * @desc 决定文本的对齐方式。
 * @default 居中
 *
 * @param Vocabulary
 *
 * @param HiddenItemA:str
 * @text 隐藏物品 A
 * @parent Vocabulary
 * @desc 在物品菜单中如何命名此类别。
 * @default 特殊物品
 *
 * @param HiddenItemB:str
 * @text 隐藏物品 B
 * @parent Vocabulary
 * @desc 在物品菜单中如何命名此类别。
 * @default 独特物品
 *
 * @param Consumable:str
 * @text 消耗品
 * @parent Vocabulary
 * @desc 在物品菜单中如何命名此类别。
 * @default 消耗品
 *
 * @param Nonconsumable:str
 * @text 非消耗品
 * @parent Vocabulary
 * @desc 在物品菜单中如何命名此类别。
 * @default 非消耗品
 *
 * @param AlwaysUsable:str
 * @text 始终可用
 * @parent Vocabulary
 * @desc 在物品菜单中如何命名此类别。
 * @default 可用
 *
 * @param BattleUsable:str
 * @text 战斗可用
 * @parent Vocabulary
 * @desc 在物品菜单中如何命名此类别。
 * @default 战斗
 *
 * @param FieldUsable:str
 * @text 场地可用
 * @parent Vocabulary
 * @desc 在物品菜单中如何命名此类别。
 * @default 场地
 *
 * @param NeverUsable:str
 * @text 永不可用
 * @parent Vocabulary
 * @desc 在物品菜单中如何命名此类别。
 * @default 材料
 *
 */

/* ----------------------------------------------------------------------------
 * 类别设置
 * ----------------------------------------------------------------------------
 */
/*~struct~Category:
 *
 * @param Type:str
 * @text 类型
 * @type combo
 * @option 所有物品
 * @option 普通物品
 * @option 关键物品
 * @option 隐藏物品 A
 * @option 隐藏物品 B
 * @option 消耗品
 * @option 非消耗品
 * @option 始终可用
 * @option 战斗可用
 * @option 场地可用
 * @option 永不可用
 * @option 所有武器
 * @option 武器类型：x
 * @option 所有防具
 * @option 防具类型：x
 * @option 装备类型：x
 * @option 类别：x
 * @desc 物品/商店菜单中显示的物品类别列表。将 x 替换为 ID 号码或文本。
 * @default 普通物品
 *
 * @param Icon:num
 * @text 图标
 * @desc 此类别使用的图标。
 * 使用 0 表示没有图标。
 * @default 0
 *
 * @param SwitchID:num
 * @text 可见性开关
 * @type switch
 * @desc 必须打开此开关才能显示此类别。
 * 使用 0 表示无开关要求。
 * @default 0
 *
 * @param SortBy:str
 * @text 排序方式
 * @type select
 * @option ID
 * @option 名称
 * @desc （仅在物品菜单和商店菜单中）按此方式对此类别进行排序。
 * @default ID
 *
 */
/* ----------------------------------------------------------------------------
 * 新标签设置
 * ----------------------------------------------------------------------------
 */
/*~struct~NewLabel:
 *
 * @param Enable:eval
 * @text 使用 NEW! 标签？
 * @type boolean
 * @on 使用
 * @off 不使用
 * @desc 是否使用 NEW! 标签？
 * @default true
 *
 * @param Icon:num
 * @text 图标
 * @desc 用于表示 NEW! 文字的图标索引。
 * 使用 0 表示不绘制任何图标。
 * @default 0
 *
 * @param Text:str
 * @text 文字
 * @desc 显示在 NEW! 标签上的文本。
 * @default NEW!
 *
 * @param FontColor:str
 * @text 字体颜色
 * @parent Text:str
 * @desc 使用 #rrggbb 自定义颜色或从窗口皮肤中选择常规数字作为文本颜色。
 * @default 17
 *
 * @param FontFace:str
 * @text 字体
 * @parent Text:str
 * @desc 用于 NEW! 标签的字体。
 * @default Verdana
 *
 * @param FontSize:str
 * @text 字体大小
 * @parent Text:str
 * @desc NEW! 文字的字体大小。
 * @default 16
 *
 * @param FadeLimit:num
 * @text 消退限制
 * @desc 在逆转之前的最大不透明限制是多少？
 * @default 360
 *
 * @param FadeSpeed:num
 * @text 消退速度
 * @desc NEW! 标签的消退速度是多少？
 * @default 4
 *
 * @param OffsetX:num
 * @text 横向偏移
 * @desc NEW! 标签的横向位置偏移量。
 * @default 0
 *
 * @param OffsetY:num
 * @text 纵向偏移
 * @desc NEW! 标签的纵向位置偏移量。
 * @default 4
 *
 */

/* ----------------------------------------------------------------------------
 * 装备菜单场景设置
 * ----------------------------------------------------------------------------
 */
/*~struct~EquipScene:
 *
 * @param General
 *
 * @param EnableLayout:eval
 * @text 使用更新的布局
 * @parent General
 * @type boolean
 * @on 使用
 * @off 不使用
 * @desc 是否使用此插件提供的更新的装备菜单布局？
 * 这将覆盖核心引擎窗口设置。
 * @default true
 *
 * @param LayoutStyle:str
 * @text 布局样式
 * @parent General
 * @type select
 * @option 上方帮助，左侧输入
 * @value upper/left
 * @option 上方帮助，右侧输入
 * @value upper/right
 * @option 下方帮助，左侧输入
 * @value lower/left
 * @option 下方帮助，右侧输入
 * @value lower/right
 * @desc 如果使用更新的布局，如何设计菜单场景布局？
 * @default upper/right
 *
 * @param ParamValueFontSize:num
 * @text 参数字体大小
 * @parent EnableLayout:eval
 * @desc 参数数值使用的字体大小。
 * @default 22
 *
 * @param MenuPortraits:eval
 * @text 显示菜单肖像？
 * @parent EnableLayout:eval
 * @type boolean
 * @on 使用肖像
 * @off 使用脸图
 * @desc 如果安装了主菜单核心，则在状态窗口中显示菜单肖像，而不是角色的脸图？
 * @default true
 *
 * @param DrawPortraitJS:func
 * @text JS：肖像上部分
 * @parent EnableLayout:eval
 * @type note
 * @desc 如果可用，用于在状态窗口中绘制上部数据的代码。
 * @default "// 声明变量\nconst lineHeight = this.lineHeight();\nconst padding = this.itemPadding();\nconst x1 = padding;\nconst x2 = this.innerWidth - 128 - padding;\n\n// 绘制菜单图像\nthis.drawItemActorMenuImage(this._actor, 0, 0, this.innerWidth, this.innerHeight);\n\n// 绘制数据\nthis.drawActorName(this._actor, x1, lineHeight * 0);\nthis.drawActorClass(this._actor, x1, lineHeight * 1);\nthis.drawActorIcons(this._actor, x1, lineHeight * 2);\nthis.drawActorLevel(this._actor, x2, lineHeight * 0);\nthis.placeBasicGauges(this._actor, x2, lineHeight * 1);"
 *
 * @param DrawFaceJS:func
 * @text JS：脸图上部分
 * @parent EnableLayout:eval
 * @type note
 * @desc 如果使用脸图，用于在状态窗口中绘制上部数据的代码。
 * @default "// 声明变量\nconst lineHeight = this.lineHeight();\nconst gaugeLineHeight = this.gaugeLineHeight();\nconst x = Math.floor(this.innerWidth / 2);\nconst limitHeight = this.innerHeight - (this.actorParams().length * lineHeight);\nconst actorX = Math.floor((x - ImageManager.faceWidth) / 2);\nconst actorY = Math.max(0, Math.floor((limitHeight - ImageManager.faceHeight) / 2));\nlet dataHeight = lineHeight * 3;\ndataHeight += gaugeLineHeight * ($dataSystem.optDisplayTp ? 3 : 2);\nconst dataY = Math.max(0, Math.floor((limitHeight - dataHeight) / 2));\n\n// 绘制数据\nthis.drawActorFace(this._actor, actorX, actorY, ImageManager.faceWidth, ImageManager.faceHeight);\nthis.drawActorIcons(this._actor, actorX + 16, actorY + ImageManager.faceHeight - lineHeight);\nthis.drawActorName(this._actor, x, dataY + lineHeight * 0);\nthis.drawActorLevel(this._actor, x, dataY + lineHeight * 1);\nthis.drawActorClass(this._actor, x, dataY + lineHeight * 2);\nthis.placeBasicGauges(this._actor, x, dataY + lineHeight * 3);"
 *
 * @param DrawParamJS:func
 * @text JS：参数下部分
 * @parent EnableLayout:eval
 * @type note
 * @desc 决定状态窗口中如何绘制参数的代码。
 * @default "// 声明变量\nconst params = this.actorParams();\nconst lineHeight = this.lineHeight();\nconst padding = this.itemPadding();\nconst baseX = 0;\nconst baseY = this.innerHeight - params.length * lineHeight;\nconst baseWidth = this.innerWidth;\nconst valueFontSize = this.paramValueFontSize();\n\n// 计算宽度\nlet paramNameWidth = Math.max(...params.map(param => this.textWidth(TextManager.param(param))));\nparamNameWidth += padding * 2;\nif (this.isUseParamNamesWithIcons()) {\n    paramNameWidth += ImageManager.iconWidth + 4;\n}\nlet arrowWidth = this.rightArrowWidth();\nconst totalDivides = this.innerWidth >= 500 ? 3 : 2;\nlet paramValueWidth = Math.floor((baseWidth - paramNameWidth - arrowWidth) / totalDivides);\nparamNameWidth = baseWidth - (paramValueWidth * totalDivides) - arrowWidth;\n\n// 绘制参数\nlet x = baseX;\nlet y = baseY;\nlet value = 0;\nlet diffValue = 0;\nlet alter = 2;\nfor (const paramId of params) {\n    // 绘制参数名称\n    this.drawItemDarkRect(x, y, paramNameWidth, lineHeight, alter);\n    this.drawUpdatedParamName(paramId, x, y, paramNameWidth);\n    this.resetFontSettings();\n    x += paramNameWidth;\n\n    // 绘制参数前\n    this.contents.fontSize = valueFontSize;\n    this.drawItemDarkRect(x, y, paramValueWidth, lineHeight, alter);\n    this.drawUpdatedBeforeParamValue(paramId, x, y, paramValueWidth);\n    this.resetFontSettings();\n    x += paramValueWidth;\n\n    // 绘制箭头\n    this.drawItemDarkRect(x, y, arrowWidth, lineHeight, alter);\n    this.drawRightArrow(x, y);\n    x += arrowWidth;\n\n    // 绘制参数后\n    this.contents.fontSize = valueFontSize;\n    this.drawItemDarkRect(x, y, paramValueWidth, lineHeight, alter);\n    this.drawUpdatedAfterParamValue(paramId, x, y, paramValueWidth);\n    x += paramValueWidth;\n\n    // 绘制参数变化\n    if (totalDivides > 2) {\n        this.drawItemDarkRect(x, y, paramValueWidth, lineHeight, alter);\n        this.drawUpdatedParamValueDiff(paramId, x, y, paramValueWidth);\n    }\n\n    // 准备下一个参数\n    x = baseX;\n    y += lineHeight;\n    alter = alter === 2 ? 1 : 2;\n}"
 *
 * @param StatusWindowWidth:num
 * @text 状态窗口宽度
 * @parent General
 * @desc 如果使用非更新的装备菜单布局，状态窗口的通常宽度。
 * @default 312
 *
 * @param DrawBackRect:eval
 * @text 显示背景矩形？
 * @parent General
 * @type boolean
 * @on 显示
 * @off 不显示
 * @desc 显示较暗颜色的背景矩形以更好地显示信息？
 * @default true
 *
 * @param BackRectColor:str
 * @text 背景矩形颜色
 * @parent DrawBackRect:eval
 * @desc 使用 #rrggbb 自定义颜色或从窗口皮肤中选择常规数字作为文本颜色。
 * @default 19
 *
 * @param CursedTextPopup:json
 * @text 诅咒装备弹出
 * @parent General
 * @type note
 * @desc %1 - 角色，%2 - 装备，%3 - 图标。允许文本代码。
 * 需要 VisuMZ_0_CoreEngine 支持！留空表示不使用。
 * @default "%1 被 %3%2 诅咒了！"
 *
 *

 *
  * @param Command
 * @text 命令窗口
 *
 * @param CmdStyle:str
 * @text 样式
 * @parent Command
 * @type select
 * @option 仅文本
 * @value text
 * @option 仅图标
 * @value icon
 * @option 图标 + 文本
 * @value iconText
 * @option 自动
 * @value auto
 * @desc 在命令窗口中如何绘制命令？
 * @default auto
 *
 * @param CmdTextAlign:str
 * @text 文本对齐
 * @parent Command
 * @type combo
 * @option 左对齐
 * @option 居中
 * @option 右对齐
 * @desc 命令窗口中文本的对齐方式。
 * @default center
 *
 * @param CmdIconEquip:num
 * @text 装备图标
 * @parent Command
 * @desc 装备命令使用的图标。
 * @default 136
 *
 * @param equipCmdDesc:json
 * @text 帮助描述
 * @parent CmdIconEquip:num
 * @type note
 * @desc 选择此命令时显示的帮助描述。
 * 允许文本代码。
 * @default "选择并更改装备。"
 *
 * @param CommandAddOptimize:eval
 * @text 添加优化命令？
 * @parent Command
 * @type boolean
 * @on 添加
 * @off 不添加
 * @desc 在命令窗口中添加“优化”命令？
 * @default true
 *
 * @param optimizeCmdDesc:json
 * @text 帮助描述
 * @parent CommandAddOptimize:eval
 * @type note
 * @desc 选择此命令时显示的帮助描述。
 * 允许文本代码。
 * @default "装备最强的可用装备。"
 *
 * @param CmdIconOptimize:num
 * @text 优化图标
 * @parent CommandAddOptimize:eval
 * @desc 优化命令使用的图标。
 * @default 137
 *
 * @param CommandAddClear:eval
 * @text 添加清除命令？
 * @parent Command
 * @type boolean
 * @on 添加
 * @off 不添加
 * @desc 在命令窗口中添加“清除”命令？
 * @default true
 *
 * @param clearCmdDesc:json
 * @text 帮助描述
 * @parent CommandAddClear:eval
 * @type note
 * @desc 选择此命令时显示的帮助描述。
 * 允许文本代码。
 * @default "移除所有可用装备。"
 *
 * @param CmdIconClear:num
 * @text 清除图标
 * @parent CommandAddClear:eval
 * @desc 清除命令使用的图标。
 * @default 135
 *
 * @param RemoveEquip
 * @text 移除装备
 *
 * @param RemoveEquipIcon:num
 * @text 图标
 * @parent RemoveEquip
 * @desc 用于装备移除的图标。
 * @default 16
 *
 * @param RemoveEquipText:str
 * @text 文本
 * @parent RemoveEquip
 * @desc 用于装备移除的文本。
 * @default 移除
 *
 * @param ShiftShortcutKey:eval
 * @text 使用 SHIFT 快捷键？
 * @parent RemoveEquip
 * @type boolean
 * @on 使用
 * @off 不使用
 * @desc 添加“Shift”按钮作为移除物品的快捷键？
 * @default true
 *
 * @param Rulings
 * @text 规则
 *
 * @param EquipAdjustHpMp:eval
 * @text 装备-调整 HP/MP
 * @parent Rulings
 * @type boolean
 * @on 调整
 * @off 不调整
 * @desc 更换装备后调整 MaxHP/MaxMP 值的 HP/MP 差异。
 * @default true
 *
 * @param NonRemoveETypes:arraynum
 * @text 不可移除的类型
 * @parent Rulings
 * @type number[]
 * @min 1
 * @max 100
 * @desc 必须始终装备物品并且不能为空的装备类型 ID。
 * @default []
 *
 * @param NonOptimizeETypes:arraynum
 * @text 不优化的类型
 * @parent Rulings
 * @type number[]
 * @min 1
 * @max 100
 * @desc 在进行装备优化时将被忽略的装备类型 ID。
 * @default []
 *
 * @param ButtonAssist
 * @text 按钮辅助窗口
 *
 * @param buttonAssistRemove:str
 * @text SHIFT：移除
 * @parent ButtonAssist
 * @desc VisuStella MZ 的核心引擎的按钮辅助窗口中使用的按钮辅助文本。
 * @default 卸下
 *
 */

/* ----------------------------------------------------------------------------
 * 商店菜单场景设置
 * ----------------------------------------------------------------------------
 */
/*~struct~ShopScene:
 *
 * @param General
 * @text 常规
 *
 * @param EnableLayout:eval
 * @text 使用更新布局
 * @parent General
 * @type boolean
 * @on 使用
 * @off 不使用
 * @desc 是否使用插件提供的更新商店布局？这将覆盖核心引擎的窗口设置。
 * @default true
 *
 * @param LayoutStyle:str
 * @text 布局样式
 * @parent General
 * @type select
 * @option 上方帮助，左侧输入
 * @value upper/left
 * @option 上方帮助，右侧输入
 * @value upper/right
 * @option 下方帮助，左侧输入
 * @value lower/left
 * @option 下方帮助，右侧输入
 * @value lower/right
 * @desc 如果使用更新布局，如何设计菜单场景布局？
 * @default upper/left
 *
 * @param Switches
 * @text 开关
 *
 * @param SwitchBuy:num
 * @text 开关：购买
 * @parent Switches
 * @type switch
 * @desc 在商店场景购买物品时，将此开关设为开启状态。
 * 商店场景打开时开关会恢复关闭状态。
 * @default 0
 *
 * @param SwitchSell:num
 * @text 开关：出售
 * @parent Switches
 * @type switch
 * @desc 在商店场景出售物品时，将此开关设为开启状态。
 * 商店场景打开时开关会恢复关闭状态。
 * @default 0
 *
 * @param Command
 * @text 命令窗口
 *
 * @param CmdHideDisabled:eval
 * @text 隐藏不可用？
 * @parent Command
 * @type boolean
 * @on 隐藏
 * @off 默认
 * @desc 是否隐藏所有不可用的命令，例如当商店仅允许购买时？
 * @default true
 *
 * @param CmdStyle:str
 * @text 样式
 * @parent Command
 * @type select
 * @option 仅文本
 * @value text
 * @option 仅图标
 * @value icon
 * @option 图标 + 文本
 * @value iconText
 * @option 自动
 * @value auto
 * @desc 在命令窗口中如何绘制命令？
 * @default auto
 *
 * @param CmdTextAlign:str
 * @text 文本对齐
 * @parent Command
 * @type combo
 * @option 左对齐
 * @option 居中
 * @option 右对齐
 * @desc 命令窗口中文本的对齐方式。
 * @default center
 *
 * @param CmdIconBuy:num
 * @text 购买图标
 * @parent Command
 * @desc 购买命令使用的图标。
 * @default 208
 *
 * @param CmdIconSell:num
 * @text 出售图标
 * @parent Command
 * @desc 出售命令使用的图标。
 * @default 314
 *
 * @param CmdIconCancel:num
 * @text 取消图标
 * @parent Command
 * @desc 取消命令使用的图标。
 * @default 82
 *
 * @param CmdCancelRename:str
 * @text 重命名“取消”
 * @parent Command
 * @desc 为商店菜单场景重命名“取消”为更符合逻辑的名称。
 * @default 退出
 *
 * @param Prices
 * @text 价格
 *
 * @param SellPriceRate:num
 * @text 出售价格比率
 * @parent Prices
 * @desc 默认的出售价格比率。
 * @default 0.50
 *
 * @param BuyPriceJS:func
 * @text JS：购买价格
 * @parent Prices
 * @type note
 * @desc 最终确定购买价格前的修改。
 * @default "// 声明变量\nlet item = arguments[0];\nlet price = arguments[1];\n\n// 返回最终价格\nreturn price;"
 *
 * @param SellPriceJS:func
 * @text JS：出售价格
 * @parent Prices
 * @type note
 * @desc 最终确定出售价格前的修改。
 * @default "// 声明变量\nlet item = arguments[0];\nlet price = arguments[1];\n\n// 返回最终价格\nreturn price;"
 * 
 * @param ButtonAssist
 * @text 按钮辅助窗口
 *
 * @param buttonAssistSmallIncrement:str
 * @text 小增量
 * @parent ButtonAssist
 * @desc 更改购买/出售数量时使用的文本。
 * 适用于VisuStella MZ的核心引擎的按钮辅助窗口。
 * @default -1/+1
 *
 * @param buttonAssistLargeIncrement:str
 * @text 大增量
 * @parent ButtonAssist
 * @desc 更改购买/出售数量时使用的文本。
 * 适用于VisuStella MZ的核心引擎的按钮辅助窗口。
 * @default -10/+10
 *
 */

/* ----------------------------------------------------------------------------
 * 商店状态窗口设置
 * ----------------------------------------------------------------------------
 */
/*~struct~StatusWindow:
 *
 * @param General
 * @text 常规
 *
 * @param Width:num
 * @text 窗口宽度
 * @parent General
 * @desc 状态窗口的常规宽度。
 * @default 352
 *
 * @param ParamChangeFontSize:num
 * @text 参数字体大小
 * @parent General
 * @desc 参数变化时使用的字体大小。
 * @default 22
 *
 * @param Translucent:num
 * @text 半透明度
 * @parent General
 * @desc 半透明窗口对象使用的不透明度设置。
 * @default 64
 *
 * @param DrawBackRect:eval
 * @text 显示背景矩形？
 * @parent General
 * @type boolean
 * @on 显示
 * @off 不显示
 * @desc 是否显示深色背景矩形以更好地显示信息？
 * @default true
 *
 * @param BackRectColor:str
 * @text 背景矩形颜色
 * @parent DrawBackRect:eval
 * @desc 使用 #rrggbb 自定义颜色或使用窗口皮肤的普通数字颜色。
 * @default 19
 *
 * @param EquipData
 * @text 装备数据
 *
 * @param AlreadyEquipMarker:str
 * @text 已装备标记
 * @parent EquipData
 * @desc 用于显示角色无法装备物品的标记。
 * @default 已
 *
 * @param CannotEquipMarker:str
 * @text 不能装备标记
 * @parent EquipData
 * @desc 用于显示角色无法装备物品的标记。
 * @default -
 *
 * @param EquipDelayMS:num
 * @text 延迟毫秒数
 * @parent EquipData
 * @type number
 * @min 1
 * @max 999
 * @desc 预览更新延迟的毫秒数（MS）？
 * 这是为了仅在装备时防止性能峰值。
 * @default 240
 *
 * @param NoChangeMarker:str
 * @text 无变化标记
 * @parent EquipData
 * @desc 用于显示未发生变化的标记。
 * @default -
 *
 * @param DrawEquipData:func
 * @text JS：绘制装备数据
 * @parent EquipData
 * @type note
 * @desc 用于绘制商店状态窗口中装备数据的代码。
 * @default "// 设置变量\nconst lineHeight = this.lineHeight();\nconst paramheight = this.gaugeLineHeight() + 8;\nlet x = 0;\nlet y = 0;\nlet width = this.innerWidth;\nlet height = this.innerHeight;\nlet hw = Math.floor(width / 2);\nlet hx = x + width - hw;\n\n// 绘制物品名称、类型和数量\nthis.drawItemName(this._item, x + this.itemPadding(), y, width - this.itemPadding() * 2);\nthis.drawItemDarkRect(x, y, width);\ny += lineHeight;\nif (this.drawItemEquipType(x, y, hw)) y += 0;\nif (this.drawItemQuantity(hx, y, hw)) y += lineHeight;\n\n// 绘制参数名称\nconst params = this.actorParams();\nconst backY = y;\ny = height - (params.length * paramheight) - 4;\nlet paramX = x;\nlet paramWidth = 0;\nlet tableY = y;\nfor (const paramId of params) {\n    paramWidth = Math.max(this.drawParamName(paramId, x + 4, y + 4, width), paramWidth);\n    y += paramheight;\n}\n\n// 绘制角色数据\nconst actorMax = $gameParty.maxBattleMembers();\nconst actorWidth = Math.floor((width - paramWidth) / actorMax);\nparamWidth = width - (actorWidth * actorMax);\nfor (const actor of $gameParty.battleMembers()) {\n    const index = $gameParty.battleMembers().indexOf(actor);\n    const actorX = paramX + paramWidth + (index * actorWidth);\n    this.changePaintOpacity(actor.canEquip(this._item));\n    this.drawActorCharacter(actor, actorX + (actorWidth / 2), tableY);\n    let actorY = tableY;\n\n    // 绘制参数变化\nfor (const paramId of params) {\n    const diffY = actorY - ((lineHeight - paramheight) / 2);\n    this.drawActorParamDifference(actor, paramId, actorX, diffY, actorWidth);\n    actorY += paramheight;\n}\n}\n\n// 绘制背景矩形\nthis.drawItemDarkRect(paramX, backY, paramWidth, tableY - backY);\nfor (let i = 0; i < actorMax; i++) {\n    const actorX = paramX + paramWidth + (i * actorWidth);\n    this.drawItemDarkRect(actorX, backY, actorWidth, tableY - backY);\n}\nfor (const paramId of params) {\n    this.drawItemDarkRect(paramX, tableY, paramWidth, paramheight);\n    for (let i = 0; i < actorMax; i++) {\n        const actorX = paramX + paramWidth + (i * actorWidth);\n        this.drawItemDarkRect(actorX, tableY, actorWidth, paramheight);\n    }\n    tableY += paramheight;\n}"
 *
 * @param ItemData
 * @text 物品数据
 *
 * @param ItemGeneral
 * @parent ItemData
 *
 * @param MaxIcons:num
 * @text 最大状态/增益图标数
 * @parent ItemGeneral
 * @desc 可显示的最大状态/增益图标数量。
 * @default 8
 *
 * @param MultiplierStandard:num
 * @text 增益标准
 * @parent ItemGeneral
 * @desc 在计算伤害倍率时过滤随机值的常量标准。
 * @default 1000000
 *
 *

 *
  * @param DrawItemData:func
 * @text JS：绘制物品数据
 * @parent ItemGeneral
 * @type note
 * @desc 用于绘制商店状态窗口中物品数据的代码。
 * @default "const lineHeight = this.lineHeight();\nlet x = 0;\nlet y = 0;\nlet width = this.innerWidth;\nlet height = this.innerHeight;\nlet hw = Math.floor(width / 2);\nlet hx = x + width - hw;\n\n// 绘制物品名称和数量\nthis.drawItemName(this._item, x + this.itemPadding(), y, width - this.itemPadding() * 2);\nthis.drawItemDarkRect(x, y, width);\ny += lineHeight;\n\n// 绘制主要物品属性\nif (this.drawItemConsumable(x, y, hw)) y += 0;\nif (this.drawItemQuantity(hx, y, hw)) y += lineHeight;\nif (this._item.occasion < 3) {\n    y = this.drawItemDamage(x, y, width);\n    y = this.drawItemEffects(x, y, width);\n}\ny = this.drawItemCustomEntries(x, y, width);\n\n// 绘制剩余物品属性\nif (this._item.occasion < 3) {\n    if (this.drawItemOccasion(x, y, hw)) y += 0;\n    if (this.drawItemScope(hx, y, hw)) y += lineHeight;\n    if (this.drawItemHitType(x, y, hw)) y += 0;\n    if (this.drawItemSuccessRate(hx, y, hw)) y += lineHeight;\n    if (this.drawItemSpeed(x, y, hw)) y += 0;\n    if (this.drawItemRepeats(hx, y, hw)) y += lineHeight;\n}\n\n// 填充窗口的其余部分\nthis.drawItemDarkRect(x, y, width, height - y);"
 *
 * @param Vocabulary
 * @parent ItemData
 *
 * @param LabelConsume:str
 * @text 可消耗
 * @parent Vocabulary
 * @desc 用于此数据条目的词汇。
 * @default 可消耗
 *
 * @param Consumable:str
 * @text 是
 * @parent LabelConsume:str
 * @desc 用于此数据条目的词汇。
 * @default ✔
 *
 * @param NotConsumable:str
 * @text 否
 * @parent LabelConsume:str
 * @desc 用于此数据条目的词汇。
 * @default ✘
 *
 * @param Occasions
 * @parent Vocabulary
 *
 * @param Occasion0:str
 * @text 始终
 * @parent Occasions
 * @desc 用于此数据条目的词汇。
 * @default 随时使用
 *
 * @param Occasion1:str
 * @text 战斗画面
 * @parent Occasions
 * @desc 用于此数据条目的词汇。
 * @default 仅战斗中
 *
 * @param Occasion2:str
 * @text 菜单画面
 * @parent Occasions
 * @desc 用于此数据条目的词汇。
 * @default 仅场景中
 *
 * @param Occasion3:str
 * @text 从不
 * @parent Occasions
 * @desc 用于此数据条目的词汇。
 * @default -
 *
 * @param Scope
 * @parent Vocabulary
 *
 * @param Scope0:str
 * @text 无
 * @parent Scope
 * @desc 用于此数据条目的词汇。
 * @default 无目标
 *
 * @param Scope1:str
 * @text 1 敌人
 * @parent Scope
 * @desc 用于此数据条目的词汇。
 * @default 1 敌人
 *
 * @param Scope2:str
 * @text 所有敌人
 * @parent Scope
 * @desc 用于此数据条目的词汇。
 * @default 所有敌人
 *
 * @param Scope3:str
 * @text 1 随机敌人
 * @parent Scope
 * @desc 用于此数据条目的词汇。
 * @default 1 随机敌人
 *
 * @param Scope4:str
 * @text 2 随机敌人
 * @parent Scope
 * @desc 用于此数据条目的词汇。
 * @default 2 随机敌人
 *
 * @param Scope5:str
 * @text 3 随机敌人
 * @parent Scope
 * @desc 用于此数据条目的词汇。
 * @default 3 随机敌人
 *
 * @param Scope6:str
 * @text 4 随机敌人
 * @parent Scope
 * @desc 用于此数据条目的词汇。
 * @default 4 随机敌人
 *
 * @param Scope7:str
 * @text 1 盟友
 * @parent Scope
 * @desc 用于此数据条目的词汇。
 * @default 1 盟友
 *
 * @param Scope8:str
 * @text 所有盟友
 * @parent Scope
 * @desc 用于此数据条目的词汇。
 * @default 存活盟友
 *
 * @param Scope9:str
 * @text 1 盟友（死亡）
 * @parent Scope
 * @desc 用于此数据条目的词汇。
 * @default 死亡盟友
 *
 * @param Scope10:str
 * @text 所有盟友（死亡）
 * @parent Scope
 * @desc 用于此数据条目的词汇。
 * @default 死亡盟友
 *
 * @param Scope11:str
 * @text 使用者
 * @parent Scope
 * @desc 用于此数据条目的词汇。
 * @default 使用者
 *
 * @param Scope12:str
 * @text 1 盟友（死亡）
 * @parent Scope
 * @desc 用于此数据条目的词汇。
 * @default 任何盟友
 *
 * @param Scope13:str
 * @text 所有盟友（死亡）
 * @parent Scope
 * @desc 用于此数据条目的词汇。
 * @default 所有盟友
 *
 * @param Scope14:str
 * @text 敌人和盟友
 * @parent Scope
 * @desc 用于此数据条目的词汇。
 * @default 所有人
 *
 * @param BattleCore
 * @text 战斗核心支持
 * @parent Vocabulary
 *
 * @param ScopeRandomAny:str
 * @text x 随机任意
 * @parent BattleCore
 * @desc 用于 <目标：x 随机任意> 标签的词汇。
 * @default %1 随机单位

 *
  * @param ScopeRandomEnemies:str
 * @text x随机敌人
 * @parent BattleCore
 * @desc <目标：x随机敌人> 标签注释的词汇。
 * @default %1随机敌人
 *
 * @param ScopeRandomAllies:str
 * @text x随机盟友
 * @parent BattleCore
 * @desc <目标：x随机盟友> 标签注释的词汇。
 * @default %1随机盟友
 *
 * @param ScopeAlliesButUser:str
 * @text 除用户外所有盟友
 * @parent BattleCore
 * @desc <目标：除用户外所有盟友> 标签注释的词汇。
 * @default 其他盟友
 *
 * @param ScopeAllyOrEnemy:str
 * @text 盟友或敌人
 * @parent BattleCore
 * @desc <目标：盟友或敌人> 标签注释的词汇。
 * @default 盟友/敌人
 *
 * @param ScopeEnemyOrAlly:str
 * @text 敌人或盟友
 * @parent BattleCore
 * @desc <目标：敌人或盟友> 标签注释的词汇。
 * @default 敌人/盟友
 *
 * @param LabelSpeed:str
 * @text 速度
 * @parent Vocabulary
 * @desc 此数据输入的词汇。
 * @default 速度
 *
 * @param Speed2000:str
 * @text >= 2000 速度
 * @parent LabelSpeed:str
 * @desc 此数据输入的词汇。
 * @default 最快

 *
  * @param Speed1000:str
 * @text >= 1000 速度
 * @parent LabelSpeed:str
 * @desc 此数据输入的词汇。
 * @default 更快
 *
 * @param Speed1:str
 * @text >= 1 速度
 * @parent LabelSpeed:str
 * @desc 此数据输入的词汇。
 * @default 快
 *
 * @param Speed0:str
 * @text == 0 速度
 * @parent LabelSpeed:str
 * @desc 此数据输入的词汇。
 * @default 普通
 *
 * @param SpeedNeg999:str
 * @text >= -999 速度
 * @parent LabelSpeed:str
 * @desc 此数据输入的词汇。
 * @default 慢
 *
 * @param SpeedNeg1999:str
 * @text >= -1999 速度
 * @parent LabelSpeed:str
 * @desc 此数据输入的词汇。
 * @default 较慢
 *
 * @param SpeedNeg2000:str
 * @text <= -2000 速度
 * @parent LabelSpeed:str
 * @desc 此数据输入的词汇。
 * @default 最慢
 *
 * @param LabelSuccessRate:str
 * @text 成功率
 * @parent Vocabulary
 * @desc 此数据输入的词汇。
 * @default 精准度
 *
 * @param LabelRepeats:str
 * @text 重复次数
 * @parent Vocabulary
 * @desc 此数据输入的词汇。
 * @default 击中次数
 *
 * @param LabelHitType:str
 * @text 命中类型
 * @parent Vocabulary
 * @desc 此数据输入的词汇。
 * @default 类型
 *
 * @param HitType0:str
 * @text 必中
 * @parent LabelHitType:str
 * @desc 此数据输入的词汇。
 * @default 中立

 *
  * @param HitType1:str
 * @text 物理
 * @parent LabelHitType:str
 * @desc 此数据输入的词汇。
 * @default 物理
 *
 * @param HitType2:str
 * @text 魔法
 * @parent LabelHitType:str
 * @desc 此数据输入的词汇。
 * @default 魔法
 *
 * @param LabelElement:str
 * @text 元素
 * @parent Vocabulary
 * @desc 此数据输入的词汇。
 * @default 元素
 *
 * @param ElementWeapon:str
 * @text 武器基础
 * @parent LabelElement:str
 * @desc 此数据输入的词汇。
 * @default \I[97]武器
 *
 * @param ElementNone:str
 * @text 无元素
 * @parent LabelElement:str
 * @desc 此数据输入的词汇。
 * @default \I[160]无元素
 *
 * @param DamageType
 * @text 伤害类型
 * @parent Vocabulary
 *
 * @param DamageType1:str
 * @text HP 伤害
 * @parent DamageType
 * @desc 此数据输入的词汇。如果安装了 Visu_1_BattleCore，则以其伤害样式设置为准。
 * @default %1 伤害倍率
 *
 * @param DamageType2:str
 * @text MP 伤害
 * @parent DamageType
 * @desc 此数据输入的词汇。如果安装了 Visu_1_BattleCore，则以其伤害样式设置为准。
 * @default %1 伤害倍率
 *
 * @param DamageType3:str
 * @text HP 回复
 * @parent DamageType
 * @desc 此数据输入的词汇。如果安装了 Visu_1_BattleCore，则以其伤害样式设置为准。
 * @default %1 回复倍率

 *
  * @param DamageType4:str
 * @text MP 回复
 * @parent DamageType
 * @desc 此数据输入的词汇。如果安装了 Visu_1_BattleCore，则以其伤害样式设置为准。
 * @default %1 回复倍率
 *
 * @param DamageType5:str
 * @text HP 吸取
 * @parent DamageType
 * @desc 此数据输入的词汇。如果安装了 Visu_1_BattleCore，则以其伤害样式设置为准。
 * @default %1 吸取倍率
 *
 * @param DamageType6:str
 * @text MP 吸取
 * @parent DamageType
 * @desc 此数据输入的词汇。如果安装了 Visu_1_BattleCore，则以其伤害样式设置为准。
 * @default %1 吸取倍率
 *
 * @param Effects
 * @parent Vocabulary
 *
 * @param LabelRecoverHP:str
 * @text 恢复 HP
 * @parent Effects
 * @desc 此数据输入的词汇。
 * @default %1 恢复
 *
 * @param LabelRecoverMP:str
 * @text 恢复 MP
 * @parent Effects
 * @desc 此数据输入的词汇。
 * @default %1 恢复
 *
 * @param LabelRecoverTP:str
 * @text 恢复 TP
 * @parent Effects
 * @desc 此数据输入的词汇。
 * @default %1 恢复
 *
 * @param LabelSelfGainTP:str
 * @text 自我获得 TP
 * @parent Effects
 * @desc 此数据输入的词汇。
 * @default 使用者 %1
 *
 * @param LabelDamageHP:str
 * @text 伤害 HP
 * @parent Effects
 * @desc 此数据输入的词汇。
 * @default %1 伤害
 *
 * @param LabelDamageMP:str
 * @text 伤害 MP
 * @parent Effects
 * @desc 此数据输入的词汇。
 * @default %1 伤害
 *
 * @param LabelDamageTP:str
 * @text 伤害 TP
 * @parent Effects
 * @desc 此数据输入的词汇。
 * @default %1 伤害
 *
 * @param LabelApply:str
 * @text 添加状态/增益
 * @parent Effects
 * @desc 此数据输入的词汇。
 * @default 应用
 *
 * @param LabelRemove:str
 * @text 移除状态/增益
 * @parent Effects
 * @desc 此数据输入的词汇。
 * @default 移除
 *
 */

//=============================================================================

const _0x709961 = _0x2c86; (function (_0xa43959, _0x421d89) { const _0x5e3f68 = _0x2c86, _0x20b438 = _0xa43959(); while (!![]) { try { const _0x5dae3b = -parseInt(_0x5e3f68(0x21f)) / 0x1 * (parseInt(_0x5e3f68(0x218)) / 0x2) + -parseInt(_0x5e3f68(0x52d)) / 0x3 * (-parseInt(_0x5e3f68(0x411)) / 0x4) + parseInt(_0x5e3f68(0x1eb)) / 0x5 + parseInt(_0x5e3f68(0x650)) / 0x6 * (-parseInt(_0x5e3f68(0x482)) / 0x7) + parseInt(_0x5e3f68(0x656)) / 0x8 + -parseInt(_0x5e3f68(0x5df)) / 0x9 + parseInt(_0x5e3f68(0x21d)) / 0xa; if (_0x5dae3b === _0x421d89) break; else _0x20b438['push'](_0x20b438['shift']()); } catch (_0x564ca7) { _0x20b438['push'](_0x20b438['shift']()); } } }(_0x5bde, 0xbccdc)); var label = _0x709961(0x3db), tier = tier || 0x0, dependencies = [], pluginData = $plugins[_0x709961(0x672)](function (_0x2fa805) { const _0x3a00ef = _0x709961; return _0x2fa805[_0x3a00ef(0x241)] && _0x2fa805['description']['includes']('[' + label + ']'); })[0x0]; VisuMZ[label][_0x709961(0x6b0)] = VisuMZ[label][_0x709961(0x6b0)] || {}, VisuMZ[_0x709961(0x654)] = function (_0x5bb01a, _0x1da402) { const _0x201bfe = _0x709961; for (const _0x3f8577 in _0x1da402) { if (_0x3f8577['match'](/(.*):(.*)/i)) { if (_0x201bfe(0x6c8) === _0x201bfe(0x6c8)) { const _0x94bf3d = String(RegExp['$1']), _0x122b6e = String(RegExp['$2'])[_0x201bfe(0x45c)]()['trim'](); let _0x2314eb, _0x379819, _0x1c94d7; switch (_0x122b6e) { case _0x201bfe(0x4c0): _0x2314eb = _0x1da402[_0x3f8577] !== '' ? Number(_0x1da402[_0x3f8577]) : 0x0; break; case _0x201bfe(0x577): _0x379819 = _0x1da402[_0x3f8577] !== '' ? JSON[_0x201bfe(0x692)](_0x1da402[_0x3f8577]) : [], _0x2314eb = _0x379819[_0x201bfe(0x1ac)](_0x2676db => Number(_0x2676db)); break; case _0x201bfe(0x42a): _0x2314eb = _0x1da402[_0x3f8577] !== '' ? eval(_0x1da402[_0x3f8577]) : null; break; case 'ARRAYEVAL': _0x379819 = _0x1da402[_0x3f8577] !== '' ? JSON['parse'](_0x1da402[_0x3f8577]) : [], _0x2314eb = _0x379819[_0x201bfe(0x1ac)](_0x2a782f => eval(_0x2a782f)); break; case _0x201bfe(0x1c2): _0x2314eb = _0x1da402[_0x3f8577] !== '' ? JSON[_0x201bfe(0x692)](_0x1da402[_0x3f8577]) : ''; break; case 'ARRAYJSON': _0x379819 = _0x1da402[_0x3f8577] !== '' ? JSON[_0x201bfe(0x692)](_0x1da402[_0x3f8577]) : [], _0x2314eb = _0x379819['map'](_0x522417 => JSON[_0x201bfe(0x692)](_0x522417)); break; case _0x201bfe(0x4db): _0x2314eb = _0x1da402[_0x3f8577] !== '' ? new Function(JSON['parse'](_0x1da402[_0x3f8577])) : new Function('return\x200'); break; case 'ARRAYFUNC': _0x379819 = _0x1da402[_0x3f8577] !== '' ? JSON[_0x201bfe(0x692)](_0x1da402[_0x3f8577]) : [], _0x2314eb = _0x379819[_0x201bfe(0x1ac)](_0x20f773 => new Function(JSON['parse'](_0x20f773))); break; case 'STR': _0x2314eb = _0x1da402[_0x3f8577] !== '' ? String(_0x1da402[_0x3f8577]) : ''; break; case _0x201bfe(0x6b3): _0x379819 = _0x1da402[_0x3f8577] !== '' ? JSON['parse'](_0x1da402[_0x3f8577]) : [], _0x2314eb = _0x379819[_0x201bfe(0x1ac)](_0x2b9fe5 => String(_0x2b9fe5)); break; case _0x201bfe(0x228): _0x1c94d7 = _0x1da402[_0x3f8577] !== '' ? JSON[_0x201bfe(0x692)](_0x1da402[_0x3f8577]) : {}, _0x5bb01a[_0x94bf3d] = {}, VisuMZ[_0x201bfe(0x654)](_0x5bb01a[_0x94bf3d], _0x1c94d7); continue; case _0x201bfe(0x54d): _0x379819 = _0x1da402[_0x3f8577] !== '' ? JSON['parse'](_0x1da402[_0x3f8577]) : [], _0x2314eb = _0x379819[_0x201bfe(0x1ac)](_0x594878 => VisuMZ[_0x201bfe(0x654)]({}, JSON[_0x201bfe(0x692)](_0x594878))); break; default: continue; }_0x5bb01a[_0x94bf3d] = _0x2314eb; } else _0x2fa367 = _0x5dbe06[_0x201bfe(0x5f5)](this[_0x201bfe(0x69a)](_0x5de7fa, _0x38a896 + 0x4, _0x6a309b + 0x4, _0x52b9f4), _0x534bdf), _0x135f4b += _0x2c9f07; } } return _0x5bb01a; }, (_0x250600 => { const _0x1a5b72 = _0x709961, _0x3fb805 = _0x250600[_0x1a5b72(0x5a7)]; for (const _0x47e23f of dependencies) { if (!Imported[_0x47e23f]) { if ('wvaFf' !== _0x1a5b72(0x4c6)) { alert(_0x1a5b72(0x4b4)['format'](_0x3fb805, _0x47e23f)), SceneManager[_0x1a5b72(0x6e4)](); break; } else { const _0x53b387 = _0x3fb538[_0x1a5b72(0x401)](_0x21b0ab[_0x1a5b72(0x1f1)]()), _0x5fe500 = this[_0x1a5b72(0x224)] - _0x53b387[_0x1a5b72(0x4ca)]; _0x5c211e += _0x5fe500 / 0x2; if (_0x5fe500 < 0x0) _0x86283d -= _0x5fe500; _0x1b1912[_0x1a5b72(0x5ef)][_0x1a5b72(0x1f5)][_0x1a5b72(0x376)](this, _0x337873, _0xbee889, _0x5e6086, _0x244194, _0x566074); } } } const _0x1e824a = _0x250600[_0x1a5b72(0x3fa)]; if (_0x1e824a[_0x1a5b72(0x1ed)](/\[Version[ ](.*?)\]/i)) { const _0xbd4123 = Number(RegExp['$1']); _0xbd4123 !== VisuMZ[label][_0x1a5b72(0x6b8)] && (alert(_0x1a5b72(0x5de)[_0x1a5b72(0x60c)](_0x3fb805, _0xbd4123)), SceneManager[_0x1a5b72(0x6e4)]()); } if (_0x1e824a[_0x1a5b72(0x1ed)](/\[Tier[ ](\d+)\]/i)) { const _0xc946cc = Number(RegExp['$1']); _0xc946cc < tier ? (alert(_0x1a5b72(0x41d)[_0x1a5b72(0x60c)](_0x3fb805, _0xc946cc, tier)), SceneManager['exit']()) : tier = Math['max'](_0xc946cc, tier); } VisuMZ['ConvertParams'](VisuMZ[label][_0x1a5b72(0x6b0)], _0x250600[_0x1a5b72(0x662)]); })(pluginData), PluginManager[_0x709961(0x58d)](pluginData['name'], _0x709961(0x3c8), _0x41f76d => { const _0x5cf01a = _0x709961; VisuMZ[_0x5cf01a(0x654)](_0x41f76d, _0x41f76d); const _0x50256d = _0x41f76d['Actors'][_0x5cf01a(0x1ac)](_0x2ade0e => $gameActors['actor'](_0x2ade0e)), _0x604097 = _0x41f76d['Slots']['map'](_0x15cc52 => $dataSystem['equipTypes'][_0x5cf01a(0x532)](_0x15cc52['trim']())); for (const _0xf0294b of _0x50256d) { if (_0x5cf01a(0x37b) !== _0x5cf01a(0x6b7)) { if (!_0xf0294b) continue; _0xf0294b[_0x5cf01a(0x520)](_0x604097); } else return this[_0x5cf01a(0x4fa)]()[_0x5cf01a(0x1ed)](/LOWER/i); } }), PluginManager[_0x709961(0x58d)](pluginData[_0x709961(0x5a7)], _0x709961(0x30b), _0x5b4aa4 => { const _0x5416c5 = _0x709961; VisuMZ[_0x5416c5(0x654)](_0x5b4aa4, _0x5b4aa4); const _0x71c65c = _0x5b4aa4[_0x5416c5(0x581)][_0x5416c5(0x1ac)](_0x3a5a76 => $gameActors['actor'](_0x3a5a76)); for (const _0x854ec9 of _0x71c65c) { if (_0x5416c5(0x31e) !== _0x5416c5(0x31e)) { const _0x25856f = _0x3ae948['weaponTypes'][_0x5416c5(0x532)](_0x4e77ce(_0x4b8716['$1'])[_0x5416c5(0x3c4)]()); return _0x1e12fd[_0x5416c5(0x67a)](_0x55fdac) && _0x3789cb['wtypeId'] === _0x25856f; } else { if (!_0x854ec9) continue; _0x854ec9[_0x5416c5(0x334)](); } } }), PluginManager[_0x709961(0x58d)](pluginData[_0x709961(0x5a7)], _0x709961(0x21a), _0x105f0a => { const _0x29545f = _0x709961; if ($gameParty[_0x29545f(0x30d)]()) return; VisuMZ[_0x29545f(0x654)](_0x105f0a, _0x105f0a); const _0x509559 = _0x105f0a[_0x29545f(0x581)]['map'](_0x28c973 => $gameActors[_0x29545f(0x67f)](_0x28c973)); for (const _0x47b227 of _0x509559) { if (!_0x47b227) continue; _0x47b227['purifyCursedEquips'](); } }), PluginManager['registerCommand'](pluginData[_0x709961(0x5a7)], _0x709961(0x5e2), _0x17463b => { const _0x226b23 = _0x709961; if ($gameParty['inBattle']()) return; $gameParty[_0x226b23(0x550)](); }), PluginManager[_0x709961(0x58d)](pluginData['name'], _0x709961(0x584), _0x5558cc => { const _0x76d7e = _0x709961; VisuMZ[_0x76d7e(0x654)](_0x5558cc, _0x5558cc); const _0x5777a5 = [], _0x5054b1 = _0x5558cc[_0x76d7e(0x4ce)][_0x76d7e(0x1ac)](_0x52c9a0 => _0x52c9a0[_0x76d7e(0x45c)]()[_0x76d7e(0x3c4)]()), _0x325d46 = _0x5558cc[_0x76d7e(0x1b7)][_0x76d7e(0x1ac)](_0x35851b => _0x35851b[_0x76d7e(0x45c)]()[_0x76d7e(0x3c4)]()), _0x188303 = _0x5558cc[_0x76d7e(0x4bc)] >= _0x5558cc[_0x76d7e(0x2db)] ? _0x5558cc['Step1Start'] : _0x5558cc[_0x76d7e(0x4bc)], _0x522e26 = _0x5558cc['Step1End'] >= _0x5558cc[_0x76d7e(0x2db)] ? _0x5558cc[_0x76d7e(0x4bc)] : _0x5558cc[_0x76d7e(0x2db)], _0x2f4ca6 = Array(_0x522e26 - _0x188303 + 0x1)[_0x76d7e(0x5d6)]()[_0x76d7e(0x1ac)]((_0x562b00, _0x1bf9e5) => _0x188303 + _0x1bf9e5); for (const _0x198fb9 of _0x2f4ca6) { const _0x5ef3f7 = $dataItems[_0x198fb9]; if (!_0x5ef3f7) continue; if (!VisuMZ['ItemsEquipsCore'][_0x76d7e(0x1a5)](_0x5ef3f7, _0x5054b1, _0x325d46)) continue; _0x5777a5[_0x76d7e(0x4ba)]([0x0, _0x198fb9, 0x0, _0x5ef3f7[_0x76d7e(0x518)]]); } const _0x420851 = _0x5558cc[_0x76d7e(0x6a3)] >= _0x5558cc[_0x76d7e(0x56c)] ? _0x5558cc['Step2Start'] : _0x5558cc[_0x76d7e(0x6a3)], _0x2612a6 = _0x5558cc[_0x76d7e(0x6a3)] >= _0x5558cc['Step2Start'] ? _0x5558cc[_0x76d7e(0x6a3)] : _0x5558cc['Step2Start'], _0x442fb0 = Array(_0x2612a6 - _0x420851 + 0x1)[_0x76d7e(0x5d6)]()['map']((_0x25ca3e, _0x14c596) => _0x420851 + _0x14c596); for (const _0x3c2bd9 of _0x442fb0) { const _0x4d2093 = $dataWeapons[_0x3c2bd9]; if (!_0x4d2093) continue; if (!VisuMZ['ItemsEquipsCore'][_0x76d7e(0x1a5)](_0x4d2093, _0x5054b1, _0x325d46)) continue; _0x5777a5['push']([0x1, _0x3c2bd9, 0x0, _0x4d2093[_0x76d7e(0x518)]]); } const _0xaca45f = _0x5558cc[_0x76d7e(0x601)] >= _0x5558cc[_0x76d7e(0x1b6)] ? _0x5558cc['Step3Start'] : _0x5558cc[_0x76d7e(0x601)], _0x1c0984 = _0x5558cc['Step3End'] >= _0x5558cc[_0x76d7e(0x1b6)] ? _0x5558cc['Step3End'] : _0x5558cc[_0x76d7e(0x1b6)], _0x58dd90 = Array(_0x1c0984 - _0xaca45f + 0x1)[_0x76d7e(0x5d6)]()[_0x76d7e(0x1ac)]((_0x11ef5b, _0x408667) => _0xaca45f + _0x408667); for (const _0x5ae488 of _0x58dd90) { if ('GXtvt' !== _0x76d7e(0x4f8)) _0x74637a[_0x76d7e(0x3db)][_0x76d7e(0x3cf)][_0x76d7e(0x376)](this, _0x4a0066), this[_0x76d7e(0x68f)](_0x3a8dd7); else { const _0x24e9cb = $dataArmors[_0x5ae488]; if (!_0x24e9cb) continue; if (!VisuMZ[_0x76d7e(0x3db)][_0x76d7e(0x1a5)](_0x24e9cb, _0x5054b1, _0x325d46)) continue; _0x5777a5[_0x76d7e(0x4ba)]([0x2, _0x5ae488, 0x0, _0x24e9cb[_0x76d7e(0x518)]]); } } SceneManager[_0x76d7e(0x4ba)](Scene_Shop), SceneManager[_0x76d7e(0x287)](_0x5777a5, _0x5558cc[_0x76d7e(0x4c7)]); }), VisuMZ[_0x709961(0x3db)][_0x709961(0x1a5)] = function (_0x7ad096, _0x2b6439, _0x176be1) { const _0x5f8c2e = _0x709961; if (_0x7ad096[_0x5f8c2e(0x5a7)]['trim']() === '') return ![]; if (_0x7ad096[_0x5f8c2e(0x5a7)][_0x5f8c2e(0x1ed)](/-----/i)) return ![]; const _0x2e5c96 = _0x7ad096[_0x5f8c2e(0x5d4)]; if (_0x2b6439[_0x5f8c2e(0x321)] > 0x0) for (const _0x17e608 of _0x2b6439) { if (_0x5f8c2e(0x51b) === _0x5f8c2e(0x51b)) { if (!_0x17e608) continue; if (_0x2e5c96[_0x5f8c2e(0x3bb)](_0x17e608)) return ![]; } else return _0xf3669b[_0x5f8c2e(0x615)] && _0x4470e8[_0x5f8c2e(0x5ef)][_0x5f8c2e(0x6d8)][_0x5f8c2e(0x376)](this); } if (_0x176be1[_0x5f8c2e(0x321)] > 0x0) { if (_0x5f8c2e(0x38a) !== _0x5f8c2e(0x38a)) { if (this[_0x5f8c2e(0x342)]) return ![]; _0x4d241b[_0x5f8c2e(0x262)] = !![]; const _0x4c70bf = _0x711ed9[_0x5f8c2e(0x3db)][_0x5f8c2e(0x235)][_0x5f8c2e(0x376)](this, _0x7dcca6, _0x366b89); return _0x549e5a[_0x5f8c2e(0x262)] = ![], _0x4c70bf; } else { for (const _0x151f78 of _0x176be1) { if ('Hrnub' === 'WThOU') { const _0x311b81 = _0x49cf5a(_0x282e99['$1']) || 0x0, _0xe6e1e9 = this[_0x5f8c2e(0x46c)](_0xaa7c37), _0x36688a = _0xe6e1e9['x'] + _0x116632['floor']((_0xe6e1e9[_0x5f8c2e(0x4ca)] - _0x47336b[_0x5f8c2e(0x357)]) / 0x2), _0x41c1ce = _0xe6e1e9['y'] + (_0xe6e1e9[_0x5f8c2e(0x232)] - _0x5b353b[_0x5f8c2e(0x2ea)]) / 0x2; this[_0x5f8c2e(0x25a)](_0x311b81, _0x36688a, _0x41c1ce); } else { if (!_0x151f78) continue; if (_0x2e5c96['includes'](_0x151f78)) return !![]; } } return ![]; } } return !![]; }, VisuMZ[_0x709961(0x3db)]['Scene_Boot_onDatabaseLoaded'] = Scene_Boot[_0x709961(0x5ef)]['onDatabaseLoaded'], Scene_Boot['prototype'][_0x709961(0x50c)] = function () { const _0x3127bc = _0x709961; this[_0x3127bc(0x500)](), VisuMZ[_0x3127bc(0x3db)][_0x3127bc(0x1aa)][_0x3127bc(0x376)](this), this[_0x3127bc(0x52c)](), VisuMZ['ItemsEquipsCore'][_0x3127bc(0x2d6)](), VisuMZ['ItemsEquipsCore']['SetupArtifactItemIDs'](); }, Scene_Boot[_0x709961(0x5ef)]['process_VisuMZ_ItemsEquipsCore_RegExp'] = function () { const _0x2b3d2a = _0x709961; VisuMZ[_0x2b3d2a(0x3db)][_0x2b3d2a(0x34a)] = {}, VisuMZ[_0x2b3d2a(0x3db)][_0x2b3d2a(0x34a)][_0x2b3d2a(0x679)] = [], VisuMZ['ItemsEquipsCore']['RegExp'][_0x2b3d2a(0x41e)] = []; const _0x5c7e10 = [_0x2b3d2a(0x24f), _0x2b3d2a(0x459), _0x2b3d2a(0x614), 'DEF', _0x2b3d2a(0x381), _0x2b3d2a(0x2e7), _0x2b3d2a(0x50a), _0x2b3d2a(0x26c)]; for (const _0x123654 of _0x5c7e10) { if (_0x2b3d2a(0x6a4) !== _0x2b3d2a(0x3a4)) { const _0x17564a = _0x2b3d2a(0x4fd)['format'](_0x123654); VisuMZ[_0x2b3d2a(0x3db)][_0x2b3d2a(0x34a)][_0x2b3d2a(0x679)]['push'](new RegExp(_0x17564a, 'i')); const _0x308d59 = _0x2b3d2a(0x564)[_0x2b3d2a(0x60c)](_0x123654); VisuMZ[_0x2b3d2a(0x3db)][_0x2b3d2a(0x34a)][_0x2b3d2a(0x41e)][_0x2b3d2a(0x4ba)](new RegExp(_0x308d59, 'g')); } else this[_0x2b3d2a(0x1d6)](!![]); } }, Scene_Boot[_0x709961(0x5ef)][_0x709961(0x52c)] = function () { const _0x28b35b = _0x709961; if (VisuMZ['ParseAllNotetags']) return; this[_0x28b35b(0x350)](); const _0x549c06 = [$dataItems, $dataWeapons, $dataArmors]; for (const _0x17b485 of _0x549c06) { for (const _0x322ee3 of _0x17b485) { if (_0x28b35b(0x460) === 'amgCx') { if (!_0x322ee3) continue; VisuMZ[_0x28b35b(0x3db)]['Parse_Notetags_Category'](_0x322ee3, _0x17b485), VisuMZ[_0x28b35b(0x3db)]['Parse_Notetags_Prices'](_0x322ee3, _0x17b485), VisuMZ['ItemsEquipsCore'][_0x28b35b(0x355)](_0x322ee3, _0x17b485), VisuMZ['ItemsEquipsCore'][_0x28b35b(0x659)](_0x322ee3, _0x17b485), VisuMZ[_0x28b35b(0x3db)][_0x28b35b(0x29e)](_0x322ee3, _0x17b485); } else return _0xdec37a[_0x28b35b(0x3db)][_0x28b35b(0x6b0)][_0x28b35b(0x281)]['LabelRemove']; } } }, Scene_Boot[_0x709961(0x5ef)][_0x709961(0x350)] = function () { const _0x35d6f2 = _0x709961; for (const _0x47d03b of $dataClasses) { if (_0x35d6f2(0x607) === 'ljjyB') _0x39540e[_0x35d6f2(0x5ef)]['isRightInputMode']['call'](this); else { if (!_0x47d03b) continue; VisuMZ['ItemsEquipsCore']['Parse_Notetags_EquipSlots'](_0x47d03b); } } }, VisuMZ[_0x709961(0x3db)]['ParseClassNotetags'] = VisuMZ[_0x709961(0x23b)], VisuMZ[_0x709961(0x23b)] = function (_0xbe4e13) { const _0x3d34f7 = _0x709961; VisuMZ[_0x3d34f7(0x3db)][_0x3d34f7(0x23b)][_0x3d34f7(0x376)](this, _0xbe4e13), VisuMZ['ItemsEquipsCore']['Parse_Notetags_EquipSlots'](_0xbe4e13); }, VisuMZ[_0x709961(0x3db)][_0x709961(0x1bc)] = VisuMZ['ParseItemNotetags'], VisuMZ[_0x709961(0x1bc)] = function (_0xa21fea) { const _0xd04314 = _0x709961; VisuMZ['ItemsEquipsCore'][_0xd04314(0x1bc)][_0xd04314(0x376)](this, _0xa21fea), VisuMZ['ItemsEquipsCore'][_0xd04314(0x1c8)](_0xa21fea, $dataItems); }, VisuMZ[_0x709961(0x3db)][_0x709961(0x555)] = VisuMZ[_0x709961(0x555)], VisuMZ[_0x709961(0x555)] = function (_0x8da782) { const _0x1e9af7 = _0x709961; VisuMZ[_0x1e9af7(0x3db)]['ParseWeaponNotetags']['call'](this, _0x8da782), VisuMZ[_0x1e9af7(0x3db)][_0x1e9af7(0x1c8)](_0x8da782, $dataWeapons); }, VisuMZ[_0x709961(0x3db)][_0x709961(0x3bf)] = VisuMZ[_0x709961(0x3bf)], VisuMZ[_0x709961(0x3bf)] = function (_0x479367) { const _0x21212a = _0x709961; VisuMZ[_0x21212a(0x3db)][_0x21212a(0x3bf)][_0x21212a(0x376)](this, _0x479367), VisuMZ[_0x21212a(0x3db)][_0x21212a(0x1c8)](_0x479367, $dataArmors); }, VisuMZ['ItemsEquipsCore'][_0x709961(0x48b)] = function (_0x4ebf5c) { const _0x5beac6 = _0x709961; _0x4ebf5c[_0x5beac6(0x252)] = []; const _0x3ee4e6 = $dataSystem[_0x5beac6(0x2c9)]['map'](_0x45dd77 => _0x45dd77 ? _0x45dd77[_0x5beac6(0x3c4)]() : ''); if (!BattleManager[_0x5beac6(0x208)]() && _0x4ebf5c[_0x5beac6(0x1e9)][_0x5beac6(0x1ed)](/<EQUIP SLOTS>\s*([\s\S]*)\s*<\/EQUIP SLOTS>/i)) { if (_0x5beac6(0x559) !== _0x5beac6(0x559)) { this[_0x5beac6(0x4e3)](), this[_0x5beac6(0x30a)][_0x5beac6(0x416)] = this[_0x5beac6(0x302)](); let _0x4a2780 = this['textWidth'](_0x105757[_0x5beac6(0x307)](_0x5118ad)) + 0x4 + _0x4d6ba8; return _0x334e6c['VisuMZ_0_CoreEngine'] ? (this[_0x5beac6(0x623)](_0x36af5a, _0x57edd4, _0x58104d, _0x5d0e01, !![]), _0x2e0bd3['CoreEngine'][_0x5beac6(0x6b0)][_0x5beac6(0x512)][_0x5beac6(0x426)] && (_0x4a2780 += _0x4ed760['iconWidth'] + 0x4)) : (this[_0x5beac6(0x61c)](_0x385dd4[_0x5beac6(0x697)]()), this[_0x5beac6(0x62c)](_0x1878a8['param'](_0x266f67), _0x9f2b1e, _0x44688c, _0xa7acb1)), this[_0x5beac6(0x4e3)](), _0x4a2780; } else { const _0x551ed8 = String(RegExp['$1'])['split'](/[\r\n]+/); for (const _0x467915 of _0x551ed8) { const _0x4f0db7 = _0x3ee4e6[_0x5beac6(0x532)](_0x467915[_0x5beac6(0x3c4)]()); if (_0x4f0db7 > 0x0) _0x4ebf5c[_0x5beac6(0x252)][_0x5beac6(0x4ba)](_0x4f0db7); } } } else for (const _0x464815 of _0x3ee4e6) { const _0x304a67 = _0x3ee4e6[_0x5beac6(0x532)](_0x464815[_0x5beac6(0x3c4)]()); if (_0x304a67 > 0x0) _0x4ebf5c[_0x5beac6(0x252)][_0x5beac6(0x4ba)](_0x304a67); } }, VisuMZ[_0x709961(0x3db)][_0x709961(0x1c8)] = function (_0x2bf0fa, _0x5a4f6a) { const _0x1566bf = _0x709961; VisuMZ['ItemsEquipsCore']['Parse_Notetags_Category'](_0x2bf0fa, _0x5a4f6a), VisuMZ[_0x1566bf(0x3db)][_0x1566bf(0x5dd)](_0x2bf0fa, _0x5a4f6a), VisuMZ['ItemsEquipsCore']['Parse_Notetags_ParamValues'](_0x2bf0fa, _0x5a4f6a), VisuMZ['ItemsEquipsCore'][_0x1566bf(0x659)](_0x2bf0fa, _0x5a4f6a), VisuMZ['ItemsEquipsCore']['Parse_Notetags_EnableJS'](_0x2bf0fa, _0x5a4f6a); }, VisuMZ['ItemsEquipsCore'][_0x709961(0x296)] = function (_0x9856c3, _0x2fa74e) { const _0x4477b6 = _0x709961; _0x9856c3[_0x4477b6(0x5d4)] = []; const _0xcce08d = _0x9856c3[_0x4477b6(0x1e9)], _0x59618c = _0xcce08d[_0x4477b6(0x1ed)](/<(?:CATEGORY|CATEGORIES):[ ](.*)>/gi); if (_0x59618c) for (const _0x231182 of _0x59618c) { _0x231182['match'](/<(?:CATEGORY|CATEGORIES):[ ](.*)>/gi); const _0x4266c1 = String(RegExp['$1'])[_0x4477b6(0x45c)]()['trim']()[_0x4477b6(0x617)](','); for (const _0x1598a2 of _0x4266c1) { _0x9856c3[_0x4477b6(0x5d4)]['push'](_0x1598a2['trim']()); } } if (_0xcce08d['match'](/<(?:CATEGORY|CATEGORIES)>\s*([\s\S]*)\s*<\/(?:CATEGORY|CATEGORIES)>/i)) { if (_0x4477b6(0x582) !== _0x4477b6(0x31a)) { const _0x11fdbb = RegExp['$1'][_0x4477b6(0x617)](/[\r\n]+/); for (const _0x333c70 of _0x11fdbb) { if (_0x4477b6(0x63f) === _0x4477b6(0x63f)) _0x9856c3['categories'][_0x4477b6(0x4ba)](_0x333c70[_0x4477b6(0x45c)]()[_0x4477b6(0x3c4)]()); else return _0x3453d7[_0x4477b6(0x3db)][_0x4477b6(0x6b0)]['StatusWindow'][_0x4477b6(0x4d2)]; } } else return !!_0x37ba0c && _0x3a8005['categories'][_0x4477b6(0x3bb)](_0x20d128(_0x2f9a2e['$1'])['toUpperCase']()[_0x4477b6(0x3c4)]()); } }, VisuMZ[_0x709961(0x3db)]['Parse_Notetags_Prices'] = function (_0x204839, _0x21ea19) { const _0xedfd27 = _0x709961; if (_0x204839[_0xedfd27(0x1e9)][_0xedfd27(0x1ed)](/<PRICE:[ ](\d+)>/i)) { if (_0xedfd27(0x5b3) === _0xedfd27(0x686)) { const _0x10f1ee = _0xedfd27(0x65c); if (this[_0xedfd27(0x6f3)][_0xedfd27(0x69d)] === 0x0 && !this[_0xedfd27(0x3b8)][_0x10f1ee]) return ![]; const _0xa230f8 = this['getItemEffectsSelfTpGainLabel'](); this[_0xedfd27(0x2c2)](_0xa230f8, _0x10fb8, _0x457c91, _0x422aae, !![]); const _0x5d4454 = this[_0xedfd27(0x54f)](); return this[_0xedfd27(0x6f3)][_0xedfd27(0x69d)] > 0x0 ? this[_0xedfd27(0x61c)](_0x274dec[_0xedfd27(0x35e)]()) : this[_0xedfd27(0x61c)](_0x23b823[_0xedfd27(0x298)]()), this['drawItemKeyData'](_0x5d4454, _0x259b24, _0xf9a1fb, _0x4adb46, ![], 'right'), this[_0xedfd27(0x533)](_0x526739, _0x3c8961, _0x2e2f9f), this['resetFontSettings'](), !![]; } else _0x204839[_0xedfd27(0x518)] = Number(RegExp['$1']); } }, VisuMZ[_0x709961(0x3db)]['Parse_Notetags_ParamValues'] = function (_0x244f66, _0x93c7ca) { const _0x48dde8 = _0x709961; if (_0x93c7ca === $dataItems) return; for (let _0x2b9c03 = 0x0; _0x2b9c03 < 0x8; _0x2b9c03++) { const _0x41cebc = VisuMZ['ItemsEquipsCore'][_0x48dde8(0x34a)][_0x48dde8(0x679)][_0x2b9c03]; _0x244f66['note'][_0x48dde8(0x1ed)](_0x41cebc) && (_0x48dde8(0x4d0) !== _0x48dde8(0x4d0) ? (_0x546de4[_0x48dde8(0x3db)][_0x48dde8(0x3e0)][_0x48dde8(0x376)](this), this[_0x48dde8(0x6d8)]() && this[_0x48dde8(0x55f)]()) : _0x244f66[_0x48dde8(0x63a)][_0x2b9c03] = parseInt(RegExp['$1'])); } }, VisuMZ[_0x709961(0x3db)][_0x709961(0x510)] = {}, VisuMZ['ItemsEquipsCore'][_0x709961(0x659)] = function (_0xc5f320, _0x407807) { const _0x3f4825 = _0x709961; if (_0x407807 === $dataItems) return; if (_0xc5f320[_0x3f4825(0x1e9)]['match'](/<JS PARAMETERS>\s*([\s\S]*)\s*<\/JS PARAMETERS>/i)) { const _0x5829a3 = String(RegExp['$1']), _0x34126c = (_0x407807 === $dataWeapons ? _0x3f4825(0x557) : _0x3f4825(0x473))[_0x3f4825(0x60c)](_0xc5f320['id']), _0x2a7e9e = '\x0a\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20let\x20MaxHP\x20=\x200;\x20let\x20MaxMP\x20=\x200;\x20let\x20ATK\x20=\x200;\x20let\x20DEF\x20=\x200;\x0a\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20let\x20MAT\x20=\x200;\x20let\x20MDF\x20=\x200;\x20let\x20AGI\x20=\x200;\x20let\x20LUK\x20=\x200;\x0a\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20const\x20user\x20=\x20this;\x0a\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20const\x20target\x20=\x20this;\x0a\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20const\x20a\x20=\x20this;\x0a\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20const\x20b\x20=\x20this;\x0a\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20try\x20{\x0a\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20%1\x0a\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20}\x20catch\x20(e)\x20{\x0a\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20if\x20($gameTemp.isPlaytest())\x20console.log(e);\x0a\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20}\x0a\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20return\x20[MaxHP,\x20MaxMP,\x20ATK,\x20DEF,\x20MAT,\x20MDF,\x20AGI,\x20LUK][paramId];\x0a\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20'[_0x3f4825(0x60c)](_0x5829a3); for (let _0x109238 = 0x0; _0x109238 < 0x8; _0x109238++) { if (_0x3f4825(0x40a) !== _0x3f4825(0x40a)) return _0x497342[_0x3f4825(0x6c1)]['isUseItemsEquipsCoreUpdatedLayout']() ? 0x1 : 0x2; else { if (_0x5829a3[_0x3f4825(0x1ed)](VisuMZ[_0x3f4825(0x3db)][_0x3f4825(0x34a)][_0x3f4825(0x41e)][_0x109238])) { const _0x172562 = _0x3f4825(0x47e)[_0x3f4825(0x60c)](_0x34126c, _0x109238); VisuMZ['ItemsEquipsCore']['paramJS'][_0x172562] = new Function(_0x3f4825(0x24d), 'paramId', _0x2a7e9e); } } } } }, VisuMZ['ItemsEquipsCore']['itemEnableJS'] = {}, VisuMZ[_0x709961(0x3db)][_0x709961(0x29e)] = function (_0x48d5fd, _0x40473b) { const _0x38a863 = _0x709961; if (_0x40473b !== $dataItems) return; if (_0x48d5fd['note'][_0x38a863(0x1ed)](/<JS ITEM ENABLE>\s*([\s\S]*)\s*<\/JS ITEM ENABLE>/i)) { const _0x1e64bd = String(RegExp['$1']), _0x2213fd = _0x38a863(0x64d)[_0x38a863(0x60c)](_0x1e64bd); VisuMZ[_0x38a863(0x3db)][_0x38a863(0x52b)][_0x48d5fd['id']] = new Function(_0x38a863(0x24d), _0x2213fd); } }, DataManager[_0x709961(0x239)] = function (_0x55251f) { const _0x3a463c = _0x709961; return this[_0x3a463c(0x2f3)](_0x55251f) && _0x55251f[_0x3a463c(0x4d4)] === 0x2; }, DataManager[_0x709961(0x1ec)] = function (_0x26c2a1) { const _0x5950b3 = _0x709961; if (!_0x26c2a1) { if (_0x5950b3(0x68b) === _0x5950b3(0x68b)) return 0x63; else { const _0x388697 = _0x54ca81[_0x5950b3(0x6c1)][_0x5950b3(0x3bc)]; _0x388697 && (this[_0x5950b3(0x22a)](this[_0x5950b3(0x624)]()) ? (this[_0x5950b3(0x3ad)](), this[_0x5950b3(0x317)]()) : this['playBuzzerSound']()); } } else return _0x26c2a1['note'][_0x5950b3(0x1ed)](/<MAX:[ ](\d+)>/i) ? parseInt(RegExp['$1']) : this[_0x5950b3(0x67d)](_0x26c2a1); }, DataManager[_0x709961(0x67d)] = function (_0x1175bb) { const _0x46ff27 = _0x709961; if (this[_0x46ff27(0x2f3)](_0x1175bb)) { if (_0x46ff27(0x1d7) !== _0x46ff27(0x1d7)) { const _0x3c5c54 = _0x424665(_0x5873e3['$1'])[_0x46ff27(0x617)](',')[_0x46ff27(0x1ac)](_0x4bbd5f => _0xf6be1d(_0x4bbd5f)); if (_0x3c5c54['some'](_0x46803d => !_0x1156f4[_0x46ff27(0x337)](_0x46803d))) return ![]; } else return VisuMZ[_0x46ff27(0x3db)][_0x46ff27(0x6b0)][_0x46ff27(0x309)][_0x46ff27(0x3e4)]; } else { if (this[_0x46ff27(0x67a)](_0x1175bb)) { if (_0x46ff27(0x303) === _0x46ff27(0x61b)) { const _0x4f833c = this[_0x46ff27(0x2df)](); this[_0x46ff27(0x2c2)](_0x4f833c, _0x2ee227, _0x390e19, _0x3c1308, !![]), this['setupItemDamageTempActors'](); const _0x2ff208 = this[_0x46ff27(0x6f1)](), _0x410bbb = _0xa8a718[_0x46ff27(0x24c)]([0x0, 0x0, 0x2, 0x1, 0x3, 0x1, 0x3][this[_0x46ff27(0x3c2)][_0x46ff27(0x553)][_0x46ff27(0x44f)]]); return this[_0x46ff27(0x61c)](_0x410bbb), this[_0x46ff27(0x2c2)](_0x2ff208, _0x30b8f3, _0x33d830, _0x4ec016, ![], 'right'), this[_0x46ff27(0x533)](_0x542f4d, _0x589176, _0x2508b8), this[_0x46ff27(0x4e3)](), !![]; } else return VisuMZ[_0x46ff27(0x3db)][_0x46ff27(0x6b0)][_0x46ff27(0x309)]['MaxWeapons']; } else { if (this[_0x46ff27(0x3b3)](_0x1175bb)) return VisuMZ['ItemsEquipsCore'][_0x46ff27(0x6b0)]['ItemScene'][_0x46ff27(0x485)]; } } }, DataManager[_0x709961(0x508)] = function (_0x194ff3) { const _0xbe31bd = _0x709961; _0x194ff3 = _0x194ff3[_0xbe31bd(0x45c)]()[_0xbe31bd(0x3c4)](), this[_0xbe31bd(0x5b2)] = this['_classIDs'] || {}; if (this['_classIDs'][_0x194ff3]) return this[_0xbe31bd(0x5b2)][_0x194ff3]; for (const _0x4fbacb of $dataClasses) { if (_0xbe31bd(0x1fd) !== 'KMKtB') { const _0x33730d = this['_itemData'][_0xbe31bd(0x6d1)][_0xd143d6], _0x3021d7 = _0x59fdc6[_0xbe31bd(0x5ef)][_0xbe31bd(0x1ea)](-0x1, _0x33730d); if (_0x3021d7 > 0x0) { _0x5e1575 += '\x5cI[%1]'[_0xbe31bd(0x60c)](_0x3021d7), _0x530793++; if (_0x4b09b0 >= _0x221b89) return _0x5c92da; } } else { if (!_0x4fbacb) continue; let _0xc32f3 = _0x4fbacb['name']; _0xc32f3 = _0xc32f3[_0xbe31bd(0x3a5)](/\x1I\[(\d+)\]/gi, ''), _0xc32f3 = _0xc32f3[_0xbe31bd(0x3a5)](/\\I\[(\d+)\]/gi, ''), this[_0xbe31bd(0x5b2)][_0xc32f3['toUpperCase']()[_0xbe31bd(0x3c4)]()] = _0x4fbacb['id']; } } return this[_0xbe31bd(0x5b2)][_0x194ff3] || 0x0; }, DataManager[_0x709961(0x215)] = function (_0x161de9) { const _0x4950d0 = _0x709961; _0x161de9 = _0x161de9[_0x4950d0(0x45c)]()[_0x4950d0(0x3c4)](), this['_skillIDs'] = this['_skillIDs'] || {}; if (this['_skillIDs'][_0x161de9]) return this[_0x4950d0(0x635)][_0x161de9]; for (const _0x5aa43f of $dataSkills) { if (!_0x5aa43f) continue; this[_0x4950d0(0x635)][_0x5aa43f['name'][_0x4950d0(0x45c)]()[_0x4950d0(0x3c4)]()] = _0x5aa43f['id']; } return this[_0x4950d0(0x635)][_0x161de9] || 0x0; }, DataManager['getItemIdWithName'] = function (_0xdea9) { const _0x555541 = _0x709961; _0xdea9 = _0xdea9[_0x555541(0x45c)]()['trim'](), this[_0x555541(0x3ec)] = this[_0x555541(0x3ec)] || {}; if (this[_0x555541(0x3ec)][_0xdea9]) return this[_0x555541(0x3ec)][_0xdea9]; for (const _0x418d5c of $dataItems) { if (!_0x418d5c) continue; this[_0x555541(0x3ec)][_0x418d5c[_0x555541(0x5a7)][_0x555541(0x45c)]()['trim']()] = _0x418d5c['id']; } return this[_0x555541(0x3ec)][_0xdea9] || 0x0; }, DataManager[_0x709961(0x278)] = function (_0x393563) { const _0x2f3355 = _0x709961; _0x393563 = _0x393563['toUpperCase']()['trim'](), this['_weaponIDs'] = this['_weaponIDs'] || {}; if (this['_weaponIDs'][_0x393563]) return this[_0x2f3355(0x214)][_0x393563]; for (const _0x4f634f of $dataWeapons) { if (!_0x4f634f) continue; this['_weaponIDs'][_0x4f634f[_0x2f3355(0x5a7)][_0x2f3355(0x45c)]()[_0x2f3355(0x3c4)]()] = _0x4f634f['id']; } return this[_0x2f3355(0x214)][_0x393563] || 0x0; }, DataManager[_0x709961(0x3c5)] = function (_0x14a73a) { const _0x1b47cd = _0x709961; _0x14a73a = _0x14a73a[_0x1b47cd(0x45c)]()[_0x1b47cd(0x3c4)](), this[_0x1b47cd(0x4e8)] = this[_0x1b47cd(0x4e8)] || {}; if (this[_0x1b47cd(0x4e8)][_0x14a73a]) return this[_0x1b47cd(0x4e8)][_0x14a73a]; for (const _0x5c92a9 of $dataArmors) { if (_0x1b47cd(0x25f) === _0x1b47cd(0x23a)) return ![]; else { if (!_0x5c92a9) continue; this[_0x1b47cd(0x4e8)][_0x5c92a9[_0x1b47cd(0x5a7)][_0x1b47cd(0x45c)]()[_0x1b47cd(0x3c4)]()] = _0x5c92a9['id']; } } return this[_0x1b47cd(0x4e8)][_0x14a73a] || 0x0; }, DataManager[_0x709961(0x5d9)] = function (_0x150cf6) { const _0x5e0a6f = _0x709961; _0x150cf6 = _0x150cf6[_0x5e0a6f(0x45c)]()['trim'](), this[_0x5e0a6f(0x2da)] = this[_0x5e0a6f(0x2da)] || {}; if (this[_0x5e0a6f(0x2da)][_0x150cf6]) return this[_0x5e0a6f(0x2da)][_0x150cf6]; for (const _0x3d891e of $dataSystem[_0x5e0a6f(0x2c9)]) { this[_0x5e0a6f(0x2da)][_0x3d891e[_0x5e0a6f(0x45c)]()['trim']()] = $dataSystem[_0x5e0a6f(0x2c9)]['indexOf'](_0x3d891e); } return this[_0x5e0a6f(0x2da)][_0x150cf6] || 0x0; }, VisuMZ[_0x709961(0x3db)][_0x709961(0x2d6)] = function () { const _0x1cbcc7 = _0x709961; VisuMZ['ItemsEquipsCore']['SetupProxyItemGroup']($dataItems), VisuMZ['ItemsEquipsCore'][_0x1cbcc7(0x6e1)]($dataWeapons), VisuMZ['ItemsEquipsCore'][_0x1cbcc7(0x6e1)]($dataArmors); }, VisuMZ[_0x709961(0x3db)][_0x709961(0x6e1)] = function (_0x335652) { const _0x454f98 = _0x709961; for (const _0x2a2082 of _0x335652) { if (_0x454f98(0x45f) === _0x454f98(0x605)) _0x26b562 = 'item-%1'[_0x454f98(0x60c)](_0x1ffa98['id']); else { if (!_0x2a2082) continue; if (!DataManager[_0x454f98(0x4a0)](_0x2a2082)) continue; const _0x32aa28 = DataManager[_0x454f98(0x36d)](_0x2a2082), _0x137b1c = [_0x454f98(0x5a7), 'iconIndex', _0x454f98(0x3fa)]; for (const _0x585a27 of _0x137b1c) { if ('VVPBt' !== _0x454f98(0x1e4)) _0x2a2082[_0x585a27] = _0x32aa28[_0x585a27]; else for (const _0x6c255e of _0x57cb58[_0x454f98(0x68c)](this[_0x454f98(0x6f4)])) { _0x6c255e['hide'](); } } } } }, DataManager[_0x709961(0x4a0)] = function (_0x30f936) { const _0xc7513c = _0x709961; if (!_0x30f936) return ![]; if (!_0x30f936[_0xc7513c(0x1e9)]) return ![]; return _0x30f936 && _0x30f936['note'][_0xc7513c(0x1ed)](/<PROXY:[ ](.*)>/i); }, DataManager[_0x709961(0x36d)] = function (_0x2630c5) { const _0x7438ef = _0x709961; return this[_0x7438ef(0x4a0)](_0x2630c5) ? this[_0x7438ef(0x547)](_0x2630c5) || _0x2630c5 : _0x2630c5; }, DataManager['switchProxyItem'] = function (_0x354643) { const _0x33f769 = _0x709961; _0x354643[_0x33f769(0x1e9)][_0x33f769(0x1ed)](/<PROXY:[ ](.*)>/i); const _0x237485 = RegExp['$1'][_0x33f769(0x3c4)](), _0x342b03 = /^\d+$/[_0x33f769(0x566)](_0x237485); if (this[_0x33f769(0x2f3)](_0x354643)) { if (_0x33f769(0x391) !== 'DVOkn') this[_0x33f769(0x34b)](); else { const _0x18c75d = _0x342b03 ? Number(_0x237485) : DataManager[_0x33f769(0x665)](_0x237485); return $dataItems[_0x18c75d] || _0x354643; } } else { if (this[_0x33f769(0x67a)](_0x354643)) { const _0xff0944 = _0x342b03 ? Number(_0x237485) : DataManager[_0x33f769(0x278)](_0x237485); return $dataWeapons[_0xff0944] || _0x354643; } else { if (this[_0x33f769(0x3b3)](_0x354643)) { if ('UtDJt' === 'UtDJt') { const _0x383649 = _0x342b03 ? Number(_0x237485) : DataManager[_0x33f769(0x3c5)](_0x237485); return $dataArmors[_0x383649] || _0x354643; } else for (const _0x260bcb of _0x17d367) { _0x260bcb['match'](/<(?:CATEGORY|CATEGORIES):[ ](.*)>/gi); const _0x3b0061 = _0x17b807(_0xb028d3['$1'])[_0x33f769(0x45c)]()[_0x33f769(0x3c4)]()[_0x33f769(0x617)](','); for (const _0x39ec12 of _0x3b0061) { _0x1944db['categories'][_0x33f769(0x4ba)](_0x39ec12['trim']()); } } } } } return _0x354643; }, VisuMZ[_0x709961(0x3db)][_0x709961(0x295)] = Window_ItemList[_0x709961(0x5ef)][_0x709961(0x24d)], Window_ItemList['prototype']['item'] = function () { const _0x1261e6 = _0x709961; if ($gameTemp['_bypassProxy']) return VisuMZ[_0x1261e6(0x3db)][_0x1261e6(0x295)]['call'](this); return DataManager[_0x1261e6(0x36d)](VisuMZ[_0x1261e6(0x3db)][_0x1261e6(0x295)][_0x1261e6(0x376)](this)); }, Window_ItemList[_0x709961(0x5ef)][_0x709961(0x24e)] = function () { const _0x1a3fe8 = _0x709961; return VisuMZ[_0x1a3fe8(0x3db)]['Window_ItemList_item']['call'](this); }, VisuMZ[_0x709961(0x3db)][_0x709961(0x4d8)] = Window_ShopBuy['prototype'][_0x709961(0x24d)], Window_ShopBuy['prototype'][_0x709961(0x24d)] = function () { const _0x258acd = _0x709961; if ($gameTemp[_0x258acd(0x327)]) return VisuMZ[_0x258acd(0x3db)][_0x258acd(0x4d8)][_0x258acd(0x376)](this); return DataManager[_0x258acd(0x36d)](VisuMZ[_0x258acd(0x3db)][_0x258acd(0x4d8)][_0x258acd(0x376)](this)); }, Window_ShopBuy['prototype'][_0x709961(0x24e)] = function () { const _0x58a734 = _0x709961; return VisuMZ['ItemsEquipsCore'][_0x58a734(0x4d8)][_0x58a734(0x376)](this); }, VisuMZ[_0x709961(0x3db)][_0x709961(0x498)] = Game_Item[_0x709961(0x5ef)][_0x709961(0x299)], Game_Item[_0x709961(0x5ef)]['setObject'] = function (_0x5bfd32) { const _0x322178 = _0x709961; if (DataManager['isProxyItem'](_0x5bfd32)) return; VisuMZ[_0x322178(0x3db)]['Game_Item_setObject'][_0x322178(0x376)](this, _0x5bfd32); }, VisuMZ[_0x709961(0x3db)][_0x709961(0x207)] = function () { const _0x4363a8 = _0x709961; this[_0x4363a8(0x398)] = { 'partyArtifactIDs': [], 'troopArtifactIDs': [] }; for (const _0x298cfe of $dataArmors) { if (!_0x298cfe) continue; if (!DataManager['isArtifact'](_0x298cfe)) continue; DataManager['isPartyArtifact'](_0x298cfe) && this[_0x4363a8(0x398)][_0x4363a8(0x470)]['push'](_0x298cfe['id']); if (DataManager[_0x4363a8(0x5c7)](_0x298cfe)) { if (_0x4363a8(0x4ed) === _0x4363a8(0x2e4)) { const _0x4e0b43 = this[_0x4363a8(0x1be)](), _0x2e22f2 = _0x5a2969['ItemsEquipsCore'][_0x4363a8(0x6b0)][_0x4363a8(0x300)][_0x4363a8(0x433)], _0x30bbf2 = _0x4e0b43 === _0x4363a8(0x461) ? _0x4692e9[_0x4363a8(0x41a)] : '\x5cI[%1]%2'['format'](_0x2e22f2, _0x4036c5[_0x4363a8(0x41a)]), _0x2987f8 = this[_0x4363a8(0x3d4)](); if (this[_0x4363a8(0x20c)]() && !_0x2987f8) return; this[_0x4363a8(0x1cb)](_0x30bbf2, _0x4363a8(0x41a), _0x2987f8); } else this[_0x4363a8(0x398)][_0x4363a8(0x677)]['push'](_0x298cfe['id']); } } }, DataManager[_0x709961(0x676)] = function (_0xb70b06) { const _0xf7e5ac = _0x709961; if (!this[_0xf7e5ac(0x3b3)](_0xb70b06)) return ![]; const _0x16ef36 = _0xb70b06[_0xf7e5ac(0x1e9)]; if (!_0x16ef36) return ![]; if (_0x16ef36[_0xf7e5ac(0x1ed)](/<(?:PARTY|ALLY) (?:ARTIFACT|RELIC)>/i)) return !![]; if (_0x16ef36[_0xf7e5ac(0x1ed)](/<(?:STACKABLE|STACK) (?:PARTY|ALLY) (?:ARTIFACT|RELIC)>/i)) return !![]; if (_0x16ef36[_0xf7e5ac(0x1ed)](/<(?:TROOP|FOE) (?:ARTIFACT|RELIC)>/i)) return !![]; if (_0x16ef36[_0xf7e5ac(0x1ed)](/<(?:STACKABLE|STACK) (?:TROOP|FOE) (?:ARTIFACT|RELIC)>/i)) return !![]; return ![]; }, DataManager[_0x709961(0x55c)] = function (_0x344ed9) { const _0x56e759 = _0x709961; if (!this[_0x56e759(0x676)](_0x344ed9)) return ![]; const _0x29f14e = _0x344ed9[_0x56e759(0x1e9)]; if (!_0x29f14e) return ![]; if (_0x29f14e[_0x56e759(0x1ed)](/<(?:STACKABLE|STACK) (?:PARTY|ALLY) (?:ARTIFACT|RELIC)>/i)) return !![]; if (_0x29f14e['match'](/<(?:STACKABLE|STACK) (?:TROOP|FOE) (?:ARTIFACT|RELIC)>/i)) return !![]; return ![]; }, DataManager[_0x709961(0x666)] = function (_0x36ba8a) { const _0xba3d3 = _0x709961; if (!this[_0xba3d3(0x676)](_0x36ba8a)) return ![]; const _0x399165 = _0x36ba8a[_0xba3d3(0x1e9)]; if (!_0x399165) return ![]; if (_0x399165[_0xba3d3(0x1ed)](/<(?:PARTY|ALLY) (?:ARTIFACT|RELIC)>/i)) return !![]; if (_0x399165[_0xba3d3(0x1ed)](/<(?:STACKABLE|STACK) (?:PARTY|ALLY) (?:ARTIFACT|RELIC)>/i)) return !![]; return ![]; }, DataManager[_0x709961(0x5c7)] = function (_0xd942ca) { const _0x3ed2ed = _0x709961; if (!this[_0x3ed2ed(0x676)](_0xd942ca)) return ![]; const _0xa28218 = _0xd942ca['note']; if (!_0xa28218) return ![]; if (_0xa28218[_0x3ed2ed(0x1ed)](/<(?:TROOP|FOE) (?:ARTIFACT|RELIC)>/i)) return !![]; if (_0xa28218['match'](/<(?:STACKABLE|STACK) (?:TROOP|FOE) (?:ARTIFACT|RELIC)>/i)) return !![]; return ![]; }, VisuMZ[_0x709961(0x3db)][_0x709961(0x37c)] = Game_BattlerBase[_0x709961(0x5ef)][_0x709961(0x447)], Game_BattlerBase[_0x709961(0x5ef)][_0x709961(0x447)] = function (_0x4936fd) { const _0x2d0ddd = _0x709961; if (DataManager['isArtifact'](_0x4936fd)) return ![]; if (!DataManager['meetsClassRequirements'](this, _0x4936fd)) return ![]; if (!DataManager['meetsEquipRequirements'](this, _0x4936fd)) return ![]; return VisuMZ[_0x2d0ddd(0x3db)][_0x2d0ddd(0x37c)]['call'](this, _0x4936fd); }, VisuMZ['ItemsEquipsCore']['Game_BattlerBase_param_artifact'] = Game_BattlerBase['prototype'][_0x709961(0x307)], Game_BattlerBase[_0x709961(0x5ef)][_0x709961(0x307)] = function (_0x4b17d0) { const _0x274545 = _0x709961; this[_0x274545(0x263)] = !![]; const _0x5178cc = VisuMZ[_0x274545(0x3db)][_0x274545(0x4e9)][_0x274545(0x376)](this, _0x4b17d0); return this[_0x274545(0x263)] = undefined, _0x5178cc; }, VisuMZ['ItemsEquipsCore']['Game_Actor_artifact'] = Game_Actor[_0x709961(0x5ef)]['traitObjects'], Game_Actor[_0x709961(0x5ef)]['traitObjects'] = function () { const _0x1c7a42 = _0x709961; this[_0x1c7a42(0x1bd)] = !![]; const _0xed4654 = VisuMZ[_0x1c7a42(0x3db)][_0x1c7a42(0x2a6)][_0x1c7a42(0x376)](this); return this[_0x1c7a42(0x1bd)] = undefined, _0xed4654; }, VisuMZ[_0x709961(0x3db)][_0x709961(0x3b1)] = Game_Actor[_0x709961(0x5ef)][_0x709961(0x673)], Game_Actor[_0x709961(0x5ef)][_0x709961(0x673)] = function () { const _0x4afdab = _0x709961, _0x19a0ef = VisuMZ[_0x4afdab(0x3db)]['Game_Actor_equips_artifacts'][_0x4afdab(0x376)](this); if (this[_0x4afdab(0x1bd)] || this[_0x4afdab(0x263)]) { const _0x18b8b0 = _0x19a0ef['concat']($gameParty[_0x4afdab(0x359)]()); return _0x18b8b0; } else return _0x19a0ef; }, VisuMZ[_0x709961(0x3db)][_0x709961(0x38c)] = Game_BattlerBase[_0x709961(0x5ef)][_0x709961(0x6e2)], Game_BattlerBase[_0x709961(0x5ef)]['paramPlus'] = function (_0x89db3e) { const _0x2af691 = _0x709961; let _0x7f192e = VisuMZ[_0x2af691(0x3db)][_0x2af691(0x38c)][_0x2af691(0x376)](this, _0x89db3e); if (this[_0x2af691(0x3f7)] === Game_Enemy) for (const _0x1c8ea3 of $gameParty[_0x2af691(0x428)]()) { if (_0x1c8ea3) _0x7f192e += _0x1c8ea3['params'][_0x89db3e]; } return _0x7f192e; }, VisuMZ[_0x709961(0x3db)][_0x709961(0x46a)] = Game_Enemy['prototype']['traitObjects'], Game_Enemy['prototype'][_0x709961(0x1e1)] = function () { const _0x530dde = _0x709961; let _0x4ff017 = VisuMZ[_0x530dde(0x3db)]['Game_Enemy_traitObjects_artifact'][_0x530dde(0x376)](this); return _0x4ff017['concat']($gameParty[_0x530dde(0x428)]()); }, VisuMZ['ItemsEquipsCore'][_0x709961(0x259)] = Game_Party[_0x709961(0x5ef)]['gainItem'], Game_Party[_0x709961(0x5ef)][_0x709961(0x2a5)] = function (_0x2f2e59, _0x4efafa, _0x580b29) { const _0x237e52 = _0x709961; VisuMZ[_0x237e52(0x3db)]['Game_Party_gainItem_artifact'][_0x237e52(0x376)](this, _0x2f2e59, _0x4efafa, _0x580b29); if (DataManager[_0x237e52(0x676)](_0x2f2e59)) { if ('eSbTk' === _0x237e52(0x62b)) { let _0x4bdd6d = $gameParty[_0x237e52(0x1cc)](); if ($gameParty[_0x237e52(0x30d)]()) _0x4bdd6d = _0x4bdd6d['concat']($gameTroop['members']()); for (const _0x35a228 of _0x4bdd6d) { if (_0x237e52(0x603) === _0x237e52(0x48e)) this[_0x237e52(0x2d5)](); else { if (!_0x35a228) continue; _0x35a228['_cache'] = {}; } } } else _0x2a35b9[_0x237e52(0x4be)] = this[_0x237e52(0x48a)]; } }, Game_Party[_0x709961(0x5ef)][_0x709961(0x359)] = function () { const _0x4c5720 = _0x709961; let _0x19d4ed = []; const _0x55b200 = VisuMZ[_0x4c5720(0x3db)][_0x4c5720(0x398)][_0x4c5720(0x470)]; if (_0x55b200) { if (_0x4c5720(0x33f) !== 'aQaqf') for (const _0x32afd8 of _0x55b200) { const _0x19eeb7 = $dataArmors[_0x32afd8]; if (!_0x19eeb7) continue; if (!this[_0x4c5720(0x646)](_0x19eeb7)) continue; let _0x38797e = 0x1; if (DataManager[_0x4c5720(0x55c)](_0x19eeb7)) _0x38797e = this[_0x4c5720(0x402)](_0x19eeb7); while (_0x38797e--) _0x19d4ed[_0x4c5720(0x4ba)](_0x19eeb7); } else _0x3e86a8['prototype'][_0x4c5720(0x67e)][_0x4c5720(0x376)](this); } return _0x19d4ed; }, Game_Party[_0x709961(0x5ef)][_0x709961(0x428)] = function () { const _0x5dcbd8 = _0x709961; let _0x5eb042 = []; const _0x59a6c4 = VisuMZ[_0x5dcbd8(0x3db)][_0x5dcbd8(0x398)]['troopArtifactIDs']; if (_0x59a6c4) for (const _0x27e4f2 of _0x59a6c4) { if ('SvJxF' === _0x5dcbd8(0x43e)) _0x2d04f8['push'](_0x431299); else { const _0x1bdaad = $dataArmors[_0x27e4f2]; if (!_0x1bdaad) continue; if (!this[_0x5dcbd8(0x646)](_0x1bdaad)) continue; let _0x5a0686 = 0x1; if (DataManager['isStackableArtifact'](_0x1bdaad)) _0x5a0686 = this['numItems'](_0x1bdaad); while (_0x5a0686--) _0x5eb042[_0x5dcbd8(0x4ba)](_0x1bdaad); } } return _0x5eb042; }, Game_Party[_0x709961(0x5ef)][_0x709961(0x694)] = function () { const _0x45ffb9 = _0x709961; return this[_0x45ffb9(0x359)]()[_0x45ffb9(0x33e)](this[_0x45ffb9(0x428)]()); }, VisuMZ[_0x709961(0x3db)][_0x709961(0x647)] = Game_Party[_0x709961(0x5ef)][_0x709961(0x2bf)], Game_Party[_0x709961(0x5ef)][_0x709961(0x2bf)] = function () { const _0x47b901 = _0x709961; VisuMZ[_0x47b901(0x3db)][_0x47b901(0x647)][_0x47b901(0x376)](this), this[_0x47b901(0x415)](); }, Game_Party[_0x709961(0x5ef)]['removeBattleTestArtifacts'] = function () { const _0xcbbe3f = _0x709961, _0x4529bb = $gameParty[_0xcbbe3f(0x2e6)]()[_0xcbbe3f(0x672)](_0x338026 => DataManager[_0xcbbe3f(0x676)](_0x338026)); for (const _0x4936b8 of _0x4529bb) { const _0x5683d4 = this[_0xcbbe3f(0x402)](_0x4936b8); if (_0x5683d4) this[_0xcbbe3f(0x65b)](_0x4936b8, _0x5683d4); } }, DataManager[_0x709961(0x62e)] = function (_0x5757c3, _0x3bbc01) { const _0x229b83 = _0x709961; if (this[_0x229b83(0x2f3)](_0x3bbc01)) return ![]; if (!_0x5757c3) return ![]; if ($gameTemp[_0x229b83(0x61d)]) return !![]; if (BattleManager[_0x229b83(0x208)]()) return !![]; const _0x22606c = this[_0x229b83(0x541)](_0x3bbc01); if (_0x22606c[_0x229b83(0x321)] <= 0x0) return !![]; return _0x22606c[_0x229b83(0x3bb)](_0x5757c3[_0x229b83(0x6d4)]()['id']); }, DataManager[_0x709961(0x541)] = function (_0xc553a3) { const _0x1d8bbd = _0x709961; if (!_0xc553a3) return []; this['_getClassRequirements'] = this['_getClassRequirements'] || {}; const _0x304b64 = _0x1d8bbd(0x47e)['format'](this[_0x1d8bbd(0x67a)](_0xc553a3) ? _0x1d8bbd(0x6d7) : 'ARMOR', _0xc553a3['id']); if (this['_getClassRequirements'][_0x304b64] !== undefined) return this[_0x1d8bbd(0x5da)][_0x304b64]; let _0x456521 = []; const _0x22a86b = _0xc553a3[_0x1d8bbd(0x1e9)] || ''; if (_0x22a86b['match'](/<EQUIP FOR CLASS(?:|ES) ONLY:[ ](.*)>/i)) { if (_0x1d8bbd(0x51a) !== _0x1d8bbd(0x6d2)) { const _0x3e440d = String(RegExp['$1'])['split'](',')[_0x1d8bbd(0x1ac)](_0x42965c => _0x42965c[_0x1d8bbd(0x3c4)]()); for (const _0x577aeb of _0x3e440d) { const _0x447ca1 = /^\d+$/[_0x1d8bbd(0x566)](_0x577aeb); _0x447ca1 ? _0x456521[_0x1d8bbd(0x4ba)](Number(_0x577aeb)) : _0x456521['push'](DataManager[_0x1d8bbd(0x508)](_0x577aeb)); } } else _0x33b9b7[_0x1d8bbd(0x3db)][_0x1d8bbd(0x4e7)][_0x1d8bbd(0x376)](this), this['isUseItemsEquipsCoreUpdatedLayout']() && this[_0x1d8bbd(0x3b5)](), this[_0x1d8bbd(0x6d8)]() && (this[_0x1d8bbd(0x5cd)][_0x1d8bbd(0x1de)](0x0), this[_0x1d8bbd(0x55f)]()); } return this['_getClassRequirements'][_0x304b64] = _0x456521, this[_0x1d8bbd(0x5da)][_0x304b64]; }, DataManager['meetsEquipRequirements'] = function (_0x5b6281, _0x2d30ae) { const _0x239783 = _0x709961; if (this[_0x239783(0x2f3)](_0x2d30ae)) return ![]; if (!_0x5b6281) return ![]; if ($gameTemp[_0x239783(0x61d)]) return !![]; if (BattleManager[_0x239783(0x208)]()) return !![]; const _0x40053d = this[_0x239783(0x4a8)](_0x2d30ae); for (const _0x11001f of _0x40053d) { if (!this['meetsEquipRequirement'](_0x5b6281, _0x11001f)) return ![]; } return !![]; }, DataManager[_0x709961(0x4a8)] = function (_0x34c65d) { const _0xd582d = _0x709961; if (!_0x34c65d) return []; this[_0xd582d(0x43c)] = this[_0xd582d(0x43c)] || {}; const _0x488faa = _0xd582d(0x47e)[_0xd582d(0x60c)](this[_0xd582d(0x67a)](_0x34c65d) ? _0xd582d(0x6d7) : _0xd582d(0x5c2), _0x34c65d['id']); if (this[_0xd582d(0x43c)][_0x488faa] !== undefined) return this[_0xd582d(0x43c)][_0x488faa]; let _0x5dc9ea = []; const _0x26fc2f = _0x34c65d[_0xd582d(0x1e9)] || ''; if (_0x26fc2f[_0xd582d(0x1ed)](/<EQUIP(?:|MENT)[ ]REQUIREMENT(?:|S)>\s*([\s\S]*)\s*<\/EQUIP(?:|MENT)[ ]REQUIREMENT(?:|S)>/i)) { if ('bPMjt' === 'bPMjt') _0x5dc9ea = String(RegExp['$1'])[_0xd582d(0x617)](/[\r\n]+/); else { this[_0xd582d(0x661)] = !![]; const _0x1c8cee = _0x1587c5['ItemsEquipsCore'][_0xd582d(0x510)][_0x451462][_0xd582d(0x376)](this, _0x384acc, _0x17baa0); return this[_0xd582d(0x661)] = ![], _0x1c8cee; } } return this[_0xd582d(0x43c)][_0x488faa] = _0x5dc9ea, this[_0xd582d(0x43c)][_0x488faa]; }, DataManager[_0x709961(0x687)] = function (_0x3a2eb7, _0x539e16) { const _0x49b920 = _0x709961; if (_0x539e16['match'](/(?:LEVEL|LV|LVL)[ ](>|>=|===|<=|<)[ ](\d+)/i)) { if (_0x49b920(0x345) !== _0x49b920(0x4ea)) { const _0x4e19d5 = String(RegExp['$1'])[_0x49b920(0x3c4)](), _0x4df5c1 = Number(RegExp['$2']); switch (_0x4e19d5) { case '>': return _0x3a2eb7[_0x49b920(0x468)] > _0x4df5c1; case '>=': return _0x3a2eb7[_0x49b920(0x468)] >= _0x4df5c1; case _0x49b920(0x408): return _0x3a2eb7[_0x49b920(0x468)] === _0x4df5c1; case '<=': return _0x3a2eb7['level'] <= _0x4df5c1; case '<': return _0x3a2eb7[_0x49b920(0x468)] < _0x4df5c1; }return ![]; } else { const _0x32e235 = _0x480e04['ItemsEquipsCore'][_0x49b920(0x6b0)][_0x49b920(0x281)]['LabelDamageMP']; return _0x32e235[_0x49b920(0x60c)](_0x229ce6['mp']); } } if (_0x539e16[_0x49b920(0x1ed)](/(MAXHP|MAXMP|MHP|MMP)[ ](>|>=|===|<=|<)[ ](\d+)/i)) { const _0x2f58e1 = String(RegExp['$1'])[_0x49b920(0x52f)]()[_0x49b920(0x3c4)](), _0x5c420e = String(RegExp['$2'])[_0x49b920(0x3c4)](), _0x117263 = Number(RegExp['$3']); let _0x2e1dcd = 0x0; if ([_0x49b920(0x23e), _0x49b920(0x21c)][_0x49b920(0x3bb)](_0x2f58e1)) _0x2e1dcd = 0x1; const _0x1ac5d7 = _0x3a2eb7[_0x49b920(0x5b4)][_0x2e1dcd] || 0x0; switch (_0x5c420e) { case '>': return _0x3a2eb7['paramBase'](_0x2e1dcd) + _0x1ac5d7 > _0x117263; case '>=': return _0x3a2eb7['paramBase'](_0x2e1dcd) + _0x1ac5d7 >= _0x117263; case _0x49b920(0x408): return _0x3a2eb7[_0x49b920(0x51d)](_0x2e1dcd) + _0x1ac5d7 === _0x117263; case '<=': return _0x3a2eb7[_0x49b920(0x51d)](_0x2e1dcd) + _0x1ac5d7 <= _0x117263; case '<': return _0x3a2eb7[_0x49b920(0x51d)](_0x2e1dcd) + _0x1ac5d7 < _0x117263; }return ![]; } if (_0x539e16[_0x49b920(0x1ed)](/(ATK|DEF|MAT|MDF|AGI|LUK)[ ](>|>=|===|<=|<)[ ](\d+)/i)) { if (_0x49b920(0x5f4) !== _0x49b920(0x5f4)) _0x29e547 = _0x49b920(0x49c)[_0x49b920(0x60c)](_0x449e1b['id']); else { const _0x4115f7 = String(RegExp['$1'])[_0x49b920(0x52f)]()[_0x49b920(0x3c4)](), _0x540810 = String(RegExp['$2'])[_0x49b920(0x3c4)](), _0x50fe43 = Number(RegExp['$3']), _0x5de0b6 = [_0x49b920(0x6be), _0x49b920(0x1db), _0x49b920(0x419), _0x49b920(0x3e2), 'agi', _0x49b920(0x5ca)]; let _0x25c007 = _0x5de0b6[_0x49b920(0x532)](_0x4115f7) + 0x2; if (_0x25c007 < 0x2) return ![]; const _0x50ca28 = _0x3a2eb7[_0x49b920(0x5b4)][_0x25c007] || 0x0; switch (_0x540810) { case '>': return _0x3a2eb7['paramBase'](_0x25c007) + _0x50ca28 > _0x50fe43; case '>=': return _0x3a2eb7[_0x49b920(0x51d)](_0x25c007) + _0x50ca28 >= _0x50fe43; case '===': return _0x3a2eb7[_0x49b920(0x51d)](_0x25c007) + _0x50ca28 === _0x50fe43; case '<=': return _0x3a2eb7[_0x49b920(0x51d)](_0x25c007) + _0x50ca28 <= _0x50fe43; case '<': return _0x3a2eb7[_0x49b920(0x51d)](_0x25c007) + _0x50ca28 < _0x50fe43; }return ![]; } } if (_0x539e16[_0x49b920(0x1ed)](/LEARNED SKILL:[ ](\d+)/i)) { if (_0x49b920(0x4d1) !== 'gYIex') { const _0x1fc1be = Number(RegExp['$1']); return _0x3a2eb7[_0x49b920(0x3f1)](_0x1fc1be); } else { _0x3a23df['isTriggered']() && this[_0x49b920(0x382)](!![]); if (_0x5a45ec[_0x49b920(0x536)]()) this[_0x49b920(0x3df)](); else _0x2c3754[_0x49b920(0x5ab)]() && this['onTouchCancel'](); } } else { if (_0x539e16[_0x49b920(0x1ed)](/LEARNED SKILL:[ ](.*)/i)) { if (_0x49b920(0x3a6) === 'DSNNR') return this[_0x49b920(0x2f9)](); else { const _0x244ed3 = String(RegExp['$1']), _0x11020c = this['getSkillIdWithName'](_0x244ed3); return _0x3a2eb7[_0x49b920(0x3f1)](_0x11020c); } } } if (_0x539e16[_0x49b920(0x1ed)](/SWITCH:[ ](\d+)/i)) { if (_0x49b920(0x330) !== _0x49b920(0x330)) { const _0x29fe67 = _0x59b3f6[_0x49b920(0x3db)][_0x49b920(0x6b0)][_0x49b920(0x281)][_0x49b920(0x54a)]; return _0x29fe67[_0x49b920(0x60c)](_0x9561f['mp']); } else { const _0xe0ea18 = Number(RegExp['$1']); return $gameSwitches[_0x49b920(0x337)](_0xe0ea18); } } return !![]; }, DataManager['getEtypeIDs'] = function (_0x547440) { const _0x58b1f8 = _0x709961; return this['isArmor'](_0x547440) ? this['getEtypeIDsCache'](_0x547440) : [_0x547440[_0x58b1f8(0x5fe)] || 0x0]; }, DataManager[_0x709961(0x240)] = function (_0x2a2a78) { const _0x2bea02 = _0x709961; this[_0x2bea02(0x28b)] = this[_0x2bea02(0x28b)] || {}; if (this['_cache_etypeIDs'][_0x2a2a78['id']] !== undefined) return this[_0x2bea02(0x28b)][_0x2a2a78['id']]; this[_0x2bea02(0x28b)][_0x2a2a78['id']] = [_0x2a2a78[_0x2bea02(0x5fe)] || 0x0]; const _0x1f73fe = _0x2a2a78[_0x2bea02(0x1e9)] || ''; if (_0x1f73fe[_0x2bea02(0x1ed)](/<ADDED ETYPE(?:|S):[ ](.*)>/i)) { const _0x32f190 = String(RegExp['$1'])[_0x2bea02(0x617)](',')[_0x2bea02(0x1ac)](_0xa1b9d6 => _0xa1b9d6[_0x2bea02(0x3c4)]()); for (const _0x447b99 of _0x32f190) { if (_0x2bea02(0x1ba) === 'yzvjn') { const _0x49fb12 = /^\d+$/[_0x2bea02(0x566)](_0x447b99); let _0x2c1304 = 0x0; if (_0x49fb12) { if (_0x2bea02(0x511) === _0x2bea02(0x511)) _0x2c1304 = Number(_0x447b99); else return this[_0x2bea02(0x289)]() ? this[_0x2bea02(0x3ce)]() : _0x6a14c1[_0x2bea02(0x3db)][_0x2bea02(0x6b0)][_0x2bea02(0x309)][_0x2bea02(0x396)][_0x2bea02(0x376)](this); } else { if ('XeIWa' !== _0x2bea02(0x4f3)) _0x2c1304 = this['getEtypeIdWithName'](_0x447b99); else return _0x758650['ItemsEquipsCore'][_0x2bea02(0x1b5)][_0x2bea02(0x376)](this); } _0x2c1304 > 0x1 && this['_cache_etypeIDs'][_0x2a2a78['id']][_0x2bea02(0x4ba)](_0x2c1304); } else return this[_0x2bea02(0x42e)](); } } return this[_0x2bea02(0x28b)][_0x2a2a78['id']]; }, Game_BattlerBase[_0x709961(0x5ef)]['canEquipArmor'] = function (_0xaddbbf) { const _0x144b6f = _0x709961; return this[_0x144b6f(0x4de)](_0xaddbbf[_0x144b6f(0x3e1)]) && !this[_0x144b6f(0x576)](_0xaddbbf[_0x144b6f(0x5fe)]) && DataManager['getEtypeIDs'](_0xaddbbf)[_0x144b6f(0x328)](_0x566015 => !this[_0x144b6f(0x576)](_0x566015)); }, DataManager[_0x709961(0x45e)] = function (_0x876f32) { const _0xc080bd = _0x709961; if (!this['isWeapon'](_0x876f32) && !this[_0xc080bd(0x3b3)](_0x876f32)) return ![]; if (Imported[_0xc080bd(0x26b)] && this[_0xc080bd(0x67a)](_0x876f32)) { if (_0xc080bd(0x5a1) === _0xc080bd(0x36a)) { if (this[_0xc080bd(0x289)]()) return this[_0xc080bd(0x61a)](); else { const _0x2a34da = _0x2c0686['ItemsEquipsCore'][_0xc080bd(0x1e5)][_0xc080bd(0x376)](this); return this[_0xc080bd(0x34f)]() && this[_0xc080bd(0x260)]() && (_0x2a34da['width'] -= this[_0xc080bd(0x62f)]()), _0x2a34da; } } else return ![]; } if (!_0x876f32[_0xc080bd(0x1e9)]) return ![]; return _0x876f32[_0xc080bd(0x1e9)]['match'](/<CURSED>/i); }, DataManager[_0x709961(0x57a)] = function (_0x382ff6) { const _0x291e01 = _0x709961; if (!_0x382ff6) return _0x382ff6; if (!this[_0x291e01(0x67a)](_0x382ff6) && !this[_0x291e01(0x3b3)](_0x382ff6)) return _0x382ff6; if (_0x382ff6[_0x291e01(0x1e9)][_0x291e01(0x1ed)](/<PURIFY TRANSFORM:[ ](.*)>/i)) { const _0x42c257 = String(RegExp['$1'])[_0x291e01(0x3c4)](), _0x159f09 = /^\d+$/[_0x291e01(0x566)](_0x42c257); if (_0x159f09) { if (this['isWeapon'](_0x382ff6)) return $dataWeapons[Number(_0x42c257)]; if (this[_0x291e01(0x3b3)](_0x382ff6)) return $dataArmors[Number(_0x42c257)]; } else { if (_0x291e01(0x455) === _0x291e01(0x329)) _0x2df2b6['log'](_0x291e01(0x6cd)[_0x291e01(0x60c)](this[_0x291e01(0x3c2)]['name'])), _0x47cc2b[_0x291e01(0x4df)](_0x180114); else { if (this[_0x291e01(0x67a)](_0x382ff6)) return $dataWeapons[this['getWeaponIdWithName'](_0x42c257)]; if (this[_0x291e01(0x3b3)](_0x382ff6)) return $dataArmors[this[_0x291e01(0x3c5)](_0x42c257)]; } } } return _0x382ff6; }, Game_Party[_0x709961(0x5ef)][_0x709961(0x550)] = function () { const _0x2c857c = _0x709961, _0xb3239e = this['allMembers'](); for (const _0x2fa26c of _0xb3239e) { if ('AGSpj' === 'EfweK') _0x257b30 = _0x2c857c(0x598); else { if (!_0x2fa26c) continue; _0x2fa26c[_0x2c857c(0x550)](); } } }, Game_Actor[_0x709961(0x5ef)]['purifyCursedEquips'] = function () { const _0x3c2d4c = _0x709961, _0x3ba566 = this[_0x3c2d4c(0x252)]()[_0x3c2d4c(0x321)]; for (let _0x12cd45 = 0x0; _0x12cd45 < _0x3ba566; _0x12cd45++) { const _0x2469ca = this[_0x3c2d4c(0x5fd)][_0x12cd45]; if (!_0x2469ca) continue; const _0x2fddc5 = _0x2469ca[_0x3c2d4c(0x2c6)](); if (!DataManager['isCursedItem'](_0x2fddc5)) continue; let _0x5dddee = DataManager[_0x3c2d4c(0x57a)](_0x2fddc5); this['isPurifyItemSwapOk'](_0x2fddc5, _0x5dddee) ? (this[_0x3c2d4c(0x5fd)][_0x12cd45]['setObject'](_0x5dddee), this[_0x3c2d4c(0x349)]()) : this[_0x3c2d4c(0x274)](_0x12cd45, null); } }, Game_Actor[_0x709961(0x5ef)][_0x709961(0x257)] = function (_0x1dbc0f, _0x5a9240) { const _0x56ab9a = _0x709961; if (_0x1dbc0f === _0x5a9240) return ![]; const _0x3189d0 = DataManager[_0x56ab9a(0x323)](_0x5a9240); if (!_0x3189d0[_0x56ab9a(0x3bb)](_0x1dbc0f[_0x56ab9a(0x5fe)])) return ![]; if (DataManager['isWeapon'](_0x5a9240)) { if (_0x56ab9a(0x393) !== _0x56ab9a(0x393)) this[_0x56ab9a(0x649)](_0x3fe361[_0x56ab9a(0x5c1)]('up')); else return this[_0x56ab9a(0x237)](_0x5a9240[_0x56ab9a(0x4f2)]); } else { if (DataManager[_0x56ab9a(0x3b3)](_0x5a9240)) { if (_0x56ab9a(0x472) !== _0x56ab9a(0x472)) { const _0x4e912f = _0x56ab9a(0x29c); if (this['_customItemInfo'][_0x4e912f]) return this[_0x56ab9a(0x3b8)][_0x4e912f]; const _0x25977e = _0x56ab9a(0x6c6); return _0x25977e[_0x56ab9a(0x60c)](this['_item'][_0x56ab9a(0x643)]); } else return this[_0x56ab9a(0x4de)](_0x5a9240['atypeId']); } } return ![]; }, TextManager[_0x709961(0x5e9)] = { 'helpDesc': { 'equip': VisuMZ[_0x709961(0x3db)][_0x709961(0x6b0)][_0x709961(0x6b4)][_0x709961(0x5a5)] ?? _0x709961(0x324), 'optimize': VisuMZ[_0x709961(0x3db)][_0x709961(0x6b0)][_0x709961(0x6b4)][_0x709961(0x219)] ?? _0x709961(0x44b), 'clear': VisuMZ[_0x709961(0x3db)][_0x709961(0x6b0)][_0x709961(0x6b4)][_0x709961(0x5a0)] ?? _0x709961(0x2b9) } }, ColorManager[_0x709961(0x2c5)] = function (_0x20ec24) { const _0x2ba884 = _0x709961; if (!_0x20ec24) return this[_0x2ba884(0x5ee)](); else { if (_0x20ec24[_0x2ba884(0x1e9)]['match'](/<COLOR:[ ](\d+)>/i)) return this['textColor'](Number(RegExp['$1'])['clamp'](0x0, 0x1f)); else return _0x20ec24[_0x2ba884(0x1e9)][_0x2ba884(0x1ed)](/<COLOR:[ ]#(.*)>/i) ? '#' + String(RegExp['$1']) : this[_0x2ba884(0x5ee)](); } }, ColorManager['getColor'] = function (_0x37c012) { const _0x3234df = _0x709961; return _0x37c012 = String(_0x37c012), _0x37c012[_0x3234df(0x1ed)](/#(.*)/i) ? _0x3234df(0x19f)[_0x3234df(0x60c)](String(RegExp['$1'])) : this['textColor'](Number(_0x37c012)); }, SceneManager[_0x709961(0x62a)] = function () { const _0x5f2c1f = _0x709961; return this[_0x5f2c1f(0x6c1)] && this['_scene'][_0x5f2c1f(0x3f7)] === Scene_Shop; }, Game_Temp[_0x709961(0x5ef)][_0x709961(0x243)] = function () { const _0xeec563 = _0x709961; if (this[_0xeec563(0x262)]) return ![]; return VisuMZ[_0xeec563(0x3db)][_0xeec563(0x6b0)]['New'][_0xeec563(0x54b)]; }, VisuMZ[_0x709961(0x26e)] = VisuMZ['ItemsEquipsCore'][_0x709961(0x6b0)][_0x709961(0x281)][_0x709961(0x3b0)], VisuMZ[_0x709961(0x3db)][_0x709961(0x225)] = Game_BattlerBase['prototype'][_0x709961(0x307)], Game_BattlerBase[_0x709961(0x5ef)][_0x709961(0x307)] = function (_0x3c607d) { const _0x2d93ad = _0x709961; return this['_shopStatusMenuMode'] ? this['_shopStatusMenuAlly'] ? VisuMZ[_0x2d93ad(0x26e)] : 0x1 : VisuMZ[_0x2d93ad(0x3db)]['Game_BattlerBase_param'][_0x2d93ad(0x376)](this, _0x3c607d); }, VisuMZ['ItemsEquipsCore'][_0x709961(0x490)] = Game_BattlerBase['prototype']['meetsItemConditions'], Game_BattlerBase[_0x709961(0x5ef)][_0x709961(0x5a6)] = function (_0x1fc3bc) { const _0x53089c = _0x709961; if (!_0x1fc3bc) return ![]; if (!VisuMZ[_0x53089c(0x3db)][_0x53089c(0x490)][_0x53089c(0x376)](this, _0x1fc3bc)) return ![]; if (!this[_0x53089c(0x60d)](_0x1fc3bc)) return ![]; if (!this[_0x53089c(0x3e9)](_0x1fc3bc)) return ![]; return !![]; }, Game_BattlerBase[_0x709961(0x5ef)][_0x709961(0x60d)] = function (_0x338c07) { const _0x438c7d = _0x709961; if (!this[_0x438c7d(0x47f)](_0x338c07)) return ![]; return !![]; }, Game_BattlerBase[_0x709961(0x5ef)][_0x709961(0x47f)] = function (_0xb2ccd3) { const _0x2c6884 = _0x709961, _0xbe7548 = _0xb2ccd3[_0x2c6884(0x1e9)]; if (_0xbe7548[_0x2c6884(0x1ed)](/<ENABLE[ ](?:SW|SWITCH|SWITCHES):[ ]*(\d+(?:\s*,\s*\d+)*)>/i)) { if (_0x2c6884(0x693) !== _0x2c6884(0x1ab)) { const _0x5d1686 = JSON['parse']('[' + RegExp['$1'][_0x2c6884(0x1ed)](/\d+/g) + ']'); for (const _0x5509a5 of _0x5d1686) { if (!$gameSwitches[_0x2c6884(0x337)](_0x5509a5)) return ![]; } return !![]; } else { if (!this[_0x2c6884(0x342)]) return !![]; return this[_0x2c6884(0x342)][_0x2c6884(0x385)]() !== _0x5a0c0d[_0x2c6884(0x385)](); } } if (_0xbe7548[_0x2c6884(0x1ed)](/<ENABLE ALL[ ](?:SW|SWITCH|SWITCHES):[ ]*(\d+(?:\s*,\s*\d+)*)>/i)) { if ('Fxsjx' === 'kBsQd') { const _0x2d83b3 = this[_0x2c6884(0x4d9)](_0x3c8a48); if (_0x2d83b3 < 0x0) return; const _0x88181d = _0x47cd9e === 0x1 ? _0x18a51a[_0xb6aab0] : _0x37a1e0[_0x51365f]; this['changeEquip'](_0x2d83b3, _0x88181d); } else { const _0x29ae08 = JSON[_0x2c6884(0x692)]('[' + RegExp['$1']['match'](/\d+/g) + ']'); for (const _0x5583f5 of _0x29ae08) { if ('lSjkq' !== _0x2c6884(0x4c4)) _0x2c0998 = _0x117b90(_0x3ebd03['$1']), _0x10fa90 = _0xe90ad3(_0x9369b9['$2']); else { if (!$gameSwitches[_0x2c6884(0x337)](_0x5583f5)) return ![]; } } return !![]; } } if (_0xbe7548[_0x2c6884(0x1ed)](/<ENABLE ANY[ ](?:SW|SWITCH|SWITCHES):[ ]*(\d+(?:\s*,\s*\d+)*)>/i)) { const _0x54d4ac = JSON[_0x2c6884(0x692)]('[' + RegExp['$1'][_0x2c6884(0x1ed)](/\d+/g) + ']'); for (const _0x55e6ad of _0x54d4ac) { if ($gameSwitches['value'](_0x55e6ad)) return !![]; } return ![]; } if (_0xbe7548[_0x2c6884(0x1ed)](/<DISABLE[ ](?:SW|SWITCH|SWITCHES):[ ]*(\d+(?:\s*,\s*\d+)*)>/i)) { const _0xae3d26 = JSON['parse']('[' + RegExp['$1'][_0x2c6884(0x1ed)](/\d+/g) + ']'); for (const _0x361d7e of _0xae3d26) { if ('kcIsm' !== _0x2c6884(0x595)) { if (!$gameSwitches[_0x2c6884(0x337)](_0x361d7e)) return !![]; } else { const _0x555043 = _0xbd6322[_0x2c6884(0x3db)][_0x2c6884(0x6b0)][_0x2c6884(0x36c)], _0x371b20 = _0x555043[_0x2c6884(0x495)]; if (_0x371b20 === '') return; const _0x2c2a8d = _0x8ea2d8[_0x2c6884(0x357)], _0x457e40 = _0x39a857[_0x2c6884(0x2ea)]; this[_0x2c6884(0x41c)]['fontFace'] = _0x555043[_0x2c6884(0x5d5)] || _0x3c54d1[_0x2c6884(0x63d)](), this[_0x2c6884(0x41c)][_0x2c6884(0x637)] = this[_0x2c6884(0x696)](), this[_0x2c6884(0x41c)][_0x2c6884(0x416)] = _0x555043[_0x2c6884(0x229)], this[_0x2c6884(0x41c)]['drawText'](_0x371b20, 0x0, _0x457e40 / 0x2, _0x2c2a8d, _0x457e40 / 0x2, 'center'); } } return ![]; } if (_0xbe7548[_0x2c6884(0x1ed)](/<DISABLE ALL[ ](?:SW|SWITCH|SWITCHES):[ ]*(\d+(?:\s*,\s*\d+)*)>/i)) { const _0x474b3f = JSON[_0x2c6884(0x692)]('[' + RegExp['$1'][_0x2c6884(0x1ed)](/\d+/g) + ']'); for (const _0x7eca66 of _0x474b3f) { if (!$gameSwitches['value'](_0x7eca66)) return !![]; } return ![]; } if (_0xbe7548[_0x2c6884(0x1ed)](/<DISABLE ANY[ ](?:SW|SWITCH|SWITCHES):[ ]*(\d+(?:\s*,\s*\d+)*)>/i)) { const _0x94f5ac = JSON[_0x2c6884(0x692)]('[' + RegExp['$1'][_0x2c6884(0x1ed)](/\d+/g) + ']'); for (const _0x3893d7 of _0x94f5ac) { if (_0x2c6884(0x204) !== _0x2c6884(0x204)) { if (_0x232805[_0x2c6884(0x327)]) return _0x340cf6[_0x2c6884(0x3db)][_0x2c6884(0x295)][_0x2c6884(0x376)](this); return _0xe39578['getProxyItem'](_0x5debdb['ItemsEquipsCore'][_0x2c6884(0x295)]['call'](this)); } else { if ($gameSwitches[_0x2c6884(0x337)](_0x3893d7)) return ![]; } } return !![]; } return !![]; }, Game_BattlerBase[_0x709961(0x5ef)]['meetsItemConditionsJS'] = function (_0x378a50) { const _0x2fb6be = _0x709961, _0x54defa = _0x378a50[_0x2fb6be(0x1e9)], _0x532a94 = VisuMZ[_0x2fb6be(0x3db)][_0x2fb6be(0x52b)]; if (_0x532a94[_0x378a50['id']]) { if (_0x2fb6be(0x368) !== 'NjiAu') return _0x532a94[_0x378a50['id']][_0x2fb6be(0x376)](this, _0x378a50); else this[_0x2fb6be(0x2c2)](_0x3056ce, _0x4e1f57, _0x1ff14a, _0x89274f, !![]), this[_0x2fb6be(0x2c2)](_0x39f5e4, _0x4dc95f, _0xcb8787, _0x4a16fc, ![], _0x2fb6be(0x4b9)), this['drawItemDarkRect'](_0x1bd76b, _0x50e864, _0x1e9802), this[_0x2fb6be(0x4e3)](); } else { if (_0x2fb6be(0x4a2) === _0x2fb6be(0x4a2)) return !![]; else { const _0x29e5bc = _0xb8699d(_0x189500['$1']) || 0x1; if (_0x8f4b89 >= _0x29e5bc) return !![]; } } }, Game_Actor[_0x709961(0x5ef)][_0x709961(0x6a0)] = function (_0x4167b7) { const _0x489b9e = _0x709961; _0x4167b7 = this[_0x489b9e(0x3b7)](_0x4167b7); const _0x2f2ffb = this['equipSlots'](); this['_equips'] = []; for (let _0x4fe78f = 0x0; _0x4fe78f < _0x2f2ffb[_0x489b9e(0x321)]; _0x4fe78f++) { this['_equips'][_0x4fe78f] = new Game_Item(); } for (let _0x5382cb = 0x0; _0x5382cb < _0x2f2ffb['length']; _0x5382cb++) { const _0x2b9e27 = _0x2f2ffb[_0x5382cb], _0x1b6ee0 = this[_0x489b9e(0x563)](_0x4167b7, _0x2b9e27); if (this[_0x489b9e(0x447)](_0x1b6ee0)) this[_0x489b9e(0x5fd)][_0x5382cb][_0x489b9e(0x299)](_0x1b6ee0); } this['releaseUnequippableItems'](!![]), this[_0x489b9e(0x349)](); }, Game_Actor[_0x709961(0x5ef)]['convertInitEquipsToItems'] = function (_0x2828f0) { const _0x286b56 = _0x709961, _0x3a2b2e = []; for (let _0x3c277a = 0x0; _0x3c277a < _0x2828f0[_0x286b56(0x321)]; _0x3c277a++) { const _0x27159d = _0x2828f0[_0x3c277a]; if (_0x27159d <= 0x0) continue; const _0x2f1f1b = $dataSystem['equipTypes'][_0x3c277a + 0x1]; if (_0x2f1f1b === $dataSystem['equipTypes'][0x1] || _0x3c277a === 0x1 && this[_0x286b56(0x4fc)]()) _0x3a2b2e[_0x286b56(0x4ba)]($dataWeapons[_0x27159d]); else { if (BattleManager['isBattleTest']()) { const _0x4400a4 = $dataArmors[_0x27159d]; _0x4400a4 && _0x4400a4[_0x286b56(0x5fe)] === _0x3c277a + 0x1 && _0x3a2b2e[_0x286b56(0x4ba)](_0x4400a4); } else { const _0x160784 = $dataArmors[_0x27159d]; if (_0x160784 && _0x160784[_0x286b56(0x5fe)] === _0x3c277a + 0x1) { if (_0x286b56(0x6a6) === _0x286b56(0x6a6)) _0x3a2b2e[_0x286b56(0x4ba)](_0x160784); else { const _0x42cc05 = _0xaa178d(_0x210fde['$1'])[_0x286b56(0x617)](',')[_0x286b56(0x1ac)](_0x456282 => _0x456282['trim']()); for (const _0x2543b8 of _0x42cc05) { const _0x47af2c = /^\d+$/['test'](_0x2543b8); _0x47af2c ? _0x5c27c1[_0x286b56(0x4ba)](_0x296c3f(_0x2543b8)) : _0x5c95d2[_0x286b56(0x4ba)](_0x5ad780[_0x286b56(0x508)](_0x2543b8)); } } } } } } return _0x3a2b2e; }, Game_Actor[_0x709961(0x5ef)]['getMatchingInitEquip'] = function (_0x3367e9, _0x4c46bb) { const _0x2f17cb = _0x709961; for (const _0x2cd9b5 of _0x3367e9) { if (!_0x2cd9b5) continue; if (_0x2cd9b5[_0x2f17cb(0x5fe)] === _0x4c46bb) return _0x3367e9[_0x2f17cb(0x43d)](_0x3367e9[_0x2f17cb(0x532)](_0x2cd9b5), 0x1), _0x2cd9b5; } return null; }, Game_Actor['prototype'][_0x709961(0x252)] = function () { const _0x51e90c = _0x709961, _0x95d10 = VisuMZ[_0x51e90c(0x3db)][_0x51e90c(0x40e)](this[_0x51e90c(0x616)] || this[_0x51e90c(0x6d4)]()[_0x51e90c(0x252)]); if (_0x95d10[_0x51e90c(0x321)] >= 0x2 && this[_0x51e90c(0x4fc)]()) _0x95d10[0x1] = 0x1; return _0x95d10; }, Game_Actor[_0x709961(0x5ef)][_0x709961(0x520)] = function (_0x479292) { const _0x23f4fc = _0x709961; _0x479292['remove'](0x0), _0x479292[_0x23f4fc(0x34e)](-0x1), this[_0x23f4fc(0x616)] = _0x479292, this['refresh'](), this[_0x23f4fc(0x5a4)](); }, Game_Actor[_0x709961(0x5ef)][_0x709961(0x334)] = function () { const _0x540ed0 = _0x709961; this['_forcedSlots'] = undefined, this[_0x540ed0(0x349)](), this[_0x540ed0(0x5a4)](); }, Game_Actor[_0x709961(0x5ef)]['updateChangedSlots'] = function () { const _0x4f0995 = _0x709961; let _0x17d11f = this[_0x4f0995(0x252)]()[_0x4f0995(0x321)]; while (this['_equips']['length'] > _0x17d11f) { if (_0x4f0995(0x1e2) === _0x4f0995(0x1e2)) { const _0x1fabb8 = this['_equips'][this[_0x4f0995(0x5fd)]['length'] - 0x1]; _0x1fabb8 && _0x1fabb8[_0x4f0995(0x2c6)]() && $gameParty[_0x4f0995(0x2a5)](_0x1fabb8[_0x4f0995(0x2c6)](), 0x1), this[_0x4f0995(0x5fd)][_0x4f0995(0x21b)](); } else return this[_0x4f0995(0x1a6)] && this[_0x4f0995(0x1a6)][_0x4f0995(0x6d8)](); } while (_0x17d11f > this['_equips'][_0x4f0995(0x321)]) { this[_0x4f0995(0x5fd)][_0x4f0995(0x4ba)](new Game_Item()); } }, Game_Actor[_0x709961(0x5ef)][_0x709961(0x366)] = function () { const _0x421b29 = _0x709961, _0x177aa0 = this[_0x421b29(0x252)](); for (let _0x365743 = 0x0; _0x365743 < _0x177aa0[_0x421b29(0x321)]; _0x365743++) { if (_0x421b29(0x2e5) === _0x421b29(0x2e5)) { if (!this[_0x421b29(0x5fd)][_0x365743]) this['_equips'][_0x365743] = new Game_Item(); } else _0x3adb1b[_0x421b29(0x5ef)][_0x421b29(0x522)][_0x421b29(0x376)](this, _0x4c7806, _0x306276, _0x2d1a19, _0x12695a); } this['releaseUnequippableItems'](![]), this[_0x421b29(0x349)](); }, VisuMZ[_0x709961(0x3db)][_0x709961(0x26f)] = Game_Actor['prototype'][_0x709961(0x274)], Game_Actor[_0x709961(0x5ef)]['changeEquip'] = function (_0x1471aa, _0x5070de) { const _0x5323fe = _0x709961; if (!this[_0x5323fe(0x342)]) { const _0x54ddf6 = JsonEx[_0x5323fe(0x340)](this); _0x54ddf6[_0x5323fe(0x342)] = !![], this[_0x5323fe(0x1d5)](_0x1471aa, _0x5070de), this[_0x5323fe(0x267)](_0x54ddf6); } else this[_0x5323fe(0x1d5)](_0x1471aa, _0x5070de); }, Game_Actor[_0x709961(0x5ef)]['changeEquipBase'] = function (_0x2780aa, _0x34cfd2) { const _0x587c57 = _0x709961; if (!this[_0x587c57(0x3af)](_0x34cfd2, this[_0x587c57(0x673)]()[_0x2780aa])) return; if (_0x34cfd2) { if (_0x587c57(0x622) === _0x587c57(0x622)) { const _0x43e5ad = DataManager[_0x587c57(0x323)](_0x34cfd2); if (!_0x43e5ad['includes'](this['equipSlots']()[_0x2780aa])) return; } else _0x1aeb1a[_0x587c57(0x3db)][_0x587c57(0x1f6)]['call'](this), this[_0x587c57(0x6d8)]() && this[_0x587c57(0x38e)](); } this['_equips'][_0x2780aa]['setObject'](_0x34cfd2); if (VisuMZ[_0x587c57(0x3db)][_0x587c57(0x546)](_0x34cfd2)) { const _0xa823c2 = VisuMZ['ItemsEquipsCore'][_0x587c57(0x6b0)]['EquipScene']['CursedTextPopup'] || '', _0x4fa777 = this[_0x587c57(0x5a7)](), _0x13c641 = _0x587c57(0x3d2)[_0x587c57(0x60c)](_0x34cfd2[_0x587c57(0x4a7)]), _0x283bbb = _0x34cfd2[_0x587c57(0x5a7)] || ''; let _0x1e34fd = _0xa823c2[_0x587c57(0x60c)](_0x4fa777, _0x13c641, _0x283bbb); if (_0x1e34fd[_0x587c57(0x321)] > 0x0) $textPopup(_0x1e34fd); } this[_0x587c57(0x349)](); }, VisuMZ[_0x709961(0x3db)]['CheckCursedItemMsg'] = function (_0x173f4d) { const _0x41b064 = _0x709961; if (!_0x173f4d) return ![]; if (!Imported[_0x41b064(0x615)]) return ![]; if (!$textPopup) return; return DataManager['isCursedItem'](_0x173f4d); }, VisuMZ[_0x709961(0x3db)][_0x709961(0x35d)] = Game_Actor[_0x709961(0x5ef)]['forceChangeEquip'], Game_Actor['prototype']['forceChangeEquip'] = function (_0x11d86b, _0x1c8493) { const _0x1ba794 = _0x709961; if (!this[_0x1ba794(0x342)]) { if ('NldCE' !== _0x1ba794(0x3a1)) this[_0x1ba794(0x25a)](_0x44fcca, _0x2271dc['x'], _0x3d7677['y'] + 0x2); else { const _0x1e2a9c = JsonEx['makeDeepCopy'](this); _0x1e2a9c[_0x1ba794(0x342)] = !![], VisuMZ[_0x1ba794(0x3db)][_0x1ba794(0x35d)][_0x1ba794(0x376)](this, _0x11d86b, _0x1c8493), this['equipAdjustHpMp'](_0x1e2a9c); } } else VisuMZ[_0x1ba794(0x3db)][_0x1ba794(0x35d)]['call'](this, _0x11d86b, _0x1c8493); }, VisuMZ[_0x709961(0x3db)]['Game_Actor_discardEquip'] = Game_Actor[_0x709961(0x5ef)][_0x709961(0x36b)], Game_Actor[_0x709961(0x5ef)][_0x709961(0x36b)] = function (_0x2cd137) { const _0x16e972 = _0x709961; if (!this[_0x16e972(0x342)]) { if ('LsCKQ' !== _0x16e972(0x32f)) { const _0x3c3064 = JsonEx[_0x16e972(0x340)](this); _0x3c3064[_0x16e972(0x342)] = !![], VisuMZ[_0x16e972(0x3db)][_0x16e972(0x6ae)][_0x16e972(0x376)](this, _0x2cd137), this[_0x16e972(0x267)](_0x3c3064); } else { const _0x7964dd = _0x5c1f05 ? _0x3772bc(_0xbb7d1c) : _0x5a1099['getItemIdWithName'](_0x4b1985); return _0x5b40f0[_0x7964dd] || _0x2a633b; } } else VisuMZ[_0x16e972(0x3db)][_0x16e972(0x6ae)][_0x16e972(0x376)](this, _0x2cd137); }, Game_Actor[_0x709961(0x5ef)][_0x709961(0x55b)] = function (_0xdb0417) { const _0x716e0c = _0x709961; if (this['_bypassReleaseUnequippableItemsItemsEquipsCore']) return; let _0x10c9eb = 0x0; for (; ;) { _0x10c9eb++; if (_0x10c9eb > 0x3) break; const _0x4948f1 = this[_0x716e0c(0x252)](), _0xa66530 = this[_0x716e0c(0x673)](), _0x2d25a4 = _0xa66530[_0x716e0c(0x321)]; let _0x4d6584 = ![]; for (let _0x1f8320 = 0x0; _0x1f8320 < _0x2d25a4; _0x1f8320++) { if (_0x716e0c(0x37f) !== _0x716e0c(0x37f)) _0x36d7e2[_0x716e0c(0x5ef)][_0x716e0c(0x2ef)]['call'](this); else { const _0x134909 = _0xa66530[_0x1f8320]; if (!_0x134909) continue; const _0x4bda2e = DataManager['getEtypeIDs'](_0x134909); if (!this[_0x716e0c(0x447)](_0x134909) || !_0x4bda2e['includes'](_0x4948f1[_0x1f8320])) { !_0xdb0417 && this[_0x716e0c(0x3af)](null, _0x134909); if (!this[_0x716e0c(0x342)]) { if (_0x716e0c(0x399) === 'FwiMr') this[_0x716e0c(0x5fd)][_0x1c8604][_0x716e0c(0x299)](null); else { const _0x24c566 = JsonEx[_0x716e0c(0x340)](this); _0x24c566['_tempActor'] = !![], this['_equips'][_0x1f8320][_0x716e0c(0x299)](null), this[_0x716e0c(0x2d1)] = !![], this[_0x716e0c(0x267)](_0x24c566), this[_0x716e0c(0x2d1)] = undefined; } } else { if (this[_0x716e0c(0x5fd)][_0x1f8320]) { if (_0x716e0c(0x261) === _0x716e0c(0x261)) this[_0x716e0c(0x5fd)][_0x1f8320][_0x716e0c(0x299)](null); else { const _0x5220af = _0x716e0c(0x4fd)['format'](_0x1f8633); _0x408ad4[_0x716e0c(0x3db)]['RegExp'][_0x716e0c(0x679)][_0x716e0c(0x4ba)](new _0x1e9e2e(_0x5220af, 'i')); const _0x26080e = _0x716e0c(0x564)['format'](_0x5a415d); _0x7024c[_0x716e0c(0x3db)][_0x716e0c(0x34a)][_0x716e0c(0x41e)][_0x716e0c(0x4ba)](new _0x5e53fa(_0x26080e, 'g')); } } else continue; } _0x4d6584 = !![]; } } } if (!_0x4d6584) { if ('yfmKg' === _0x716e0c(0x477)) break; else { if (_0x8d610b !== _0x43226b) return; if (_0x7320eb[_0x716e0c(0x1e9)][_0x716e0c(0x1ed)](/<JS ITEM ENABLE>\s*([\s\S]*)\s*<\/JS ITEM ENABLE>/i)) { const _0x1ae7f2 = _0x48abbd(_0x1c7e43['$1']), _0x26dfa5 = _0x716e0c(0x64d)[_0x716e0c(0x60c)](_0x1ae7f2); _0x58756f[_0x716e0c(0x3db)][_0x716e0c(0x52b)][_0x26bc6e['id']] = new _0x1fb3a0('item', _0x26dfa5); } } } } }, Game_Actor['prototype'][_0x709961(0x267)] = function (_0x3f9e1a) { const _0x41a1d4 = _0x709961; if (this[_0x41a1d4(0x342)]) return; if (!VisuMZ[_0x41a1d4(0x3db)]['Settings'][_0x41a1d4(0x6b4)]['EquipAdjustHpMp']) return; const _0x4dadbd = Math['round'](_0x3f9e1a[_0x41a1d4(0x4a4)]() * this['mhp']), _0x388026 = Math[_0x41a1d4(0x284)](_0x3f9e1a[_0x41a1d4(0x2cf)]() * this[_0x41a1d4(0x21c)]); if (this['hp'] > 0x0) this[_0x41a1d4(0x6e0)](_0x4dadbd); if (this['mp'] > 0x0) this['setMp'](_0x388026); }, Game_Actor[_0x709961(0x5ef)][_0x709961(0x1f2)] = function () { const _0x2ac4c4 = _0x709961, _0x1d5ee1 = this[_0x2ac4c4(0x252)]()['length']; for (let _0x5bd577 = 0x0; _0x5bd577 < _0x1d5ee1; _0x5bd577++) { if (this['isClearEquipOk'](_0x5bd577)) this[_0x2ac4c4(0x274)](_0x5bd577, null); } }, Game_Actor['prototype'][_0x709961(0x202)] = function (_0x1ec67d) { const _0x48fed = _0x709961; if (this[_0x48fed(0x290)]()[_0x48fed(0x3bb)](this[_0x48fed(0x252)]()[_0x1ec67d])) return ![]; else { if ('HZcms' !== 'GZlAc') return this['isEquipChangeOk'](_0x1ec67d); else { this[_0x48fed(0x30a)][_0x48fed(0x556)](); if (!this[_0x48fed(0x3bc)]) return; if (this[_0x48fed(0x30e)]()) { const _0x3a74df = _0x4bab0c[_0x48fed(0x401)](this[_0x48fed(0x3bc)][_0x48fed(0x1f1)]()); _0x3a74df[_0x48fed(0x535)](this[_0x48fed(0x273)][_0x48fed(0x4b0)](this)); } else this[_0x48fed(0x377)](); } } }, Game_Actor['prototype']['nonRemovableEtypes'] = function () { const _0xf73111 = _0x709961; return VisuMZ[_0xf73111(0x3db)][_0xf73111(0x6b0)][_0xf73111(0x6b4)]['NonRemoveETypes']; }, Game_Actor[_0x709961(0x5ef)][_0x709961(0x255)] = function () { const _0x18c4a8 = _0x709961, _0x26dfd5 = this[_0x18c4a8(0x252)]()[_0x18c4a8(0x321)]; for (let _0x3439e1 = 0x0; _0x3439e1 < _0x26dfd5; _0x3439e1++) { if (_0x18c4a8(0x2c0) !== _0x18c4a8(0x689)) { if (this['isOptimizeEquipOk'](_0x3439e1)) this[_0x18c4a8(0x274)](_0x3439e1, null); } else return _0xfcfa9e[_0x18c4a8(0x3db)][_0x18c4a8(0x6b0)][_0x18c4a8(0x300)]['CmdHideDisabled']; } for (let _0x2b886d = 0x0; _0x2b886d < _0x26dfd5; _0x2b886d++) { if (this[_0x18c4a8(0x3c1)](_0x2b886d)) this[_0x18c4a8(0x274)](_0x2b886d, this[_0x18c4a8(0x5a2)](_0x2b886d)); } }, Game_Actor[_0x709961(0x5ef)][_0x709961(0x5a2)] = function (_0x17f349) { const _0x354686 = _0x709961, _0x1462da = this[_0x354686(0x252)]()[_0x17f349], _0x831b9e = $gameParty[_0x354686(0x4cb)]()[_0x354686(0x672)](_0x1c55f8 => DataManager[_0x354686(0x323)](_0x1c55f8)['includes'](_0x1462da) && this[_0x354686(0x447)](_0x1c55f8) && !DataManager[_0x354686(0x45e)](_0x1c55f8)); let _0x39515e = null, _0x314c3f = -0x3e8; for (let _0x5588b0 = 0x0; _0x5588b0 < _0x831b9e[_0x354686(0x321)]; _0x5588b0++) { if (_0x354686(0x251) !== _0x354686(0x251)) return _0x32c61b; else { const _0x249a44 = this[_0x354686(0x51f)](_0x831b9e[_0x5588b0]); if (_0x249a44 > _0x314c3f) { if (_0x354686(0x5c6) !== _0x354686(0x5c6)) { _0xa36325 = _0x8e8449 || this[_0x354686(0x361)](), this[_0x354686(0x30a)]['paintOpacity'] = 0xa0; const _0x1564a8 = _0x28a9cb[_0x354686(0x6a7)](); this[_0x354686(0x30a)][_0x354686(0x68d)](_0x511e08 + 0x1, _0x1d307f + 0x1, _0x3dfcb9 - 0x2, _0x1d46c8 - 0x2, _0x1564a8), this[_0x354686(0x30a)][_0x354686(0x32b)] = 0xff; } else _0x314c3f = _0x249a44, _0x39515e = _0x831b9e[_0x5588b0]; } } } return _0x39515e; }, Game_Actor['prototype']['isOptimizeEquipOk'] = function (_0x2d1754) { const _0x347fe3 = _0x709961; return this['nonOptimizeEtypes']()[_0x347fe3(0x3bb)](this[_0x347fe3(0x252)]()[_0x2d1754]) ? ![] : this[_0x347fe3(0x698)](_0x2d1754); }, VisuMZ[_0x709961(0x3db)][_0x709961(0x6d0)] = Game_Actor[_0x709961(0x5ef)]['isEquipChangeOk'], Game_Actor['prototype'][_0x709961(0x698)] = function (_0x2d02ce) { const _0x523a6c = _0x709961, _0x2c0f6c = this[_0x523a6c(0x5fd)][_0x2d02ce]; if (_0x2c0f6c) { if (_0x523a6c(0x525) !== 'PRXze') return this[_0x523a6c(0x240)](_0x18609c); else { const _0x5ba00b = _0x2c0f6c[_0x523a6c(0x2c6)](); if (DataManager[_0x523a6c(0x45e)](_0x5ba00b)) return ![]; } } return VisuMZ[_0x523a6c(0x3db)][_0x523a6c(0x6d0)]['call'](this, _0x2d02ce); }, Game_Actor['prototype'][_0x709961(0x442)] = function () { const _0x50a0b2 = _0x709961; return VisuMZ[_0x50a0b2(0x3db)][_0x50a0b2(0x6b0)][_0x50a0b2(0x6b4)]['NonOptimizeETypes']; }, VisuMZ[_0x709961(0x3db)][_0x709961(0x235)] = Game_Actor['prototype'][_0x709961(0x3af)], Game_Actor[_0x709961(0x5ef)][_0x709961(0x3af)] = function (_0x313134, _0x4a2721) { const _0x9adcb2 = _0x709961; if (this['_tempActor']) return ![]; $gameTemp[_0x9adcb2(0x262)] = !![]; const _0x2f2287 = VisuMZ[_0x9adcb2(0x3db)][_0x9adcb2(0x235)][_0x9adcb2(0x376)](this, _0x313134, _0x4a2721); return $gameTemp[_0x9adcb2(0x262)] = ![], _0x2f2287; }, Game_Actor[_0x709961(0x5ef)][_0x709961(0x432)] = function (_0x15237e, _0x1dee7d) { const _0x177299 = _0x709961, _0x4749f8 = this[_0x177299(0x4d9)](_0x15237e); if (_0x4749f8 < 0x0) return; const _0x24e64b = _0x15237e === 0x1 ? $dataWeapons[_0x1dee7d] : $dataArmors[_0x1dee7d]; this[_0x177299(0x274)](_0x4749f8, _0x24e64b); }, Game_Actor[_0x709961(0x5ef)][_0x709961(0x4d9)] = function (_0x2e55ec) { const _0x23bb3a = _0x709961; let _0x5666ca = 0x0; const _0x4bb2a5 = this['equipSlots'](), _0x469d0d = this[_0x23bb3a(0x673)](); for (let _0x50b03f = 0x0; _0x50b03f < _0x4bb2a5['length']; _0x50b03f++) { if (_0x4bb2a5[_0x50b03f] === _0x2e55ec) { _0x5666ca = _0x50b03f; if (!_0x469d0d[_0x50b03f]) return _0x5666ca; } } return _0x5666ca; }, VisuMZ[_0x709961(0x3db)]['Game_Actor_paramPlus'] = Game_Actor[_0x709961(0x5ef)]['paramPlus'], Game_Actor[_0x709961(0x5ef)][_0x709961(0x6e2)] = function (_0x44d174) { const _0x32fbd8 = _0x709961; let _0x51dc31 = VisuMZ[_0x32fbd8(0x3db)][_0x32fbd8(0x638)][_0x32fbd8(0x376)](this, _0x44d174); for (const _0x178f93 of this[_0x32fbd8(0x673)]()) { if (_0x178f93) _0x51dc31 += this[_0x32fbd8(0x23f)](_0x178f93, _0x44d174); } return _0x51dc31; }, Game_Actor[_0x709961(0x5ef)][_0x709961(0x23f)] = function (_0xa53384, _0x2fe97e) { const _0x500e24 = _0x709961; if (this[_0x500e24(0x661)]) return 0x0; const _0x1a538e = (DataManager[_0x500e24(0x67a)](_0xa53384) ? 'W%1' : _0x500e24(0x473))[_0x500e24(0x60c)](_0xa53384['id']), _0xa91b91 = '%1-%2'[_0x500e24(0x60c)](_0x1a538e, _0x2fe97e); if (VisuMZ[_0x500e24(0x3db)][_0x500e24(0x510)][_0xa91b91]) { this[_0x500e24(0x661)] = !![]; const _0x480777 = VisuMZ[_0x500e24(0x3db)]['paramJS'][_0xa91b91][_0x500e24(0x376)](this, _0xa53384, _0x2fe97e); return this[_0x500e24(0x661)] = ![], _0x480777; } else { if (_0x500e24(0x43f) === _0x500e24(0x668)) this[_0x500e24(0x5d0)](), _0x2a5ee4[_0x500e24(0x6c1)][_0x500e24(0x344)](), _0x552cac[_0x500e24(0x6c1)][_0x500e24(0x3f9)][_0x500e24(0x1de)](-0x1); else return 0x0; } }, Game_Actor[_0x709961(0x5ef)][_0x709961(0x6a1)] = function (_0x2d4f31) { const _0x5cd9ca = _0x709961; this[_0x5cd9ca(0x216)] = !![], this[_0x5cd9ca(0x551)] = _0x2d4f31; }, VisuMZ['ItemsEquipsCore']['Game_Party_initialize'] = Game_Party[_0x709961(0x5ef)][_0x709961(0x527)], Game_Party['prototype'][_0x709961(0x527)] = function () { const _0x398593 = _0x709961; VisuMZ['ItemsEquipsCore'][_0x398593(0x5aa)]['call'](this), this['initNewItemsList'](), this[_0x398593(0x59b)](); }, Game_Party[_0x709961(0x5ef)][_0x709961(0x414)] = function () { const _0x4c37b9 = _0x709961; this[_0x4c37b9(0x3ed)] = []; }, Game_Party[_0x709961(0x5ef)][_0x709961(0x572)] = function (_0x24dcee) { const _0xeedb19 = _0x709961; if (!$gameTemp[_0xeedb19(0x243)]()) return ![]; if (this[_0xeedb19(0x3ed)] === undefined) this[_0xeedb19(0x414)](); let _0x5eee08 = ''; if (DataManager[_0xeedb19(0x2f3)](_0x24dcee)) 'ZXzNH' === _0xeedb19(0x3cb) ? this['cursorPageup']() : _0x5eee08 = 'item-%1'[_0xeedb19(0x60c)](_0x24dcee['id']); else { if (DataManager[_0xeedb19(0x67a)](_0x24dcee)) { if (_0xeedb19(0x319) !== _0xeedb19(0x319)) { if (!this[_0xeedb19(0x3fe)]()) return; const _0x35f286 = this[_0xeedb19(0x1be)](), _0x653e13 = _0x3817c8[_0xeedb19(0x3db)][_0xeedb19(0x6b0)][_0xeedb19(0x6b4)][_0xeedb19(0x5bb)], _0xcf0793 = _0x35f286 === _0xeedb19(0x461) ? _0x46dc49[_0xeedb19(0x49d)] : _0xeedb19(0x297)[_0xeedb19(0x60c)](_0x653e13, _0x5bbf97[_0xeedb19(0x49d)]), _0x2ff9da = this[_0xeedb19(0x201)](); this['addCommand'](_0xcf0793, 'optimize', _0x2ff9da); } else _0x5eee08 = _0xeedb19(0x49c)['format'](_0x24dcee['id']); } else { if (DataManager[_0xeedb19(0x3b3)](_0x24dcee)) { if ('vJmPz' !== _0xeedb19(0x39b)) { if (_0x4b6d6f[_0xeedb19(0x38b)]()) _0x321ae1[_0xeedb19(0x4df)](_0x491d24); } else _0x5eee08 = _0xeedb19(0x269)[_0xeedb19(0x60c)](_0x24dcee['id']); } else return; } } return this[_0xeedb19(0x3ed)][_0xeedb19(0x3bb)](_0x5eee08); }, Game_Party[_0x709961(0x5ef)]['setNewItem'] = function (_0x5bf5c1) { const _0x2ada46 = _0x709961; if (!$gameTemp['newLabelEnabled']()) return; if (this['_newItemsList'] === undefined) this['initNewItemsList'](); let _0x2bb510 = ''; if (DataManager[_0x2ada46(0x2f3)](_0x5bf5c1)) { if (_0x2ada46(0x5b9) === _0x2ada46(0x3b4)) return this[_0x2ada46(0x568)](); else _0x2bb510 = 'item-%1'[_0x2ada46(0x60c)](_0x5bf5c1['id']); } else { if (DataManager['isWeapon'](_0x5bf5c1)) _0x2ada46(0x5bc) !== 'CtVFD' ? _0x215695 += '%1'[_0x2ada46(0x60c)](this[_0x2ada46(0x6f3)]['selfTP']) : _0x2bb510 = 'weapon-%1'['format'](_0x5bf5c1['id']); else { if (DataManager['isArmor'](_0x5bf5c1)) 'LufjS' === _0x2ada46(0x5ba) ? this['artifactIDs'][_0x2ada46(0x677)][_0x2ada46(0x4ba)](_0x3aa724['id']) : _0x2bb510 = _0x2ada46(0x269)[_0x2ada46(0x60c)](_0x5bf5c1['id']); else return; } } if (!this[_0x2ada46(0x3ed)][_0x2ada46(0x3bb)](_0x2bb510)) this[_0x2ada46(0x3ed)][_0x2ada46(0x4ba)](_0x2bb510); }, Game_Party[_0x709961(0x5ef)][_0x709961(0x6b1)] = function (_0x57f9e2) { const _0x1a41fb = _0x709961; if (!$gameTemp[_0x1a41fb(0x243)]()) return; if (this[_0x1a41fb(0x3ed)] === undefined) this[_0x1a41fb(0x414)](); let _0x501390 = ''; if (DataManager[_0x1a41fb(0x2f3)](_0x57f9e2)) _0x501390 = _0x1a41fb(0x4c8)[_0x1a41fb(0x60c)](_0x57f9e2['id']); else { if (DataManager[_0x1a41fb(0x67a)](_0x57f9e2)) _0x501390 = _0x1a41fb(0x49c)[_0x1a41fb(0x60c)](_0x57f9e2['id']); else { if (DataManager[_0x1a41fb(0x3b3)](_0x57f9e2)) { if (_0x1a41fb(0x43a) === _0x1a41fb(0x43a)) _0x501390 = _0x1a41fb(0x269)[_0x1a41fb(0x60c)](_0x57f9e2['id']); else { if (!_0x27228f) return _0x2c2a76; if (!this['isWeapon'](_0x54a3e1) && !this[_0x1a41fb(0x3b3)](_0x275647)) return _0x3a3707; if (_0x814b4b['note']['match'](/<PURIFY TRANSFORM:[ ](.*)>/i)) { const _0x427867 = _0x378c4c(_0xe4e90a['$1'])[_0x1a41fb(0x3c4)](), _0x2c5122 = /^\d+$/[_0x1a41fb(0x566)](_0x427867); if (_0x2c5122) { if (this[_0x1a41fb(0x67a)](_0x386d62)) return _0x5c7655[_0x45afae(_0x427867)]; if (this[_0x1a41fb(0x3b3)](_0xecad70)) return _0x2f0f6c[_0x32b7a5(_0x427867)]; } else { if (this[_0x1a41fb(0x67a)](_0xd743f1)) return _0x528858[this['getWeaponIdWithName'](_0x427867)]; if (this[_0x1a41fb(0x3b3)](_0x3c9ff7)) return _0x3a35b1[this[_0x1a41fb(0x3c5)](_0x427867)]; } } return _0x2198d6; } } else { if (_0x1a41fb(0x373) !== _0x1a41fb(0x373)) { const _0x373574 = _0x238b33[_0x8c7bc]; _0x373574 && _0x373574[_0x1a41fb(0x5fe)] === _0x1d97e6 + 0x1 && _0x5ef590[_0x1a41fb(0x4ba)](_0x373574); } else return; } } } this[_0x1a41fb(0x3ed)][_0x1a41fb(0x3bb)](_0x501390) && (_0x1a41fb(0x6af) !== 'TPIkm' ? _0x88669f = _0x1a41fb(0x269)[_0x1a41fb(0x60c)](_0x11e3e9['id']) : this[_0x1a41fb(0x3ed)][_0x1a41fb(0x43d)](this[_0x1a41fb(0x3ed)][_0x1a41fb(0x532)](_0x501390), 0x1)); }, VisuMZ[_0x709961(0x3db)][_0x709961(0x2d3)] = Game_Party['prototype'][_0x709961(0x402)], Game_Party[_0x709961(0x5ef)]['numItems'] = function (_0x170301) { const _0x1095dc = _0x709961; if (DataManager['isProxyItem'](_0x170301)) _0x170301 = DataManager[_0x1095dc(0x36d)](_0x170301); return VisuMZ[_0x1095dc(0x3db)][_0x1095dc(0x2d3)]['call'](this, _0x170301); }, VisuMZ[_0x709961(0x3db)][_0x709961(0x5d3)] = Game_Party[_0x709961(0x5ef)][_0x709961(0x2a5)], Game_Party['prototype'][_0x709961(0x2a5)] = function (_0x4be3f4, _0xfb890a, _0x26d5d9) { const _0x4efed4 = _0x709961; if (DataManager[_0x4efed4(0x4a0)](_0x4be3f4)) _0x4be3f4 = null; const _0x5a3758 = this['numItems'](_0x4be3f4); VisuMZ[_0x4efed4(0x3db)]['Game_Party_gainItem'][_0x4efed4(0x376)](this, _0x4be3f4, _0xfb890a, _0x26d5d9); if (this[_0x4efed4(0x402)](_0x4be3f4) > _0x5a3758) this[_0x4efed4(0x678)](_0x4be3f4); }, Game_Party[_0x709961(0x5ef)][_0x709961(0x1fb)] = function (_0x3464b9) { const _0x56e1ab = _0x709961; if (DataManager['isProxyItem'](_0x3464b9)) _0x3464b9 = DataManager[_0x56e1ab(0x36d)](_0x3464b9); return DataManager['maxItemAmount'](_0x3464b9); }, VisuMZ['ItemsEquipsCore'][_0x709961(0x404)] = Game_Party['prototype'][_0x709961(0x46f)], Game_Party[_0x709961(0x5ef)][_0x709961(0x46f)] = function (_0x4fc1a4) { const _0x2ebba4 = _0x709961; if (_0x4fc1a4) { const _0x4e65dd = _0x4fc1a4[_0x2ebba4(0x1e9)] || ''; if (_0x4e65dd['match'](/<(?:CONSERVE|PRESERVE):[ ](\d+)([%％])>/i)) { const _0x1203ce = Number(RegExp['$1']) * 0.01; if (Math[_0x2ebba4(0x580)]() < _0x1203ce) return; } } VisuMZ['ItemsEquipsCore']['Game_Party_consumeItem']['call'](this, _0x4fc1a4); }, Game_Party[_0x709961(0x5ef)][_0x709961(0x59b)] = function () { this['_shopTrackingData'] = { 'buy': { 'gold': 0x0, 'items': {} }, 'sell': { 'gold': 0x0, 'items': {} } }; }, Game_Party['prototype']['getShopTrackingData'] = function () { const _0x330d60 = _0x709961; return this[_0x330d60(0x5cf)] === undefined && this[_0x330d60(0x59b)](), this[_0x330d60(0x5cf)]; }, Game_Party['prototype']['getShopTrackingItem'] = function (_0x49ec83, _0x5892a7) { const _0x3fca1b = _0x709961; if (!_0x5892a7) return 0x0; this[_0x3fca1b(0x5cf)] === undefined && this['initShopTrackingData'](); const _0x4002d1 = this[_0x3fca1b(0x1a1)](); if (!_0x4002d1[_0x49ec83]) return 0x0; if (_0x5892a7 === _0x3fca1b(0x1d4)) return _0x4002d1[_0x49ec83]['gold'] = _0x4002d1[_0x49ec83][_0x3fca1b(0x1d4)] || 0x0, _0x4002d1[_0x49ec83][_0x3fca1b(0x1d4)]; else { if (DataManager[_0x3fca1b(0x2f3)](_0x5892a7)) key = _0x3fca1b(0x4c8)[_0x3fca1b(0x60c)](_0x5892a7['id']); else { if (DataManager[_0x3fca1b(0x67a)](_0x5892a7)) { if ('VhXrM' === _0x3fca1b(0x3aa)) return _0x45a930['ItemsEquipsCore'][_0x3fca1b(0x6b0)][_0x3fca1b(0x281)]['NotConsumable']; else key = _0x3fca1b(0x49c)[_0x3fca1b(0x60c)](_0x5892a7['id']); } else { if (DataManager['isArmor'](_0x5892a7)) key = _0x3fca1b(0x269)[_0x3fca1b(0x60c)](_0x5892a7['id']); else { if (_0x3fca1b(0x2d7) !== _0x3fca1b(0x2d7)) _0x1210b7[_0x3fca1b(0x32c)](_0x2b9e42, ![]); else return 0x0; } } } } return _0x4002d1[_0x49ec83]['items'][key] = _0x4002d1[_0x49ec83]['items'][key] || 0x0, _0x4002d1[_0x49ec83][_0x3fca1b(0x4b1)][key]; }, Game_Party[_0x709961(0x5ef)][_0x709961(0x1f0)] = function (_0x3632bd) { const _0x30cb67 = _0x709961; return this[_0x30cb67(0x339)](_0x30cb67(0x41a), _0x3632bd); }, Game_Party[_0x709961(0x5ef)][_0x709961(0x3da)] = function (_0x33ee2a) { const _0x1d34ab = _0x709961; return this[_0x1d34ab(0x339)](_0x1d34ab(0x1b9), _0x33ee2a); }, Game_Party[_0x709961(0x5ef)]['getShopTrackingGoldBuy'] = function () { const _0x14ae49 = _0x709961; return this['getShopTrackingItem'](_0x14ae49(0x41a), 'gold'); }, Game_Party['prototype'][_0x709961(0x360)] = function () { const _0x200dad = _0x709961; return this['getShopTrackingItem'](_0x200dad(0x1b9), 'gold'); }, Game_Party['prototype']['addShopTrackingItem'] = function (_0x30d527, _0x21341d, _0x1baef2) { const _0x12a38c = _0x709961; if (!_0x21341d) return; if (_0x1baef2 <= 0x0) return; this['_shopTrackingData'] === undefined && this[_0x12a38c(0x59b)](); const _0x30e546 = this[_0x12a38c(0x1a1)](); if (!_0x30e546[_0x30d527]) return; if (_0x21341d === _0x12a38c(0x1d4)) { _0x30e546[_0x30d527]['gold'] = _0x30e546[_0x30d527][_0x12a38c(0x1d4)] || 0x0, _0x30e546[_0x30d527][_0x12a38c(0x1d4)] += _0x1baef2; return; } else { if (DataManager[_0x12a38c(0x2f3)](_0x21341d)) key = _0x12a38c(0x4c8)[_0x12a38c(0x60c)](_0x21341d['id']); else { if (DataManager[_0x12a38c(0x67a)](_0x21341d)) key = _0x12a38c(0x49c)['format'](_0x21341d['id']); else { if (DataManager['isArmor'](_0x21341d)) key = _0x12a38c(0x269)['format'](_0x21341d['id']); else return; } } } _0x30e546[_0x30d527][_0x12a38c(0x4b1)][key] = _0x30e546[_0x30d527][_0x12a38c(0x4b1)][key] || 0x0, _0x30e546[_0x30d527][_0x12a38c(0x4b1)][key] += _0x1baef2; }, Game_Party[_0x709961(0x5ef)][_0x709961(0x28c)] = function (_0x393fbb, _0x3e1bf7) { const _0x3d6bc3 = _0x709961; this[_0x3d6bc3(0x4f9)](_0x3d6bc3(0x41a), _0x393fbb, _0x3e1bf7); }, Game_Party[_0x709961(0x5ef)]['addShopTrackingItemSell'] = function (_0x41fb8, _0x52115e) { const _0x56b937 = _0x709961; this[_0x56b937(0x4f9)](_0x56b937(0x1b9), _0x41fb8, _0x52115e); }, Game_Party[_0x709961(0x5ef)][_0x709961(0x64b)] = function (_0x147721) { const _0x1a0944 = _0x709961; this[_0x1a0944(0x4f9)](_0x1a0944(0x41a), _0x1a0944(0x1d4), _0x147721); }, Game_Party[_0x709961(0x5ef)][_0x709961(0x37e)] = function (_0x2cb089) { const _0x3e3d6b = _0x709961; this[_0x3e3d6b(0x4f9)]('sell', _0x3e3d6b(0x1d4), _0x2cb089); }, VisuMZ['ItemsEquipsCore'][_0x709961(0x28d)] = Scene_ItemBase[_0x709961(0x5ef)][_0x709961(0x65e)], Scene_ItemBase['prototype'][_0x709961(0x65e)] = function () { const _0xf36466 = _0x709961; VisuMZ[_0xf36466(0x3db)][_0xf36466(0x28d)][_0xf36466(0x376)](this), this[_0xf36466(0x2ec)][_0xf36466(0x3d8)](); }, Scene_Item[_0x709961(0x5ef)][_0x709961(0x4bf)] = function () { const _0x1d4220 = _0x709961; if (ConfigManager[_0x1d4220(0x53e)] && ConfigManager[_0x1d4220(0x32e)] !== undefined) { if ('lbZrd' === _0x1d4220(0x63c)) return ConfigManager['uiHelpPosition']; else this[_0x1d4220(0x2ec)][_0x1d4220(0x630)] = 0x1, this[_0x1d4220(0x2ec)]['updateSmoothScroll'](); } else return this[_0x1d4220(0x289)]() ? this[_0x1d4220(0x4fa)]()['match'](/LOWER/i) : Scene_ItemBase[_0x1d4220(0x5ef)][_0x1d4220(0x4bf)][_0x1d4220(0x376)](this); }, Scene_Item[_0x709961(0x5ef)][_0x709961(0x2ef)] = function () { const _0x3dfc26 = _0x709961; if (ConfigManager[_0x3dfc26(0x53e)] && ConfigManager['uiInputPosition'] !== undefined) return ConfigManager['uiInputPosition']; else { if (this[_0x3dfc26(0x289)]()) return _0x3dfc26(0x212) === _0x3dfc26(0x632) ? this[_0x3dfc26(0x289)]() ? this[_0x3dfc26(0x3ce)]() : _0x1cf064[_0x3dfc26(0x3db)][_0x3dfc26(0x1a2)][_0x3dfc26(0x376)](this) : this['updatedLayoutStyle']()[_0x3dfc26(0x1ed)](/RIGHT/i); else { if ('OFiWY' === _0x3dfc26(0x55d)) _0x15e9c8[_0x3dfc26(0x5ef)][_0x3dfc26(0x527)][_0x3dfc26(0x376)](this), this[_0x3dfc26(0x1ff)](); else return Scene_ItemBase[_0x3dfc26(0x5ef)][_0x3dfc26(0x2ef)][_0x3dfc26(0x376)](this); } } }, Scene_Item[_0x709961(0x5ef)][_0x709961(0x4fa)] = function () { const _0xa8add3 = _0x709961; return VisuMZ[_0xa8add3(0x3db)][_0xa8add3(0x6b0)][_0xa8add3(0x309)][_0xa8add3(0x315)]; }, Scene_Item[_0x709961(0x5ef)][_0x709961(0x6d8)] = function () { const _0x2869da = _0x709961; return this[_0x2869da(0x5cd)] && this[_0x2869da(0x5cd)][_0x2869da(0x6d8)](); }, Scene_Item['prototype']['isUseItemsEquipsCoreUpdatedLayout'] = function () { const _0x5bbf02 = _0x709961; return VisuMZ[_0x5bbf02(0x3db)][_0x5bbf02(0x6b0)][_0x5bbf02(0x309)][_0x5bbf02(0x494)]; }, VisuMZ[_0x709961(0x3db)][_0x709961(0x3e0)] = Scene_Item['prototype'][_0x709961(0x256)], Scene_Item['prototype'][_0x709961(0x256)] = function () { const _0x2f3474 = _0x709961; VisuMZ[_0x2f3474(0x3db)][_0x2f3474(0x3e0)]['call'](this), this['isUseModernControls']() && this['onCategoryOk'](); }, VisuMZ['ItemsEquipsCore']['Scene_Item_helpWindowRect'] = Scene_Item[_0x709961(0x5ef)][_0x709961(0x67b)], Scene_Item[_0x709961(0x5ef)][_0x709961(0x67b)] = function () { const _0x1c974d = _0x709961; return this['isUseItemsEquipsCoreUpdatedLayout']() ? this['helpWindowRectItemsEquipsCore']() : VisuMZ[_0x1c974d(0x3db)][_0x1c974d(0x310)][_0x1c974d(0x376)](this); }, Scene_Item[_0x709961(0x5ef)][_0x709961(0x386)] = function () { const _0x59b92f = _0x709961, _0x35a188 = 0x0, _0x5c43f0 = this['helpAreaTop'](), _0xf947d3 = Graphics['boxWidth'], _0x5490bc = this[_0x59b92f(0x60f)](); return new Rectangle(_0x35a188, _0x5c43f0, _0xf947d3, _0x5490bc); }, VisuMZ[_0x709961(0x3db)][_0x709961(0x369)] = Scene_Item[_0x709961(0x5ef)][_0x709961(0x5fb)], Scene_Item[_0x709961(0x5ef)][_0x709961(0x5fb)] = function () { const _0x154518 = _0x709961; VisuMZ[_0x154518(0x3db)][_0x154518(0x369)][_0x154518(0x376)](this), this['isUseModernControls']() && this[_0x154518(0x38e)](); }, Scene_Item['prototype']['postCreateCategoryWindowItemsEquipsCore'] = function () { const _0x41d9e0 = _0x709961; delete this['_categoryWindow'][_0x41d9e0(0x4c3)]['ok'], delete this['_categoryWindow'][_0x41d9e0(0x4c3)][_0x41d9e0(0x320)]; }, VisuMZ[_0x709961(0x3db)][_0x709961(0x227)] = Scene_Item[_0x709961(0x5ef)]['categoryWindowRect'], Scene_Item[_0x709961(0x5ef)][_0x709961(0x549)] = function () { const _0x4821ac = _0x709961; if (this[_0x4821ac(0x289)]()) { if ('ZoBmU' === _0x4821ac(0x663)) return this[_0x4821ac(0x507)](); else this['drawItemStyleIconText'](_0x4e3f8b); } else return VisuMZ[_0x4821ac(0x3db)][_0x4821ac(0x227)][_0x4821ac(0x376)](this); }, Scene_Item[_0x709961(0x5ef)][_0x709961(0x507)] = function () { const _0xdf99f1 = _0x709961, _0x407c37 = 0x0, _0xa537b4 = this[_0xdf99f1(0x31b)](), _0x17e021 = Graphics[_0xdf99f1(0x628)], _0x4f28be = this[_0xdf99f1(0x6ac)](0x1, !![]); return new Rectangle(_0x407c37, _0xa537b4, _0x17e021, _0x4f28be); }, VisuMZ['ItemsEquipsCore'][_0x709961(0x5b7)] = Scene_Item[_0x709961(0x5ef)][_0x709961(0x561)], Scene_Item[_0x709961(0x5ef)][_0x709961(0x561)] = function () { const _0x466d34 = _0x709961; VisuMZ[_0x466d34(0x3db)][_0x466d34(0x5b7)]['call'](this); this[_0x466d34(0x6d8)]() && this[_0x466d34(0x1b0)](); if (this[_0x466d34(0x34f)]()) { if (_0x466d34(0x394) !== 'HQIGy') return _0x4337b9[_0x466d34(0x5f5)](0x1, _0x2073ac['mainFontSize']() - 0x4); else this[_0x466d34(0x5e4)](); } }, VisuMZ[_0x709961(0x3db)][_0x709961(0x1e5)] = Scene_Item[_0x709961(0x5ef)][_0x709961(0x1f9)], Scene_Item[_0x709961(0x5ef)][_0x709961(0x1f9)] = function () { const _0x5ee965 = _0x709961; if (this[_0x5ee965(0x289)]()) return this[_0x5ee965(0x61a)](); else { if ('sTsQn' !== _0x5ee965(0x6a8)) { const _0x1bdaba = VisuMZ['ItemsEquipsCore']['Scene_Item_itemWindowRect']['call'](this); return this[_0x5ee965(0x34f)]() && this[_0x5ee965(0x260)]() && (_0x1bdaba[_0x5ee965(0x4ca)] -= this[_0x5ee965(0x62f)]()), _0x1bdaba; } else return this[_0x5ee965(0x4fa)]()['match'](/RIGHT/i); } }, Scene_Item['prototype'][_0x709961(0x61a)] = function () { const _0x46c4cd = _0x709961, _0xd9c632 = this[_0x46c4cd(0x2ef)]() ? this[_0x46c4cd(0x62f)]() : 0x0, _0x5c1cb9 = this[_0x46c4cd(0x5cd)]['y'] + this[_0x46c4cd(0x5cd)][_0x46c4cd(0x232)], _0x4b6e8e = Graphics[_0x46c4cd(0x628)] - this['statusWidth'](), _0x36915c = this[_0x46c4cd(0x496)]() - _0x5c1cb9; return new Rectangle(_0xd9c632, _0x5c1cb9, _0x4b6e8e, _0x36915c); }, Scene_Item[_0x709961(0x5ef)][_0x709961(0x1b0)] = function () { const _0x3a1db5 = _0x709961; this[_0x3a1db5(0x2ec)]['setHandler'](_0x3a1db5(0x320), this['popScene'][_0x3a1db5(0x4b0)](this)); }, Scene_Item[_0x709961(0x5ef)][_0x709961(0x34f)] = function () { const _0x57e649 = _0x709961; return this[_0x57e649(0x289)]() ? !![] : VisuMZ['ItemsEquipsCore'][_0x57e649(0x6b0)]['ItemScene'][_0x57e649(0x452)]; }, Scene_Item['prototype']['adjustItemWidthByStatus'] = function () { const _0x5a2d5d = _0x709961; return VisuMZ[_0x5a2d5d(0x3db)][_0x5a2d5d(0x6b0)][_0x5a2d5d(0x309)][_0x5a2d5d(0x363)]; }, Scene_Item['prototype'][_0x709961(0x5e4)] = function () { const _0x37a05d = _0x709961, _0x4a4015 = this[_0x37a05d(0x59f)](); this[_0x37a05d(0x633)] = new Window_ShopStatus(_0x4a4015), this[_0x37a05d(0x5e8)](this[_0x37a05d(0x633)]), this['_itemWindow'][_0x37a05d(0x6b6)](this['_statusWindow']); const _0x4592f2 = VisuMZ[_0x37a05d(0x3db)][_0x37a05d(0x6b0)][_0x37a05d(0x309)]['ItemMenuStatusBgType']; this['_statusWindow'][_0x37a05d(0x3e7)](_0x4592f2 || 0x0); }, Scene_Item['prototype'][_0x709961(0x59f)] = function () { const _0x34b917 = _0x709961; if (this[_0x34b917(0x289)]()) { if (_0x34b917(0x47a) !== _0x34b917(0x374)) return this[_0x34b917(0x3ce)](); else { const _0xcc1349 = this['_commandNameWindow']; _0xcc1349[_0x34b917(0x30a)]['clear'](); const _0x4e7322 = this[_0x34b917(0x2b7)](this[_0x34b917(0x624)]()); if (_0x4e7322 === 'icon') { const _0x5a66ab = this['itemLineRect'](this[_0x34b917(0x624)]()); let _0x3205a5 = this[_0x34b917(0x626)](this[_0x34b917(0x624)]()); _0x3205a5 = _0x3205a5[_0x34b917(0x3a5)](/\\I\[(\d+)\]/gi, ''), _0xcc1349['resetFontSettings'](), this[_0x34b917(0x25d)](_0x3205a5, _0x5a66ab), this[_0x34b917(0x690)](_0x3205a5, _0x5a66ab), this[_0x34b917(0x45a)](_0x3205a5, _0x5a66ab); } } } else return VisuMZ['ItemsEquipsCore'][_0x34b917(0x6b0)][_0x34b917(0x309)][_0x34b917(0x396)][_0x34b917(0x376)](this); }, Scene_Item['prototype']['statusWindowRectItemsEquipsCore'] = function () { const _0x3b61fd = _0x709961, _0x34ef3d = this[_0x3b61fd(0x62f)](), _0x361fd2 = this[_0x3b61fd(0x2ec)]['height'], _0x59ea53 = this[_0x3b61fd(0x2ef)]() ? 0x0 : Graphics['boxWidth'] - this[_0x3b61fd(0x62f)](), _0x2c9627 = this[_0x3b61fd(0x2ec)]['y']; return new Rectangle(_0x59ea53, _0x2c9627, _0x34ef3d, _0x361fd2); }, Scene_Item[_0x709961(0x5ef)][_0x709961(0x62f)] = function () { const _0x430091 = _0x709961; return Scene_Shop[_0x430091(0x5ef)][_0x430091(0x62f)](); }, Scene_Item[_0x709961(0x5ef)][_0x709961(0x484)] = function () { const _0x4676f1 = _0x709961; if (!this[_0x4676f1(0x4fa)]()) return ![]; if (!this[_0x4676f1(0x6d8)]()) return ![]; if (!this['_itemWindow']) return ![]; if (!this[_0x4676f1(0x2ec)][_0x4676f1(0x3bd)]) return ![]; return this[_0x4676f1(0x4fa)]() && this[_0x4676f1(0x6d8)](); }, Scene_Item[_0x709961(0x5ef)]['buttonAssistKey1'] = function () { const _0x5df0a6 = _0x709961; if (this[_0x5df0a6(0x484)]()) { if (_0x5df0a6(0x435) !== _0x5df0a6(0x40f)) { if (this['_itemWindow'][_0x5df0a6(0x515)]() === 0x1) return TextManager[_0x5df0a6(0x4bd)]('left', _0x5df0a6(0x4b9)); else { if (_0x5df0a6(0x343) !== 'XJmHG') { const _0x5dd6ab = this[_0x5df0a6(0x407)](); let _0x4ea531 = 0x0, _0x132922 = 0x0, _0x37b418 = ''; if (this[_0x5df0a6(0x342)]) { _0x4e7f89[_0x5df0a6(0x615)] ? (_0x4ea531 = this[_0x5df0a6(0x3bc)][_0x5df0a6(0x29d)](_0x50a5f4, ![]), _0x132922 = this[_0x5df0a6(0x342)][_0x5df0a6(0x29d)](_0x3c7c0a, ![]), _0x37b418 = this[_0x5df0a6(0x342)]['paramValueByName'](_0x3a14ff, !![])) : (_0x4ea531 = this['_actor'][_0x5df0a6(0x307)](_0x33c788), _0x132922 = this[_0x5df0a6(0x342)][_0x5df0a6(0x307)](_0x177fa5), _0x37b418 = this['_tempActor']['param'](_0x5c44dc)); const _0x4a0a77 = _0x4ea531, _0x27c436 = _0x132922; _0x888d4a = _0x27c436 - _0x4a0a77, this[_0x5df0a6(0x61c)](_0x4985df[_0x5df0a6(0x4da)](_0x340359)), this[_0x5df0a6(0x62c)](_0x37b418, _0x22a2bd, _0x8b50c, _0x292656 - _0x5dd6ab, 'right'); } } else return TextManager[_0x5df0a6(0x4bd)](_0x5df0a6(0x277), _0x5df0a6(0x5af)); } } else return this[_0x5df0a6(0x289)]() ? this['geUpdatedLayoutStatusWidth']() : _0x51965b[_0x5df0a6(0x3db)][_0x5df0a6(0x6b0)]['EquipScene'][_0x5df0a6(0x610)]; } return Scene_ItemBase[_0x5df0a6(0x5ef)]['buttonAssistKey1'][_0x5df0a6(0x376)](this); }, Scene_Item[_0x709961(0x5ef)][_0x709961(0x211)] = function () { const _0x4d94e0 = _0x709961; if (this[_0x4d94e0(0x484)]()) return VisuMZ[_0x4d94e0(0x3db)][_0x4d94e0(0x6b0)][_0x4d94e0(0x309)]['buttonAssistCategory']; return Scene_ItemBase[_0x4d94e0(0x5ef)][_0x4d94e0(0x211)]['call'](this); }, Scene_Equip['prototype'][_0x709961(0x56e)] = function () { const _0x13c3af = _0x709961; Scene_ItemBase['prototype'][_0x13c3af(0x56e)][_0x13c3af(0x376)](this), this[_0x13c3af(0x5f0)](); }, Scene_Equip[_0x709961(0x5ef)][_0x709961(0x4bf)] = function () { const _0x3addab = _0x709961; if (ConfigManager[_0x3addab(0x53e)] && ConfigManager[_0x3addab(0x32e)] !== undefined) return ConfigManager['uiHelpPosition']; else { if (this[_0x3addab(0x289)]()) return this[_0x3addab(0x4fa)]()[_0x3addab(0x1ed)](/LOWER/i); else Scene_MenuBase[_0x3addab(0x5ef)][_0x3addab(0x2ef)][_0x3addab(0x376)](this); } }, Scene_Equip[_0x709961(0x5ef)][_0x709961(0x2ef)] = function () { const _0x553cdd = _0x709961; if (ConfigManager[_0x553cdd(0x53e)] && ConfigManager['uiInputPosition'] !== undefined) return ConfigManager[_0x553cdd(0x2e1)]; else { if (this['isUseItemsEquipsCoreUpdatedLayout']()) { if (_0x553cdd(0x4a6) === _0x553cdd(0x6ee)) _0x46af01 = _0x1e371f[_0x553cdd(0x3db)][_0x553cdd(0x40e)](_0x5245c1), _0x1d36db['ItemsEquipsCore'][_0x553cdd(0x591)]['call'](this, _0x3c988c, _0x2b2c0d), this[_0x553cdd(0x6cc)](); else return this[_0x553cdd(0x4fa)]()[_0x553cdd(0x1ed)](/RIGHT/i); } else { if (_0x553cdd(0x4af) === _0x553cdd(0x4af)) Scene_MenuBase[_0x553cdd(0x5ef)][_0x553cdd(0x2ef)][_0x553cdd(0x376)](this); else return this['updatedLayoutStyle']()['match'](/RIGHT/i); } } }, Scene_Equip[_0x709961(0x5ef)]['updatedLayoutStyle'] = function () { const _0x3d9b06 = _0x709961; return VisuMZ[_0x3d9b06(0x3db)][_0x3d9b06(0x6b0)][_0x3d9b06(0x6b4)]['LayoutStyle']; }, Scene_Equip['prototype']['isUseModernControls'] = function () { const _0x17bfc4 = _0x709961; return this[_0x17bfc4(0x1a6)] && this[_0x17bfc4(0x1a6)][_0x17bfc4(0x6d8)](); }, Scene_Equip['prototype'][_0x709961(0x289)] = function () { const _0x32d410 = _0x709961; return VisuMZ['ItemsEquipsCore']['Settings'][_0x32d410(0x6b4)][_0x32d410(0x494)]; }, VisuMZ[_0x709961(0x3db)][_0x709961(0x1b2)] = Scene_Equip[_0x709961(0x5ef)]['create'], Scene_Equip[_0x709961(0x5ef)][_0x709961(0x256)] = function () { const _0x5b49d6 = _0x709961; VisuMZ[_0x5b49d6(0x3db)][_0x5b49d6(0x1b2)]['call'](this), this[_0x5b49d6(0x6d8)]() && this[_0x5b49d6(0x344)](); }, VisuMZ['ItemsEquipsCore'][_0x709961(0x6bf)] = Scene_Equip[_0x709961(0x5ef)][_0x709961(0x67b)], Scene_Equip[_0x709961(0x5ef)][_0x709961(0x67b)] = function () { const _0x5b3e24 = _0x709961; return this['isUseItemsEquipsCoreUpdatedLayout']() ? 'gfYno' !== _0x5b3e24(0x4b6) ? ![] : this[_0x5b3e24(0x386)]() : VisuMZ[_0x5b3e24(0x3db)]['Scene_Equip_helpWindowRect'][_0x5b3e24(0x376)](this); }, Scene_Equip['prototype']['helpWindowRectItemsEquipsCore'] = function () { const _0xa368e3 = _0x709961, _0x1456e4 = 0x0, _0x5e6a61 = this[_0xa368e3(0x2fb)](), _0xbde460 = Graphics['boxWidth'], _0x1c3148 = this[_0xa368e3(0x60f)](); return new Rectangle(_0x1456e4, _0x5e6a61, _0xbde460, _0x1c3148); }, VisuMZ[_0x709961(0x3db)][_0x709961(0x1a2)] = Scene_Equip[_0x709961(0x5ef)]['statusWindowRect'], Scene_Equip[_0x709961(0x5ef)][_0x709961(0x59f)] = function () { const _0x171b5b = _0x709961; if (this[_0x171b5b(0x289)]()) { if ('qCfvW' !== _0x171b5b(0x441)) { _0x411f08[_0x171b5b(0x5ef)][_0x171b5b(0x3d8)][_0x171b5b(0x376)](this); if (this['_categoryNameWindow']) this[_0x171b5b(0x280)](); } else return this[_0x171b5b(0x3ce)](); } else return VisuMZ['ItemsEquipsCore'][_0x171b5b(0x1a2)]['call'](this); }, Scene_Equip[_0x709961(0x5ef)][_0x709961(0x3ce)] = function () { const _0x43ec8d = _0x709961, _0x5752f5 = this[_0x43ec8d(0x2ef)]() ? 0x0 : Graphics[_0x43ec8d(0x628)] - this[_0x43ec8d(0x62f)](), _0x5e48ea = this[_0x43ec8d(0x31b)](), _0x4ef769 = this[_0x43ec8d(0x62f)](), _0x3134aa = this['mainAreaHeight'](); return new Rectangle(_0x5752f5, _0x5e48ea, _0x4ef769, _0x3134aa); }, VisuMZ[_0x709961(0x3db)]['Scene_Equip_createCommandWindow'] = Scene_Equip[_0x709961(0x5ef)]['createCommandWindow'], Scene_Equip[_0x709961(0x5ef)][_0x709961(0x5f9)] = function () { const _0xc0fc62 = _0x709961; VisuMZ[_0xc0fc62(0x3db)][_0xc0fc62(0x4ab)][_0xc0fc62(0x376)](this); if (this[_0xc0fc62(0x2c3)]) this['_commandWindow'][_0xc0fc62(0x33a)](this[_0xc0fc62(0x2c3)]); }, VisuMZ[_0x709961(0x3db)][_0x709961(0x6d9)] = Scene_Equip[_0x709961(0x5ef)][_0x709961(0x558)], Scene_Equip[_0x709961(0x5ef)][_0x709961(0x558)] = function () { const _0x5097dd = _0x709961; return this[_0x5097dd(0x289)]() ? this[_0x5097dd(0x1f3)]() : VisuMZ[_0x5097dd(0x3db)][_0x5097dd(0x6d9)][_0x5097dd(0x376)](this); }, Scene_Equip[_0x709961(0x5ef)]['shouldCommandWindowExist'] = function () { const _0x953233 = _0x709961, _0x4170a6 = VisuMZ['ItemsEquipsCore'][_0x953233(0x6b0)][_0x953233(0x6b4)]; return _0x4170a6['CommandAddOptimize'] || _0x4170a6[_0x953233(0x578)]; }, Scene_Equip[_0x709961(0x5ef)][_0x709961(0x1f3)] = function () { const _0x18380d = _0x709961, _0x32346d = this[_0x18380d(0x492)](), _0xe9aacc = this['isRightInputMode']() ? this[_0x18380d(0x62f)]() : 0x0, _0x18e653 = this[_0x18380d(0x31b)](), _0x41c48f = Graphics[_0x18380d(0x628)] - this['statusWidth'](), _0x7a75bf = _0x32346d ? this[_0x18380d(0x6ac)](0x1, !![]) : 0x0; return new Rectangle(_0xe9aacc, _0x18e653, _0x41c48f, _0x7a75bf); }, VisuMZ[_0x709961(0x3db)][_0x709961(0x451)] = Scene_Equip['prototype'][_0x709961(0x64f)], Scene_Equip[_0x709961(0x5ef)][_0x709961(0x64f)] = function () { const _0x3b8d57 = _0x709961; VisuMZ[_0x3b8d57(0x3db)][_0x3b8d57(0x451)][_0x3b8d57(0x376)](this), this[_0x3b8d57(0x6d8)]() && this['postCreateSlotWindowItemsEquipsCore'](); }, VisuMZ[_0x709961(0x3db)]['Scene_Equip_slotWindowRect'] = Scene_Equip[_0x709961(0x5ef)][_0x709961(0x2f9)], Scene_Equip['prototype'][_0x709961(0x2f9)] = function () { const _0x2be399 = _0x709961; if (this['isUseItemsEquipsCoreUpdatedLayout']()) return this['slotWindowRectItemsEquipsCore'](); else { if (_0x2be399(0x627) !== _0x2be399(0x6d5)) return VisuMZ[_0x2be399(0x3db)][_0x2be399(0x5bf)][_0x2be399(0x376)](this); else this[_0x2be399(0x6e8)][_0x2be399(0x5b0)](), this[_0x2be399(0x1a6)][_0x2be399(0x5b0)](); } }, Scene_Equip[_0x709961(0x5ef)][_0x709961(0x42e)] = function () { const _0x234da4 = _0x709961, _0x315856 = this[_0x234da4(0x558)](), _0x4587dc = this[_0x234da4(0x2ef)]() ? this[_0x234da4(0x62f)]() : 0x0, _0xaebf33 = _0x315856['y'] + _0x315856[_0x234da4(0x232)], _0x5d4aec = Graphics[_0x234da4(0x628)] - this[_0x234da4(0x62f)](), _0xc4896a = this[_0x234da4(0x5e0)]() - _0x315856[_0x234da4(0x232)]; return new Rectangle(_0x4587dc, _0xaebf33, _0x5d4aec, _0xc4896a); }, VisuMZ[_0x709961(0x3db)][_0x709961(0x1b5)] = Scene_Equip['prototype'][_0x709961(0x1f9)], Scene_Equip[_0x709961(0x5ef)][_0x709961(0x1f9)] = function () { const _0x1d6686 = _0x709961; return this[_0x1d6686(0x289)]() ? this[_0x1d6686(0x2f9)]() : VisuMZ['ItemsEquipsCore']['Scene_Equip_itemWindowRect'][_0x1d6686(0x376)](this); }, Scene_Equip['prototype'][_0x709961(0x62f)] = function () { const _0x338708 = _0x709961; return this['isUseItemsEquipsCoreUpdatedLayout']() ? this[_0x338708(0x2d2)]() : VisuMZ[_0x338708(0x3db)][_0x338708(0x6b0)][_0x338708(0x6b4)][_0x338708(0x610)]; }, Scene_Equip[_0x709961(0x5ef)][_0x709961(0x2d2)] = function () { const _0x39dda9 = _0x709961; return Math[_0x39dda9(0x4e5)](Graphics[_0x39dda9(0x628)] / 0x2); }, Scene_Equip[_0x709961(0x5ef)][_0x709961(0x5db)] = function () { const _0x21f44b = _0x709961; this[_0x21f44b(0x3f9)]['setHandler'](_0x21f44b(0x320), this['popScene'][_0x21f44b(0x4b0)](this)), this[_0x21f44b(0x3f9)][_0x21f44b(0x2c8)](_0x21f44b(0x5af), this['nextActor'][_0x21f44b(0x4b0)](this)), this[_0x21f44b(0x3f9)]['setHandler'](_0x21f44b(0x277), this[_0x21f44b(0x1c3)][_0x21f44b(0x4b0)](this)); }, VisuMZ[_0x709961(0x3db)][_0x709961(0x272)] = Scene_Equip[_0x709961(0x5ef)]['commandEquip'], Scene_Equip[_0x709961(0x5ef)][_0x709961(0x344)] = function () { const _0xb6d038 = _0x709961; this[_0xb6d038(0x6d8)]() && (this[_0xb6d038(0x1a6)]['deselect'](), this['_commandWindow'][_0xb6d038(0x6df)]()), VisuMZ[_0xb6d038(0x3db)]['Scene_Equip_commandEquip']['call'](this); }, VisuMZ[_0x709961(0x3db)][_0x709961(0x326)] = Scene_Equip[_0x709961(0x5ef)]['onSlotOk'], Scene_Equip[_0x709961(0x5ef)][_0x709961(0x1b4)] = function () { const _0x5e4bbf = _0x709961; this[_0x5e4bbf(0x3f9)][_0x5e4bbf(0x624)]() >= 0x0 ? _0x5e4bbf(0x3d7) === 'jPqRG' ? (VisuMZ[_0x5e4bbf(0x3db)][_0x5e4bbf(0x326)][_0x5e4bbf(0x376)](this), this[_0x5e4bbf(0x65a)]()) : this['cursorLeft'](_0x53591c[_0x5e4bbf(0x5c1)](_0x5e4bbf(0x316))) : (this[_0x5e4bbf(0x3f9)][_0x5e4bbf(0x1de)](0x0), this[_0x5e4bbf(0x3f9)][_0x5e4bbf(0x55a)]()); }, Scene_Equip[_0x709961(0x5ef)][_0x709961(0x65a)] = function () { const _0x4639d5 = _0x709961; this[_0x4639d5(0x2ec)]['refresh'](); const _0x5e8eff = this['_slotWindow']['item'](), _0x3c6cfa = this[_0x4639d5(0x2ec)]['_data']['indexOf'](_0x5e8eff), _0x203fbe = Math[_0x4639d5(0x4e5)](this[_0x4639d5(0x2ec)][_0x4639d5(0x436)]() / 0x2) - 0x1; this[_0x4639d5(0x2ec)][_0x4639d5(0x1de)](_0x3c6cfa >= 0x0 ? _0x3c6cfa : 0x0), this['_itemWindow'][_0x4639d5(0x630)] > 0x1 && (this[_0x4639d5(0x2ec)][_0x4639d5(0x630)] = 0x1, this[_0x4639d5(0x2ec)][_0x4639d5(0x4e1)]()), this[_0x4639d5(0x2ec)][_0x4639d5(0x57d)](this[_0x4639d5(0x2ec)][_0x4639d5(0x624)]() - _0x203fbe); }, VisuMZ[_0x709961(0x3db)][_0x709961(0x49f)] = Scene_Equip[_0x709961(0x5ef)][_0x709961(0x236)], Scene_Equip[_0x709961(0x5ef)][_0x709961(0x236)] = function () { const _0x2e480a = _0x709961; VisuMZ[_0x2e480a(0x3db)][_0x2e480a(0x49f)][_0x2e480a(0x376)](this), this[_0x2e480a(0x6d8)]() && (_0x2e480a(0x338) !== _0x2e480a(0x63b) ? (this['_commandWindow']['smoothSelect'](0x0), this[_0x2e480a(0x3f9)]['deactivate']()) : (this[_0x2e480a(0x216)] = !![], this[_0x2e480a(0x551)] = _0x26b73a)); }, VisuMZ['ItemsEquipsCore'][_0x709961(0x571)] = Scene_Equip[_0x709961(0x5ef)][_0x709961(0x641)], Scene_Equip[_0x709961(0x5ef)][_0x709961(0x641)] = function () { const _0x1fcd9b = _0x709961; VisuMZ[_0x1fcd9b(0x3db)]['Scene_Equip_onActorChange']['call'](this); if (this[_0x1fcd9b(0x6d8)]()) { if (_0x1fcd9b(0x27c) === _0x1fcd9b(0x429)) return _0x5af809['getInputMultiButtonStrings']('pageup', _0x1fcd9b(0x5af)); else this['_commandWindow']['deactivate'](), this[_0x1fcd9b(0x1a6)]['deselect'](), this[_0x1fcd9b(0x3f9)][_0x1fcd9b(0x1de)](0x0), this[_0x1fcd9b(0x3f9)]['activate'](); } }, Scene_Equip['prototype'][_0x709961(0x38d)] = function () { const _0x470f0b = _0x709961; if (!this['_slotWindow']) return ![]; if (!this[_0x470f0b(0x3f9)][_0x470f0b(0x3bd)]) return ![]; return this[_0x470f0b(0x3f9)][_0x470f0b(0x466)](); }, Scene_Equip[_0x709961(0x5ef)][_0x709961(0x648)] = function () { const _0x677559 = _0x709961; if (this[_0x677559(0x38d)]()) { if (_0x677559(0x48c) === 'udknT') return TextManager[_0x677559(0x32d)]('shift'); else { const _0x3f78fb = this[_0x677559(0x3b2)](); return this[_0x677559(0x2c2)](_0x3f78fb, _0x55a638, _0x17cd44, _0x56d7db, ![], _0x677559(0x50b)), this[_0x677559(0x533)](_0x1249fc, _0x5b8512, _0x5d9f00), this['resetFontSettings'](), !![]; } } return Scene_MenuBase[_0x677559(0x5ef)][_0x677559(0x648)]['call'](this); }, Scene_Equip[_0x709961(0x5ef)][_0x709961(0x60e)] = function () { const _0x4f513b = _0x709961; if (this[_0x4f513b(0x38d)]()) { if ('byFjv' === _0x4f513b(0x341)) return VisuMZ['ItemsEquipsCore'][_0x4f513b(0x6b0)][_0x4f513b(0x6b4)][_0x4f513b(0x3ba)]; else { const _0x3eb7d9 = _0xaa277a(_0xa7f16a['$1'])[_0x4f513b(0x617)](',')[_0x4f513b(0x1ac)](_0x49db7b => _0x6c6460(_0x49db7b)); for (const _0x538169 of _0x3eb7d9) { _0x47a07b[_0x4f513b(0x32c)](_0x538169, ![]); } } } return Scene_MenuBase['prototype'][_0x4f513b(0x60e)][_0x4f513b(0x376)](this); }, Scene_Equip[_0x709961(0x5ef)][_0x709961(0x48f)] = function () { const _0xd2965a = _0x709961; if (this[_0xd2965a(0x38d)]()) return this[_0xd2965a(0x2b8)][_0xd2965a(0x4ca)] / 0x5 / -0x3; return Scene_MenuBase['prototype'][_0xd2965a(0x48f)][_0xd2965a(0x376)](this); }, Scene_Equip[_0x709961(0x5ef)][_0x709961(0x4d7)] = function () { const _0x1c37b5 = _0x709961; SceneManager[_0x1c37b5(0x21b)](); }, VisuMZ['ItemsEquipsCore'][_0x709961(0x286)] = Scene_Load[_0x709961(0x5ef)][_0x709961(0x2ff)], Scene_Load[_0x709961(0x5ef)][_0x709961(0x2ff)] = function () { const _0x4b9e78 = _0x709961; VisuMZ[_0x4b9e78(0x3db)][_0x4b9e78(0x286)][_0x4b9e78(0x376)](this), this['refreshActorEquipSlotsIfUpdated'](); }, Scene_Load[_0x709961(0x5ef)][_0x709961(0x636)] = function () { const _0x3d4f4b = _0x709961; if ($gameSystem[_0x3d4f4b(0x47b)]() !== $dataSystem[_0x3d4f4b(0x47b)]) { if (_0x3d4f4b(0x657) === 'QPhfe') for (const _0x29e067 of $gameActors[_0x3d4f4b(0x53a)]) { if (_0x29e067) _0x29e067[_0x3d4f4b(0x366)](); } else this[_0x3d4f4b(0x3af)](null, _0x9620b3); } }, Scene_Shop[_0x709961(0x5ef)]['isBottomHelpMode'] = function () { const _0x1dedf1 = _0x709961; if (ConfigManager[_0x1dedf1(0x53e)] && ConfigManager[_0x1dedf1(0x32e)] !== undefined) return ConfigManager[_0x1dedf1(0x32e)]; else { if (this[_0x1dedf1(0x289)]()) return this['updatedLayoutStyle']()[_0x1dedf1(0x1ed)](/LOWER/i); else { if (_0x1dedf1(0x322) !== _0x1dedf1(0x423)) Scene_MenuBase[_0x1dedf1(0x5ef)][_0x1dedf1(0x2ef)]['call'](this); else return _0x1dedf1(0x3be); } } }, Scene_Shop['prototype'][_0x709961(0x2ef)] = function () { const _0x34dd3b = _0x709961; if (ConfigManager[_0x34dd3b(0x53e)] && ConfigManager['uiInputPosition'] !== undefined) { if ('PmWfq' === 'PmWfq') return ConfigManager[_0x34dd3b(0x2e1)]; else { if (!this[_0x34dd3b(0x3fc)]() && !_0x76bf5c['isItem'](this[_0x34dd3b(0x3c2)])) return ![]; if (_0x12e3df[_0x34dd3b(0x239)](this[_0x34dd3b(0x3c2)]) && !_0x269454[_0x34dd3b(0x33d)]) { const _0x5d8c28 = _0x5cad61[_0x34dd3b(0x44d)]; this['drawItemKeyData'](_0x5d8c28, _0x3faac6, _0x5e0a4d, _0x42f51c, !![], _0x34dd3b(0x50b)); } else { const _0x5b6f89 = _0xc46bfb[_0x34dd3b(0x65d)]; this[_0x34dd3b(0x2c2)](_0x5b6f89, _0x4b9d96, _0x4b6a93, _0x3f77d7, !![]); const _0x462797 = this[_0x34dd3b(0x2e2)](); this[_0x34dd3b(0x2c2)](_0x462797, _0x58d4ac, _0x24c043, _0x1a2a6a, ![], _0x34dd3b(0x4b9)); } return this[_0x34dd3b(0x533)](_0x25a4f6, _0x5056e5, _0x1c2833), this['resetFontSettings'](), !![]; } } else { if (this['isUseItemsEquipsCoreUpdatedLayout']()) { if (_0x34dd3b(0x683) !== _0x34dd3b(0x2d9)) return this[_0x34dd3b(0x4fa)]()[_0x34dd3b(0x1ed)](/RIGHT/i); else this[_0x34dd3b(0x55f)](); } else _0x34dd3b(0x3f3) === 'JHzAf' ? Scene_MenuBase['prototype'][_0x34dd3b(0x2ef)][_0x34dd3b(0x376)](this) : this['playBuzzerSound'](); } }, Scene_Shop[_0x709961(0x5ef)][_0x709961(0x4fa)] = function () { const _0x3254b5 = _0x709961; return VisuMZ['ItemsEquipsCore'][_0x3254b5(0x6b0)]['ShopScene'][_0x3254b5(0x315)]; }, Scene_Shop[_0x709961(0x5ef)][_0x709961(0x6d8)] = function () { const _0x5ef87d = _0x709961; return this[_0x5ef87d(0x5cd)] && this[_0x5ef87d(0x5cd)][_0x5ef87d(0x6d8)](); }, Scene_Shop['prototype'][_0x709961(0x289)] = function () { const _0x2d9d8f = _0x709961; return VisuMZ[_0x2d9d8f(0x3db)]['Settings']['ShopScene']['EnableLayout']; }, VisuMZ[_0x709961(0x3db)][_0x709961(0x591)] = Scene_Shop[_0x709961(0x5ef)][_0x709961(0x2dc)], Scene_Shop[_0x709961(0x5ef)][_0x709961(0x2dc)] = function (_0x4e09c3, _0x5a7b1a) { const _0x2d39f7 = _0x709961; _0x4e09c3 = VisuMZ[_0x2d39f7(0x3db)]['deepCopy'](_0x4e09c3), VisuMZ[_0x2d39f7(0x3db)][_0x2d39f7(0x591)]['call'](this, _0x4e09c3, _0x5a7b1a), this['adjustHiddenShownGoods'](); }, Scene_Shop[_0x709961(0x5ef)][_0x709961(0x6cc)] = function () { const _0x3cd243 = _0x709961; this[_0x3cd243(0x25b)] = 0x0; const _0x29cd74 = []; for (const _0x343225 of this[_0x3cd243(0x2fe)]) { if (this[_0x3cd243(0x6bc)](_0x343225)) this['_goodsCount']++; else { if ('XqSPE' === _0x3cd243(0x383)) return _0xcc7a8d[_0x3cd243(0x3db)][_0x3cd243(0x58a)][_0x3cd243(0x376)](this); else _0x29cd74['push'](_0x343225); } } for (const _0x458d64 of _0x29cd74) { this[_0x3cd243(0x2fe)][_0x3cd243(0x34e)](_0x458d64); } }, Scene_Shop[_0x709961(0x5ef)]['isGoodShown'] = function (_0x361f86) { if (_0x361f86[0x0] > 0x2 || _0x361f86[0x0] < 0x0) return ![]; const _0x1e8f53 = [$dataItems, $dataWeapons, $dataArmors][_0x361f86[0x0]][_0x361f86[0x1]]; if (!_0x1e8f53) return ![]; return !![]; }, VisuMZ[_0x709961(0x3db)][_0x709961(0x2ab)] = Scene_Shop[_0x709961(0x5ef)][_0x709961(0x256)], Scene_Shop[_0x709961(0x5ef)][_0x709961(0x256)] = function () { const _0x4a7676 = _0x709961; VisuMZ['ItemsEquipsCore'][_0x4a7676(0x2ab)]['call'](this); if (this['isUseItemsEquipsCoreUpdatedLayout']()) { if ('RAuKW' !== _0x4a7676(0x446)) { const _0x429919 = _0x527578[_0x339a22], _0x480d19 = this[_0x4a7676(0x563)](_0x1cf796, _0x429919); if (this[_0x4a7676(0x447)](_0x480d19)) this[_0x4a7676(0x5fd)][_0x170678][_0x4a7676(0x299)](_0x480d19); } else this[_0x4a7676(0x34b)](); } this[_0x4a7676(0x4dd)](); }, Scene_Shop[_0x709961(0x5ef)][_0x709961(0x34b)] = function () { const _0xb7c899 = _0x709961; this[_0xb7c899(0x50e)][_0xb7c899(0x5b0)](), this[_0xb7c899(0x6e8)][_0xb7c899(0x314)](), this['_buyWindow']['deselect'](), this[_0xb7c899(0x633)][_0xb7c899(0x314)](); }, VisuMZ[_0x709961(0x3db)]['Scene_Shop_helpWindowRect'] = Scene_Shop[_0x709961(0x5ef)][_0x709961(0x67b)], Scene_Shop[_0x709961(0x5ef)][_0x709961(0x67b)] = function () { const _0x5afb50 = _0x709961; return this['isUseItemsEquipsCoreUpdatedLayout']() ? this[_0x5afb50(0x386)]() : VisuMZ['ItemsEquipsCore'][_0x5afb50(0x58a)][_0x5afb50(0x376)](this); }, Scene_Shop[_0x709961(0x5ef)][_0x709961(0x386)] = function () { const _0x458878 = _0x709961, _0x52bc14 = 0x0, _0x57db92 = this['helpAreaTop'](), _0x36ed1b = Graphics[_0x458878(0x628)], _0xac0827 = this[_0x458878(0x60f)](); return new Rectangle(_0x52bc14, _0x57db92, _0x36ed1b, _0xac0827); }, VisuMZ['ItemsEquipsCore']['Scene_Shop_goldWindowRect'] = Scene_Shop[_0x709961(0x5ef)][_0x709961(0x3b9)], Scene_Shop[_0x709961(0x5ef)]['goldWindowRect'] = function () { const _0x3ff2ed = _0x709961; if (this[_0x3ff2ed(0x289)]()) return this[_0x3ff2ed(0x568)](); else { if (_0x3ff2ed(0x6c3) !== _0x3ff2ed(0x4c9)) return VisuMZ[_0x3ff2ed(0x3db)][_0x3ff2ed(0x1cd)][_0x3ff2ed(0x376)](this); else !this['processCursorSpecialCheckModernControls']() && _0x4db55c[_0x3ff2ed(0x5ef)][_0x3ff2ed(0x67e)][_0x3ff2ed(0x376)](this); } }, Scene_Shop['prototype'][_0x709961(0x568)] = function () { const _0xcb3430 = _0x709961, _0x2c03fc = this[_0xcb3430(0x5a8)](), _0x343213 = this[_0xcb3430(0x6ac)](0x1, !![]), _0x3ff3ff = this[_0xcb3430(0x2ef)]() ? 0x0 : Graphics[_0xcb3430(0x628)] - _0x2c03fc, _0x15bde9 = this['mainAreaTop'](); return new Rectangle(_0x3ff3ff, _0x15bde9, _0x2c03fc, _0x343213); }, VisuMZ['ItemsEquipsCore'][_0x709961(0x2bd)] = Scene_Shop['prototype'][_0x709961(0x558)], Scene_Shop[_0x709961(0x5ef)][_0x709961(0x558)] = function () { const _0x4d930e = _0x709961; if (this['isUseItemsEquipsCoreUpdatedLayout']()) { if ('EWgRV' === 'EWgRV') return this[_0x4d930e(0x1f3)](); else _0x209f88 = _0x31f0a9[_0x4d930e(0x29d)](_0x11edbf), _0x5037d8 = _0x589793 - _0x3af10e[_0x4d930e(0x29d)](_0x179301), this[_0x4d930e(0x61c)](_0x172091[_0x4d930e(0x4da)](_0x3bcd73)), _0x36eec6 = (_0x229a37 >= 0x0 ? '+' : '') + _0x114426['ConvertNumberToString'](_0x3941c1, 0x0, _0x2bae34); } else { if (_0x4d930e(0x4f5) !== _0x4d930e(0x4f5)) _0x49c134 = this[_0x4d930e(0x5d9)](_0x16934a); else return VisuMZ['ItemsEquipsCore']['Scene_Shop_commandWindowRect'][_0x4d930e(0x376)](this); } }, Scene_Shop[_0x709961(0x5ef)]['commandWindowRectItemsEquipsCore'] = function () { const _0x33b4cc = _0x709961, _0xa83c27 = this[_0x33b4cc(0x2ef)]() ? this['mainCommandWidth']() : 0x0, _0x5a7751 = this[_0x33b4cc(0x31b)](), _0xc441c4 = Graphics[_0x33b4cc(0x628)] - this[_0x33b4cc(0x5a8)](), _0x59a6dc = this['calcWindowHeight'](0x1, !![]); return new Rectangle(_0xa83c27, _0x5a7751, _0xc441c4, _0x59a6dc); }, VisuMZ[_0x709961(0x3db)][_0x709961(0x685)] = Scene_Shop[_0x709961(0x5ef)]['numberWindowRect'], Scene_Shop[_0x709961(0x5ef)][_0x709961(0x445)] = function () { const _0x2e5038 = _0x709961; if (this[_0x2e5038(0x289)]()) { if ('OxvIq' !== _0x2e5038(0x20d)) return this[_0x2e5038(0x1bb)](); else this[_0x2e5038(0x30a)][_0x2e5038(0x556)](), this['contentsBack'][_0x2e5038(0x556)](), this['_item'] && (this[_0x2e5038(0x4e3)](), this[_0x2e5038(0x403)](!![]), this[_0x2e5038(0x365)](), this['isEquipItem']() ? this[_0x2e5038(0x44e)]() : this[_0x2e5038(0x6ef)](), this['drawCustomShopGraphic']()); } else return VisuMZ['ItemsEquipsCore'][_0x2e5038(0x685)][_0x2e5038(0x376)](this); }, Scene_Shop[_0x709961(0x5ef)][_0x709961(0x1bb)] = function () { const _0x5d52e9 = _0x709961, _0x4d2ae8 = this[_0x5d52e9(0x1a6)]['y'] + this[_0x5d52e9(0x1a6)][_0x5d52e9(0x232)], _0x1656cb = Graphics[_0x5d52e9(0x628)] - this[_0x5d52e9(0x62f)](), _0x4ad421 = this['isRightInputMode']() ? Graphics[_0x5d52e9(0x628)] - _0x1656cb : 0x0, _0x4d9731 = this[_0x5d52e9(0x5e0)]() - this['_commandWindow'][_0x5d52e9(0x232)]; return new Rectangle(_0x4ad421, _0x4d2ae8, _0x1656cb, _0x4d9731); }, VisuMZ[_0x709961(0x3db)][_0x709961(0x6c7)] = Scene_Shop[_0x709961(0x5ef)][_0x709961(0x59f)], Scene_Shop['prototype'][_0x709961(0x59f)] = function () { const _0x4ac7d3 = _0x709961; return this['isUseItemsEquipsCoreUpdatedLayout']() ? this['statusWindowRectItemsEquipsCore']() : VisuMZ['ItemsEquipsCore']['Scene_Shop_statusWindowRect'][_0x4ac7d3(0x376)](this); }, Scene_Shop[_0x709961(0x5ef)]['statusWindowRectItemsEquipsCore'] = function () { const _0x4581f6 = _0x709961, _0x4e0dd6 = this[_0x4581f6(0x62f)](), _0x32d12f = this[_0x4581f6(0x5e0)]() - this[_0x4581f6(0x1a6)]['height'], _0x3612fa = this[_0x4581f6(0x2ef)]() ? 0x0 : Graphics[_0x4581f6(0x628)] - _0x4e0dd6, _0x3a1df4 = this['_commandWindow']['y'] + this[_0x4581f6(0x1a6)][_0x4581f6(0x232)]; return new Rectangle(_0x3612fa, _0x3a1df4, _0x4e0dd6, _0x32d12f); }, VisuMZ[_0x709961(0x3db)]['Scene_Shop_buyWindowRect'] = Scene_Shop[_0x709961(0x5ef)][_0x709961(0x23d)], Scene_Shop[_0x709961(0x5ef)]['buyWindowRect'] = function () { const _0x501925 = _0x709961; return this[_0x501925(0x289)]() ? this[_0x501925(0x28e)]() : VisuMZ['ItemsEquipsCore'][_0x501925(0x6f0)]['call'](this); }, Scene_Shop[_0x709961(0x5ef)][_0x709961(0x28e)] = function () { const _0x14a4a7 = _0x709961, _0x3ded93 = this[_0x14a4a7(0x1a6)]['y'] + this[_0x14a4a7(0x1a6)][_0x14a4a7(0x232)], _0x1abdc0 = Graphics['boxWidth'] - this[_0x14a4a7(0x62f)](), _0x45034b = this[_0x14a4a7(0x5e0)]() - this['_commandWindow'][_0x14a4a7(0x232)], _0x599969 = this['isRightInputMode']() ? Graphics['boxWidth'] - _0x1abdc0 : 0x0; return new Rectangle(_0x599969, _0x3ded93, _0x1abdc0, _0x45034b); }, VisuMZ[_0x709961(0x3db)][_0x709961(0x1f6)] = Scene_Shop[_0x709961(0x5ef)][_0x709961(0x5fb)], Scene_Shop[_0x709961(0x5ef)][_0x709961(0x5fb)] = function () { const _0x8fe057 = _0x709961; VisuMZ[_0x8fe057(0x3db)][_0x8fe057(0x1f6)]['call'](this), this['isUseModernControls']() && this[_0x8fe057(0x38e)](); }, VisuMZ[_0x709961(0x3db)][_0x709961(0x2ad)] = Scene_Shop['prototype'][_0x709961(0x549)], Scene_Shop[_0x709961(0x5ef)][_0x709961(0x549)] = function () { const _0x17f417 = _0x709961; if (this[_0x17f417(0x289)]()) { if (_0x17f417(0x5c0) === 'ptTGt') return this[_0x17f417(0x507)](); else this['_cache_etypeIDs'][_0x2df66e['id']]['push'](_0x21f1f5); } else return VisuMZ[_0x17f417(0x3db)]['Scene_Shop_categoryWindowRect'][_0x17f417(0x376)](this); }, Scene_Shop[_0x709961(0x5ef)]['categoryWindowRectItemsEquipsCore'] = function () { const _0x1391a3 = _0x709961, _0x40b9ae = this['_commandWindow']['y'], _0x4977fc = this[_0x1391a3(0x1a6)][_0x1391a3(0x4ca)], _0x1bdd5f = this[_0x1391a3(0x6ac)](0x1, !![]), _0x223b21 = this['isRightInputMode']() ? Graphics[_0x1391a3(0x628)] - _0x4977fc : 0x0; return new Rectangle(_0x223b21, _0x40b9ae, _0x4977fc, _0x1bdd5f); }, Scene_Shop[_0x709961(0x5ef)][_0x709961(0x38e)] = function () { const _0x2963a8 = _0x709961; delete this[_0x2963a8(0x5cd)][_0x2963a8(0x4c3)]['ok'], delete this[_0x2963a8(0x5cd)][_0x2963a8(0x4c3)][_0x2963a8(0x320)]; }, VisuMZ[_0x709961(0x3db)][_0x709961(0x64a)] = Scene_Shop[_0x709961(0x5ef)][_0x709961(0x618)], Scene_Shop[_0x709961(0x5ef)]['createSellWindow'] = function () { const _0x5e2a3c = _0x709961; VisuMZ[_0x5e2a3c(0x3db)][_0x5e2a3c(0x64a)][_0x5e2a3c(0x376)](this), this['isUseItemsEquipsCoreUpdatedLayout']() && this[_0x5e2a3c(0x3ee)](); }, VisuMZ[_0x709961(0x3db)][_0x709961(0x19e)] = Scene_Shop[_0x709961(0x5ef)][_0x709961(0x513)], Scene_Shop[_0x709961(0x5ef)][_0x709961(0x513)] = function () { const _0x26412c = _0x709961; if (this['isUseItemsEquipsCoreUpdatedLayout']()) return this['sellWindowRectItemsEquipsCore'](); else { if ('FpZEC' === _0x26412c(0x23c)) return VisuMZ['ItemsEquipsCore'][_0x26412c(0x19e)][_0x26412c(0x376)](this); else _0x5cc281[_0x26412c(0x4ba)](_0xb417c7[_0x26412c(0x508)](_0x668d9)); } }, Scene_Shop[_0x709961(0x5ef)][_0x709961(0x288)] = function () { const _0x40a7e7 = _0x709961, _0x13e30d = this[_0x40a7e7(0x5cd)]['y'] + this[_0x40a7e7(0x5cd)][_0x40a7e7(0x232)], _0xc7f6d5 = Graphics[_0x40a7e7(0x628)] - this[_0x40a7e7(0x62f)](), _0x390f12 = this[_0x40a7e7(0x5e0)]() - this[_0x40a7e7(0x5cd)][_0x40a7e7(0x232)], _0x274fab = this[_0x40a7e7(0x2ef)]() ? Graphics[_0x40a7e7(0x628)] - _0xc7f6d5 : 0x0; return new Rectangle(_0x274fab, _0x13e30d, _0xc7f6d5, _0x390f12); }, Scene_Shop[_0x709961(0x5ef)]['postCreateSellWindowItemsEquipsCore'] = function () { const _0x2ebaf5 = _0x709961; this[_0x2ebaf5(0x449)]['setStatusWindow'](this['_statusWindow']); }, Scene_Shop['prototype']['statusWidth'] = function () { const _0x24c2cb = _0x709961; return VisuMZ[_0x24c2cb(0x3db)]['Settings'][_0x24c2cb(0x281)]['Width']; }, VisuMZ[_0x709961(0x3db)][_0x709961(0x1d8)] = Scene_Shop['prototype'][_0x709961(0x5c4)], Scene_Shop[_0x709961(0x5ef)][_0x709961(0x5c4)] = function () { const _0x5c692d = _0x709961; VisuMZ[_0x5c692d(0x3db)][_0x5c692d(0x1d8)][_0x5c692d(0x376)](this), this[_0x5c692d(0x289)]() && this[_0x5c692d(0x633)][_0x5c692d(0x314)](), this[_0x5c692d(0x449)][_0x5c692d(0x317)](); }, VisuMZ['ItemsEquipsCore'][_0x709961(0x358)] = Scene_Shop['prototype'][_0x709961(0x4cf)], Scene_Shop[_0x709961(0x5ef)]['commandBuy'] = function () { const _0x466ff2 = _0x709961; VisuMZ[_0x466ff2(0x3db)][_0x466ff2(0x358)][_0x466ff2(0x376)](this); if (this['isUseItemsEquipsCoreUpdatedLayout']()) { if (_0x466ff2(0x37d) === _0x466ff2(0x629)) { if (!this['active']) return ![]; if (!_0x238035[_0x466ff2(0x3db)][_0x466ff2(0x6b0)][_0x466ff2(0x6b4)][_0x466ff2(0x469)]) return ![]; return !![]; } else this[_0x466ff2(0x1d1)](); } }, Scene_Shop['prototype'][_0x709961(0x1d1)] = function () { const _0xd327e7 = _0x709961; this[_0xd327e7(0x5be)] = this[_0xd327e7(0x5be)] || 0x0, this[_0xd327e7(0x6e8)][_0xd327e7(0x1de)](this[_0xd327e7(0x5be)]); }, VisuMZ[_0x709961(0x3db)][_0x709961(0x4e7)] = Scene_Shop[_0x709961(0x5ef)][_0x709961(0x397)], Scene_Shop['prototype'][_0x709961(0x397)] = function () { const _0x9889f8 = _0x709961; VisuMZ[_0x9889f8(0x3db)][_0x9889f8(0x4e7)][_0x9889f8(0x376)](this); if (this['isUseItemsEquipsCoreUpdatedLayout']()) { if (_0x9889f8(0x33c) !== _0x9889f8(0x20b)) this[_0x9889f8(0x3b5)](); else return !![]; } if (this[_0x9889f8(0x6d8)]()) { if (_0x9889f8(0x249) !== _0x9889f8(0x305)) this['_categoryWindow'][_0x9889f8(0x1de)](0x0), this[_0x9889f8(0x55f)](); else return !!_0x1efd1c && _0x163253[_0x9889f8(0x5fe)] === _0x4281f4(_0x595117['$1']); } }, Scene_Shop[_0x709961(0x5ef)][_0x709961(0x3b5)] = function () { const _0x3c579f = _0x709961; this[_0x3c579f(0x6e8)][_0x3c579f(0x5b0)](), this[_0x3c579f(0x1a6)][_0x3c579f(0x5b0)](); }, VisuMZ[_0x709961(0x3db)][_0x709961(0x332)] = Scene_Shop[_0x709961(0x5ef)]['onBuyCancel'], Scene_Shop[_0x709961(0x5ef)][_0x709961(0x4f0)] = function () { const _0x4c7976 = _0x709961; VisuMZ[_0x4c7976(0x3db)][_0x4c7976(0x332)][_0x4c7976(0x376)](this), this['isUseItemsEquipsCoreUpdatedLayout']() && this['onBuyCancelItemsEquipsCore'](); }, Scene_Shop['prototype']['onBuyCancelItemsEquipsCore'] = function () { const _0x36db1a = _0x709961; this['_buyWindowLastIndex'] = this[_0x36db1a(0x6e8)][_0x36db1a(0x624)](), this[_0x36db1a(0x6e8)][_0x36db1a(0x314)](), this[_0x36db1a(0x6e8)]['deselect'](), this['_buyWindow']['smoothScrollTo'](0x0, 0x0), this[_0x36db1a(0x633)]['show'](), this[_0x36db1a(0x50e)][_0x36db1a(0x5b0)](); }, VisuMZ[_0x709961(0x3db)][_0x709961(0x285)] = Scene_Shop['prototype'][_0x709961(0x4ad)], Scene_Shop[_0x709961(0x5ef)]['onCategoryCancel'] = function () { const _0x20d51a = _0x709961; VisuMZ['ItemsEquipsCore'][_0x20d51a(0x285)][_0x20d51a(0x376)](this), this[_0x20d51a(0x289)]() && this[_0x20d51a(0x43b)](); }, Scene_Shop[_0x709961(0x5ef)][_0x709961(0x43b)] = function () { const _0x452b76 = _0x709961; this[_0x452b76(0x6e8)][_0x452b76(0x314)](), this[_0x452b76(0x1a6)]['show'](); }, VisuMZ[_0x709961(0x3db)]['Scene_Shop_onBuyOk'] = Scene_Shop[_0x709961(0x5ef)]['onBuyOk'], Scene_Shop[_0x709961(0x5ef)][_0x709961(0x4cd)] = function () { const _0x55eae7 = _0x709961; $gameTemp[_0x55eae7(0x327)] = !![], VisuMZ[_0x55eae7(0x3db)][_0x55eae7(0x3a8)][_0x55eae7(0x376)](this), $gameTemp['_bypassProxy'] = ![], this['_item'] = this[_0x55eae7(0x6e8)][_0x55eae7(0x24d)](); }, VisuMZ['ItemsEquipsCore'][_0x709961(0x1af)] = Scene_Shop[_0x709961(0x5ef)][_0x709961(0x22b)], Scene_Shop[_0x709961(0x5ef)]['buyingPrice'] = function () { const _0x290507 = _0x709961; $gameTemp[_0x290507(0x327)] = !![], this[_0x290507(0x3c2)] = this[_0x290507(0x6e8)][_0x290507(0x24d)](); const _0x50042a = VisuMZ[_0x290507(0x3db)][_0x290507(0x1af)][_0x290507(0x376)](this); return $gameTemp['_bypassProxy'] = ![], this[_0x290507(0x3c2)] = this['_buyWindow'][_0x290507(0x24d)](), _0x50042a; }, VisuMZ[_0x709961(0x3db)]['Scene_Shop_onSellOk'] = Scene_Shop[_0x709961(0x5ef)][_0x709961(0x573)], Scene_Shop[_0x709961(0x5ef)][_0x709961(0x573)] = function () { const _0x284f2b = _0x709961; VisuMZ[_0x284f2b(0x3db)][_0x284f2b(0x57c)][_0x284f2b(0x376)](this), this[_0x284f2b(0x289)]() && this[_0x284f2b(0x27a)](); }, Scene_Shop[_0x709961(0x5ef)][_0x709961(0x27a)] = function () { const _0x4bf399 = _0x709961; this[_0x4bf399(0x5cd)]['show'](); }, VisuMZ[_0x709961(0x3db)][_0x709961(0x1c9)] = Scene_Shop[_0x709961(0x5ef)][_0x709961(0x226)], Scene_Shop['prototype']['onSellCancel'] = function () { const _0x278097 = _0x709961; VisuMZ[_0x278097(0x3db)][_0x278097(0x1c9)][_0x278097(0x376)](this); this[_0x278097(0x6d8)]() && this[_0x278097(0x4ad)](); if (this[_0x278097(0x289)]()) { if (_0x278097(0x3d1) !== _0x278097(0x348)) this[_0x278097(0x50e)][_0x278097(0x5b0)](); else { const _0x4b6ceb = 'ELEMENT'; if (this[_0x278097(0x3b8)][_0x4b6ceb]) return this[_0x278097(0x3b8)][_0x4b6ceb]; if (this['_item']['damage'][_0x278097(0x2de)] <= -0x1) return _0x37959f[_0x278097(0x3db)]['Settings'][_0x278097(0x281)][_0x278097(0x2cb)]; else return this['_item'][_0x278097(0x553)][_0x278097(0x2de)] === 0x0 ? _0x4d61d4[_0x278097(0x3db)][_0x278097(0x6b0)][_0x278097(0x281)][_0x278097(0x5d2)] : _0x254da5[_0x278097(0x664)][this['_item'][_0x278097(0x553)][_0x278097(0x2de)]]; } } }, Scene_Shop['prototype'][_0x709961(0x417)] = function (_0x14dccf) { const _0x58e865 = _0x709961, _0x451ce4 = this['_item']; this[_0x58e865(0x3c2)] = _0x14dccf; const _0x53bd67 = this[_0x58e865(0x270)](); return this[_0x58e865(0x3c2)] = _0x451ce4, _0x53bd67; }, VisuMZ[_0x709961(0x3db)][_0x709961(0x54c)] = Scene_Shop['prototype'][_0x709961(0x270)], Scene_Shop[_0x709961(0x5ef)][_0x709961(0x270)] = function () { const _0x17c0ec = _0x709961; let _0x3a1202 = this[_0x17c0ec(0x3ff)](); const _0x56e24c = this[_0x17c0ec(0x3c2)]; return _0x3a1202 = VisuMZ['ItemsEquipsCore']['Settings'][_0x17c0ec(0x300)][_0x17c0ec(0x4fb)][_0x17c0ec(0x376)](this, _0x56e24c, _0x3a1202), _0x3a1202; }, Scene_Shop[_0x709961(0x5ef)]['determineBaseSellingPrice'] = function () { const _0x45b38f = _0x709961; let _0x5beef1 = this[_0x45b38f(0x3c2)]['price']; if (!this[_0x45b38f(0x3c2)]) return 0x0; else { if (this[_0x45b38f(0x3c2)][_0x45b38f(0x1e9)][_0x45b38f(0x1ed)](/<JS SELL PRICE>\s*([\s\S]*)\s*<\/JS SELL PRICE>/i)) { const _0x4665f9 = String(RegExp['$1']); window['item'] = this[_0x45b38f(0x3c2)], window['price'] = _0x5beef1 * this['sellPriceRate'](); try { if (_0x45b38f(0x4e4) === _0x45b38f(0x4e4)) eval(_0x4665f9); else { const _0x35b4b0 = _0x3984fa[_0x45b38f(0x692)]('[' + _0x3fd571['$1'][_0x45b38f(0x1ed)](/\d+/g) + ']'); for (const _0x285bfd of _0x35b4b0) { if (!_0x18177f['value'](_0x285bfd)) return ![]; } return !![]; } } catch (_0xcf346) { if ($gameTemp['isPlaytest']()) console[_0x45b38f(0x4df)](_0xcf346); } let _0x1caf8d = window[_0x45b38f(0x518)]; window[_0x45b38f(0x24d)] = undefined, window['price'] = undefined; if (isNaN(_0x1caf8d)) _0x1caf8d = 0x0; return Math[_0x45b38f(0x4e5)](_0x1caf8d); } else { if (this['_item'][_0x45b38f(0x1e9)][_0x45b38f(0x1ed)](/<SELL PRICE:[ ](\d+)>/i)) { if (_0x45b38f(0x427) !== _0x45b38f(0x427)) { const _0x27aca0 = _0x45b38f(0x5fa); if (this[_0x45b38f(0x3b8)][_0x27aca0]) return this['_customItemInfo'][_0x27aca0]; let _0x53bcf7 = ''; return _0x53bcf7 += _0x45b38f(0x367)['format'](this[_0x45b38f(0x6f3)][_0x45b38f(0x5b1)]), _0x53bcf7; } else return parseInt(RegExp['$1']); } else return Math['floor'](this['baseSellingPrice']()); } } }, Scene_Shop[_0x709961(0x5ef)]['baseSellingPrice'] = function () { const _0x84c275 = _0x709961; return this[_0x84c275(0x3c2)]['price'] * this[_0x84c275(0x590)](); }, Scene_Shop[_0x709961(0x5ef)][_0x709961(0x590)] = function () { const _0x4a376d = _0x709961; return VisuMZ[_0x4a376d(0x3db)][_0x4a376d(0x6b0)][_0x4a376d(0x300)][_0x4a376d(0x254)]; }, Scene_Shop[_0x709961(0x5ef)]['buttonAssistItemListRequirement'] = function () { const _0x720a55 = _0x709961; if (!this[_0x720a55(0x4fa)]()) return ![]; if (!this[_0x720a55(0x6d8)]()) return ![]; if (!this[_0x720a55(0x449)]) return ![]; if (!this['_sellWindow'][_0x720a55(0x3bd)]) return ![]; return this[_0x720a55(0x4fa)]() && this['isUseModernControls'](); }, Scene_Shop[_0x709961(0x5ef)]['buttonAssistKey1'] = function () { const _0x27722a = _0x709961; if (this[_0x27722a(0x484)]()) { if (this[_0x27722a(0x449)]['maxCols']() === 0x1) { if (_0x27722a(0x3c7) !== 'eHTWG') return TextManager[_0x27722a(0x4bd)](_0x27722a(0x316), _0x27722a(0x4b9)); else { const _0x2b7959 = this[_0x27722a(0x62f)](), _0x22f8ff = this[_0x27722a(0x5e0)]() - this[_0x27722a(0x1a6)][_0x27722a(0x232)], _0x1d5cda = this[_0x27722a(0x2ef)]() ? 0x0 : _0x56d12d[_0x27722a(0x628)] - _0x2b7959, _0x286b74 = this['_commandWindow']['y'] + this[_0x27722a(0x1a6)][_0x27722a(0x232)]; return new _0x25752c(_0x1d5cda, _0x286b74, _0x2b7959, _0x22f8ff); } } else return TextManager[_0x27722a(0x4bd)](_0x27722a(0x277), _0x27722a(0x5af)); } else { if (this[_0x27722a(0x502)] && this[_0x27722a(0x502)][_0x27722a(0x3bd)]) { if (_0x27722a(0x438) !== _0x27722a(0x438)) { const _0x83011e = _0x5179bc(_0x500d78['$1'])[_0x27722a(0x617)](/[\r\n]+/); for (const _0x33744f of _0x83011e) { if (_0x33744f[_0x27722a(0x1ed)](/(.*):[ ](.*)/i)) { const _0x43a157 = _0x2b0185(_0x4bff24['$1'])[_0x27722a(0x45c)]()[_0x27722a(0x3c4)](), _0x5f3fe1 = _0x22d1db(_0x459312['$2'])[_0x27722a(0x3c4)](); this[_0x27722a(0x3b8)][_0x43a157] = _0x5f3fe1; } } } else return TextManager['getInputMultiButtonStrings'](_0x27722a(0x316), _0x27722a(0x4b9)); } } return Scene_MenuBase[_0x27722a(0x5ef)][_0x27722a(0x3a2)][_0x27722a(0x376)](this); }, Scene_Shop[_0x709961(0x5ef)][_0x709961(0x5cc)] = function () { const _0xba843c = _0x709961; if (this[_0xba843c(0x502)] && this[_0xba843c(0x502)][_0xba843c(0x3bd)]) return TextManager[_0xba843c(0x4bd)]('up', 'down'); return Scene_MenuBase['prototype'][_0xba843c(0x5cc)][_0xba843c(0x376)](this); }, Scene_Shop[_0x709961(0x5ef)][_0x709961(0x211)] = function () { const _0x395cca = _0x709961; if (this[_0x395cca(0x484)]()) { if ('NiVhw' !== 'NiVhw') _0x39768c[_0x395cca(0x5c1)](_0x395cca(0x5af)) && _0x1b99e4[_0x395cca(0x40b)](_0x395cca(0x5ce)) && this[_0x395cca(0x222)](), _0x49a62d['isTriggered'](_0x395cca(0x277)) && _0x566158[_0x395cca(0x40b)](_0x395cca(0x5ce)) && this['cursorPageup'](); else return VisuMZ['ItemsEquipsCore']['Settings'][_0x395cca(0x309)]['buttonAssistCategory']; } else { if (this['_numberWindow'] && this[_0x395cca(0x502)][_0x395cca(0x3bd)]) { if (_0x395cca(0x4d5) !== _0x395cca(0x4d5)) { if (!this[_0x395cca(0x3af)](_0x47a21b, this[_0x395cca(0x673)]()[_0x1c8835])) return; if (_0x5464e0) { const _0x31ad84 = _0x308a6c[_0x395cca(0x323)](_0x514dd1); if (!_0x31ad84[_0x395cca(0x3bb)](this['equipSlots']()[_0x4efdd3])) return; } this[_0x395cca(0x5fd)][_0x5cd981][_0x395cca(0x299)](_0x124542); if (_0x890cd2[_0x395cca(0x3db)][_0x395cca(0x546)](_0x5edc3b)) { const _0x3fdc24 = _0x23f08b[_0x395cca(0x3db)][_0x395cca(0x6b0)][_0x395cca(0x6b4)]['CursedTextPopup'] || '', _0x5274a1 = this[_0x395cca(0x5a7)](), _0x443791 = '\x5cI[%1]'[_0x395cca(0x60c)](_0x2a3c18[_0x395cca(0x4a7)]), _0x56ae36 = _0x19b0a8[_0x395cca(0x5a7)] || ''; let _0x249015 = _0x3fdc24['format'](_0x5274a1, _0x443791, _0x56ae36); if (_0x249015[_0x395cca(0x321)] > 0x0) _0x4819dc(_0x249015); } this[_0x395cca(0x349)](); } else return VisuMZ[_0x395cca(0x3db)]['Settings'][_0x395cca(0x300)][_0x395cca(0x200)]; } } return Scene_MenuBase['prototype'][_0x395cca(0x211)][_0x395cca(0x376)](this); }, Scene_Shop['prototype'][_0x709961(0x39a)] = function () { const _0x2b86ec = _0x709961; if (this[_0x2b86ec(0x502)] && this[_0x2b86ec(0x502)]['active']) return 'fJmXh' !== _0x2b86ec(0x2f0) ? this[_0x2b86ec(0x237)](_0xe5034b[_0x2b86ec(0x4f2)]) : VisuMZ['ItemsEquipsCore'][_0x2b86ec(0x6b0)]['ShopScene'][_0x2b86ec(0x420)]; return Scene_MenuBase['prototype'][_0x2b86ec(0x39a)][_0x2b86ec(0x376)](this); }, Scene_Shop[_0x709961(0x5ef)][_0x709961(0x4dd)] = function () { const _0x312f83 = _0x709961; if (!SceneManager['isSceneShop']()) return; const _0x556a3b = VisuMZ[_0x312f83(0x3db)]['Settings'][_0x312f83(0x300)]; if (_0x556a3b['SwitchBuy']) { if ('uEsKx' !== _0x312f83(0x488)) return _0xadc135[_0x312f83(0x32e)]; else $gameSwitches[_0x312f83(0x32c)](_0x556a3b[_0x312f83(0x4a9)], ![]); } _0x556a3b[_0x312f83(0x4a5)] && ('zaWYq' === _0x312f83(0x65f) ? _0x464719 = _0x23a592[_0x312f83(0x24d)] : $gameSwitches[_0x312f83(0x32c)](_0x556a3b[_0x312f83(0x4a5)], ![])); }, VisuMZ[_0x709961(0x3db)][_0x709961(0x4fe)] = Scene_Shop['prototype'][_0x709961(0x42c)], Scene_Shop[_0x709961(0x5ef)][_0x709961(0x42c)] = function (_0xb82a3b) { const _0x20ed2b = _0x709961; VisuMZ[_0x20ed2b(0x3db)][_0x20ed2b(0x4fe)][_0x20ed2b(0x376)](this, _0xb82a3b), this[_0x20ed2b(0x418)](this[_0x20ed2b(0x3c2)], _0xb82a3b); if (_0xb82a3b <= 0x0) return; const _0x5c8d7c = VisuMZ['ItemsEquipsCore']['Settings'][_0x20ed2b(0x300)]; _0x5c8d7c[_0x20ed2b(0x4a9)] && $gameSwitches[_0x20ed2b(0x32c)](_0x5c8d7c[_0x20ed2b(0x4a9)], !![]), this[_0x20ed2b(0x6e8)]['refresh'](), this[_0x20ed2b(0x449)][_0x20ed2b(0x349)](); }, Scene_Shop[_0x709961(0x5ef)][_0x709961(0x418)] = function (_0x4397d2, _0xe3848d) { const _0x39742b = _0x709961; this[_0x39742b(0x509)](_0x4397d2, _0xe3848d), $gameParty[_0x39742b(0x28c)](_0x4397d2, _0xe3848d), $gameParty[_0x39742b(0x64b)](_0xe3848d * this['buyingPrice']()); }, Scene_Shop[_0x709961(0x5ef)][_0x709961(0x509)] = function (_0x25bd99, _0x59a81f) { const _0x434f9c = _0x709961; if (!_0x25bd99) return; if (!_0x59a81f) return; const _0x5abbe1 = VisuMZ['ItemsEquipsCore'][_0x434f9c(0x4ae)], _0x121653 = _0x25bd99[_0x434f9c(0x1e9)] || ''; if (_0x121653['match'](_0x5abbe1[_0x434f9c(0x352)])) { const _0x35d73c = String(RegExp['$1'])[_0x434f9c(0x617)](',')['map'](_0x2d8d57 => Number(_0x2d8d57)); for (const _0x2641ae of _0x35d73c) { $gameSwitches[_0x434f9c(0x32c)](_0x2641ae, !![]); } } if (_0x121653[_0x434f9c(0x1ed)](_0x5abbe1[_0x434f9c(0x5fc)])) { const _0x165af5 = String(RegExp['$1'])[_0x434f9c(0x617)](',')['map'](_0x43fa6a => Number(_0x43fa6a)); for (const _0x592d8d of _0x165af5) { $gameSwitches[_0x434f9c(0x32c)](_0x592d8d, ![]); } } }, VisuMZ[_0x709961(0x3db)][_0x709961(0x3d3)] = Scene_Shop[_0x709961(0x5ef)][_0x709961(0x3c0)], Scene_Shop[_0x709961(0x5ef)][_0x709961(0x3c0)] = function (_0x53177b) { const _0x40fa59 = _0x709961; VisuMZ[_0x40fa59(0x3db)][_0x40fa59(0x3d3)][_0x40fa59(0x376)](this, _0x53177b), this[_0x40fa59(0x39f)](this['_item'], _0x53177b); if (_0x53177b <= 0x0) return; const _0x1cd075 = VisuMZ[_0x40fa59(0x3db)][_0x40fa59(0x6b0)][_0x40fa59(0x300)]; if (_0x1cd075['SwitchBuy']) { if (_0x40fa59(0x2a4) === 'OsZdK') { this[_0x40fa59(0x56a)] = ![]; if (this[_0x40fa59(0x565)]()) { const _0x1e65bc = this[_0x40fa59(0x624)](), _0x2d73ee = this[_0x40fa59(0x2bb)](); _0x2d73ee >= 0x0 && _0x2d73ee !== this[_0x40fa59(0x624)]() && this[_0x40fa59(0x2a0)](_0x2d73ee), _0xbb612c && this[_0x40fa59(0x624)]() !== _0x1e65bc && this['playCursorSound'](); } } else $gameSwitches[_0x40fa59(0x32c)](_0x1cd075[_0x40fa59(0x4a5)], !![]); } this[_0x40fa59(0x6e8)][_0x40fa59(0x349)](), this[_0x40fa59(0x449)][_0x40fa59(0x349)](); }, Scene_Shop[_0x709961(0x5ef)][_0x709961(0x39f)] = function (_0x3c79ee, _0x47a2e7) { const _0x4cbac0 = _0x709961; this['processShopCondListingOnSellItem'](_0x3c79ee, _0x47a2e7), $gameParty[_0x4cbac0(0x2cc)](_0x3c79ee, _0x47a2e7), $gameParty[_0x4cbac0(0x37e)](_0x47a2e7 * this['sellingPrice']()); }, Scene_Shop[_0x709961(0x5ef)][_0x709961(0x22e)] = function (_0x56fc25, _0x5185d0) { const _0x10ee98 = _0x709961; if (!_0x56fc25) return; if (!_0x5185d0) return; const _0x321d94 = VisuMZ[_0x10ee98(0x3db)][_0x10ee98(0x4ae)], _0x1a9111 = _0x56fc25[_0x10ee98(0x1e9)] || ''; if (_0x1a9111[_0x10ee98(0x1ed)](_0x321d94['SellTurnSwitchOn'])) { const _0x553984 = String(RegExp['$1'])[_0x10ee98(0x617)](',')[_0x10ee98(0x1ac)](_0x298669 => Number(_0x298669)); for (const _0x5d1729 of _0x553984) { if ('aghXB' !== 'aghXB') return !this['nonRemovableEtypes']()[_0x10ee98(0x3bb)](this[_0x10ee98(0x5fe)]()); else $gameSwitches[_0x10ee98(0x32c)](_0x5d1729, !![]); } } if (_0x1a9111[_0x10ee98(0x1ed)](_0x321d94[_0x10ee98(0x642)])) { if (_0x10ee98(0x5f8) === _0x10ee98(0x4c1)) this[_0x10ee98(0x5be)] = this[_0x10ee98(0x6e8)]['index'](), this['_buyWindow'][_0x10ee98(0x314)](), this[_0x10ee98(0x6e8)][_0x10ee98(0x6cb)](), this['_buyWindow'][_0x10ee98(0x53c)](0x0, 0x0), this[_0x10ee98(0x633)][_0x10ee98(0x314)](), this['_dummyWindow'][_0x10ee98(0x5b0)](); else { const _0x437169 = String(RegExp['$1'])[_0x10ee98(0x617)](',')[_0x10ee98(0x1ac)](_0x4c75c7 => Number(_0x4c75c7)); for (const _0x2d903f of _0x437169) { $gameSwitches[_0x10ee98(0x32c)](_0x2d903f, ![]); } } } }; function Sprite_NewLabel() { const _0x3ffd83 = _0x709961; this[_0x3ffd83(0x527)](...arguments); } function _0x2c86(_0x337ec8, _0x315b81) { const _0x5bde49 = _0x5bde(); return _0x2c86 = function (_0x2c86ef, _0x1fd6ff) { _0x2c86ef = _0x2c86ef - 0x19c; let _0x485bdb = _0x5bde49[_0x2c86ef]; return _0x485bdb; }, _0x2c86(_0x337ec8, _0x315b81); } function _0x5bde() { const _0x5b7d28 = ['onCategoryOk', 'TegKy', 'createItemWindow', '?????', 'getMatchingInitEquip', '\x5cb%1\x5cb', 'isCursorMovable', 'test', 'ykEWB', 'goldWindowRectItemsEquipsCore', 'NeEWA', '_doubleTouch', 'CmdIconCancel', 'Step2Start', 'mekbR', 'start', 'setText', 'bvsEW', 'Scene_Equip_onActorChange', 'isNewItem', 'onSellOk', 'EFFECT_RECOVER_HP', 'drawItemSpeed', 'isEquipTypeSealed', 'ARRAYNUM', 'CommandAddClear', 'mgjVr', 'getPurifyTransformation', 'setItem', 'Scene_Shop_onSellOk', 'setTopRow', 'cursorPageup', 'drawItemDamageAmount', 'random', 'Actors', 'abIKw', 'LabelApply', 'BatchShop', 'isShiftShortcutKeyForRemove', 'sbwOX', 'drawActorCharacter', 'NoChangeMarker', 'LabelDamageTP', 'Scene_Shop_helpWindowRect', 'getItemEffectsMpRecoveryLabel', 'EFFECT_REMOVE_DEBUFF', 'registerCommand', 'mainFontSize', 'needsNewTempActor', 'sellPriceRate', 'Scene_Shop_prepare', 'Window_Selectable_initialize', 'KNpkW', 'NgRtj', 'gIsfS', 'drawItemEffectsTpDamage', 'Translucent', 'foreground', 'SpeedNeg1999', 'fontFace', 'initShopTrackingData', 'addCancelCommand', 'zwzEQ', 'isClearCommandEnabled', 'statusWindowRect', 'clearCmdDesc', 'vYjbG', 'bestEquipItem', 'AllArmors', 'updateChangedSlots', 'equipCmdDesc', 'meetsItemConditions', 'name', 'mainCommandWidth', 'UcidE', 'Game_Party_initialize', 'isCancelled', 'getItemEffects', 'drawNewLabelText', 'Scene_Shop', 'pagedown', 'hide', 'gainTP', '_classIDs', 'DWPsr', '_paramPlus', 'getItemDamageAmountLabelBattleCore', 'CONSUMABLE', 'Scene_Item_createItemWindow', 'ItemQuantityFmt', 'vPPgO', 'gGhxW', 'CmdIconOptimize', 'CtVFD', 'WYOmi', '_buyWindowLastIndex', 'Scene_Equip_slotWindowRect', 'ptTGt', 'isTriggered', 'ARMOR', 'canConsumeItem', 'activateSellWindow', 'getItemEffectsAddedStatesBuffsLabel', 'AacgG', 'isTroopArtifact', 'Window_EquipItem_includes', 'drawing', 'luk', 'colSpacing', 'buttonAssistKey2', '_categoryWindow', 'shift', '_shopTrackingData', 'playCursorSound', 'SYsbK', 'ElementNone', 'Game_Party_gainItem', 'categories', 'FontFace', 'fill', 'uPKtC', 'GLvfL', 'getEtypeIdWithName', '_getClassRequirements', 'postCreateSlotWindowItemsEquipsCore', 'DjWPZ', 'Parse_Notetags_Prices', '%1\x27s\x20version\x20does\x20not\x20match\x20plugin\x27s.\x20Please\x20update\x20it\x20in\x20the\x20Plugin\x20Manager.', '10435932VCEaOh', 'mainAreaHeight', 'drawItemEffectsHpDamage', 'PurifyParty', 'lIeUg', 'createStatusWindow', 'weaponTypes', 'LabelDamageMP', 'getItemEffectsTpRecoveryLabel', 'addWindow', 'ITEMS_EQUIPS_CORE', 'placeNewLabel', 'BmNgN', 'currentExt', 'drawItemEffectsMpDamage', 'normalColor', 'prototype', 'refreshActor', 'vjVmm', 'limitedPageUpDownSceneCheck', 'makeItemList', 'ZXxvC', 'max', 'NotConsumable', 'FieldUsable', 'gJrEF', 'createCommandWindow', 'TP\x20RECOVERY', 'createCategoryWindow', 'BuyTurnSwitchOff', '_equips', 'etypeId', 'wpEOl', 'isSellCommandEnabled', 'Step3End', 'drawItem', 'OTnqU', 'ktmun', 'DOcTD', 'refreshCursor', 'eWiCK', 'getItemEffectsAddedStatesBuffsText', 'qQJMQ', '(+%1)', 'blt', 'format', 'meetsItemConditionsNotetags', 'buttonAssistText3', 'helpAreaHeight', 'StatusWindowWidth', 'aSpNN', 'aiUkS', 'MP\x20RECOVERY', 'ATK', 'VisuMZ_0_CoreEngine', '_forcedSlots', 'split', 'createSellWindow', 'RemoveEquipText', 'itemWindowRectItemsEquipsCore', 'REqdK', 'changeTextColor', '_checkEquipRequirements', 'processCursorMove', 'processDrawIcon', 'DrawFaceJS', '+%1%', 'ttnYn', 'drawParamText', 'index', 'anyEmptyEquipSlotsOfSameEtype', 'commandName', 'qjSbj', 'boxWidth', 'dxMva', 'isSceneShop', 'eSbTk', 'drawText', 'drawItemOccasion', 'meetsClassRequirements', 'statusWidth', '_scrollDuration', 'ItemQuantityFontSize', 'ZtzEK', '_statusWindow', 'getItemRepeatsText', '_skillIDs', 'refreshActorEquipSlotsIfUpdated', 'textColor', 'Game_Actor_paramPlus', 'isClearCommandAdded', 'params', 'cdjPG', 'lbZrd', 'mainFontFace', 'LabelElement', 'afUvP', 'CmdIconEquip', 'onActorChange', 'SellTurnSwitchOff', 'repeats', 'ouUDr', 'cFXVW', 'hasItem', 'Game_Party_setupBattleTestItems_artifact', 'buttonAssistKey3', 'cursorUp', 'Scene_Shop_createSellWindow', 'addShopTrackingGoldBuy', 'TP\x20DAMAGE', '\x0a\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20let\x20enabled\x20=\x20true;\x0a\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20const\x20user\x20=\x20this;\x0a\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20const\x20target\x20=\x20this;\x0a\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20const\x20a\x20=\x20this;\x0a\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20const\x20b\x20=\x20this;\x0a\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20try\x20{\x0a\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20%1\x0a\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20}\x20catch\x20(e)\x20{\x0a\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20if\x20($gameTemp.isPlaytest())\x20console.log(e);\x0a\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20}\x0a\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20return\x20enabled;\x0a\x20\x20\x20\x20\x20\x20\x20\x20', 'getItemEffectsTpDamageText', 'createSlotWindow', '930408qXajQA', 'VisuMZ_1_MainMenuCore', 'Eeohh', 'update', 'ConvertParams', 'categoryStyle', '2894288tvzAEX', 'QPhfe', 'BackRectColor', 'Parse_Notetags_ParamJS', 'onSlotOkAutoSelect', 'loseItem', 'USER\x20TP\x20GAIN', 'possession', 'activateItemWindow', 'QvkQG', 'EFFECT_REMOVE_STATE', '_calculatingJSParameters', 'parameters', 'ZoBmU', 'elements', 'getItemIdWithName', 'isPartyArtifact', 'LabelRecoverHP', 'PqhUF', 'rateMP', 'textSizeEx', 'ifQty', 'bLHpB', 'czBmw', 'AllItems', 'dataId', 'RBdDE', 'YEAbt', 'filter', 'equips', 'Window_ItemList_updateHelp', 'CmdCancelRename', 'isArtifact', 'troopArtifactIDs', 'setNewItem', 'EquipParams', 'isWeapon', 'helpWindowRect', 'LabelRemove', 'defaultItemMax', 'processCursorMoveModernControls', 'actor', 'hhmHx', 'OffsetY', 'ScopeRandomAllies', 'oDCHZ', 'flatMP', 'Scene_Shop_numberWindowRect', 'qxKzj', 'meetsEquipRequirement', 'EFFECT_ADD_DEBUFF', 'LXoLc', 'Scene_Item', 'emNSQ', 'values', 'fillRect', 'KeyItems', 'placeItemNewLabel', 'commandNameWindowDrawText', 'AbUAu', 'parse', 'MRAZT', 'artifacts', '_purchaseOnly', 'getTextColor', 'systemColor', 'isEquipChangeOk', 'getItemDamageElementLabel', 'drawParamName', '_newLabelOpacityChange', 'sortListItemScene', 'selfTP', 'SPEED', 'meetsEquipRequirements', 'initEquips', 'setShopStatusWindowMode', 'LJHNs', 'Step2End', 'WgsyQ', 'consumable', 'fJypc', 'getItemsEquipsCoreBackColor2', 'DNdYr', 'zVOgc', 'categoryStyleCheck', 'processHandling', 'calcWindowHeight', 'isPageChangeRequested', 'Game_Actor_discardEquip', 'TPIkm', 'Settings', 'clearNewItem', 'Window_EquipCommand_initialize', 'ARRAYSTR', 'EquipScene', 'LMfEW', 'setStatusWindow', 'lBYgR', 'version', 'wqGZk', 'drawTextEx', 'CoosO', 'isGoodShown', 'UoqaT', 'atk', 'Scene_Equip_helpWindowRect', 'Window_EquipItem_isEnabled', '_scene', 'EFFECT_RECOVER_MP', 'XZDHg', 'HToGo', 'HP\x20RECOVERY', '×%1', 'Scene_Shop_statusWindowRect', 'EvhLO', 'isEquipCommandEnabled', 'innerHeight', 'deselect', 'adjustHiddenShownGoods', 'Damage\x20Formula\x20Error\x20for\x20%1', 'dkcII', 'initNewLabelSprites', 'Game_Actor_isEquipChangeOk', 'removeDebuff', 'ckpAf', 'MenuPortraits', 'currentClass', 'XUENO', 'YXocE', 'WEAPON', 'isUseModernControls', 'Scene_Equip_commandWindowRect', 'changeBuff', 'getItemScopeText', 'category', 'qUbdM', 'iwVhL', 'deactivate', 'setHp', 'SetupProxyItemGroup', 'paramPlus', 'getItemDamageElementText', 'exit', 'CmdHideDisabled', 'CousE', 'AlwaysUsable', '_buyWindow', 'drawItemSuccessRate', 'createTempActorEquips', 'getItemEffectsMpDamageText', 'drawCustomShopGraphicLoad', 'getItemDamageAmountLabelOriginal', 'zoRZq', 'drawItemData', 'Scene_Shop_buyWindowRect', 'getItemDamageAmountText', 'KeyItemProtect', '_itemData', '_newLabelSprites', 'dcVCF', 'KUGAm', 'Scene_Shop_sellWindowRect', '#%1', 'createNewLabelSprite', 'getShopTrackingData', 'Scene_Equip_statusWindowRect', 'Zshug', 'meetsShopListingConditions', 'IncludeShopItem', '_commandWindow', 'DUUwL', 'vdYQV', 'znfKy', 'Scene_Boot_onDatabaseLoaded', 'uhkOr', 'map', 'LabelSpeed', 'Window_ShopCommand_initialize', 'Scene_Shop_buyingPrice', 'postCreateItemWindowModernControls', 'glwjf', 'Scene_Equip_create', 'eubfC', 'onSlotOk', 'Scene_Equip_itemWindowRect', 'Step3Start', 'Whitelist', 'BuJzT', 'sell', 'yzvjn', 'numberWindowRectItemsEquipsCore', 'ParseItemNotetags', '_allowArtifactTraitObjects', 'commandStyle', 'MP\x20DAMAGE', 'resetTextColor', 'onTouchCancel', 'JSON', 'previousActor', 'currentSymbol', 'background', 'Scope1', 'pVYgA', 'Parse_Notetags_Batch', 'Scene_Shop_onSellCancel', 'Speed1', 'addCommand', 'allMembers', 'Scene_Shop_goldWindowRect', 'updateCommandNameWindow', 'cursorDown', 'AnyGJ', 'commandBuyItemsEquipsCore', 'drawItemEffectsSelfTpGain', 'removeState', 'gold', 'changeEquipBase', 'onTouchSelectModernControls', 'nntEd', 'Scene_Shop_activateSellWindow', 'gaugeBackColor', 'addItemCategories', 'def', 'bMTmr', 'PLjzr', 'smoothSelect', 'helpDescriptionText', 'Window_Selectable_refresh', 'traitObjects', 'tyTdZ', 'getItemSuccessRateLabel', 'BAROq', 'Scene_Item_itemWindowRect', 'wbBQw', 'BattleUsable', 'Scope%1', 'note', 'buffIconIndex', '6453895XqFxby', 'maxItemAmount', 'match', 'isHoverEnabled', 'IzTQr', 'getShopTrackingItemBuy', 'getMenuImage', 'clearEquipments', 'commandWindowRectItemsEquipsCore', 'DrawEquipData', 'drawItemActorMenuImage', 'Scene_Shop_createCategoryWindow', 'visible', 'hitType', 'itemWindowRect', 'getItemEffectsTpDamageLabel', 'maxItems', 'HP\x20DAMAGE', 'KMKtB', 'FadeLimit', 'createBitmap', 'buttonAssistSmallIncrement', 'isOptimizeCommandEnabled', 'isClearEquipOk', 'vVYQB', 'lwcRV', 'IconSet', 'ACjcH', 'SetupArtifactItemIDs', 'isBattleTest', 'getItemEffectsRemovedStatesBuffsLabel', 'Window_ItemCategory_setItemWindow', 'vSEIg', 'hideDisabledCommands', 'WzaVQ', 'itemHasEquipLimit', 'ceil', 'addState', 'buttonAssistText1', 'lMfqB', 'maxBattleMembers', '_weaponIDs', 'getSkillIdWithName', '_shopStatusMenuMode', 'some', '52602axNNVH', 'optimizeCmdDesc', 'PurifyActors', 'pop', 'mmp', '16805390SHuCGx', 'EFFECT_ADD_STATE', '54TxPEdD', 'icon', 'DrawParamJS', 'cursorPagedown', 'jMljf', 'innerWidth', 'Game_BattlerBase_param', 'onSellCancel', 'Scene_Item_categoryWindowRect', 'STRUCT', 'FontSize', 'canShiftRemoveEquipment', 'buyingPrice', '_categoryNameWindow', 'hasOwnProperty', 'processShopCondListingOnSellItem', 'aJisa', 'isEquipCommandAdded', 'IVMDe', 'height', 'QQwYN', 'lCBDk', 'Game_Actor_tradeItemWithParty', 'onSlotCancel', 'isEquipWtypeOk', 'HmycV', 'isKeyItem', 'qAmOD', 'ParseClassNotetags', 'FpZEC', 'buyWindowRect', 'maxmp', 'paramPlusItemsEquipsCoreCustomJS', 'getEtypeIDsCache', 'status', 'AllWeapons', 'newLabelEnabled', 'drawItemRepeats', 'PkAry', 'formula', 'FBMdh', 'addBuyCommand', 'nzyOb', 'getItemEffectsSelfTpGainLabel', 'isEnabled', 'damageColor', 'item', 'proxyItem', 'MaxHP', 'getItemHitTypeText', 'IAHRp', 'equipSlots', 'Speed2000', 'SellPriceRate', 'optimizeEquipments', 'create', 'isPurifyItemSwapOk', 'NkYQO', 'Game_Party_gainItem_artifact', 'drawIcon', '_goodsCount', 'windowPadding', 'commandNameWindowDrawBackground', 'UWgkE', 'XmZNL', 'adjustItemWidthByStatus', 'REbZo', '_bypassNewLabel', '_allowArtifactParamBase', 'MbYiX', 'XyTMd', 'onBuyCancelItemsEquipsCore', 'equipAdjustHpMp', 'drawItemCost', 'armor-%1', 'UfIEg', 'VisuMZ_2_WeaponSwapSystem', 'LUK', 'RegularItems', 'ShopMenuStatusStandard', 'Game_Actor_changeEquip', 'sellingPrice', 'addChild', 'Scene_Equip_commandEquip', 'onMenuImageLoad', 'changeEquip', '_category', 'NIrAs', 'pageup', 'getWeaponIdWithName', 'removeBuff', 'onSellOkItemsEquipsCore', 'itemTextAlign', 'OMjfj', 'paramValueFontSize', 'OCCASION', 'isRepeated', 'updateCategoryNameWindow', 'StatusWindow', 'ejvPa', 'ExtDisplayedParams', 'round', 'Scene_Shop_onCategoryCancel', 'Scene_Load_reloadMapIfUpdated', 'prepareNextScene', 'sellWindowRectItemsEquipsCore', 'isUseItemsEquipsCoreUpdatedLayout', 'playEquip', '_cache_etypeIDs', 'addShopTrackingItemBuy', 'Scene_ItemBase_activateItemWindow', 'buyWindowRectItemsEquipsCore', 'auto', 'nonRemovableEtypes', 'addItemCategory', 'CommandAddOptimize', 'members', 'currencyUnit', 'Window_ItemList_item', 'Parse_Notetags_Category', '\x5cI[%1]%2', 'powerDownColor', 'setObject', 'categoryList', 'Categories', 'REPEAT', 'paramValueByName', 'Parse_Notetags_EnableJS', 'mxvmC', 'select', 'translucentOpacity', 'characterName', 'flatHP', 'qLdHb', 'gainItem', 'Game_Actor_artifact', 'vTiqR', 'aAOfq', 'clearNewLabelFromItem', 'HiddenItemB', 'Scene_Shop_create', 'playBuzzerSound', 'Scene_Shop_categoryWindowRect', 'ScopeAllyOrEnemy', 'drawActorParamDifference', 'edoth', 'drawItemEffectsTpRecovery', 'DkCoo', 'vuHSL', 'isShowNew', 'nMgpv', 'hVDzX', 'commandStyleCheck', '_buttonAssistWindow', 'Remove\x20all\x20available\x20equipment.', 'isArray', 'hitIndex', 'qgavq', 'Scene_Shop_commandWindowRect', 'goodsToItem', 'setupBattleTestItems', 'OfcmW', 'setHelpWindowItem', 'drawItemKeyData', '_helpWindow', 'Window_ItemList_makeItemList', 'getItemColor', 'object', 'getItemEffectsHpDamageLabel', 'setHandler', 'equipTypes', 'prepareRefreshItemsEquipsCoreLayout', 'ElementWeapon', 'addShopTrackingItemSell', 'user', 'kgxWR', 'mpRate', 'min', '_bypassReleaseUnequippableItemsItemsEquipsCore', 'geUpdatedLayoutStatusWidth', 'Game_Party_numItems', 'Icon', 'processCursorHomeEndTrigger', 'SetupProxyItemGroups', 'sUqkT', 'fontSizeRatio', 'nSPrb', '_etypeIDs', 'Step1Start', 'prepare', 'setItemDelay', 'elementId', 'getItemDamageAmountLabel', 'YygoU', 'uiInputPosition', 'getItemQuantityText', 'aPwhA', 'YnQFQ', 'jRFQy', 'armors', 'MDF', 'setupItemDamageTempActors', 'equipSlotIndex', 'iconHeight', 'actorParams', '_itemWindow', 'zaKLt', 'hideAdditionalSprites', 'isRightInputMode', 'fJmXh', 'getItemConsumableText', 'CMjFR', 'isItem', 'localeCompare', 'drawItemStyleIconText', 'cSJKJ', 'processCursorSpecialCheckModernControls', 'PgAyk', 'slotWindowRect', 'addEquipCommand', 'helpAreaTop', 'hTiXT', 'Pwcog', '_goods', 'reloadMapIfUpdated', 'ShopScene', 'Window_ShopStatus_setItem', 'smallParamFontSize', 'UfqAH', 'LabelConsume', 'kObNN', 'ZXFCa', 'param', 'lCNfD', 'ItemScene', 'contents', 'ActorResetEquipSlots', 'ELnbg', 'inBattle', 'isMainMenuCoreMenuImageOptionAvailable', 'hraYv', 'Scene_Item_helpWindowRect', 'getItemEffectsMpRecoveryText', 'addStateBuffChanges', 'bzvIJ', 'show', 'LayoutStyle', 'left', 'updateHelp', 'SwitchID', 'MdLfQ', 'BFDre', 'mainAreaTop', 'drawItemScope', 'drawItemQuantity', 'xYpiC', 'getDamageStyle', 'cancel', 'length', 'FaglX', 'getEtypeIDs', 'Pick\x20and\x20choose\x20equipment\x20to\x20change.', 'weapon', 'Scene_Equip_onSlotOk', '_bypassProxy', 'every', 'bnupq', 'down', 'paintOpacity', 'setValue', 'getInputButtonString', 'uiHelpPosition', 'iEKEl', 'hWcvX', 'getItemEffectsHpDamageText', 'Scene_Shop_onBuyCancel', 'drawNewLabelIcon', 'forceResetEquipSlots', 'forceChangeEquip', 'drawItemConsumable', 'value', 'MHstG', 'getShopTrackingItem', 'setHelpWindow', 'OffsetX', 'ctrje', 'optKeyItemsNumber', 'concat', 'IKyDk', 'makeDeepCopy', 'byFjv', '_tempActor', 'XJmHG', 'commandEquip', 'iKNka', 'setItemWindow', 'uJCYe', 'Orefy', 'refresh', 'RegExp', 'postCreateItemsEquipsCore', 'scope', 'CmdTextAlign', 'remove', 'allowCreateStatusWindow', 'process_VisuMZ_ItemsEquipsCore_EquipSlots', '_newLabelOpacityUpperLimit', 'BuyTurnSwitchOn', 'drawRemoveItem', 'FontColor', 'Parse_Notetags_ParamValues', 'isSoleArmorType', 'iconWidth', 'Scene_Shop_commandBuy', 'partyArtifacts', 'isCommandEnabled', 'cursorRight', 'loadSystem', 'Game_Actor_forceChangeEquip', 'powerUpColor', 'WNSAE', 'getShopTrackingGoldSell', 'lineHeight', 'getItemEffectsTpRecoveryText', 'ItemSceneAdjustItemList', 'itemAt', 'prepareItemCustomData', 'prepareNewEquipSlotsOnLoad', '+%1', 'yyHEm', 'Scene_Item_createCategoryWindow', 'GpXHP', 'discardEquip', 'New', 'getProxyItem', 'tpGain', 'revertGlobalNamespaceVariables', 'Window_ItemList_maxCols', 'clamp', 'DrawBackRect', 'TTLQl', 'hhnGi', 'createCategoryNameWindow', 'call', 'refreshItemsEquipsCoreNoMenuImage', 'occasion', 'Occasion%1', 'EQUIP_DELAY_MS', 'mXAVR', 'Game_BattlerBase_canEquip_artifact', 'kHrRw', 'addShopTrackingGoldSell', 'sOPDc', 'DAMAGE\x20MULTIPLIER', 'MAT', 'onTouchSelect', 'Igklo', 'GAUUC', 'actorId', 'helpWindowRectItemsEquipsCore', 'nGSKy', 'getItemSpeedLabel', '_resetFontColor', 'FNcCi', 'isPlaytest', 'Game_BattlerBase_paramPlus_artifact', 'buttonAssistSlotWindowShift', 'postCreateCategoryWindowItemsEquipsCore', 'iLJzv', 'drawUpdatedParamValueDiff', 'DVOkn', 'MPqEO', 'znjCk', 'HQIGy', 'rateHP', 'ItemMenuStatusRect', 'commandSell', 'artifactIDs', 'zvDYB', 'buttonAssistText2', 'vJmPz', 'removeStateBuffChanges', 'isUseParamNamesWithIcons', 'wqbJG', 'onSellItem', 'addClearCommand', 'NldCE', 'buttonAssistKey1', 'NeverUsable', 'YqGJO', 'replace', 'jtCXZ', 'DamageType%1', 'Scene_Shop_onBuyOk', 'ScopeRandomEnemies', 'zRmHL', 'value1', 'xEffl', 'processShiftRemoveShortcut', 'Type', 'tradeItemWithParty', 'MultiplierStandard', 'Game_Actor_equips_artifacts', 'getItemOccasionText', 'isArmor', 'HZBqH', 'commandSellItemsEquipsCore', 'yoktL', 'convertInitEquipsToItems', '_customItemInfo', 'goldWindowRect', 'buttonAssistRemove', 'includes', '_actor', 'active', 'iconText', 'ParseArmorNotetags', 'doSell', 'isOptimizeEquipOk', '_item', '_slotId', 'trim', 'getArmorIdWithName', 'checkShiftRemoveShortcut', 'pFIUd', 'ActorChangeEquipSlots', 'getItemConsumableLabel', 'Window_Selectable_setHelpWindowItem', 'WuKZQ', 'Window_ShopBuy_goodsToItem', 'ScopeEnemyOrAlly', 'statusWindowRectItemsEquipsCore', 'Window_ItemList_drawItem', 'drawItemCustomEntryLine', 'aHnZi', '\x5cI[%1]', 'Scene_Shop_doSell', 'isBuyCommandEnabled', 'PXetd', 'processTouchModernControls', 'jPqRG', 'callUpdateHelp', 'LabelDamageHP', 'getShopTrackingItemSell', 'ItemsEquipsCore', '_list', 'cursorLeft', 'middle', 'onTouchOk', 'Scene_Item_create', 'atypeId', 'mdf', 'getItemSpeedText', 'MaxItems', 'zQHbl', 'KrBSS', 'setBackgroundType', 'uHYUK', 'meetsItemConditionsJS', 'drawItemEffectsMpRecovery', 'ADDED\x20EFFECTS', '_itemIDs', '_newItemsList', 'postCreateSellWindowItemsEquipsCore', 'categoryNameWindowDrawBackground', 'isSoleWeaponType', 'isLearnedSkill', 'SDAUg', 'JHzAf', '_resetFontSize', 'makeItemData', '_tempActorA', 'constructor', 'FIEgI', '_slotWindow', 'description', '_commandNameWindow', 'isEquipItem', 'getColor', 'isOptimizeCommandAdded', 'determineBaseSellingPrice', '%1%', 'loadPicture', 'numItems', 'changePaintOpacity', 'Game_Party_consumeItem', 'playOkSound', 'cNjxO', 'itemPadding', '===', 'yqDRc', 'iFNWW', 'isPressed', 'Window_ItemList_colSpacing', 'Speed0', 'deepCopy', 'TfElb', 'VisuMZ_1_BattleCore', '970484pfdJfm', 'getItemEffectsMpDamageLabel', 'categoryNameWindowDrawText', 'initNewItemsList', 'removeBattleTestArtifacts', 'fontSize', 'sellPriceOfItem', 'onBuyItem', 'mat', 'buy', 'Consumable', 'bitmap', '%1\x20is\x20incorrectly\x20placed\x20on\x20the\x20plugin\x20list.\x0aIt\x20is\x20a\x20Tier\x20%2\x20plugin\x20placed\x20over\x20other\x20Tier\x20%3\x20plugins.\x0aPlease\x20reorder\x20the\x20plugin\x20list\x20from\x20smallest\x20to\x20largest\x20tier\x20numbers.', 'BorderRegExp', 'HiddenItemA', 'buttonAssistLargeIncrement', 'UUzjA', 'getEmptyEquipSlotOfSameEtype', 'ZsZam', 'getItemSuccessRateText', 'Window_ShopSell_isEnabled', 'DrawIcons', 'JjcBk', 'troopArtifacts', 'kuAHK', 'EVAL', 'WRfDi', 'doBuy', 'NonRemoveETypes', 'slotWindowRectItemsEquipsCore', 'List', 'dasXt', 'BOjwt', 'changeEquipById', 'CmdIconBuy', 'pxgxu', 'nGKIr', 'maxVisibleItems', 'eDQmH', 'DHlxV', 'tcqVh', 'OOItv', 'onCategoryCancelItemsEquipsCore', '_getEquipRequirements', 'splice', 'ujYsv', 'ZDwFp', 'drawItemEffects', 'qCfvW', 'nonOptimizeEtypes', 'wgTTS', 'CannotEquipMarker', 'numberWindowRect', 'RAuKW', 'canEquip', 'allowShiftScrolling', '_sellWindow', 'drawItemEffectsRemovedStatesBuffs', 'Equip\x20the\x20strongest\x20available\x20equipment.', 'ZNaGa', 'keyItem', 'drawEquipData', 'type', 'value2', 'Scene_Equip_createSlotWindow', 'ShowShopStatus', 'makeCommandList', 'drawUpdatedAfterParamValue', 'ZurSn', 'addSellCommand', 'isHandled', 'slzKt', 'MaxMP', 'commandNameWindowCenter', 'drawItemEffectsHpRecovery', 'toUpperCase', 'ConvertNumberToString', 'isCursedItem', 'QSbiy', 'amgCx', 'text', 'ScopeRandomAny', 'gWmPC', 'hCBXA', 'setTempActor', 'isShiftRemoveShortcutEnabled', 'code', 'level', 'ShiftShortcutKey', 'Game_Enemy_traitObjects_artifact', 'TextAlign', 'itemLineRect', 'fCPYW', 'Window_Selectable_update', 'consumeItem', 'partyArtifactIDs', 'gaugeLineHeight', 'sdlpa', 'A%1', '(%1)', '0000', 'refreshDelay', 'yfmKg', 'canUse', 'sort', 'ZMPlZ', 'versionId', 'Window_ShopBuy_refresh', 'OmLFn', '%1-%2', 'checkItemConditionsSwitchNotetags', 'itemDataFontSize', 'battleMembers', '21eFcmZb', 'helpDesc', 'buttonAssistItemListRequirement', 'MaxArmors', 'bxUZh', 'drawItemEffectsAddedStatesBuffs', 'uEsKx', 'DrawItemData', '_newLabelOpacity', 'Parse_Notetags_EquipSlots', 'udknT', 'textWidth', 'YlfYs', 'buttonAssistOffset3', 'Game_BattlerBase_meetsItemConditions', 'Window_ItemCategory_initialize', 'shouldCommandWindowExist', 'qtpcG', 'EnableLayout', 'Text', 'mainAreaBottom', 'cEVpb', 'Game_Item_setObject', 'alterSkillName', 'wkfkG', 'allowCommandWindowCursorUp', 'weapon-%1', 'optimize', 'find', 'Scene_Equip_onSlotCancel', 'isProxyItem', 'LabelRecoverTP', 'lRGaT', 'drawItemEquipType', 'hpRate', 'SwitchSell', 'rtpFN', 'iconIndex', 'getEquipRequirements', 'SwitchBuy', 'FadeSpeed', 'Scene_Equip_createCommandWindow', 'getItemsEquipsCoreBackColor1', 'onCategoryCancel', 'ShopListingRegExp', 'Waeku', 'bind', 'items', 'LcWRr', 'getItemRepeatsLabel', '%1\x20is\x20missing\x20a\x20required\x20plugin.\x0aPlease\x20install\x20%2\x20into\x20the\x20Plugin\x20Manager.', 'REMOVED\x20EFFECTS', 'gfYno', 'MExcB', 'isOpen', 'right', 'push', 'ParamValueFontSize', 'Step1End', 'getInputMultiButtonStrings', 'opacity', 'isBottomHelpMode', 'NUM', 'CFKbL', 'drawItemDamage', '_handlers', 'lSjkq', 'drawCustomShopGraphic', 'HqXZF', 'PurchaseOnly', 'item-%1', 'YitOV', 'width', 'equipItems', 'canSortListItemScene', 'onBuyOk', 'Blacklist', 'commandBuy', 'utQhM', 'XgUIu', 'ParamChangeFontSize', 'Nonconsumable', 'itypeId', 'wnkkd', 'equip2', 'popScene', 'Window_ShopBuy_item', 'getNextAvailableEtypeId', 'paramchangeTextColor', 'FUNC', 'drawItemName', 'resetShopSwitches', 'isEquipAtypeOk', 'log', 'drawItemDamageElement', 'updateSmoothScroll', 'bhDxM', 'resetFontSettings', 'rNmvn', 'floor', 'hKtAD', 'Scene_Shop_commandSell', '_armorIDs', 'Game_BattlerBase_param_artifact', 'OUtTG', 'armorTypes', 'drawItemStyleIcon', 'yucyx', 'getItemEffectsRemovedStatesBuffsText', 'setCategory', 'onBuyCancel', 'OLGgM', 'wtypeId', 'VisAn', 'ShowAllSwitches', 'UeRcD', 'Vdlji', 'UulpX', 'GXtvt', 'addShopTrackingItem', 'updatedLayoutStyle', 'SellPriceJS', 'isDualWield', '<%1:[\x20]([\x5c+\x5c-]\x5cd+)>', 'Scene_Shop_doBuy', 'HLTXe', 'process_VisuMZ_ItemsEquipsCore_RegExp', 'getItemDamageAmountTextOriginal', '_numberWindow', 'RXYTo', 'hideNewLabelSprites', 'ELEMENT', 'LabelSelfGainTP', 'categoryWindowRectItemsEquipsCore', 'getClassIdWithName', 'processShopCondListingOnBuyItem', 'AGI', 'center', 'onDatabaseLoaded', 'Window_EquipStatus_refresh', '_dummyWindow', '_money', 'paramJS', 'yyICf', 'Param', 'sellWindowRect', 'HIT\x20TYPE', 'maxCols', 'CoreEngine', 'xfyBA', 'price', 'ZNloW', 'XxATt', 'LNinT', 'isEquipped', 'paramBase', 'updateNewLabelOpacity', 'calcEquipItemPerformance', 'forceChangeEquipSlots', 'CmdStyle', 'drawItemNumber', 'updateMoneyAmount', 'WpFIY', 'PRXze', 'neyOm', 'initialize', 'GHnCs', 'HideAllSwitches', 'drawParamsItemsEquipsCore', 'itemEnableJS', 'process_VisuMZ_ItemsEquipsCore_Notetags', '6pHIPZg', 'getItemEffectsHpRecoveryLabel', 'toLowerCase', 'equip', 'createCommandNameWindow', 'indexOf', 'drawItemDarkRect', 'CIkTg', 'addLoadListener', 'isClicked', 'ListWindowCols', 'processDownCursorSpecialCheckModernControls', 'addOptimizeCommand', '_data', '_tempActorB', 'smoothScrollTo', 'SUCCESS\x20RATE', 'uiMenuStyle', 'RemoveEquipIcon', 'number', 'getClassRequirements', 'move', 'ElqYT', 'contentsBack', '100%', 'CheckCursedItemMsg', 'switchProxyItem', 'categoryItemTypes', 'categoryWindowRect', 'LabelRecoverMP', 'Enable', 'Scene_Shop_sellingPrice', 'ARRAYSTRUCT', 'modifiedBuyPriceItemsEquipsCore', 'getItemEffectsSelfTpGainText', 'purifyCursedEquips', '_shopStatusMenuAlly', 'Mdswv', 'damage', 'MANUAL', 'ParseWeaponNotetags', 'clear', 'W%1', 'commandWindowRect', 'NXufE', 'activate', 'releaseUnequippableItems', 'isStackableArtifact', 'KHePS', 'ScopeAlliesButUser']; _0x5bde = function () { return _0x5b7d28; }; return _0x5bde(); } Sprite_NewLabel[_0x709961(0x5ef)] = Object['create'](Sprite[_0x709961(0x5ef)]), Sprite_NewLabel['prototype'][_0x709961(0x3f7)] = Sprite_NewLabel, Sprite_NewLabel['prototype'][_0x709961(0x527)] = function () { const _0x27b646 = _0x709961; Sprite[_0x27b646(0x5ef)][_0x27b646(0x527)][_0x27b646(0x376)](this), this[_0x27b646(0x1ff)](); }, Sprite_NewLabel[_0x709961(0x5ef)][_0x709961(0x1ff)] = function () { const _0x554a15 = _0x709961, _0x26670d = ImageManager[_0x554a15(0x357)], _0xf0e569 = ImageManager['iconHeight']; this[_0x554a15(0x41c)] = new Bitmap(_0x26670d, _0xf0e569), this[_0x554a15(0x333)](), this[_0x554a15(0x5ad)](); }, Sprite_NewLabel[_0x709961(0x5ef)]['drawNewLabelIcon'] = function () { const _0x56a654 = _0x709961, _0x3497db = VisuMZ[_0x56a654(0x3db)]['Settings']['New'][_0x56a654(0x2d4)]; if (_0x3497db <= 0x0) return; const _0x15de9a = ImageManager[_0x56a654(0x35c)](_0x56a654(0x205)), _0x305a27 = ImageManager['iconWidth'], _0x77f791 = ImageManager[_0x56a654(0x2ea)], _0x3e5433 = _0x3497db % 0x10 * _0x305a27, _0x18a68a = Math[_0x56a654(0x4e5)](_0x3497db / 0x10) * _0x77f791; this[_0x56a654(0x41c)][_0x56a654(0x60b)](_0x15de9a, _0x3e5433, _0x18a68a, _0x305a27, _0x77f791, 0x0, 0x0); }, Sprite_NewLabel[_0x709961(0x5ef)]['drawNewLabelText'] = function () { const _0xba5f89 = _0x709961, _0xf28aeb = VisuMZ['ItemsEquipsCore'][_0xba5f89(0x6b0)]['New'], _0x52fcdd = _0xf28aeb[_0xba5f89(0x495)]; if (_0x52fcdd === '') return; const _0x387edd = ImageManager[_0xba5f89(0x357)], _0x555d28 = ImageManager[_0xba5f89(0x2ea)]; this[_0xba5f89(0x41c)][_0xba5f89(0x59a)] = _0xf28aeb[_0xba5f89(0x5d5)] || $gameSystem[_0xba5f89(0x63d)](), this[_0xba5f89(0x41c)][_0xba5f89(0x637)] = this[_0xba5f89(0x696)](), this[_0xba5f89(0x41c)][_0xba5f89(0x416)] = _0xf28aeb[_0xba5f89(0x229)], this['bitmap']['drawText'](_0x52fcdd, 0x0, _0x555d28 / 0x2, _0x387edd, _0x555d28 / 0x2, _0xba5f89(0x50b)); }, Sprite_NewLabel[_0x709961(0x5ef)][_0x709961(0x696)] = function () { const _0x1ee55f = _0x709961, _0x359bc5 = VisuMZ['ItemsEquipsCore'][_0x1ee55f(0x6b0)][_0x1ee55f(0x36c)]['FontColor']; return _0x359bc5[_0x1ee55f(0x1ed)](/#(.*)/i) ? '#' + String(RegExp['$1']) : ColorManager['textColor'](_0x359bc5); }, Window_Base[_0x709961(0x5ef)][_0x709961(0x4dc)] = function (_0x328afb, _0x4a4543, _0x532919, _0x2aadb0) { const _0x1d5b28 = _0x709961; if (_0x328afb) { if (_0x1d5b28(0x49a) === _0x1d5b28(0x463)) return _0x12107e[_0x1d5b28(0x3db)][_0x1d5b28(0x295)][_0x1d5b28(0x376)](this); else { const _0x2133d1 = _0x532919 + (this[_0x1d5b28(0x361)]() - ImageManager[_0x1d5b28(0x2ea)]) / 0x2, _0x58464b = ImageManager['iconWidth'] + 0x4, _0x4f750b = Math[_0x1d5b28(0x5f5)](0x0, _0x2aadb0 - _0x58464b); this[_0x1d5b28(0x61c)](ColorManager[_0x1d5b28(0x2c5)](_0x328afb)), this['drawIcon'](_0x328afb[_0x1d5b28(0x4a7)], _0x4a4543, _0x2133d1), this[_0x1d5b28(0x62c)](_0x328afb[_0x1d5b28(0x5a7)], _0x4a4543 + _0x58464b, _0x532919, _0x4f750b), this[_0x1d5b28(0x1c0)](); } } }, Window_Base[_0x709961(0x5ef)][_0x709961(0x522)] = function (_0x1772f2, _0x455ed2, _0xd4a7bd, _0x59ab37) { const _0x3a44b3 = _0x709961; if (this['isDrawItemNumber'](_0x1772f2)) { this['resetFontSettings'](); const _0x820ba7 = VisuMZ['ItemsEquipsCore'][_0x3a44b3(0x6b0)][_0x3a44b3(0x309)], _0x731c2 = _0x820ba7[_0x3a44b3(0x5b8)], _0x6fe309 = _0x731c2[_0x3a44b3(0x60c)]($gameParty[_0x3a44b3(0x402)](_0x1772f2)); this['contents'][_0x3a44b3(0x416)] = _0x820ba7[_0x3a44b3(0x631)], this[_0x3a44b3(0x62c)](_0x6fe309, _0x455ed2, _0xd4a7bd, _0x59ab37, _0x3a44b3(0x4b9)), this[_0x3a44b3(0x4e3)](); } }, Window_Base['prototype']['isDrawItemNumber'] = function (_0x1f134d) { if (DataManager['isKeyItem'](_0x1f134d)) return $dataSystem['optKeyItemsNumber']; return !![]; }, Window_Base['prototype'][_0x709961(0x533)] = function (_0xdf9bdb, _0x36eecd, _0x3ea2d4, _0xf7da8a, _0x44e485) { const _0x25c22c = _0x709961; _0x44e485 = Math[_0x25c22c(0x5f5)](_0x44e485 || 0x1, 0x1); while (_0x44e485--) { _0xf7da8a = _0xf7da8a || this['lineHeight'](), this[_0x25c22c(0x544)]['paintOpacity'] = 0xa0; const _0x18085f = ColorManager[_0x25c22c(0x1d9)](); this[_0x25c22c(0x544)][_0x25c22c(0x68d)](_0xdf9bdb + 0x1, _0x36eecd + 0x1, _0x3ea2d4 - 0x2, _0xf7da8a - 0x2, _0x18085f), this['contentsBack'][_0x25c22c(0x32b)] = 0xff; } }, VisuMZ[_0x709961(0x3db)][_0x709961(0x592)] = Window_Selectable[_0x709961(0x5ef)][_0x709961(0x527)], Window_Selectable[_0x709961(0x5ef)][_0x709961(0x527)] = function (_0x24da51) { const _0x1dc67a = _0x709961; this[_0x1dc67a(0x6cf)](), VisuMZ['ItemsEquipsCore']['Window_Selectable_initialize'][_0x1dc67a(0x376)](this, _0x24da51); }, Window_Selectable['prototype'][_0x709961(0x6cf)] = function () { const _0x511bfa = _0x709961; this[_0x511bfa(0x6f4)] = {}, this[_0x511bfa(0x48a)] = 0xff, this[_0x511bfa(0x69b)] = VisuMZ[_0x511bfa(0x3db)]['Settings'][_0x511bfa(0x36c)][_0x511bfa(0x4aa)], this[_0x511bfa(0x351)] = VisuMZ[_0x511bfa(0x3db)][_0x511bfa(0x6b0)][_0x511bfa(0x36c)][_0x511bfa(0x1fe)]; }, Window_Selectable['prototype'][_0x709961(0x2b4)] = function () { return ![]; }, VisuMZ['ItemsEquipsCore'][_0x709961(0x3ca)] = Window_Selectable['prototype']['setHelpWindowItem'], Window_Selectable[_0x709961(0x5ef)][_0x709961(0x2c1)] = function (_0x53ec7a) { const _0x5d245b = _0x709961; VisuMZ[_0x5d245b(0x3db)]['Window_Selectable_setHelpWindowItem'][_0x5d245b(0x376)](this, _0x53ec7a); if (this['isShowNew']()) this['clearNewLabelFromItem'](_0x53ec7a); }, Window_Selectable[_0x709961(0x5ef)][_0x709961(0x2a9)] = function (_0x173823) { const _0x11764f = _0x709961; if (!_0x173823) return; $gameParty['clearNewItem'](_0x173823); let _0x2ef27a = ''; if (DataManager[_0x11764f(0x2f3)](_0x173823)) _0x2ef27a = _0x11764f(0x4c8)[_0x11764f(0x60c)](_0x173823['id']); else { if (DataManager[_0x11764f(0x67a)](_0x173823)) _0x11764f(0x264) !== _0x11764f(0x25e) ? _0x2ef27a = 'weapon-%1'[_0x11764f(0x60c)](_0x173823['id']) : (this[_0x11764f(0x4e3)](), this[_0x11764f(0x403)](!![]), this['prepareItemCustomData'](), this[_0x11764f(0x3fc)]() ? this['drawEquipData']() : this[_0x11764f(0x6ef)](), this[_0x11764f(0x4c5)]()); else { if (DataManager[_0x11764f(0x3b3)](_0x173823)) _0x2ef27a = _0x11764f(0x269)[_0x11764f(0x60c)](_0x173823['id']); else return; } } const _0x486ff0 = this[_0x11764f(0x6f4)][_0x2ef27a]; if (_0x486ff0) _0x486ff0[_0x11764f(0x5b0)](); }, VisuMZ['ItemsEquipsCore'][_0x709961(0x1e0)] = Window_Selectable['prototype'][_0x709961(0x349)], Window_Selectable[_0x709961(0x5ef)][_0x709961(0x349)] = function () { const _0x93d6a2 = _0x709961; this[_0x93d6a2(0x504)](), VisuMZ[_0x93d6a2(0x3db)][_0x93d6a2(0x1e0)]['call'](this); }, Window_Selectable[_0x709961(0x5ef)][_0x709961(0x504)] = function () { const _0x5ba00e = _0x709961; for (const _0x31355a of Object[_0x5ba00e(0x68c)](this['_newLabelSprites'])) { _0x31355a[_0x5ba00e(0x5b0)](); } }, VisuMZ['ItemsEquipsCore'][_0x709961(0x46e)] = Window_Selectable['prototype'][_0x709961(0x653)], Window_Selectable[_0x709961(0x5ef)][_0x709961(0x653)] = function () { const _0xc47ebd = _0x709961; this[_0xc47ebd(0x51e)](), VisuMZ[_0xc47ebd(0x3db)][_0xc47ebd(0x46e)]['call'](this); }, Window_Selectable['prototype'][_0x709961(0x51e)] = function () { const _0x5bf25b = _0x709961; if (!this['isShowNew']()) return; const _0x42b784 = this[_0x5bf25b(0x351)]; this[_0x5bf25b(0x48a)] += this[_0x5bf25b(0x69b)]; (this[_0x5bf25b(0x48a)] >= _0x42b784 || this[_0x5bf25b(0x48a)] <= 0x0) && (this[_0x5bf25b(0x69b)] *= -0x1); this['_newLabelOpacity'] = this[_0x5bf25b(0x48a)][_0x5bf25b(0x371)](0x0, _0x42b784); for (const _0x233548 of Object[_0x5bf25b(0x68c)](this[_0x5bf25b(0x6f4)])) { _0x233548['opacity'] = this[_0x5bf25b(0x48a)]; } }, Window_Selectable['prototype'][_0x709961(0x1a0)] = function (_0x1011d7) { const _0x20c325 = _0x709961, _0x3e34eb = this[_0x20c325(0x6f4)]; if (_0x3e34eb[_0x1011d7]) return _0x3e34eb[_0x1011d7]; else { if ('yYjxZ' === _0x20c325(0x265)) _0x20a0a5[_0x20c325(0x27f)](_0x20c325(0x4b9)) && this[_0x20c325(0x35b)](_0x3f835c[_0x20c325(0x5c1)](_0x20c325(0x4b9))), _0x2ae3c8['isRepeated']('left') && this[_0x20c325(0x3dd)](_0x3a52c5[_0x20c325(0x5c1)](_0x20c325(0x316))); else { const _0x2642db = new Sprite_NewLabel(); return _0x3e34eb[_0x1011d7] = _0x2642db, this['addInnerChild'](_0x2642db), _0x2642db; } } }, Window_Selectable[_0x709961(0x5ef)]['placeNewLabel'] = function (_0x4a3f67, _0x48469b, _0x4be285) { const _0x2ab8d8 = _0x709961; let _0x4c37a5 = ''; if (DataManager[_0x2ab8d8(0x2f3)](_0x4a3f67)) _0x2ab8d8(0x594) === _0x2ab8d8(0x4f7) ? this['onTouchSelectModernControls'](![]) : _0x4c37a5 = _0x2ab8d8(0x4c8)['format'](_0x4a3f67['id']); else { if (DataManager[_0x2ab8d8(0x67a)](_0x4a3f67)) { if (_0x2ab8d8(0x6ce) === _0x2ab8d8(0x231)) { if (_0x24e1b6[_0x2ab8d8(0x53e)] && _0x303cf1['uiInputPosition'] !== _0x32a0b8) return _0x233434['uiInputPosition']; else { if (this['isUseItemsEquipsCoreUpdatedLayout']()) return this[_0x2ab8d8(0x4fa)]()[_0x2ab8d8(0x1ed)](/RIGHT/i); else _0x5a8c4e[_0x2ab8d8(0x5ef)][_0x2ab8d8(0x2ef)][_0x2ab8d8(0x376)](this); } } else _0x4c37a5 = 'weapon-%1'[_0x2ab8d8(0x60c)](_0x4a3f67['id']); } else { if (DataManager[_0x2ab8d8(0x3b3)](_0x4a3f67)) { if (_0x2ab8d8(0x609) === _0x2ab8d8(0x611)) { if (this['buttonAssistItemListRequirement']()) return this[_0x2ab8d8(0x2ec)][_0x2ab8d8(0x515)]() === 0x1 ? _0xde64f2[_0x2ab8d8(0x4bd)](_0x2ab8d8(0x316), _0x2ab8d8(0x4b9)) : _0x4ef876['getInputMultiButtonStrings'](_0x2ab8d8(0x277), 'pagedown'); return _0x519f2c[_0x2ab8d8(0x5ef)][_0x2ab8d8(0x3a2)][_0x2ab8d8(0x376)](this); } else _0x4c37a5 = 'armor-%1'['format'](_0x4a3f67['id']); } else { if (_0x2ab8d8(0x6de) === _0x2ab8d8(0x6de)) return; else { if (!this[_0x2ab8d8(0x676)](_0x2b7647)) return ![]; const _0x515118 = _0xdc088a['note']; if (!_0x515118) return ![]; if (_0x515118[_0x2ab8d8(0x1ed)](/<(?:PARTY|ALLY) (?:ARTIFACT|RELIC)>/i)) return !![]; if (_0x515118[_0x2ab8d8(0x1ed)](/<(?:STACKABLE|STACK) (?:PARTY|ALLY) (?:ARTIFACT|RELIC)>/i)) return !![]; return ![]; } } } } const _0x1e4b9f = this[_0x2ab8d8(0x1a0)](_0x4c37a5); _0x1e4b9f[_0x2ab8d8(0x542)](_0x48469b, _0x4be285), _0x1e4b9f[_0x2ab8d8(0x314)](), _0x1e4b9f[_0x2ab8d8(0x4be)] = this['_newLabelOpacity']; }, Window_ItemCategory[_0x709961(0x29a)] = VisuMZ[_0x709961(0x3db)][_0x709961(0x6b0)]['Categories'][_0x709961(0x42f)], Window_ItemCategory[_0x709961(0x548)] = [_0x709961(0x41f), _0x709961(0x2aa), _0x709961(0x4d3), 'Consumable', _0x709961(0x6e7), _0x709961(0x1e7), _0x709961(0x5f7), 'NeverUsable'], VisuMZ['ItemsEquipsCore']['Window_ItemCategory_initialize'] = Window_ItemCategory[_0x709961(0x5ef)][_0x709961(0x527)], Window_ItemCategory[_0x709961(0x5ef)]['initialize'] = function (_0x5b3d3a) { const _0x11c64e = _0x709961; VisuMZ[_0x11c64e(0x3db)][_0x11c64e(0x491)]['call'](this, _0x5b3d3a), this[_0x11c64e(0x375)](_0x5b3d3a); }, Window_ItemCategory['prototype'][_0x709961(0x375)] = function (_0x179d76) { const _0x4a4d40 = _0x709961, _0x5e736c = new Rectangle(0x0, 0x0, _0x179d76[_0x4a4d40(0x4ca)], _0x179d76['height']); this[_0x4a4d40(0x22c)] = new Window_Base(_0x5e736c), this['_categoryNameWindow'][_0x4a4d40(0x4be)] = 0x0, this[_0x4a4d40(0x271)](this[_0x4a4d40(0x22c)]), this['updateCategoryNameWindow'](); }, Window_ItemCategory[_0x709961(0x5ef)][_0x709961(0x6d8)] = function () { const _0x2b65e8 = _0x709961; return Imported[_0x2b65e8(0x615)] && Window_HorzCommand[_0x2b65e8(0x5ef)]['isUseModernControls'][_0x2b65e8(0x376)](this); }, Window_ItemCategory[_0x709961(0x5ef)][_0x709961(0x2d5)] = function () { }, Window_ItemCategory['prototype'][_0x709961(0x405)] = function () { const _0xc9e6db = _0x709961; if (!this[_0xc9e6db(0x6d8)]()) Window_HorzCommand[_0xc9e6db(0x5ef)][_0xc9e6db(0x405)][_0xc9e6db(0x376)](this); }, Window_ItemCategory[_0x709961(0x5ef)][_0x709961(0x515)] = function () { const _0x740afc = _0x709961; return this[_0x740afc(0x3dc)] ? this[_0x740afc(0x1fb)]() : 0x4; }, Window_ItemCategory[_0x709961(0x5ef)][_0x709961(0x653)] = function () { const _0x359b7b = _0x709961; Window_HorzCommand[_0x359b7b(0x5ef)]['update'][_0x359b7b(0x376)](this), this[_0x359b7b(0x2ec)] && this[_0x359b7b(0x2ec)][_0x359b7b(0x4ef)](this[_0x359b7b(0x5ec)]()); }, Window_ItemCategory[_0x709961(0x5ef)]['processCursorMoveModernControls'] = function () { const _0x481315 = _0x709961; if (this[_0x481315(0x565)]()) { if (_0x481315(0x5d8) === 'Kaigv') this[_0x481315(0x59b)](); else { const _0x5c2a21 = this[_0x481315(0x624)](); if (this[_0x481315(0x2ec)] && this['_itemWindow'][_0x481315(0x515)]() <= 0x1) { if (_0x481315(0x439) === _0x481315(0x439)) { Input[_0x481315(0x27f)]('right') && this[_0x481315(0x35b)](Input[_0x481315(0x5c1)](_0x481315(0x4b9))); if (Input[_0x481315(0x27f)](_0x481315(0x316))) { if (_0x481315(0x1e6) === _0x481315(0x1e6)) this['cursorLeft'](Input['isTriggered'](_0x481315(0x316))); else return this[_0x481315(0x1f3)](); } } else _0x4e75ea = _0x2cc040[_0x481315(0x307)](_0x4370be), _0x1c797c = _0x5593ab - _0x296ca8[_0x481315(0x307)](_0x19f603), this[_0x481315(0x61c)](_0x2acb6d[_0x481315(0x4da)](_0x322ea2)), _0x5e6040 = (_0x585193 >= 0x0 ? '+' : '') + _0x1ae38e; } else this[_0x481315(0x2ec)] && this[_0x481315(0x2ec)][_0x481315(0x515)]() > 0x1 && (Input['isRepeated'](_0x481315(0x5af)) && !Input[_0x481315(0x40b)](_0x481315(0x5ce)) && this['cursorRight'](Input[_0x481315(0x5c1)]('pagedown')), Input['isRepeated'](_0x481315(0x277)) && !Input['isPressed'](_0x481315(0x5ce)) && (_0x481315(0x2e0) !== _0x481315(0x2e0) ? (this['addBuyCommand'](), this[_0x481315(0x456)](), this['addCancelCommand']()) : this[_0x481315(0x3dd)](Input[_0x481315(0x5c1)](_0x481315(0x277))))); if (this[_0x481315(0x624)]() !== _0x5c2a21) { if (_0x481315(0x5d1) !== 'SvGIK') this['playCursorSound'](); else return _0x26af36[_0x481315(0x3db)][_0x481315(0x6b0)][_0x481315(0x281)][_0x481315(0x5d2)]; } } } }, Window_ItemCategory['prototype'][_0x709961(0x6ab)] = function () { const _0x1e9dcf = _0x709961; if (this['isUseModernControls']()) return; Window_HorzCommand['prototype'][_0x1e9dcf(0x6ab)][_0x1e9dcf(0x376)](this); }, Window_ItemCategory[_0x709961(0x5ef)]['isHoverEnabled'] = function () { const _0x366c45 = _0x709961; return this['isUseModernControls']() ? ![] : Window_HorzCommand[_0x366c45(0x5ef)][_0x366c45(0x1ee)][_0x366c45(0x376)](this); }, Window_ItemCategory['prototype'][_0x709961(0x3d6)] = function () { const _0x212101 = _0x709961; if (this['isOpenAndActive']()) { TouchInput[_0x212101(0x5c1)]() && this[_0x212101(0x382)](!![]); if (TouchInput[_0x212101(0x536)]()) { if (_0x212101(0x528) === _0x212101(0x528)) this[_0x212101(0x3df)](); else { this['_item'] = _0x469a15; const _0x31cb88 = _0x525cb0[_0x212101(0x37a)]; _0x21c400(this['refreshDelay'][_0x212101(0x4b0)](this, _0x30b5f1), _0x31cb88); } } else { if (TouchInput[_0x212101(0x5ab)]()) { if (_0x212101(0x5d7) !== 'uPKtC') return _0x4f67ab['ScopeRandomEnemies'][_0x212101(0x60c)](_0x5a7f54(_0x584f46['$1'])); else this[_0x212101(0x1c1)](); } } } }, Window_ItemCategory[_0x709961(0x5ef)][_0x709961(0x382)] = function (_0x2ef650) { const _0x240eab = _0x709961; this[_0x240eab(0x6d8)]() ? this['onTouchSelectModern'](!![]) : Window_HorzCommand[_0x240eab(0x5ef)]['onTouchSelect'][_0x240eab(0x376)](this, _0x2ef650); }, Window_ItemCategory[_0x709961(0x5ef)]['onTouchSelectModern'] = function (_0xe4b4ac) { const _0x4e4554 = _0x709961; this[_0x4e4554(0x56a)] = ![]; if (this['isCursorMovable']()) { if (_0x4e4554(0x3e6) === _0x4e4554(0x3e6)) { const _0x29d25f = this['index'](), _0x2903a7 = this[_0x4e4554(0x2bb)](); if (_0x2903a7 >= 0x0 && _0x2903a7 !== this['index']()) { if (_0x4e4554(0x652) === _0x4e4554(0x430)) { if (!_0x44bbe8) return ![]; if (!_0x15b8ec[_0x4e4554(0x3db)][_0x4e4554(0x490)][_0x4e4554(0x376)](this, _0xb40d58)) return ![]; if (!this[_0x4e4554(0x60d)](_0x33ce7d)) return ![]; if (!this[_0x4e4554(0x3e9)](_0x3cac8a)) return ![]; return !![]; } else this[_0x4e4554(0x2a0)](_0x2903a7); } _0xe4b4ac && this['index']() !== _0x29d25f && (_0x4e4554(0x258) === _0x4e4554(0x567) ? _0x4e0d88['params'][_0x580488] = _0x373cf3(_0x40911d['$1']) : this[_0x4e4554(0x5d0)]()); } else _0x2f931a = this[_0x4e4554(0x3bc)]['paramValueByName'](_0x39a4d0, !![]); } }, Window_ItemCategory['prototype'][_0x709961(0x453)] = function () { const _0x9e71cc = _0x709961; this[_0x9e71cc(0x1da)](), this[_0x9e71cc(0x2a0)](this['index']()); }, Window_ItemCategory[_0x709961(0x5ef)][_0x709961(0x1da)] = function () { const _0x300330 = _0x709961; for (const _0x2651f2 of Window_ItemCategory[_0x300330(0x29a)]) { if ('eubfC' !== _0x300330(0x1b3)) return this[_0x300330(0x339)]('buy', _0x1a303a); else this[_0x300330(0x291)](_0x2651f2); } }, Window_ItemCategory[_0x709961(0x5ef)]['addItemCategory'] = function (_0x1be87b) { const _0x4591f9 = _0x709961, _0x2e4cd2 = _0x1be87b[_0x4591f9(0x3ae)], _0x52b6e5 = _0x1be87b[_0x4591f9(0x2d4)], _0x3f511e = _0x1be87b[_0x4591f9(0x318)] || 0x0; if (_0x3f511e > 0x0 && !$gameSwitches[_0x4591f9(0x337)](_0x3f511e)) return; let _0x360e2a = '', _0x4def4f = _0x4591f9(0x6dc), _0x3fdd8d = _0x2e4cd2; if (_0x2e4cd2[_0x4591f9(0x1ed)](/Category:(.*)/i)) _0x360e2a = String(RegExp['$1'])['trim'](); else { if (Window_ItemCategory[_0x4591f9(0x548)]['includes'](_0x2e4cd2)) _0x360e2a = VisuMZ['ItemsEquipsCore'][_0x4591f9(0x6b0)][_0x4591f9(0x29b)][_0x2e4cd2]; else { if ([_0x4591f9(0x66e), _0x4591f9(0x26d)][_0x4591f9(0x3bb)](_0x2e4cd2)) _0x360e2a = TextManager['item']; else { if (_0x2e4cd2 === _0x4591f9(0x68e)) { if ('WuPMs' !== 'zrNST') _0x360e2a = TextManager[_0x4591f9(0x44d)]; else { const _0x3eb5b5 = 'OCCASION'; if (this[_0x4591f9(0x3b8)][_0x3eb5b5]) return this['_customItemInfo'][_0x3eb5b5]; const _0x44e951 = _0x4b88c9[_0x4591f9(0x3db)][_0x4591f9(0x6b0)]['StatusWindow'], _0x33fd62 = _0x4591f9(0x379)['format'](this[_0x4591f9(0x3c2)]['occasion']); return _0x44e951[_0x33fd62]; } } else { if (_0x2e4cd2 === _0x4591f9(0x242)) { if ('wpEOl' !== _0x4591f9(0x5ff)) return this[_0x4591f9(0x289)]() ? this[_0x4591f9(0x288)]() : _0x211f29['ItemsEquipsCore']['Scene_Shop_sellWindowRect'][_0x4591f9(0x376)](this); else _0x360e2a = TextManager[_0x4591f9(0x325)]; } else { if (_0x2e4cd2 === _0x4591f9(0x5a3)) _0x360e2a = TextManager['armor']; else { if (_0x2e4cd2[_0x4591f9(0x1ed)](/WTYPE:(\d+)/i)) _0x360e2a = $dataSystem[_0x4591f9(0x5e5)][Number(RegExp['$1'])] || ''; else { if (_0x2e4cd2[_0x4591f9(0x1ed)](/ATYPE:(\d+)/i)) { if (_0x4591f9(0x534) !== _0x4591f9(0x534)) { this[_0x4591f9(0x626)](_0x2c1ed1)[_0x4591f9(0x1ed)](/\\I\[(\d+)\]/i); const _0x35744d = _0x871045(_0x55bd32['$1']) || 0x0, _0x477b14 = this[_0x4591f9(0x46c)](_0xe5501), _0x3de28e = _0x477b14['x'] + _0xbb7352[_0x4591f9(0x4e5)]((_0x477b14[_0x4591f9(0x4ca)] - _0x51bd6e[_0x4591f9(0x357)]) / 0x2), _0x71b237 = _0x477b14['y'] + (_0x477b14[_0x4591f9(0x232)] - _0x48022f[_0x4591f9(0x2ea)]) / 0x2; this['drawIcon'](_0x35744d, _0x3de28e, _0x71b237); } else _0x360e2a = $dataSystem[_0x4591f9(0x4eb)][Number(RegExp['$1'])] || ''; } else _0x2e4cd2[_0x4591f9(0x1ed)](/ETYPE:(\d+)/i) && (_0x360e2a = $dataSystem[_0x4591f9(0x2c9)][Number(RegExp['$1'])] || ''); } } } } } } } _0x52b6e5 > 0x0 && this[_0x4591f9(0x655)]() !== 'text' && (_0x360e2a = '\x5cI[%1]%2'[_0x4591f9(0x60c)](_0x52b6e5, _0x360e2a)), this['addCommand'](_0x360e2a, _0x4def4f, !![], _0x3fdd8d); }, Window_ItemCategory[_0x709961(0x5ef)]['itemTextAlign'] = function () { const _0xa54e71 = _0x709961; return VisuMZ[_0xa54e71(0x3db)][_0xa54e71(0x6b0)]['Categories'][_0xa54e71(0x46b)]; }, Window_ItemCategory[_0x709961(0x5ef)][_0x709961(0x602)] = function (_0x5b5751) { const _0x146259 = _0x709961, _0x551a9b = this[_0x146259(0x6aa)](_0x5b5751); if (_0x551a9b === 'iconText') { if ('YKBkD' !== 'iXtMZ') this[_0x146259(0x2f5)](_0x5b5751); else { let _0x46f8aa = _0x49122a[_0x146259(0x3db)][_0x146259(0x46a)][_0x146259(0x376)](this); return _0x46f8aa[_0x146259(0x33e)](_0x5c72b7[_0x146259(0x428)]()); } } else _0x551a9b === _0x146259(0x220) ? _0x146259(0x2b5) !== 'nMgpv' ? _0x5e690a = _0x4608f2[_0x146259(0x5f5)](_0x247129, _0x3159b7) : this[_0x146259(0x4ec)](_0x5b5751) : Window_HorzCommand[_0x146259(0x5ef)][_0x146259(0x602)][_0x146259(0x376)](this, _0x5b5751); }, Window_ItemCategory[_0x709961(0x5ef)][_0x709961(0x655)] = function () { const _0x1bc834 = _0x709961; return VisuMZ[_0x1bc834(0x3db)][_0x1bc834(0x6b0)][_0x1bc834(0x29b)]['Style']; }, Window_ItemCategory[_0x709961(0x5ef)][_0x709961(0x6aa)] = function (_0x2fb03) { const _0x42abce = _0x709961; if (_0x2fb03 < 0x0) return _0x42abce(0x461); const _0x50a4d2 = this[_0x42abce(0x655)](); if (_0x50a4d2 !== _0x42abce(0x28f)) { if (_0x42abce(0x4b7) !== _0x42abce(0x4b7)) _0x26425f[_0x42abce(0x4ba)](_0x4b9d0c[_0x33bc8b]); else return _0x50a4d2; } else { if ('qYeCH' === _0x42abce(0x66c)) { const _0x19010f = new _0x28746f(0x0, 0x0, _0x7d1dca[_0x42abce(0x4ca)], _0x4a3d9b[_0x42abce(0x232)]); this[_0x42abce(0x3fb)] = new _0x56ff33(_0x19010f), this[_0x42abce(0x3fb)][_0x42abce(0x4be)] = 0x0, this['addChild'](this[_0x42abce(0x3fb)]), this[_0x42abce(0x1ce)](); } else { const _0x15f49c = this[_0x42abce(0x626)](_0x2fb03); if (_0x15f49c[_0x42abce(0x1ed)](/\\I\[(\d+)\]/i)) { const _0x3f5719 = this[_0x42abce(0x46c)](_0x2fb03), _0x1b8494 = this['textSizeEx'](_0x15f49c)[_0x42abce(0x4ca)]; return _0x1b8494 <= _0x3f5719[_0x42abce(0x4ca)] ? _0x42abce(0x3be) : _0x42abce(0x220); } else return _0x42abce(0x461); } } }, Window_ItemCategory[_0x709961(0x5ef)]['drawItemStyleIconText'] = function (_0x41c85b) { const _0x229bcb = _0x709961, _0x50bc53 = this[_0x229bcb(0x46c)](_0x41c85b), _0x421d24 = this[_0x229bcb(0x626)](_0x41c85b), _0x3bcaad = this['textSizeEx'](_0x421d24)[_0x229bcb(0x4ca)]; this[_0x229bcb(0x403)](this[_0x229bcb(0x35a)](_0x41c85b)); const _0x34a858 = this[_0x229bcb(0x27b)](); if (_0x34a858 === _0x229bcb(0x4b9)) { if (_0x229bcb(0x2b3) !== 'vuHSL') { const _0x47617e = this[_0x229bcb(0x46c)](_0x2891fa), _0x4a7530 = this[_0x229bcb(0x66a)](_0x524dee)[_0x229bcb(0x4ca)]; return _0x4a7530 <= _0x47617e[_0x229bcb(0x4ca)] ? _0x229bcb(0x3be) : _0x229bcb(0x220); } else this[_0x229bcb(0x6ba)](_0x421d24, _0x50bc53['x'] + _0x50bc53[_0x229bcb(0x4ca)] - _0x3bcaad, _0x50bc53['y'], _0x3bcaad); } else { if (_0x34a858 === _0x229bcb(0x50b)) { if (_0x229bcb(0x2fc) !== _0x229bcb(0x6bb)) { const _0x5a7b27 = _0x50bc53['x'] + Math['floor']((_0x50bc53['width'] - _0x3bcaad) / 0x2); this['drawTextEx'](_0x421d24, _0x5a7b27, _0x50bc53['y'], _0x3bcaad); } else this['playCursorSound'](); } else this[_0x229bcb(0x6ba)](_0x421d24, _0x50bc53['x'], _0x50bc53['y'], _0x3bcaad); } }, Window_ItemCategory[_0x709961(0x5ef)][_0x709961(0x4ec)] = function (_0x524479) { const _0x205c7e = _0x709961, _0x588d40 = this['commandName'](_0x524479); if (_0x588d40['match'](/\\I\[(\d+)\]/i)) { const _0x49e0f0 = Number(RegExp['$1']) || 0x0, _0x469c44 = this[_0x205c7e(0x46c)](_0x524479), _0x2b167f = _0x469c44['x'] + Math[_0x205c7e(0x4e5)]((_0x469c44[_0x205c7e(0x4ca)] - ImageManager[_0x205c7e(0x357)]) / 0x2), _0x347097 = _0x469c44['y'] + (_0x469c44['height'] - ImageManager[_0x205c7e(0x2ea)]) / 0x2; this[_0x205c7e(0x25a)](_0x49e0f0, _0x2b167f, _0x347097); } }, VisuMZ['ItemsEquipsCore'][_0x709961(0x20a)] = Window_ItemCategory['prototype'][_0x709961(0x346)], Window_ItemCategory['prototype'][_0x709961(0x346)] = function (_0x27995a) { const _0x304c45 = _0x709961; VisuMZ[_0x304c45(0x3db)][_0x304c45(0x20a)][_0x304c45(0x376)](this, _0x27995a), _0x27995a[_0x304c45(0x5cd)] = this; }, Window_ItemCategory[_0x709961(0x5ef)][_0x709961(0x3d8)] = function () { const _0xe9f04f = _0x709961; Window_HorzCommand[_0xe9f04f(0x5ef)][_0xe9f04f(0x3d8)][_0xe9f04f(0x376)](this); if (this['_categoryNameWindow']) this['updateCategoryNameWindow'](); }, Window_ItemCategory['prototype'][_0x709961(0x280)] = function () { const _0x47f446 = _0x709961, _0x5164b9 = this[_0x47f446(0x22c)]; _0x5164b9[_0x47f446(0x30a)][_0x47f446(0x556)](); const _0x4bc279 = this['categoryStyleCheck'](this[_0x47f446(0x624)]()); if (_0x4bc279 === _0x47f446(0x220)) { const _0x3c436c = this[_0x47f446(0x46c)](this[_0x47f446(0x624)]()); let _0x3b6d97 = this[_0x47f446(0x626)](this[_0x47f446(0x624)]()); _0x3b6d97 = _0x3b6d97[_0x47f446(0x3a5)](/\\I\[(\d+)\]/gi, ''), _0x5164b9[_0x47f446(0x4e3)](), this[_0x47f446(0x3ef)](_0x3b6d97, _0x3c436c), this[_0x47f446(0x413)](_0x3b6d97, _0x3c436c), this['categoryNameWindowCenter'](_0x3b6d97, _0x3c436c); } }, Window_ItemCategory['prototype'][_0x709961(0x3ef)] = function (_0x4d307a, _0x8e51fc) { }, Window_ItemCategory[_0x709961(0x5ef)]['categoryNameWindowDrawText'] = function (_0x344c9c, _0x2b3efe) { const _0x19d8fb = _0x709961, _0x2459eb = this['_categoryNameWindow']; _0x2459eb[_0x19d8fb(0x62c)](_0x344c9c, 0x0, _0x2b3efe['y'], _0x2459eb[_0x19d8fb(0x224)], 'center'); }, Window_ItemCategory[_0x709961(0x5ef)]['categoryNameWindowCenter'] = function (_0x4dc918, _0xa8a9bc) { const _0x26374f = _0x709961, _0x3539ca = this['_categoryNameWindow'], _0x596c88 = $gameSystem['windowPadding'](), _0xed94eb = _0xa8a9bc['x'] + Math[_0x26374f(0x4e5)](_0xa8a9bc['width'] / 0x2) + _0x596c88; _0x3539ca['x'] = _0x3539ca['width'] / -0x2 + _0xed94eb, _0x3539ca['y'] = Math[_0x26374f(0x4e5)](_0xa8a9bc[_0x26374f(0x232)] / 0x2); }, Window_ItemList[_0x709961(0x5ef)][_0x709961(0x67e)] = function () { const _0x169788 = _0x709961; if (this['isCursorMovable']()) { const _0x4b00f5 = this[_0x169788(0x624)](); if (this[_0x169788(0x515)]() <= 0x1) !this[_0x169788(0x457)]('pagedown') && Input[_0x169788(0x5c1)](_0x169788(0x5af)) && this[_0x169788(0x222)](), !this['isHandled']('pageup') && Input['isTriggered'](_0x169788(0x277)) && this[_0x169788(0x57e)](); else { if (this[_0x169788(0x515)]() > 0x1) { Input[_0x169788(0x27f)](_0x169788(0x4b9)) && this[_0x169788(0x35b)](Input[_0x169788(0x5c1)](_0x169788(0x4b9))); Input[_0x169788(0x27f)](_0x169788(0x316)) && this['cursorLeft'](Input[_0x169788(0x5c1)]('left')); if (this[_0x169788(0x5f2)]()) Input['isTriggered'](_0x169788(0x5af)) && Input[_0x169788(0x40b)]('shift') && this[_0x169788(0x222)](), Input[_0x169788(0x5c1)]('pageup') && Input[_0x169788(0x40b)](_0x169788(0x5ce)) && this[_0x169788(0x57e)](); else { if (_0x169788(0x59d) === _0x169788(0x59d)) { if (Input[_0x169788(0x5c1)](_0x169788(0x5af))) { if (_0x169788(0x4f6) !== _0x169788(0x604)) this[_0x169788(0x222)](); else return !![]; } if (Input[_0x169788(0x5c1)](_0x169788(0x277))) { if (_0x169788(0x524) === 'WpFIY') this['cursorPageup'](); else { const _0x3c14c2 = _0x4d6d69(_0x14dfe5['$1']) || 0x1; if (_0x27670d >= _0x3c14c2) return !![]; } } } else { const _0x3fbc44 = this['isRightInputMode']() ? this['mainCommandWidth']() : 0x0, _0x3e2499 = this['mainAreaTop'](), _0x5eb297 = _0x4a910c[_0x169788(0x628)] - this[_0x169788(0x5a8)](), _0x39cc3a = this[_0x169788(0x6ac)](0x1, !![]); return new _0xfdeb77(_0x3fbc44, _0x3e2499, _0x5eb297, _0x39cc3a); } } } } Input[_0x169788(0x27f)](_0x169788(0x32a)) && (Input[_0x169788(0x40b)]('shift') && this[_0x169788(0x448)]() ? this['cursorPagedown']() : this['cursorDown'](Input[_0x169788(0x5c1)](_0x169788(0x32a)))); if (Input[_0x169788(0x27f)]('up')) { if ('RXYTo' !== _0x169788(0x503)) { const _0x40a67d = this[_0x169788(0x3c2)]['note']; if (_0x40a67d[_0x169788(0x1ed)](/<ALWAYS HIT>/i)) return _0x169788(0x545); else { if (_0x40a67d[_0x169788(0x1ed)](/<ALWAYS HIT RATE: (\d+)([%％])>/i)) return _0x169788(0x400)[_0x169788(0x60c)](_0x4d33ac(_0x31ee2d['$1'])); } } else Input[_0x169788(0x40b)](_0x169788(0x5ce)) && this[_0x169788(0x448)]() ? this[_0x169788(0x57e)]() : this[_0x169788(0x649)](Input[_0x169788(0x5c1)]('up')); } if (Imported['VisuMZ_0_CoreEngine']) { if (_0x169788(0x233) !== 'QQwYN') return this[_0x169788(0x3c2)][_0x169788(0x6a5)]; else this[_0x169788(0x2d5)](); } if (this[_0x169788(0x624)]() !== _0x4b00f5) { if (_0x169788(0x2ce) !== _0x169788(0x2ce)) return this[_0x169788(0x43c)][_0x1c40c1]; else this[_0x169788(0x5d0)](); } } }, Window_ItemList[_0x709961(0x5ef)][_0x709961(0x5f2)] = function () { const _0x23ae0a = _0x709961, _0x3a0eca = SceneManager[_0x23ae0a(0x6c1)], _0x80228f = [Scene_Item, Scene_Shop]; return _0x80228f[_0x23ae0a(0x3bb)](_0x3a0eca[_0x23ae0a(0x3f7)]); }, Window_ItemList[_0x709961(0x5ef)][_0x709961(0x55a)] = function () { const _0x3bb93d = _0x709961; Window_Selectable[_0x3bb93d(0x5ef)][_0x3bb93d(0x55a)][_0x3bb93d(0x376)](this), this[_0x3bb93d(0x5cd)] && this[_0x3bb93d(0x5cd)][_0x3bb93d(0x6d8)]() && this[_0x3bb93d(0x5cd)][_0x3bb93d(0x55a)](); }, Window_ItemList[_0x709961(0x5ef)][_0x709961(0x6df)] = function () { const _0x559c84 = _0x709961; Window_Selectable['prototype'][_0x559c84(0x6df)]['call'](this), this[_0x559c84(0x5cd)] && this['_categoryWindow'][_0x559c84(0x6d8)]() && this[_0x559c84(0x5cd)][_0x559c84(0x6df)](); }, Window_ItemList['prototype'][_0x709961(0x4ef)] = function (_0x1dd75f) { const _0x24b37f = _0x709961; this[_0x24b37f(0x275)] !== _0x1dd75f && (this[_0x24b37f(0x275)] = _0x1dd75f, this['refresh'](), this[_0x24b37f(0x5cd)] && this['_categoryWindow'][_0x24b37f(0x6d8)]() ? this['smoothSelect'](0x0) : this['scrollTo'](0x0, 0x0)); }, VisuMZ[_0x709961(0x3db)][_0x709961(0x370)] = Window_ItemList[_0x709961(0x5ef)][_0x709961(0x515)], Window_ItemList[_0x709961(0x5ef)][_0x709961(0x515)] = function () { const _0x47e2ce = _0x709961; if (SceneManager[_0x47e2ce(0x6c1)]['constructor'] === Scene_Battle) return VisuMZ['ItemsEquipsCore'][_0x47e2ce(0x370)]['call'](this); else return SceneManager['_scene'][_0x47e2ce(0x3f7)] === Scene_Map ? VisuMZ['ItemsEquipsCore']['Window_ItemList_maxCols']['call'](this) : _0x47e2ce(0x387) === _0x47e2ce(0x593) ? this['_buttonAssistWindow'][_0x47e2ce(0x4ca)] / 0x5 / -0x3 : VisuMZ[_0x47e2ce(0x3db)][_0x47e2ce(0x6b0)][_0x47e2ce(0x309)][_0x47e2ce(0x537)]; }, VisuMZ['ItemsEquipsCore'][_0x709961(0x40c)] = Window_ItemList[_0x709961(0x5ef)][_0x709961(0x5cb)], Window_ItemList[_0x709961(0x5ef)][_0x709961(0x5cb)] = function () { const _0x327e03 = _0x709961; if (this[_0x327e03(0x515)]() <= 0x1) return Window_Selectable[_0x327e03(0x5ef)][_0x327e03(0x5cb)][_0x327e03(0x376)](this); else { if (_0x327e03(0x5f1) !== _0x327e03(0x5f1)) { if (_0x5ee1ee) { const _0x227071 = _0x41d530 + (this[_0x327e03(0x361)]() - _0x4a0ffb['iconHeight']) / 0x2, _0x49a314 = _0x277cc2['iconWidth'] + 0x4, _0x31c5ac = _0x5dde11[_0x327e03(0x5f5)](0x0, _0x426a6c - _0x49a314); this[_0x327e03(0x61c)](_0x9684e0[_0x327e03(0x2c5)](_0x4a0fe5)), this['drawIcon'](_0x249ca5[_0x327e03(0x4a7)], _0x33e5f1, _0x227071), this[_0x327e03(0x62c)](_0x3bc337['name'], _0x3dc605 + _0x49a314, _0x407576, _0x31c5ac), this['resetTextColor'](); } } else return VisuMZ[_0x327e03(0x3db)][_0x327e03(0x40c)][_0x327e03(0x376)](this); } }, Window_ItemList['prototype'][_0x709961(0x3bb)] = function (_0x3d6c6c) { const _0x17f05b = _0x709961; switch (this[_0x17f05b(0x275)]) { case 'AllItems': return DataManager['isItem'](_0x3d6c6c); case 'RegularItems': return DataManager[_0x17f05b(0x2f3)](_0x3d6c6c) && _0x3d6c6c[_0x17f05b(0x4d4)] === 0x1; case _0x17f05b(0x68e): return DataManager[_0x17f05b(0x2f3)](_0x3d6c6c) && _0x3d6c6c['itypeId'] === 0x2; case 'HiddenItemA': return DataManager['isItem'](_0x3d6c6c) && _0x3d6c6c[_0x17f05b(0x4d4)] === 0x3; case _0x17f05b(0x2aa): return DataManager['isItem'](_0x3d6c6c) && _0x3d6c6c[_0x17f05b(0x4d4)] === 0x4; case _0x17f05b(0x41b): return DataManager['isItem'](_0x3d6c6c) && _0x3d6c6c[_0x17f05b(0x6a5)]; case _0x17f05b(0x4d3): return DataManager[_0x17f05b(0x2f3)](_0x3d6c6c) && !_0x3d6c6c[_0x17f05b(0x6a5)]; case _0x17f05b(0x6e7): return DataManager[_0x17f05b(0x2f3)](_0x3d6c6c) && [0x0][_0x17f05b(0x3bb)](_0x3d6c6c[_0x17f05b(0x378)]); case 'BattleUsable': return DataManager[_0x17f05b(0x2f3)](_0x3d6c6c) && [0x0, 0x1][_0x17f05b(0x3bb)](_0x3d6c6c[_0x17f05b(0x378)]); case _0x17f05b(0x5f7): return DataManager[_0x17f05b(0x2f3)](_0x3d6c6c) && [0x0, 0x2][_0x17f05b(0x3bb)](_0x3d6c6c[_0x17f05b(0x378)]); case _0x17f05b(0x3a3): return DataManager['isItem'](_0x3d6c6c) && [0x3][_0x17f05b(0x3bb)](_0x3d6c6c[_0x17f05b(0x378)]); case _0x17f05b(0x242): return DataManager['isWeapon'](_0x3d6c6c); case _0x17f05b(0x5a3): return DataManager[_0x17f05b(0x3b3)](_0x3d6c6c); default: if (this[_0x17f05b(0x275)][_0x17f05b(0x1ed)](/WTYPE:(\d+)/i)) { if (_0x17f05b(0x3f2) !== _0x17f05b(0x1b8)) return DataManager[_0x17f05b(0x67a)](_0x3d6c6c) && _0x3d6c6c[_0x17f05b(0x4f2)] === Number(RegExp['$1']); else { const _0x4d5ee7 = this['mainCommandWidth'](), _0xc2bc58 = this[_0x17f05b(0x6ac)](0x1, !![]), _0x211ac2 = this['isRightInputMode']() ? 0x0 : _0x347f0b[_0x17f05b(0x628)] - _0x4d5ee7, _0xfceb48 = this[_0x17f05b(0x31b)](); return new _0xbdca4e(_0x211ac2, _0xfceb48, _0x4d5ee7, _0xc2bc58); } } else { if (this[_0x17f05b(0x275)][_0x17f05b(0x1ed)](/WTYPE:(.*)/i)) { if (_0x17f05b(0x517) !== 'xfyBA') _0x3592c3 = _0x4937bd(_0x396947['$1'])[_0x17f05b(0x3c4)](); else { const _0x5d5c30 = $dataSystem[_0x17f05b(0x5e5)]['indexOf'](String(RegExp['$1'])[_0x17f05b(0x3c4)]()); return DataManager[_0x17f05b(0x67a)](_0x3d6c6c) && _0x3d6c6c[_0x17f05b(0x4f2)] === _0x5d5c30; } } else { if (this[_0x17f05b(0x275)][_0x17f05b(0x1ed)](/ATYPE:(\d+)/i)) return DataManager[_0x17f05b(0x3b3)](_0x3d6c6c) && _0x3d6c6c[_0x17f05b(0x3e1)] === Number(RegExp['$1']); else { if (this[_0x17f05b(0x275)][_0x17f05b(0x1ed)](/ATYPE:(.*)/i)) { if (_0x17f05b(0x570) === _0x17f05b(0x4e2)) { _0x59de46 = this['convertInitEquipsToItems'](_0x30a512); const _0x3b2e1a = this['equipSlots'](); this[_0x17f05b(0x5fd)] = []; for (let _0x109768 = 0x0; _0x109768 < _0x3b2e1a['length']; _0x109768++) { this[_0x17f05b(0x5fd)][_0x109768] = new _0x7fa957(); } for (let _0x51c429 = 0x0; _0x51c429 < _0x3b2e1a[_0x17f05b(0x321)]; _0x51c429++) { const _0x3c076f = _0x3b2e1a[_0x51c429], _0x5e8f2f = this[_0x17f05b(0x563)](_0x2ac576, _0x3c076f); if (this[_0x17f05b(0x447)](_0x5e8f2f)) this['_equips'][_0x51c429]['setObject'](_0x5e8f2f); } this['releaseUnequippableItems'](!![]), this['refresh'](); } else { const _0x2a9cb5 = $dataSystem[_0x17f05b(0x4eb)][_0x17f05b(0x532)](String(RegExp['$1'])[_0x17f05b(0x3c4)]()); return DataManager[_0x17f05b(0x3b3)](_0x3d6c6c) && _0x3d6c6c[_0x17f05b(0x3e1)] === _0x2a9cb5; } } else { if (this[_0x17f05b(0x275)][_0x17f05b(0x1ed)](/ETYPE:(\d+)/i)) return !!_0x3d6c6c && _0x3d6c6c[_0x17f05b(0x5fe)] === Number(RegExp['$1']); else { if (this[_0x17f05b(0x275)][_0x17f05b(0x1ed)](/ETYPE:(.*)/i)) { const _0xb0cb58 = $dataSystem[_0x17f05b(0x2c9)][_0x17f05b(0x532)](String(RegExp['$1'])['trim']()); return DataManager[_0x17f05b(0x3b3)](_0x3d6c6c) && _0x3d6c6c['etypeId'] === _0xb0cb58; } else { if (this[_0x17f05b(0x275)][_0x17f05b(0x1ed)](/Category:(.*)/i)) { if ('ouUDr' !== _0x17f05b(0x644)) this[_0x17f05b(0x6ba)](_0x5be6ab, _0x210f4f['x'] + _0x5773d4['width'] - _0x402ea0, _0xb18640['y'], _0x24ee1d); else return !!_0x3d6c6c && _0x3d6c6c[_0x17f05b(0x5d4)][_0x17f05b(0x3bb)](String(RegExp['$1'])[_0x17f05b(0x45c)]()[_0x17f05b(0x3c4)]()); } } } } } } } }return ![]; }, VisuMZ[_0x709961(0x3db)][_0x709961(0x2c4)] = Window_ItemList['prototype'][_0x709961(0x5f3)], Window_ItemList[_0x709961(0x5ef)][_0x709961(0x5f3)] = function () { const _0x51352d = _0x709961; VisuMZ[_0x51352d(0x3db)][_0x51352d(0x2c4)][_0x51352d(0x376)](this); if (this[_0x51352d(0x4cc)]()) this[_0x51352d(0x69c)](); }, Window_ItemList['prototype'][_0x709961(0x4cc)] = function () { const _0x51d16 = _0x709961, _0x3732c2 = [_0x51d16(0x68a), _0x51d16(0x5ae)], _0x1dccf4 = SceneManager[_0x51d16(0x6c1)]; return _0x3732c2['includes'](_0x1dccf4[_0x51d16(0x3f7)]['name']); }, Window_ItemList[_0x709961(0x5ef)][_0x709961(0x69c)] = function () { const _0x4fad1a = _0x709961, _0x2dcd6b = Window_ItemCategory[_0x4fad1a(0x29a)], _0x5d28ec = _0x2dcd6b[_0x4fad1a(0x49e)](_0x5008cf => _0x5008cf['Type'] === this[_0x4fad1a(0x275)]); if (!_0x5d28ec) return; const _0x5abc64 = ((_0x5d28ec['SortBy'] ?? 'ID') || 'ID')[_0x4fad1a(0x45c)]()['trim'](); if (_0x5abc64 === 'NAME') { if (_0x4fad1a(0x276) !== _0x4fad1a(0x276)) { const _0x40366f = _0x127904(_0x59b55c['$1'])[_0x4fad1a(0x617)](',')[_0x4fad1a(0x1ac)](_0x135d31 => _0x8a815f(_0x135d31)); if (_0x40366f[_0x4fad1a(0x328)](_0x16084a => _0x19c8f0[_0x4fad1a(0x337)](_0x16084a))) return ![]; } else this[_0x4fad1a(0x53a)][_0x4fad1a(0x479)]((_0x4f73e7, _0xc6313e) => { const _0x119740 = _0x4fad1a; if ('ffLJu' === _0x119740(0x6b9)) return _0x5964e1['ItemsEquipsCore'][_0x119740(0x6b0)]['EquipScene'][_0x119740(0x42d)]; else { if (!!_0x4f73e7 && !!_0xc6313e) return _0x4f73e7[_0x119740(0x5a7)][_0x119740(0x2f4)](_0xc6313e[_0x119740(0x5a7)]); return 0x0; } }); } else { } }, Window_ItemList[_0x709961(0x5ef)][_0x709961(0x2b4)] = function () { return !![]; }, VisuMZ[_0x709961(0x3db)]['Window_ItemList_drawItem'] = Window_ItemList[_0x709961(0x5ef)][_0x709961(0x602)], Window_ItemList[_0x709961(0x5ef)][_0x709961(0x602)] = function (_0x5be1bd) { const _0x3372bf = _0x709961; VisuMZ['ItemsEquipsCore'][_0x3372bf(0x3cf)]['call'](this, _0x5be1bd), this[_0x3372bf(0x68f)](_0x5be1bd); }, Window_ItemList[_0x709961(0x5ef)][_0x709961(0x522)] = function (_0xff76b3, _0x426cc0, _0x3c1fc1, _0x57f256) { const _0x3af76d = _0x709961; Window_Selectable[_0x3af76d(0x5ef)]['drawItemNumber'][_0x3af76d(0x376)](this, _0xff76b3, _0x426cc0, _0x3c1fc1, _0x57f256); }, Window_ItemList[_0x709961(0x5ef)][_0x709961(0x68f)] = function (_0x31443f) { const _0x34748c = _0x709961, _0x526497 = this[_0x34748c(0x364)](_0x31443f); if (!_0x526497 || !this[_0x34748c(0x2b4)]()) return; if (!$gameParty[_0x34748c(0x572)](_0x526497)) return; const _0x476339 = this[_0x34748c(0x46c)](_0x31443f), _0x26c347 = _0x476339['x'], _0x136897 = _0x476339['y'] + (this[_0x34748c(0x361)]() - ImageManager[_0x34748c(0x2ea)]) / 0x2, _0x5001f6 = VisuMZ['ItemsEquipsCore']['Settings'][_0x34748c(0x36c)][_0x34748c(0x33b)], _0x31b39e = VisuMZ[_0x34748c(0x3db)]['Settings']['New'][_0x34748c(0x681)]; this[_0x34748c(0x5ea)](_0x526497, _0x26c347 + _0x5001f6, _0x136897 + _0x31b39e); }, Window_ItemList[_0x709961(0x5ef)][_0x709961(0x6b6)] = function (_0x4fccab) { const _0x9ce590 = _0x709961; this[_0x9ce590(0x633)] = _0x4fccab, this[_0x9ce590(0x3d8)](); }, VisuMZ[_0x709961(0x3db)][_0x709961(0x674)] = Window_ItemList[_0x709961(0x5ef)]['updateHelp'], Window_ItemList['prototype'][_0x709961(0x317)] = function () { const _0xdf8280 = _0x709961; VisuMZ[_0xdf8280(0x3db)][_0xdf8280(0x674)][_0xdf8280(0x376)](this); if (this['_statusWindow'] && this[_0xdf8280(0x633)][_0xdf8280(0x3f7)] === Window_ShopStatus) { if ('FmQLD' !== _0xdf8280(0x35f)) this['_statusWindow'][_0xdf8280(0x57b)](this[_0xdf8280(0x24d)]()); else { if (this['isOptimizeEquipOk'](_0x2ade90)) this['changeEquip'](_0x42922e, null); } } }, Window_BattleItem[_0x709961(0x5ef)][_0x709961(0x24b)] = function (_0x29d714) { const _0x4d6c36 = _0x709961; if (BattleManager[_0x4d6c36(0x67f)]()) { if (_0x4d6c36(0x1b1) !== _0x4d6c36(0x66b)) return BattleManager[_0x4d6c36(0x67f)]()[_0x4d6c36(0x478)](_0x29d714); else { if (this[_0x4d6c36(0x502)] && this['_numberWindow'][_0x4d6c36(0x3bd)]) return _0x184141[_0x4d6c36(0x3db)][_0x4d6c36(0x6b0)][_0x4d6c36(0x300)][_0x4d6c36(0x420)]; return _0x452b96[_0x4d6c36(0x5ef)][_0x4d6c36(0x39a)]['call'](this); } } else return Window_ItemList[_0x4d6c36(0x5ef)][_0x4d6c36(0x24b)][_0x4d6c36(0x376)](this, _0x29d714); }, Window_EventItem[_0x709961(0x5ef)][_0x709961(0x2b4)] = function () { return ![]; }, Window_EquipStatus['prototype'][_0x709961(0x289)] = function () { const _0x2212d4 = _0x709961; return VisuMZ[_0x2212d4(0x3db)][_0x2212d4(0x6b0)]['EquipScene']['EnableLayout']; }, VisuMZ[_0x709961(0x3db)]['Window_EquipStatus_refresh'] = Window_EquipStatus[_0x709961(0x5ef)]['refresh'], Window_EquipStatus['prototype'][_0x709961(0x349)] = function () { const _0x4931ad = _0x709961; this[_0x4931ad(0x2ee)](), this[_0x4931ad(0x4e3)](); if (this['_actor']) this[_0x4931ad(0x3bc)][_0x4931ad(0x349)](); this[_0x4931ad(0x289)]() ? this[_0x4931ad(0x2ca)]() : VisuMZ[_0x4931ad(0x3db)][_0x4931ad(0x50d)][_0x4931ad(0x376)](this); }, Window_EquipStatus['prototype'][_0x709961(0x2ca)] = function () { const _0x575ed1 = _0x709961; this[_0x575ed1(0x30a)][_0x575ed1(0x556)](); if (!this[_0x575ed1(0x3bc)]) return; if (this[_0x575ed1(0x30e)]()) { if (_0x575ed1(0x5dc) === 'DjWPZ') { const _0x428816 = ImageManager[_0x575ed1(0x401)](this['_actor'][_0x575ed1(0x1f1)]()); _0x428816[_0x575ed1(0x535)](this[_0x575ed1(0x273)][_0x575ed1(0x4b0)](this)); } else { if (!_0x405f74[_0x575ed1(0x2f3)](this['_item'])) return ![]; const _0x4061de = this['getItemConsumableLabel'](); this[_0x575ed1(0x2c2)](_0x4061de, _0x35fbab, _0x119426, _0x4a0d09, !![]); const _0xe35eee = this[_0x575ed1(0x2f1)](); return this[_0x575ed1(0x2c2)](_0xe35eee, _0x5aed0c, _0x583d4a, _0x2d61eb, ![], _0x575ed1(0x4b9)), this['drawItemDarkRect'](_0x1c3546, _0x20022d, _0x1ab366), this[_0x575ed1(0x4e3)](), !![]; } } else this[_0x575ed1(0x377)](); }, Window_EquipStatus['prototype'][_0x709961(0x30e)] = function () { const _0x3f981d = _0x709961; return Imported[_0x3f981d(0x651)] && this[_0x3f981d(0x3bc)]['getMenuImage']() !== '' && VisuMZ[_0x3f981d(0x3db)]['Settings'][_0x3f981d(0x6b4)][_0x3f981d(0x6d3)]; }, Window_EquipStatus['prototype']['onMenuImageLoad'] = function () { const _0x952b6e = _0x709961; VisuMZ['ItemsEquipsCore'][_0x952b6e(0x6b0)]['EquipScene']['DrawPortraitJS'][_0x952b6e(0x376)](this), this[_0x952b6e(0x52a)](); }, Window_EquipStatus[_0x709961(0x5ef)][_0x709961(0x377)] = function () { const _0x17a059 = _0x709961; VisuMZ['ItemsEquipsCore'][_0x17a059(0x6b0)][_0x17a059(0x6b4)][_0x17a059(0x620)][_0x17a059(0x376)](this), this[_0x17a059(0x52a)](); }, Window_EquipStatus[_0x709961(0x5ef)]['drawParamsItemsEquipsCore'] = function () { const _0x5af85e = _0x709961; this[_0x5af85e(0x4e3)](), VisuMZ[_0x5af85e(0x3db)][_0x5af85e(0x6b0)][_0x5af85e(0x6b4)][_0x5af85e(0x221)][_0x5af85e(0x376)](this); }, Window_EquipStatus[_0x709961(0x5ef)]['drawItemActorMenuImage'] = function (_0x31490a, _0x9e87e9, _0x40628a, _0x416e89, _0x242fa5) { const _0x46d645 = _0x709961, _0x11ba78 = ImageManager[_0x46d645(0x401)](_0x31490a['getMenuImage']()), _0x3f4f0a = this[_0x46d645(0x224)] - _0x11ba78[_0x46d645(0x4ca)]; _0x9e87e9 += _0x3f4f0a / 0x2; if (_0x3f4f0a < 0x0) _0x416e89 -= _0x3f4f0a; Window_StatusBase[_0x46d645(0x5ef)][_0x46d645(0x1f5)][_0x46d645(0x376)](this, _0x31490a, _0x9e87e9, _0x40628a, _0x416e89, _0x242fa5); }, Window_EquipStatus['prototype'][_0x709961(0x2eb)] = function () { const _0x118441 = _0x709961; return Imported[_0x118441(0x615)] ? VisuMZ['CoreEngine'][_0x118441(0x6b0)][_0x118441(0x512)][_0x118441(0x283)] : [0x0, 0x1, 0x2, 0x3, 0x4, 0x5, 0x6, 0x7]; }, Window_EquipStatus[_0x709961(0x5ef)][_0x709961(0x27d)] = function () { const _0x21c01e = _0x709961; return VisuMZ[_0x21c01e(0x3db)][_0x21c01e(0x6b0)][_0x21c01e(0x6b4)][_0x21c01e(0x4bb)]; }, Window_EquipStatus[_0x709961(0x5ef)][_0x709961(0x39d)] = function () { const _0x8990b3 = _0x709961; return Imported[_0x8990b3(0x615)] && VisuMZ[_0x8990b3(0x516)][_0x8990b3(0x6b0)]['Param'][_0x8990b3(0x426)]; }, Window_EquipStatus[_0x709961(0x5ef)]['drawUpdatedParamName'] = function (_0x25e80d, _0x1688ec, _0x2b5f9e, _0x28b2a3) { const _0x495299 = _0x709961, _0x3c87ae = this['itemPadding'](); Imported[_0x495299(0x615)] ? this[_0x495299(0x623)](_0x1688ec + _0x3c87ae, _0x2b5f9e, _0x28b2a3, _0x25e80d, ![]) : this[_0x495299(0x62c)](TextManager[_0x495299(0x307)](_0x25e80d), _0x1688ec + _0x3c87ae, _0x2b5f9e, _0x28b2a3); }, Window_EquipStatus[_0x709961(0x5ef)]['drawUpdatedBeforeParamValue'] = function (_0x55beb8, _0x15d4eb, _0x5d5188, _0x462a10) { const _0x222b31 = _0x709961, _0x3834af = this[_0x222b31(0x407)](); let _0x3b6e41 = 0x0; if (Imported['VisuMZ_0_CoreEngine']) _0x3b6e41 = this[_0x222b31(0x3bc)]['paramValueByName'](_0x55beb8, !![]); else { if (_0x222b31(0x6a9) !== _0x222b31(0x245)) _0x3b6e41 = this[_0x222b31(0x3bc)][_0x222b31(0x307)](_0x55beb8); else return this[_0x222b31(0x386)](); } const _0x1e8269 = _0x3b6e41; this[_0x222b31(0x62c)](_0x3b6e41, _0x15d4eb, _0x5d5188, _0x462a10 - _0x3834af, 'right'); }, Window_EquipStatus[_0x709961(0x5ef)][_0x709961(0x454)] = function (_0x51327b, _0x33c08a, _0x5365de, _0xf114a5) { const _0x3a772e = _0x709961, _0x3d8d27 = this[_0x3a772e(0x407)](); let _0x38fdd9 = 0x0, _0x1aa3cc = 0x0, _0x592a9a = ''; if (this['_tempActor']) { Imported[_0x3a772e(0x615)] ? _0x3a772e(0x3f8) === _0x3a772e(0x203) ? (_0x54a9f6[_0x3a772e(0x3db)][_0x3a772e(0x369)][_0x3a772e(0x376)](this), this[_0x3a772e(0x6d8)]() && this[_0x3a772e(0x38e)]()) : (_0x38fdd9 = this[_0x3a772e(0x3bc)][_0x3a772e(0x29d)](_0x51327b, ![]), _0x1aa3cc = this['_tempActor'][_0x3a772e(0x29d)](_0x51327b, ![]), _0x592a9a = this[_0x3a772e(0x342)][_0x3a772e(0x29d)](_0x51327b, !![])) : (_0x38fdd9 = this[_0x3a772e(0x3bc)]['param'](_0x51327b), _0x1aa3cc = this[_0x3a772e(0x342)][_0x3a772e(0x307)](_0x51327b), _0x592a9a = this[_0x3a772e(0x342)]['param'](_0x51327b)); const _0x5bc09b = _0x38fdd9, _0x6ee9d6 = _0x1aa3cc; diffValue = _0x6ee9d6 - _0x5bc09b, this[_0x3a772e(0x61c)](ColorManager[_0x3a772e(0x4da)](diffValue)), this[_0x3a772e(0x62c)](_0x592a9a, _0x33c08a, _0x5365de, _0xf114a5 - _0x3d8d27, _0x3a772e(0x4b9)); } }, Window_EquipStatus[_0x709961(0x5ef)][_0x709961(0x390)] = function (_0x54bc11, _0x3eb9e5, _0x8cc6be, _0xf48e18) { const _0x1f579a = _0x709961, _0x4fff92 = this[_0x1f579a(0x407)](); let _0x5dfcf2 = 0x0, _0x235810 = 0x0, _0x3a0aaa = ![]; if (this['_tempActor']) { if (Imported['VisuMZ_0_CoreEngine']) { if (_0x1f579a(0x47d) !== 'sysiF') _0x5dfcf2 = this[_0x1f579a(0x3bc)][_0x1f579a(0x29d)](_0x54bc11, ![]), _0x235810 = this['_tempActor'][_0x1f579a(0x29d)](_0x54bc11, ![]), _0x3a0aaa = String(this[_0x1f579a(0x3bc)][_0x1f579a(0x29d)](_0x54bc11, !![]))[_0x1f579a(0x1ed)](/([%％])/i); else return _0xb27bec; } else { if (_0x1f579a(0x434) === _0x1f579a(0x434)) _0x5dfcf2 = this[_0x1f579a(0x3bc)][_0x1f579a(0x307)](_0x54bc11), _0x235810 = this[_0x1f579a(0x342)][_0x1f579a(0x307)](_0x54bc11), _0x3a0aaa = _0x5dfcf2 % 0x1 !== 0x0 || _0x235810 % 0x1 !== 0x0; else { if (_0x7e7afd['id'] === _0x5af7e1['id']) _0xc036d2 += 0x1; } } const _0x583798 = _0x5dfcf2, _0x57b722 = _0x235810, _0x406264 = _0x57b722 - _0x583798; let _0x30bca4 = _0x406264; if (_0x3a0aaa) _0x30bca4 = Math[_0x1f579a(0x284)](_0x406264 * 0x64) + '%'; _0x406264 !== 0x0 && (this[_0x1f579a(0x61c)](ColorManager['paramchangeTextColor'](_0x406264)), _0x30bca4 = (_0x406264 > 0x0 ? _0x1f579a(0x60a) : _0x1f579a(0x474))[_0x1f579a(0x60c)](_0x30bca4), this[_0x1f579a(0x62c)](_0x30bca4, _0x3eb9e5 + _0x4fff92, _0x8cc6be, _0xf48e18, _0x1f579a(0x316))); } }, Window_EquipStatus[_0x709961(0x5ef)][_0x709961(0x533)] = function (_0xd3174f, _0x292706, _0x53c73e, _0x382fb0, _0xecd52f) { const _0x4e3cc2 = _0x709961; if (VisuMZ[_0x4e3cc2(0x3db)][_0x4e3cc2(0x6b0)]['EquipScene'][_0x4e3cc2(0x372)] === ![]) return; _0xecd52f = Math[_0x4e3cc2(0x5f5)](_0xecd52f || 0x1, 0x1); while (_0xecd52f--) { _0x382fb0 = _0x382fb0 || this['lineHeight'](), this[_0x4e3cc2(0x30a)][_0x4e3cc2(0x32b)] = 0xa0; const _0x43da5d = ColorManager[_0x4e3cc2(0x6a7)](); this[_0x4e3cc2(0x30a)][_0x4e3cc2(0x68d)](_0xd3174f + 0x1, _0x292706 + 0x1, _0x53c73e - 0x2, _0x382fb0 - 0x2, _0x43da5d), this['contents'][_0x4e3cc2(0x32b)] = 0xff; } }, ColorManager[_0x709961(0x6a7)] = function () { const _0x4232d7 = _0x709961, _0x2e6be3 = VisuMZ['ItemsEquipsCore'][_0x4232d7(0x6b0)][_0x4232d7(0x6b4)]; let _0x216b49 = _0x2e6be3['BackRectColor'] !== undefined ? _0x2e6be3[_0x4232d7(0x658)] : 0x13; return ColorManager[_0x4232d7(0x3fd)](_0x216b49); }, VisuMZ['ItemsEquipsCore'][_0x709961(0x6b2)] = Window_EquipCommand[_0x709961(0x5ef)]['initialize'], Window_EquipCommand[_0x709961(0x5ef)][_0x709961(0x527)] = function (_0x389663) { const _0x357bd7 = _0x709961; VisuMZ[_0x357bd7(0x3db)][_0x357bd7(0x6b2)][_0x357bd7(0x376)](this, _0x389663), this[_0x357bd7(0x531)](_0x389663); }, Window_EquipCommand['prototype'][_0x709961(0x531)] = function (_0x1e4fe2) { const _0x237027 = _0x709961, _0xc40c02 = new Rectangle(0x0, 0x0, _0x1e4fe2[_0x237027(0x4ca)], _0x1e4fe2[_0x237027(0x232)]); this[_0x237027(0x3fb)] = new Window_Base(_0xc40c02), this[_0x237027(0x3fb)]['opacity'] = 0x0, this[_0x237027(0x271)](this[_0x237027(0x3fb)]), this[_0x237027(0x1ce)](); }, Window_EquipCommand[_0x709961(0x5ef)][_0x709961(0x3d8)] = function () { const _0x5d8b52 = _0x709961; Window_HorzCommand[_0x5d8b52(0x5ef)]['callUpdateHelp'][_0x5d8b52(0x376)](this); if (this[_0x5d8b52(0x3fb)]) this[_0x5d8b52(0x1ce)](); }, Window_EquipCommand[_0x709961(0x5ef)][_0x709961(0x1ce)] = function () { const _0x36b701 = _0x709961, _0x351659 = this[_0x36b701(0x3fb)]; _0x351659[_0x36b701(0x30a)][_0x36b701(0x556)](); const _0x189d90 = this[_0x36b701(0x2b7)](this[_0x36b701(0x624)]()); if (_0x189d90 === _0x36b701(0x220)) { if (_0x36b701(0x486) !== _0x36b701(0x384)) { const _0x1bb979 = this[_0x36b701(0x46c)](this[_0x36b701(0x624)]()); let _0x4e807c = this[_0x36b701(0x626)](this[_0x36b701(0x624)]()); _0x4e807c = _0x4e807c[_0x36b701(0x3a5)](/\\I\[(\d+)\]/gi, ''), _0x351659[_0x36b701(0x4e3)](), this[_0x36b701(0x25d)](_0x4e807c, _0x1bb979), this[_0x36b701(0x690)](_0x4e807c, _0x1bb979), this[_0x36b701(0x45a)](_0x4e807c, _0x1bb979); } else { _0x55c139['ItemsEquipsCore'][_0x36b701(0x2c4)][_0x36b701(0x376)](this); if (this[_0x36b701(0x4cc)]()) this[_0x36b701(0x69c)](); } } }, Window_EquipCommand[_0x709961(0x5ef)]['commandNameWindowDrawBackground'] = function (_0x4dc19f, _0x6c7caf) { }, Window_EquipCommand['prototype'][_0x709961(0x690)] = function (_0x4a6204, _0x517a8a) { const _0x393124 = _0x709961, _0x392a4d = this[_0x393124(0x3fb)]; _0x392a4d[_0x393124(0x62c)](_0x4a6204, 0x0, _0x517a8a['y'], _0x392a4d[_0x393124(0x224)], _0x393124(0x50b)); }, Window_EquipCommand[_0x709961(0x5ef)][_0x709961(0x45a)] = function (_0x5d0ffb, _0x5038d7) { const _0xf84f7 = _0x709961, _0xdbe3df = this['_commandNameWindow'], _0x285713 = $gameSystem[_0xf84f7(0x25c)](), _0x43043f = _0x5038d7['x'] + Math[_0xf84f7(0x4e5)](_0x5038d7[_0xf84f7(0x4ca)] / 0x2) + _0x285713; _0xdbe3df['x'] = _0xdbe3df[_0xf84f7(0x4ca)] / -0x2 + _0x43043f, _0xdbe3df['y'] = Math[_0xf84f7(0x4e5)](_0x5038d7['height'] / 0x2); }, Window_EquipCommand[_0x709961(0x5ef)][_0x709961(0x6d8)] = function () { const _0x349154 = _0x709961; return Imported['VisuMZ_0_CoreEngine'] && Window_HorzCommand['prototype']['isUseModernControls'][_0x349154(0x376)](this); }, Window_EquipCommand['prototype'][_0x709961(0x405)] = function () { const _0x2728b7 = _0x709961; if (this[_0x2728b7(0x1c4)]() === 'equip') Window_HorzCommand[_0x2728b7(0x5ef)][_0x2728b7(0x405)][_0x2728b7(0x376)](this); }, Window_EquipCommand['prototype'][_0x709961(0x67e)] = function () { const _0x373300 = _0x709961; !this[_0x373300(0x2f7)]() && ('slzKt' === _0x373300(0x458) ? Window_HorzCommand['prototype'][_0x373300(0x67e)][_0x373300(0x376)](this) : _0x153f60['prototype'][_0x373300(0x2ef)][_0x373300(0x376)](this)); }, Window_EquipCommand[_0x709961(0x5ef)][_0x709961(0x2f7)] = function () { const _0x2ec9aa = _0x709961; if (!this[_0x2ec9aa(0x565)]()) return ![]; if (SceneManager[_0x2ec9aa(0x6c1)][_0x2ec9aa(0x3f7)] !== Scene_Equip) return ![]; if (Input[_0x2ec9aa(0x5c1)]('down')) { if ('YXocE' !== _0x2ec9aa(0x6d6)) { if (!this[_0x2ec9aa(0x342)]) { const _0x244c1a = _0x58fd7b[_0x2ec9aa(0x340)](this); _0x244c1a['_tempActor'] = !![], _0x2861e6['ItemsEquipsCore'][_0x2ec9aa(0x35d)][_0x2ec9aa(0x376)](this, _0x21716e, _0x5ce95e), this[_0x2ec9aa(0x267)](_0x244c1a); } else _0x556400[_0x2ec9aa(0x3db)][_0x2ec9aa(0x35d)][_0x2ec9aa(0x376)](this, _0x1592e3, _0x5a6bf5); } else this[_0x2ec9aa(0x538)](); } return ![]; }, Window_EquipCommand[_0x709961(0x5ef)][_0x709961(0x538)] = function () { const _0x331ae8 = _0x709961; this[_0x331ae8(0x5d0)](), SceneManager[_0x331ae8(0x6c1)]['commandEquip'](), SceneManager[_0x331ae8(0x6c1)][_0x331ae8(0x3f9)][_0x331ae8(0x1de)](-0x1); }, Window_EquipCommand[_0x709961(0x5ef)]['maxCols'] = function () { const _0x1d6a2f = _0x709961; return this[_0x1d6a2f(0x3dc)] ? this[_0x1d6a2f(0x3dc)][_0x1d6a2f(0x321)] : 0x3; }, Window_EquipCommand[_0x709961(0x5ef)]['processTouchModernControls'] = function () { const _0x52d37f = _0x709961; if (this[_0x52d37f(0x4b8)]() && this[_0x52d37f(0x1f7)] && SceneManager[_0x52d37f(0x6c1)][_0x52d37f(0x3f7)] === Scene_Equip) { if (this[_0x52d37f(0x1ee)]() && TouchInput['isHovered']()) this['onTouchSelectModernControls'](![]); else TouchInput[_0x52d37f(0x5c1)]() && this['onTouchSelectModernControls'](!![]); TouchInput[_0x52d37f(0x536)]() && this[_0x52d37f(0x3df)](); } }, Window_EquipCommand['prototype']['onTouchSelectModernControls'] = function (_0x22c809) { const _0x415828 = _0x709961; this[_0x415828(0x56a)] = ![]; const _0xb94d63 = this[_0x415828(0x624)](), _0x38caf7 = this['hitIndex'](), _0xd70d1e = SceneManager[_0x415828(0x6c1)][_0x415828(0x3f9)]; if (_0xd70d1e[_0x415828(0x4b8)]() && _0xd70d1e[_0x415828(0x1f7)]) { if (_0x38caf7 >= 0x0) { if (_0x415828(0x6bd) !== _0x415828(0x6bd)) return this[_0x415828(0x4de)](_0x398f8a[_0x415828(0x3e1)]); else _0x38caf7 === this['index']() && (this[_0x415828(0x56a)] = !![]), this[_0x415828(0x55a)](), this[_0x415828(0x2a0)](_0x38caf7); } else { if (_0xd70d1e[_0x415828(0x2bb)]() >= 0x0) { if (_0x415828(0x2ed) !== 'kWtfG') this[_0x415828(0x6df)](), this[_0x415828(0x6cb)](); else { if (this['isItem'](_0x2e490f)) return ![]; if (!_0x19c1cd) return ![]; if (_0x4c8151[_0x415828(0x61d)]) return !![]; if (_0x2139c7[_0x415828(0x208)]()) return !![]; const _0x3c6882 = this['getEquipRequirements'](_0x48b702); for (const _0x44cb6e of _0x3c6882) { if (!this[_0x415828(0x687)](_0x5a2ef1, _0x44cb6e)) return ![]; } return !![]; } } } } _0x22c809 && this[_0x415828(0x624)]() !== _0xb94d63 && this['playCursorSound'](); }, Window_EquipCommand['prototype']['makeCommandList'] = function () { const _0x26d921 = _0x709961; this['addEquipCommand'](), this[_0x26d921(0x539)](), this[_0x26d921(0x3a0)](); }, Window_EquipCommand[_0x709961(0x5ef)]['refresh'] = function () { const _0x5c00f4 = _0x709961; Window_HorzCommand[_0x5c00f4(0x5ef)][_0x5c00f4(0x349)][_0x5c00f4(0x376)](this), this[_0x5c00f4(0x606)](); }, Window_EquipCommand['prototype'][_0x709961(0x2fa)] = function () { const _0x580072 = _0x709961; if (!this[_0x580072(0x230)]()) return; const _0x1382e4 = this['commandStyle'](), _0x303a7c = VisuMZ[_0x580072(0x3db)]['Settings'][_0x580072(0x6b4)][_0x580072(0x640)], _0x2434cb = _0x1382e4 === _0x580072(0x461) ? TextManager[_0x580072(0x4d6)] : _0x580072(0x297)['format'](_0x303a7c, TextManager[_0x580072(0x4d6)]), _0x18e154 = this[_0x580072(0x6c9)](); this[_0x580072(0x1cb)](_0x2434cb, _0x580072(0x530), _0x18e154); }, Window_EquipCommand[_0x709961(0x5ef)][_0x709961(0x230)] = function () { const _0x14809a = _0x709961; return !this[_0x14809a(0x6d8)](); }, Window_EquipCommand[_0x709961(0x5ef)][_0x709961(0x6c9)] = function () { return !![]; }, Window_EquipCommand[_0x709961(0x5ef)][_0x709961(0x539)] = function () { const _0x49c306 = _0x709961; if (!this['isOptimizeCommandAdded']()) return; const _0x50eca0 = this[_0x49c306(0x1be)](), _0x4023b1 = VisuMZ[_0x49c306(0x3db)][_0x49c306(0x6b0)][_0x49c306(0x6b4)][_0x49c306(0x5bb)], _0xa4c7a2 = _0x50eca0 === 'text' ? TextManager['optimize'] : _0x49c306(0x297)[_0x49c306(0x60c)](_0x4023b1, TextManager[_0x49c306(0x49d)]), _0x157463 = this[_0x49c306(0x201)](); this[_0x49c306(0x1cb)](_0xa4c7a2, _0x49c306(0x49d), _0x157463); }, Window_EquipCommand[_0x709961(0x5ef)]['isOptimizeCommandAdded'] = function () { const _0x466a9a = _0x709961; return VisuMZ[_0x466a9a(0x3db)][_0x466a9a(0x6b0)][_0x466a9a(0x6b4)][_0x466a9a(0x292)]; }, Window_EquipCommand[_0x709961(0x5ef)][_0x709961(0x201)] = function () { return !![]; }, Window_EquipCommand[_0x709961(0x5ef)][_0x709961(0x3a0)] = function () { const _0x535bfc = _0x709961; if (!this[_0x535bfc(0x639)]()) return; const _0x1a73f7 = this['commandStyle'](), _0x796f69 = VisuMZ[_0x535bfc(0x3db)][_0x535bfc(0x6b0)]['EquipScene']['CmdIconClear'], _0x5ce7b4 = _0x1a73f7 === _0x535bfc(0x461) ? TextManager['clear'] : _0x535bfc(0x297)['format'](_0x796f69, TextManager[_0x535bfc(0x556)]), _0x50186f = this[_0x535bfc(0x59e)](); this[_0x535bfc(0x1cb)](_0x5ce7b4, 'clear', _0x50186f); }, Window_EquipCommand[_0x709961(0x5ef)][_0x709961(0x639)] = function () { const _0x2baa0f = _0x709961; return VisuMZ[_0x2baa0f(0x3db)][_0x2baa0f(0x6b0)][_0x2baa0f(0x6b4)][_0x2baa0f(0x578)]; }, Window_EquipCommand['prototype']['isClearCommandEnabled'] = function () { return !![]; }, Window_EquipCommand[_0x709961(0x5ef)][_0x709961(0x27b)] = function () { const _0x40b7e4 = _0x709961; return VisuMZ[_0x40b7e4(0x3db)][_0x40b7e4(0x6b0)][_0x40b7e4(0x6b4)][_0x40b7e4(0x34d)]; }, Window_EquipCommand[_0x709961(0x5ef)][_0x709961(0x602)] = function (_0x213562) { const _0x5aade1 = _0x709961, _0x815c0 = this[_0x5aade1(0x2b7)](_0x213562); if (_0x815c0 === _0x5aade1(0x3be)) this['drawItemStyleIconText'](_0x213562); else _0x815c0 === 'icon' ? this[_0x5aade1(0x4ec)](_0x213562) : Window_HorzCommand[_0x5aade1(0x5ef)][_0x5aade1(0x602)][_0x5aade1(0x376)](this, _0x213562); }, Window_EquipCommand[_0x709961(0x5ef)]['commandStyle'] = function () { const _0x2013f3 = _0x709961; return VisuMZ[_0x2013f3(0x3db)][_0x2013f3(0x6b0)][_0x2013f3(0x6b4)][_0x2013f3(0x521)]; }, Window_EquipCommand[_0x709961(0x5ef)]['commandStyleCheck'] = function (_0xe8c956) { const _0x4ed37b = _0x709961; if (_0xe8c956 < 0x0) return 'text'; const _0x6fac38 = this[_0x4ed37b(0x1be)](); if (_0x6fac38 !== _0x4ed37b(0x28f)) return _0x4ed37b(0x526) === _0x4ed37b(0x526) ? _0x6fac38 : this[_0x4ed37b(0x6d8)]() ? ![] : _0x4f7327['prototype']['isHoverEnabled'][_0x4ed37b(0x376)](this); else { if (this['maxItems']() > 0x0) { const _0xb61870 = this[_0x4ed37b(0x626)](_0xe8c956); if (_0xb61870[_0x4ed37b(0x1ed)](/\\I\[(\d+)\]/i)) { const _0x46fa61 = this[_0x4ed37b(0x46c)](_0xe8c956), _0x22030d = this[_0x4ed37b(0x66a)](_0xb61870)[_0x4ed37b(0x4ca)]; return _0x22030d <= _0x46fa61[_0x4ed37b(0x4ca)] ? 'iconText' : _0x4ed37b(0x220); } } } return 'text'; }, Window_EquipCommand['prototype'][_0x709961(0x2f5)] = function (_0x486c8c) { const _0x4a0508 = _0x709961, _0xf44c2b = this['itemLineRect'](_0x486c8c), _0x18e1bf = this[_0x4a0508(0x626)](_0x486c8c), _0x2fca4e = this['textSizeEx'](_0x18e1bf)['width']; this[_0x4a0508(0x403)](this['isCommandEnabled'](_0x486c8c)); const _0x472e1a = this[_0x4a0508(0x27b)](); if (_0x472e1a === 'right') { if (_0x4a0508(0x206) !== 'qGmbe') this[_0x4a0508(0x6ba)](_0x18e1bf, _0xf44c2b['x'] + _0xf44c2b[_0x4a0508(0x4ca)] - _0x2fca4e, _0xf44c2b['y'], _0x2fca4e); else { if (_0x316d4e[_0x4a0508(0x6c1)]['constructor'] === _0x58be7f) return _0xebe83d[_0x4a0508(0x3db)][_0x4a0508(0x370)]['call'](this); else return _0x23444e['_scene'][_0x4a0508(0x3f7)] === _0x26ee5f ? _0x4b7df3['ItemsEquipsCore'][_0x4a0508(0x370)][_0x4a0508(0x376)](this) : _0x3cdd62[_0x4a0508(0x3db)][_0x4a0508(0x6b0)][_0x4a0508(0x309)][_0x4a0508(0x537)]; } } else { if (_0x472e1a === _0x4a0508(0x50b)) { if (_0x4a0508(0x42b) !== _0x4a0508(0x42b)) { const _0x596d6f = this[_0x4a0508(0x62f)](), _0x4be875 = this[_0x4a0508(0x2ec)][_0x4a0508(0x232)], _0x8fbe6 = this[_0x4a0508(0x2ef)]() ? 0x0 : _0x345c47['boxWidth'] - this['statusWidth'](), _0x12b80f = this[_0x4a0508(0x2ec)]['y']; return new _0x3884dc(_0x8fbe6, _0x12b80f, _0x596d6f, _0x4be875); } else { const _0x40ba6f = _0xf44c2b['x'] + Math['floor']((_0xf44c2b[_0x4a0508(0x4ca)] - _0x2fca4e) / 0x2); this[_0x4a0508(0x6ba)](_0x18e1bf, _0x40ba6f, _0xf44c2b['y'], _0x2fca4e); } } else _0x4a0508(0x3ac) !== _0x4a0508(0x3ac) ? this['cursorRight'](_0x4acb1b[_0x4a0508(0x5c1)](_0x4a0508(0x5af))) : this[_0x4a0508(0x6ba)](_0x18e1bf, _0xf44c2b['x'], _0xf44c2b['y'], _0x2fca4e); } }, Window_EquipCommand[_0x709961(0x5ef)][_0x709961(0x4ec)] = function (_0x2292c1) { const _0x5d5f31 = _0x709961; this[_0x5d5f31(0x626)](_0x2292c1)[_0x5d5f31(0x1ed)](/\\I\[(\d+)\]/i); const _0x48e7d5 = Number(RegExp['$1']) || 0x0, _0x1ebe7c = this[_0x5d5f31(0x46c)](_0x2292c1), _0x160277 = _0x1ebe7c['x'] + Math[_0x5d5f31(0x4e5)]((_0x1ebe7c[_0x5d5f31(0x4ca)] - ImageManager[_0x5d5f31(0x357)]) / 0x2), _0x3801e5 = _0x1ebe7c['y'] + (_0x1ebe7c[_0x5d5f31(0x232)] - ImageManager['iconHeight']) / 0x2; this[_0x5d5f31(0x25a)](_0x48e7d5, _0x160277, _0x3801e5); }, Window_EquipCommand['prototype'][_0x709961(0x67f)] = function () { const _0x16c62a = _0x709961, _0x3b4da7 = SceneManager[_0x16c62a(0x6c1)]; if (_0x3b4da7 && _0x3b4da7['user']) return _0x16c62a(0x1c7) === _0x16c62a(0x1c7) ? _0x3b4da7[_0x16c62a(0x2cd)]() : _0x5cc5a3['getInputMultiButtonStrings']('up', _0x16c62a(0x32a)); return null; }, Window_EquipCommand[_0x709961(0x5ef)][_0x709961(0x317)] = function () { const _0x3a3028 = _0x709961; Window_Command[_0x3a3028(0x5ef)]['updateHelp']['call'](this), this[_0x3a3028(0x2c3)][_0x3a3028(0x56f)](this[_0x3a3028(0x1df)]()); }, Window_EquipCommand['prototype'][_0x709961(0x1df)] = function () { const _0x129c97 = _0x709961, _0x57ef97 = this[_0x129c97(0x1c4)](); switch (_0x57ef97) { case _0x129c97(0x530): return TextManager['ITEMS_EQUIPS_CORE'][_0x129c97(0x483)][_0x129c97(0x530)]; case _0x129c97(0x49d): return TextManager[_0x129c97(0x5e9)]['helpDesc'][_0x129c97(0x49d)]; case _0x129c97(0x556): return TextManager[_0x129c97(0x5e9)][_0x129c97(0x483)]['clear']; default: return ''; } }, Window_EquipSlot['prototype']['isUseModernControls'] = function () { const _0x5d825a = _0x709961; return Imported['VisuMZ_0_CoreEngine'] && Window_HorzCommand[_0x5d825a(0x5ef)][_0x5d825a(0x6d8)]['call'](this); }, Window_EquipSlot['prototype'][_0x709961(0x55a)] = function () { const _0x34b59e = _0x709961; Window_StatusBase[_0x34b59e(0x5ef)][_0x34b59e(0x55a)]['call'](this), this[_0x34b59e(0x3d8)](); }, Window_EquipSlot[_0x709961(0x5ef)][_0x709961(0x61e)] = function () { const _0x3aaae5 = _0x709961; Window_StatusBase[_0x3aaae5(0x5ef)][_0x3aaae5(0x61e)][_0x3aaae5(0x376)](this), this[_0x3aaae5(0x3c6)](); }, Window_EquipSlot[_0x709961(0x5ef)][_0x709961(0x3c6)] = function () { const _0x1b9818 = _0x709961; if (!this['isShiftRemoveShortcutEnabled']()) return; if (Input[_0x1b9818(0x5c1)](_0x1b9818(0x5ce)) && this[_0x1b9818(0x24d)]()) { const _0x4185a7 = SceneManager[_0x1b9818(0x6c1)][_0x1b9818(0x3bc)]; if (_0x4185a7) { if (this['canShiftRemoveEquipment'](this[_0x1b9818(0x624)]())) { if (_0x1b9818(0x308) === _0x1b9818(0x5bd)) { this[_0x1b9818(0x1bd)] = !![]; const _0x43f0e7 = _0x64bff4['ItemsEquipsCore'][_0x1b9818(0x2a6)][_0x1b9818(0x376)](this); return this['_allowArtifactTraitObjects'] = _0x513243, _0x43f0e7; } else this['processShiftRemoveShortcut'](), this[_0x1b9818(0x317)](); } else this[_0x1b9818(0x2ac)](); } } }, Window_EquipSlot[_0x709961(0x5ef)][_0x709961(0x22a)] = function (_0x202158) { const _0x439bca = _0x709961, _0x59abea = SceneManager[_0x439bca(0x6c1)][_0x439bca(0x3bc)]; if (!_0x59abea) return; if (!_0x59abea['isEquipChangeOk'](_0x202158)) return ![]; const _0x48cd12 = _0x59abea[_0x439bca(0x252)]()[_0x202158]; if (_0x59abea['nonRemovableEtypes']()['includes'](_0x48cd12)) return ![]; return !![];; }, Window_EquipSlot[_0x709961(0x5ef)][_0x709961(0x3ad)] = function () { const _0x574710 = _0x709961; SoundManager[_0x574710(0x28a)](); const _0x3efa94 = SceneManager[_0x574710(0x6c1)]['_actor']; _0x3efa94[_0x574710(0x274)](this[_0x574710(0x624)](), null), this[_0x574710(0x349)](), this['_itemWindow']['refresh'](), this['callUpdateHelp'](); const _0x380ea1 = SceneManager['_scene'][_0x574710(0x633)]; if (_0x380ea1) _0x380ea1[_0x574710(0x349)](); }, Window_EquipSlot['prototype'][_0x709961(0x466)] = function () { const _0x1b968a = _0x709961; if (!this[_0x1b968a(0x3bd)]) return ![]; if (!VisuMZ['ItemsEquipsCore'][_0x1b968a(0x6b0)]['EquipScene'][_0x1b968a(0x469)]) return ![]; return !![]; }, Window_EquipSlot[_0x709961(0x5ef)][_0x709961(0x67e)] = function () { const _0x201a44 = _0x709961; if (!this[_0x201a44(0x2f7)]()) { if (_0x201a44(0x2f2) !== _0x201a44(0x2f2)) { const _0x76100c = this[_0x201a44(0x5fd)][this['_equips']['length'] - 0x1]; _0x76100c && _0x76100c[_0x201a44(0x2c6)]() && _0x21bc54[_0x201a44(0x2a5)](_0x76100c[_0x201a44(0x2c6)](), 0x1), this[_0x201a44(0x5fd)][_0x201a44(0x21b)](); } else Window_StatusBase[_0x201a44(0x5ef)][_0x201a44(0x67e)]['call'](this); } }, Window_EquipSlot['prototype']['processCursorSpecialCheckModernControls'] = function () { const _0x5a143f = _0x709961; if (!this[_0x5a143f(0x565)]()) return ![]; if (SceneManager[_0x5a143f(0x6c1)]['constructor'] !== Scene_Equip) return ![]; if (this[_0x5a143f(0x49b)]()) return _0x5a143f(0x1dd) === _0x5a143f(0x3e8) ? _0x38788d[_0x5a143f(0x615)] && _0x16f4cf[_0x5a143f(0x5ef)][_0x5a143f(0x6d8)]['call'](this) : (this[_0x5a143f(0x5d0)](), Input[_0x5a143f(0x556)](), SceneManager[_0x5a143f(0x6c1)][_0x5a143f(0x236)](), ![]); else { if (Input[_0x5a143f(0x27f)](_0x5a143f(0x32a))) { const _0x57cd93 = this[_0x5a143f(0x624)](); if (Input[_0x5a143f(0x40b)](_0x5a143f(0x5ce))) { if (_0x5a143f(0x579) !== 'IBSZk') this[_0x5a143f(0x222)](); else { const _0x28cd97 = _0x39d040(_0x565105['$1'])[_0x5a143f(0x617)](/[\r\n]+/); for (const _0x3dde4a of _0x28cd97) { const _0x2f151f = _0x393d58[_0x5a143f(0x532)](_0x3dde4a['trim']()); if (_0x2f151f > 0x0) _0x442b2b['equipSlots'][_0x5a143f(0x4ba)](_0x2f151f); } } } else _0x5a143f(0x3b6) === _0x5a143f(0x670) ? this[_0x5a143f(0x4ec)](_0x3b2dbc) : this[_0x5a143f(0x1cf)](Input[_0x5a143f(0x5c1)](_0x5a143f(0x32a))); return this[_0x5a143f(0x624)]() !== _0x57cd93 && this[_0x5a143f(0x5d0)](), !![]; } else { if (this[_0x5a143f(0x585)]() && Input[_0x5a143f(0x5c1)](_0x5a143f(0x5ce))) return !![]; } } return ![]; }, Window_EquipSlot[_0x709961(0x5ef)]['allowCommandWindowCursorUp'] = function () { const _0x38fee8 = _0x709961; if (this[_0x38fee8(0x624)]() !== 0x0) return ![]; const _0x1f4b66 = VisuMZ[_0x38fee8(0x3db)][_0x38fee8(0x6b0)][_0x38fee8(0x6b4)]; if (!_0x1f4b66[_0x38fee8(0x292)] && !_0x1f4b66['CommandAddClear']) return ![]; return Input[_0x38fee8(0x5c1)]('up'); }, Window_EquipSlot[_0x709961(0x5ef)]['isShiftShortcutKeyForRemove'] = function () { const _0x1ac858 = _0x709961; return VisuMZ[_0x1ac858(0x3db)][_0x1ac858(0x6b0)]['EquipScene']['ShiftShortcutKey']; }, Window_EquipSlot[_0x709961(0x5ef)][_0x709961(0x3d6)] = function () { const _0xc1827b = _0x709961; if (this[_0xc1827b(0x4b8)]() && this['visible'] && SceneManager[_0xc1827b(0x6c1)][_0xc1827b(0x3f7)] === Scene_Equip) { if (this[_0xc1827b(0x1ee)]() && TouchInput['isHovered']()) this[_0xc1827b(0x1d6)](![]); else TouchInput['isTriggered']() && this[_0xc1827b(0x1d6)](!![]); if (TouchInput[_0xc1827b(0x536)]()) _0xc1827b(0x6b5) !== _0xc1827b(0x234) ? this[_0xc1827b(0x3df)]() : (_0x5f3965['ItemsEquipsCore'][_0xc1827b(0x6b2)][_0xc1827b(0x376)](this, _0x144dcb), this[_0xc1827b(0x531)](_0x7eb12e)); else TouchInput[_0xc1827b(0x5ab)]() && this[_0xc1827b(0x1c1)](); } }, Window_EquipSlot[_0x709961(0x5ef)][_0x709961(0x1d6)] = function (_0x29a3b3) { const _0xf7049d = _0x709961; this[_0xf7049d(0x56a)] = ![]; const _0x42ac70 = this['index'](), _0x47b693 = this[_0xf7049d(0x2bb)](), _0x55c554 = SceneManager[_0xf7049d(0x6c1)][_0xf7049d(0x1a6)]; if (_0x55c554['isOpen']() && _0x55c554[_0xf7049d(0x1f7)]) { if (_0x47b693 >= 0x0) _0x47b693 === this[_0xf7049d(0x624)]() && (this[_0xf7049d(0x56a)] = !![]), this[_0xf7049d(0x55a)](), this['select'](_0x47b693); else _0x55c554[_0xf7049d(0x2bb)]() >= 0x0 && (this[_0xf7049d(0x6df)](), this[_0xf7049d(0x6cb)]()); } if (_0x29a3b3 && this['index']() !== _0x42ac70) { if (_0xf7049d(0x671) === _0xf7049d(0x1d0)) { const _0x476685 = _0x26aef2[_0xf7049d(0x340)](this); _0x476685['_tempActor'] = !![], this[_0xf7049d(0x1d5)](_0x4eec53, _0x5fa0e3), this[_0xf7049d(0x267)](_0x476685); } else this['playCursorSound'](); } }, Window_EquipSlot['prototype'][_0x709961(0x2e9)] = function () { const _0xdf594b = _0x709961; return this[_0xdf594b(0x624)](); }, VisuMZ['ItemsEquipsCore'][_0x709961(0x5c8)] = Window_EquipItem[_0x709961(0x5ef)]['includes'], Window_EquipItem[_0x709961(0x5ef)][_0x709961(0x3bb)] = function (_0x2a60d0) { const _0x73d113 = _0x709961; if (_0x2a60d0 === null && this[_0x73d113(0x290)]()[_0x73d113(0x3bb)](this[_0x73d113(0x5fe)]())) return ![]; else { $gameTemp[_0x73d113(0x61d)] = !![]; let _0x58dc62 = VisuMZ[_0x73d113(0x3db)][_0x73d113(0x5c8)]['call'](this, _0x2a60d0); if (!_0x58dc62 && _0x2a60d0 && DataManager[_0x73d113(0x3b3)](_0x2a60d0)) { const _0x81def7 = _0x2a60d0[_0x73d113(0x3e1)] || 0x0; if (this[_0x73d113(0x3bc)] && this[_0x73d113(0x3bc)][_0x73d113(0x4de)](_0x81def7)) { const _0x3a89d2 = DataManager[_0x73d113(0x323)](_0x2a60d0); _0x3a89d2[_0x73d113(0x3bb)](this['etypeId']()) && (_0x58dc62 = !![]); } } return $gameTemp[_0x73d113(0x61d)] = undefined, _0x58dc62; } }, VisuMZ[_0x709961(0x3db)][_0x709961(0x6c0)] = Window_EquipItem[_0x709961(0x5ef)][_0x709961(0x24b)], Window_EquipItem[_0x709961(0x5ef)][_0x709961(0x24b)] = function (_0x260a8a) { const _0x9c7270 = _0x709961; if (_0x260a8a && this[_0x9c7270(0x3bc)]) { if (_0x9c7270(0x431) === _0x9c7270(0x543)) { let _0x3667d6 = _0x47e49e[_0x9c7270(0x3db)][_0x9c7270(0x38c)][_0x9c7270(0x376)](this, _0xed5ab9); if (this[_0x9c7270(0x3f7)] === _0x4de513) for (const _0x3c27aa of _0x5ed65b[_0x9c7270(0x428)]()) { if (_0x3c27aa) _0x3667d6 += _0x3c27aa[_0x9c7270(0x63a)][_0x480c60]; } return _0x3667d6; } else { if (this[_0x9c7270(0x20e)](_0x260a8a)) return ![]; if (this[_0x9c7270(0x3f0)](_0x260a8a)) return ![]; if (this[_0x9c7270(0x356)](_0x260a8a)) return ![]; if (!this[_0x9c7270(0x3bc)][_0x9c7270(0x447)](_0x260a8a)) return ![]; } } if (!_0x260a8a) return !this[_0x9c7270(0x290)]()[_0x9c7270(0x3bb)](this[_0x9c7270(0x5fe)]()); return VisuMZ['ItemsEquipsCore'][_0x9c7270(0x6c0)][_0x9c7270(0x376)](this, _0x260a8a); }, Window_EquipItem[_0x709961(0x5ef)]['itemHasEquipLimit'] = function (_0x45ee4c) { const _0x3fa358 = _0x709961, _0x209cef = _0x45ee4c['note']; if (_0x209cef[_0x3fa358(0x1ed)](/<EQUIP COPY LIMIT:[ ](\d+)>/i)) { if ('CousE' !== _0x3fa358(0x6e6)) return ![]; else { const _0x585c8a = Number(RegExp['$1']) || 0x1; let _0x59bd1c = 0x0; const _0x1d274a = this[_0x3fa358(0x3bc)][_0x3fa358(0x673)](), _0x58b9af = SceneManager['_scene'][_0x3fa358(0x3f9)][_0x3fa358(0x2e9)](); _0x1d274a[_0x58b9af] = null; for (const _0x2f7401 of _0x1d274a) { if (!_0x2f7401) continue; if (DataManager[_0x3fa358(0x67a)](_0x45ee4c) === DataManager[_0x3fa358(0x67a)](_0x2f7401)) { if (_0x45ee4c['id'] === _0x2f7401['id']) _0x59bd1c += 0x1; } } return _0x59bd1c >= _0x585c8a; } } else { if (_0x3fa358(0x645) !== 'AIuOv') return ![]; else { const _0x1598d0 = _0x5a79e0(_0x7539ce['$1'])[_0x3fa358(0x3c4)](), _0x44197c = /^\d+$/['test'](_0x1598d0); if (_0x44197c) { if (this['isWeapon'](_0x486789)) return _0x1bb602[_0x1afae4(_0x1598d0)]; if (this[_0x3fa358(0x3b3)](_0x1f43b2)) return _0x1c1bf5[_0x51a992(_0x1598d0)]; } else { if (this[_0x3fa358(0x67a)](_0x2d9faf)) return _0x49ff0e[this[_0x3fa358(0x278)](_0x1598d0)]; if (this['isArmor'](_0x40d7ab)) return _0x18abaa[this[_0x3fa358(0x3c5)](_0x1598d0)]; } } } }, Window_EquipItem[_0x709961(0x5ef)][_0x709961(0x3f0)] = function (_0x43b58f) { const _0x3fa6e8 = _0x709961; if (!DataManager[_0x3fa6e8(0x67a)](_0x43b58f)) return ![]; const _0x3c9f3d = /<EQUIP WEAPON TYPE LIMIT:[ ](\d+)>/i; let _0xd8aa7a = 0x0; const _0x4ebcde = this[_0x3fa6e8(0x3bc)]['equips'](), _0x2c2886 = SceneManager[_0x3fa6e8(0x6c1)][_0x3fa6e8(0x3f9)]['equipSlotIndex'](); _0x4ebcde[_0x2c2886] = null; for (const _0x31b5f6 of _0x4ebcde) { if (_0x3fa6e8(0x519) === 'WxgPR') return this[_0x3fa6e8(0x5b5)](); else { if (!_0x31b5f6) continue; if (!DataManager['isWeapon'](_0x31b5f6)) continue; if (_0x43b58f[_0x3fa6e8(0x4f2)] === _0x31b5f6[_0x3fa6e8(0x4f2)]) { _0xd8aa7a += 0x1; if (_0x43b58f[_0x3fa6e8(0x1e9)][_0x3fa6e8(0x1ed)](_0x3c9f3d)) { const _0x14f09c = Number(RegExp['$1']) || 0x1; if (_0xd8aa7a >= _0x14f09c) return !![]; } if (_0x31b5f6[_0x3fa6e8(0x1e9)][_0x3fa6e8(0x1ed)](_0x3c9f3d)) { const _0x2e482c = Number(RegExp['$1']) || 0x1; if (_0xd8aa7a >= _0x2e482c) return !![]; } } } } return ![]; }, Window_EquipItem[_0x709961(0x5ef)][_0x709961(0x356)] = function (_0x1f5fa2) { const _0x33f310 = _0x709961; if (!DataManager[_0x33f310(0x3b3)](_0x1f5fa2)) return ![]; const _0x1060d4 = /<EQUIP ARMOR TYPE LIMIT:[ ](\d+)>/i; let _0x2148c6 = 0x0; const _0x21bdca = this[_0x33f310(0x3bc)]['equips'](), _0x11d4a2 = SceneManager[_0x33f310(0x6c1)][_0x33f310(0x3f9)][_0x33f310(0x2e9)](); _0x21bdca[_0x11d4a2] = null; for (const _0x530df8 of _0x21bdca) { if (!_0x530df8) continue; if (!DataManager[_0x33f310(0x3b3)](_0x530df8)) continue; if (_0x1f5fa2[_0x33f310(0x3e1)] === _0x530df8['atypeId']) { _0x2148c6 += 0x1; if (_0x1f5fa2[_0x33f310(0x1e9)][_0x33f310(0x1ed)](_0x1060d4)) { const _0x374e45 = Number(RegExp['$1']) || 0x1; if (_0x2148c6 >= _0x374e45) return !![]; } if (_0x530df8[_0x33f310(0x1e9)]['match'](_0x1060d4)) { if (_0x33f310(0x6a2) === 'LJHNs') { const _0x2f29be = Number(RegExp['$1']) || 0x1; if (_0x2148c6 >= _0x2f29be) return !![]; } else return this[_0x33f310(0x1bb)](); } } } return ![]; }, Window_EquipItem[_0x709961(0x5ef)][_0x709961(0x290)] = function () { const _0x1c5e85 = _0x709961; return VisuMZ[_0x1c5e85(0x3db)][_0x1c5e85(0x6b0)][_0x1c5e85(0x6b4)]['NonRemoveETypes']; }, Window_EquipItem[_0x709961(0x5ef)][_0x709961(0x602)] = function (_0x2005fb) { const _0x1e4e51 = _0x709961, _0x2438ea = this[_0x1e4e51(0x364)](_0x2005fb); if (_0x2438ea) { if ('RLrxx' === _0x1e4e51(0x680)) { const _0x5eb0f7 = 'QUANTITY'; if (this[_0x1e4e51(0x3b8)][_0x5eb0f7]) return this['_customItemInfo'][_0x5eb0f7]; const _0x1e37c3 = _0x4152d7['ItemsEquipsCore'][_0x1e4e51(0x6b0)][_0x1e4e51(0x309)][_0x1e4e51(0x5b8)]; return _0x1e37c3['format'](_0xdef943[_0x1e4e51(0x402)](this[_0x1e4e51(0x3c2)])); } else Window_ItemList[_0x1e4e51(0x5ef)]['drawItem'][_0x1e4e51(0x376)](this, _0x2005fb); } else this[_0x1e4e51(0x353)](_0x2005fb); }, Window_EquipItem[_0x709961(0x5ef)][_0x709961(0x353)] = function (_0x349e5c) { const _0x41e1cc = _0x709961; this[_0x41e1cc(0x403)](this[_0x41e1cc(0x24b)](null)); const _0x4fd988 = VisuMZ['ItemsEquipsCore'][_0x41e1cc(0x6b0)][_0x41e1cc(0x6b4)], _0x5453c2 = this[_0x41e1cc(0x46c)](_0x349e5c), _0x3ef48f = _0x5453c2['y'] + (this[_0x41e1cc(0x361)]() - ImageManager['iconHeight']) / 0x2, _0x24f962 = ImageManager['iconWidth'] + 0x4, _0x48b575 = Math[_0x41e1cc(0x5f5)](0x0, _0x5453c2[_0x41e1cc(0x4ca)] - _0x24f962); this[_0x41e1cc(0x1c0)](), this[_0x41e1cc(0x25a)](_0x4fd988[_0x41e1cc(0x53f)], _0x5453c2['x'], _0x3ef48f), this[_0x41e1cc(0x62c)](_0x4fd988[_0x41e1cc(0x619)], _0x5453c2['x'] + _0x24f962, _0x5453c2['y'], _0x48b575), this[_0x41e1cc(0x403)](!![]); }, Window_EquipItem[_0x709961(0x5ef)]['updateHelp'] = function () { const _0xa4603e = _0x709961; Window_ItemList[_0xa4603e(0x5ef)][_0xa4603e(0x317)][_0xa4603e(0x376)](this); if (this[_0xa4603e(0x3bc)] && this[_0xa4603e(0x633)] && this[_0xa4603e(0x3c3)] >= 0x0) { const _0x1a5231 = JsonEx['makeDeepCopy'](this[_0xa4603e(0x3bc)]); _0x1a5231[_0xa4603e(0x342)] = !![], _0x1a5231[_0xa4603e(0x335)](this[_0xa4603e(0x3c3)], this['item']()), this['_statusWindow'][_0xa4603e(0x465)](_0x1a5231); } }, VisuMZ[_0x709961(0x3db)][_0x709961(0x1ae)] = Window_ShopCommand[_0x709961(0x5ef)]['initialize'], Window_ShopCommand[_0x709961(0x5ef)][_0x709961(0x527)] = function (_0x3709e2) { const _0x282948 = _0x709961; VisuMZ['ItemsEquipsCore'][_0x282948(0x1ae)][_0x282948(0x376)](this, _0x3709e2), this[_0x282948(0x531)](_0x3709e2); }, Window_ShopCommand[_0x709961(0x5ef)][_0x709961(0x531)] = function (_0x6f1ca1) { const _0x357fb1 = _0x709961, _0x118da1 = new Rectangle(0x0, 0x0, _0x6f1ca1['width'], _0x6f1ca1[_0x357fb1(0x232)]); this['_commandNameWindow'] = new Window_Base(_0x118da1), this[_0x357fb1(0x3fb)][_0x357fb1(0x4be)] = 0x0, this[_0x357fb1(0x271)](this[_0x357fb1(0x3fb)]), this[_0x357fb1(0x1ce)](); }, Window_ShopCommand[_0x709961(0x5ef)][_0x709961(0x3d8)] = function () { const _0x267f6a = _0x709961; Window_HorzCommand[_0x267f6a(0x5ef)][_0x267f6a(0x3d8)]['call'](this); if (this[_0x267f6a(0x3fb)]) this[_0x267f6a(0x1ce)](); }, Window_ShopCommand[_0x709961(0x5ef)]['updateCommandNameWindow'] = function () { const _0x1ec5ef = _0x709961, _0x218467 = this[_0x1ec5ef(0x3fb)]; _0x218467[_0x1ec5ef(0x30a)][_0x1ec5ef(0x556)](); const _0x500bfa = this[_0x1ec5ef(0x2b7)](this['index']()); if (_0x500bfa === _0x1ec5ef(0x220)) { const _0x5d155e = this['itemLineRect'](this[_0x1ec5ef(0x624)]()); let _0x394af1 = this[_0x1ec5ef(0x626)](this[_0x1ec5ef(0x624)]()); _0x394af1 = _0x394af1[_0x1ec5ef(0x3a5)](/\\I\[(\d+)\]/gi, ''), _0x218467[_0x1ec5ef(0x4e3)](), this[_0x1ec5ef(0x25d)](_0x394af1, _0x5d155e), this[_0x1ec5ef(0x690)](_0x394af1, _0x5d155e), this[_0x1ec5ef(0x45a)](_0x394af1, _0x5d155e); } }, Window_ShopCommand[_0x709961(0x5ef)][_0x709961(0x25d)] = function (_0x3990bc, _0x25008e) { }, Window_ShopCommand['prototype'][_0x709961(0x690)] = function (_0x3ca4a8, _0x55897c) { const _0x38d66f = _0x709961, _0x1f6e48 = this['_commandNameWindow']; _0x1f6e48['drawText'](_0x3ca4a8, 0x0, _0x55897c['y'], _0x1f6e48[_0x38d66f(0x224)], _0x38d66f(0x50b)); }, Window_ShopCommand[_0x709961(0x5ef)][_0x709961(0x45a)] = function (_0x262e60, _0x51f3f0) { const _0x3e5212 = _0x709961, _0x33a8d7 = this[_0x3e5212(0x3fb)], _0x3dca93 = $gameSystem[_0x3e5212(0x25c)](), _0x5a7544 = _0x51f3f0['x'] + Math[_0x3e5212(0x4e5)](_0x51f3f0[_0x3e5212(0x4ca)] / 0x2) + _0x3dca93; _0x33a8d7['x'] = _0x33a8d7[_0x3e5212(0x4ca)] / -0x2 + _0x5a7544, _0x33a8d7['y'] = Math[_0x3e5212(0x4e5)](_0x51f3f0[_0x3e5212(0x232)] / 0x2); }, Window_ShopCommand[_0x709961(0x5ef)]['maxCols'] = function () { const _0x4388e2 = _0x709961; return this['_list'] ? this[_0x4388e2(0x3dc)][_0x4388e2(0x321)] : 0x3; }, Window_ShopCommand[_0x709961(0x5ef)]['hideDisabledCommands'] = function () { const _0x23f9d9 = _0x709961; return VisuMZ[_0x23f9d9(0x3db)]['Settings'][_0x23f9d9(0x300)][_0x23f9d9(0x6e5)]; }, Window_ShopCommand['prototype'][_0x709961(0x453)] = function () { const _0x50b477 = _0x709961; this[_0x50b477(0x248)](), this[_0x50b477(0x456)](), this['addCancelCommand'](); }, Window_ShopCommand[_0x709961(0x5ef)]['refresh'] = function () { const _0x5525b5 = _0x709961; Window_HorzCommand[_0x5525b5(0x5ef)][_0x5525b5(0x349)][_0x5525b5(0x376)](this), this[_0x5525b5(0x606)](); }, Window_ShopCommand[_0x709961(0x5ef)]['addBuyCommand'] = function () { const _0x2b630f = _0x709961, _0x15a798 = this[_0x2b630f(0x1be)](), _0x1d98fa = VisuMZ[_0x2b630f(0x3db)]['Settings'][_0x2b630f(0x300)]['CmdIconBuy'], _0x11ef18 = _0x15a798 === _0x2b630f(0x461) ? TextManager[_0x2b630f(0x41a)] : _0x2b630f(0x297)[_0x2b630f(0x60c)](_0x1d98fa, TextManager[_0x2b630f(0x41a)]), _0xb9d8b4 = this[_0x2b630f(0x3d4)](); if (this['hideDisabledCommands']() && !_0xb9d8b4) return; this[_0x2b630f(0x1cb)](_0x11ef18, 'buy', _0xb9d8b4); }, Window_ShopCommand[_0x709961(0x5ef)][_0x709961(0x3d4)] = function () { const _0x2ac4b2 = _0x709961; return SceneManager[_0x2ac4b2(0x6c1)][_0x2ac4b2(0x3f7)] === Scene_Shop ? SceneManager[_0x2ac4b2(0x6c1)]['_goodsCount'] > 0x0 : !![]; }, Window_ShopCommand[_0x709961(0x5ef)][_0x709961(0x456)] = function () { const _0x467867 = _0x709961, _0x590352 = this[_0x467867(0x1be)](), _0xce0129 = VisuMZ[_0x467867(0x3db)][_0x467867(0x6b0)]['ShopScene']['CmdIconSell'], _0x36ae82 = _0x590352 === _0x467867(0x461) ? TextManager[_0x467867(0x1b9)] : _0x467867(0x297)[_0x467867(0x60c)](_0xce0129, TextManager['sell']), _0x3db2ca = this[_0x467867(0x600)](); if (this[_0x467867(0x20c)]() && !_0x3db2ca) return; this[_0x467867(0x1cb)](_0x36ae82, _0x467867(0x1b9), _0x3db2ca); }, Window_ShopCommand[_0x709961(0x5ef)][_0x709961(0x600)] = function () { const _0x1119f6 = _0x709961; return !this[_0x1119f6(0x695)]; }, Window_ShopCommand[_0x709961(0x5ef)][_0x709961(0x59c)] = function () { const _0x5a247d = _0x709961, _0x4d4541 = this[_0x5a247d(0x1be)](), _0x5cd392 = VisuMZ[_0x5a247d(0x3db)][_0x5a247d(0x6b0)][_0x5a247d(0x300)][_0x5a247d(0x56b)], _0x5486b3 = VisuMZ[_0x5a247d(0x3db)]['Settings'][_0x5a247d(0x300)][_0x5a247d(0x675)], _0x12d1ea = _0x4d4541 === 'text' ? _0x5486b3 : _0x5a247d(0x297)[_0x5a247d(0x60c)](_0x5cd392, _0x5486b3); this['addCommand'](_0x12d1ea, _0x5a247d(0x320)); }, Window_ShopCommand[_0x709961(0x5ef)][_0x709961(0x27b)] = function () { const _0x12f027 = _0x709961; return VisuMZ[_0x12f027(0x3db)][_0x12f027(0x6b0)]['ShopScene'][_0x12f027(0x34d)]; }, Window_ShopCommand['prototype']['drawItem'] = function (_0x2209c9) { const _0x130ea5 = _0x709961, _0x26669f = this['commandStyleCheck'](_0x2209c9); if (_0x26669f === _0x130ea5(0x3be)) this[_0x130ea5(0x2f5)](_0x2209c9); else _0x26669f === _0x130ea5(0x220) ? this[_0x130ea5(0x4ec)](_0x2209c9) : 'lywij' === _0x130ea5(0x2a7) ? this[_0x130ea5(0x5cd)][_0x130ea5(0x55a)]() : Window_HorzCommand[_0x130ea5(0x5ef)][_0x130ea5(0x602)]['call'](this, _0x2209c9); }, Window_ShopCommand[_0x709961(0x5ef)][_0x709961(0x1be)] = function () { const _0x297c54 = _0x709961; return VisuMZ['ItemsEquipsCore'][_0x297c54(0x6b0)][_0x297c54(0x300)]['CmdStyle']; }, Window_ShopCommand['prototype'][_0x709961(0x2b7)] = function (_0x2d4f6f) { const _0x1a51f7 = _0x709961; if (_0x2d4f6f < 0x0) return _0x1a51f7(0x461); const _0x585e82 = this[_0x1a51f7(0x1be)](); if (_0x585e82 !== _0x1a51f7(0x28f)) { if (_0x1a51f7(0x4e6) !== _0x1a51f7(0x4e6)) _0x2eb56e = _0x1a51f7(0x49c)['format'](_0x1bda1b['id']); else return _0x585e82; } else { if (this['maxItems']() > 0x0) { if (_0x1a51f7(0x2f8) !== 'PgAyk') { const _0x26c271 = this[_0x1a51f7(0x402)](_0x1788e4); if (_0x26c271) this['loseItem'](_0x406aea, _0x26c271); } else { const _0x142ec2 = this[_0x1a51f7(0x626)](_0x2d4f6f); if (_0x142ec2[_0x1a51f7(0x1ed)](/\\I\[(\d+)\]/i)) { if ('QCCeB' === _0x1a51f7(0x2fd)) return this[_0x1a51f7(0x289)]() ? this[_0x1a51f7(0x1f3)]() : _0x355bf2['ItemsEquipsCore'][_0x1a51f7(0x6d9)][_0x1a51f7(0x376)](this); else { const _0x1ba5e0 = this[_0x1a51f7(0x46c)](_0x2d4f6f), _0x2a25b8 = this[_0x1a51f7(0x66a)](_0x142ec2)['width']; return _0x2a25b8 <= _0x1ba5e0[_0x1a51f7(0x4ca)] ? _0x1a51f7(0x3be) : _0x1a51f7(0x220); } } } } } return _0x1a51f7(0x461); }, Window_ShopCommand[_0x709961(0x5ef)][_0x709961(0x2f5)] = function (_0x51f462) { const _0x525668 = _0x709961, _0x2a05d0 = this['itemLineRect'](_0x51f462), _0x5f462e = this['commandName'](_0x51f462), _0x1f4ccf = this[_0x525668(0x66a)](_0x5f462e)[_0x525668(0x4ca)]; this['changePaintOpacity'](this[_0x525668(0x35a)](_0x51f462)); const _0x38dd45 = this[_0x525668(0x27b)](); if (_0x38dd45 === _0x525668(0x4b9)) { if (_0x525668(0x569) !== _0x525668(0x569)) return this[_0x525668(0x4de)](_0x290c05[_0x525668(0x3e1)]) && !this['isEquipTypeSealed'](_0x3bab2d[_0x525668(0x5fe)]) && _0x5a0eab[_0x525668(0x323)](_0x5bc30d)[_0x525668(0x328)](_0x32caa0 => !this['isEquipTypeSealed'](_0x32caa0)); else this[_0x525668(0x6ba)](_0x5f462e, _0x2a05d0['x'] + _0x2a05d0['width'] - _0x1f4ccf, _0x2a05d0['y'], _0x1f4ccf); } else { if (_0x38dd45 === _0x525668(0x50b)) { const _0x5f0516 = _0x2a05d0['x'] + Math[_0x525668(0x4e5)]((_0x2a05d0[_0x525668(0x4ca)] - _0x1f4ccf) / 0x2); this[_0x525668(0x6ba)](_0x5f462e, _0x5f0516, _0x2a05d0['y'], _0x1f4ccf); } else { if (_0x525668(0x306) === _0x525668(0x6dd)) { if (_0xc3cf7) _0xe50c11 += this[_0x525668(0x23f)](_0x2d37d8, _0x1f2447); } else this[_0x525668(0x6ba)](_0x5f462e, _0x2a05d0['x'], _0x2a05d0['y'], _0x1f4ccf); } } }, Window_ShopCommand['prototype'][_0x709961(0x4ec)] = function (_0x1fadb7) { const _0x217fa5 = _0x709961; this[_0x217fa5(0x626)](_0x1fadb7)['match'](/\\I\[(\d+)\]/i); const _0x4a3668 = Number(RegExp['$1']) || 0x0, _0x2a6c75 = this[_0x217fa5(0x46c)](_0x1fadb7), _0x5e2e7f = _0x2a6c75['x'] + Math[_0x217fa5(0x4e5)]((_0x2a6c75[_0x217fa5(0x4ca)] - ImageManager[_0x217fa5(0x357)]) / 0x2), _0x3756e1 = _0x2a6c75['y'] + (_0x2a6c75['height'] - ImageManager[_0x217fa5(0x2ea)]) / 0x2; this['drawIcon'](_0x4a3668, _0x5e2e7f, _0x3756e1); }, VisuMZ['ItemsEquipsCore'][_0x709961(0x47c)] = Window_ShopBuy['prototype'][_0x709961(0x349)], Window_ShopBuy[_0x709961(0x5ef)]['refresh'] = function () { const _0x488990 = _0x709961; this[_0x488990(0x523)](), VisuMZ[_0x488990(0x3db)][_0x488990(0x47c)]['call'](this); }, Window_ShopBuy[_0x709961(0x5ef)][_0x709961(0x523)] = function () { const _0x162437 = _0x709961; SceneManager[_0x162437(0x6c1)][_0x162437(0x3f7)] === Scene_Shop && (this[_0x162437(0x50f)] = SceneManager[_0x162437(0x6c1)]['money']()); }, VisuMZ[_0x709961(0x3db)]['Window_ShopBuy_price'] = Window_ShopBuy[_0x709961(0x5ef)]['price'], Window_ShopBuy[_0x709961(0x5ef)][_0x709961(0x518)] = function (_0xcb4b62) { const _0x5edd69 = _0x709961; if (!_0xcb4b62) return 0x0; let _0x478114 = VisuMZ[_0x5edd69(0x3db)]['Window_ShopBuy_price'][_0x5edd69(0x376)](this, _0xcb4b62); return Math[_0x5edd69(0x5f5)](0x0, this[_0x5edd69(0x54e)](_0xcb4b62, _0x478114)); }, Window_ShopBuy[_0x709961(0x5ef)][_0x709961(0x54e)] = function (_0x1f4c36, _0x3aaadc) { const _0xee4ee3 = _0x709961, _0x2e644c = _0x1f4c36['note']; if (_0x2e644c[_0xee4ee3(0x1ed)](/<JS BUY PRICE>\s*([\s\S]*)\s*<\/JS BUY PRICE>/i)) { const _0x18db61 = String(RegExp['$1']); window[_0xee4ee3(0x518)] = _0x3aaadc, window[_0xee4ee3(0x24d)] = _0x1f4c36; try { eval(_0x18db61); } catch (_0x476e50) { if ($gameTemp[_0xee4ee3(0x38b)]()) console[_0xee4ee3(0x4df)](_0x476e50); } _0x3aaadc = window[_0xee4ee3(0x518)], window[_0xee4ee3(0x518)] = undefined, window[_0xee4ee3(0x24d)] = undefined; } _0x3aaadc = VisuMZ[_0xee4ee3(0x3db)][_0xee4ee3(0x6b0)][_0xee4ee3(0x300)]['BuyPriceJS'][_0xee4ee3(0x376)](this, _0x1f4c36, _0x3aaadc); if (isNaN(_0x3aaadc)) _0x3aaadc = 0x0; return Math[_0xee4ee3(0x4e5)](_0x3aaadc); }, VisuMZ['ItemsEquipsCore'][_0x709961(0x3cc)] = Window_ShopBuy[_0x709961(0x5ef)][_0x709961(0x2be)], Window_ShopBuy[_0x709961(0x5ef)][_0x709961(0x2be)] = function (_0x5a0d3a) { const _0x4083c6 = _0x709961, _0x164876 = VisuMZ['ItemsEquipsCore'][_0x4083c6(0x3cc)][_0x4083c6(0x376)](this, _0x5a0d3a); return _0x164876 && !this[_0x4083c6(0x1a4)](_0x164876) ? null : _0x164876; }, VisuMZ[_0x709961(0x3db)][_0x709961(0x4ae)] = { 'ShowAllSwitches': /<SHOW SHOP (?:ALL |)SWITCH(?:|ES):[ ](.*)>/i, 'ShowAnySwitches': /<SHOW SHOP ANY SWITCH(?:|ES):[ ](.*)>/i, 'HideAllSwitches': /<HIDE SHOP (?:ALL |)SWITCH(?:|ES):[ ](.*)>/i, 'HideAnySwitches': /<HIDE SHOP ANY SWITCH(?:|ES):[ ](.*)>/i, 'BuyTurnSwitchOn': /<BUY TURN ON SWITCH(?:|ES):[ ](.*)>/i, 'BuyTurnSwitchOff': /<BUY TURN OFF SWITCH(?:|ES):[ ](.*)>/i, 'SellTurnSwitchOn': /<SELL TURN ON SWITCH(?:|ES):[ ](.*)>/i, 'SellTurnSwitchOff': /<SELL TURN OFF SWITCH(?:|ES):[ ](.*)>/i }, Window_ShopBuy[_0x709961(0x5ef)][_0x709961(0x1a4)] = function (_0x58a9fc) { const _0x5992d0 = _0x709961; if (!_0x58a9fc) return ![]; const _0x2f2860 = VisuMZ[_0x5992d0(0x3db)][_0x5992d0(0x4ae)], _0x247ed1 = _0x58a9fc ? _0x58a9fc[_0x5992d0(0x1e9)] || '' : ''; if (_0x247ed1[_0x5992d0(0x1ed)](_0x2f2860[_0x5992d0(0x4f4)])) { const _0x15071e = String(RegExp['$1'])[_0x5992d0(0x617)](',')[_0x5992d0(0x1ac)](_0xe1b297 => Number(_0xe1b297)); if (_0x15071e[_0x5992d0(0x217)](_0x445e1e => !$gameSwitches[_0x5992d0(0x337)](_0x445e1e))) return ![]; } if (_0x247ed1[_0x5992d0(0x1ed)](_0x2f2860['ShowAnySwitches'])) { const _0x2dd431 = String(RegExp['$1'])['split'](',')['map'](_0x2ebb36 => Number(_0x2ebb36)); if (_0x2dd431['every'](_0x49b6c0 => !$gameSwitches[_0x5992d0(0x337)](_0x49b6c0))) return ![]; } if (_0x247ed1['match'](_0x2f2860[_0x5992d0(0x529)])) { if (_0x5992d0(0x1a3) !== _0x5992d0(0x19c)) { const _0x272d28 = String(RegExp['$1'])[_0x5992d0(0x617)](',')[_0x5992d0(0x1ac)](_0x12495b => Number(_0x12495b)); if (_0x272d28['every'](_0x2d7efb => $gameSwitches[_0x5992d0(0x337)](_0x2d7efb))) return ![]; } else _0x564b55['push'](_0x36d07b(_0x558bc4)); } if (_0x247ed1[_0x5992d0(0x1ed)](_0x2f2860['HideAnySwitches'])) { if ('rNQUW' !== _0x5992d0(0x29f)) { const _0x48a11a = String(RegExp['$1'])[_0x5992d0(0x617)](',')[_0x5992d0(0x1ac)](_0x49495d => Number(_0x49495d)); if (_0x48a11a[_0x5992d0(0x217)](_0x125535 => $gameSwitches[_0x5992d0(0x337)](_0x125535))) return ![]; } else _0x2c7515[_0x5992d0(0x3db)][_0x5992d0(0x451)][_0x5992d0(0x376)](this), this[_0x5992d0(0x6d8)]() && this[_0x5992d0(0x5db)](); } return !![]; }, Window_ShopBuy[_0x709961(0x5ef)][_0x709961(0x602)] = function (_0x22d56d) { const _0x3170c5 = _0x709961; this[_0x3170c5(0x4e3)](); const _0x1922fa = this[_0x3170c5(0x364)](_0x22d56d), _0x324159 = this[_0x3170c5(0x46c)](_0x22d56d), _0xda0fc3 = _0x324159[_0x3170c5(0x4ca)]; this[_0x3170c5(0x403)](this['isEnabled'](_0x1922fa)), this['drawItemName'](_0x1922fa, _0x324159['x'], _0x324159['y'], _0xda0fc3), this[_0x3170c5(0x268)](_0x1922fa, _0x324159), this[_0x3170c5(0x403)](!![]); }, Window_ShopBuy[_0x709961(0x5ef)]['drawItemCost'] = function (_0x345473, _0x44255e) { const _0x13cf22 = _0x709961, _0x16db94 = this[_0x13cf22(0x518)](_0x345473); this['drawCurrencyValue'](_0x16db94, TextManager[_0x13cf22(0x294)], _0x44255e['x'], _0x44255e['y'], _0x44255e[_0x13cf22(0x4ca)]); }, Window_ShopSell[_0x709961(0x5ef)]['maxCols'] = function () { const _0x52b579 = _0x709961; return SceneManager[_0x52b579(0x6c1)][_0x52b579(0x289)]() ? 0x1 : 0x2; }, VisuMZ[_0x709961(0x3db)]['Window_ShopSell_isEnabled'] = Window_ShopSell['prototype'][_0x709961(0x24b)], Window_ShopSell[_0x709961(0x5ef)]['isEnabled'] = function (_0x30b35) { const _0x196704 = _0x709961; if (!_0x30b35) return ![]; const _0x31b2f3 = _0x30b35['note']; if (_0x31b2f3[_0x196704(0x1ed)](/<CANNOT SELL>/i)) return ![]; if (_0x31b2f3[_0x196704(0x1ed)](/<CAN SELL>/i)) return !![]; if (_0x31b2f3[_0x196704(0x1ed)](/<CANNOT SELL[ ](?:SW|SWITCH|SWITCHES):[ ]*(\d+(?:\s*,\s*\d+)*)>/i)) { const _0x25bf7c = JSON[_0x196704(0x692)]('[' + RegExp['$1'][_0x196704(0x1ed)](/\d+/g) + ']'); for (const _0x5d6038 of _0x25bf7c) { if ('pKySE' === 'pKySE') { if (!$gameSwitches[_0x196704(0x337)](_0x5d6038)) return ![]; } else { const _0x172c97 = _0x58e1a4[_0x196704(0x3db)]['Settings']['New'][_0x196704(0x354)]; return _0x172c97[_0x196704(0x1ed)](/#(.*)/i) ? '#' + _0x40ed94(_0x8c35ac['$1']) : _0x6d4bed[_0x196704(0x637)](_0x172c97); } } } if (_0x31b2f3[_0x196704(0x1ed)](/<CANNOT SELL ALL[ ](?:SW|SWITCH|SWITCHES):[ ]*(\d+(?:\s*,\s*\d+)*)>/i)) { if (_0x196704(0x2bc) !== _0x196704(0x2f6)) { const _0x5d46b6 = JSON['parse']('[' + RegExp['$1']['match'](/\d+/g) + ']'); for (const _0x20f8bb of _0x5d46b6) { if (!$gameSwitches[_0x196704(0x337)](_0x20f8bb)) return ![]; } } else _0xbe87a1['prototype'][_0x196704(0x61e)][_0x196704(0x376)](this), this['checkShiftRemoveShortcut'](); } if (_0x31b2f3[_0x196704(0x1ed)](/<CANNOT SELL ANY[ ](?:SW|SWITCH|SWITCHES):[ ]*(\d+(?:\s*,\s*\d+)*)>/i)) { const _0x2815d2 = JSON['parse']('[' + RegExp['$1']['match'](/\d+/g) + ']'); for (const _0xe05cff of _0x2815d2) { if ($gameSwitches[_0x196704(0x337)](_0xe05cff)) return ![]; } } return VisuMZ[_0x196704(0x3db)][_0x196704(0x425)][_0x196704(0x376)](this, _0x30b35); }, Window_ShopStatus['EQUIP_DELAY_MS'] = VisuMZ[_0x709961(0x3db)][_0x709961(0x6b0)]['StatusWindow']['EquipDelayMS'] ?? 0xf0, VisuMZ[_0x709961(0x3db)][_0x709961(0x301)] = Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x57b)], Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x57b)] = function (_0x48a646) { const _0x2e5760 = _0x709961; _0x48a646 = DataManager[_0x2e5760(0x36d)](_0x48a646); if (DataManager[_0x2e5760(0x67a)](_0x48a646) || DataManager[_0x2e5760(0x3b3)](_0x48a646)) this[_0x2e5760(0x2dd)](_0x48a646); else { if ('IfFRH' === _0x2e5760(0x1dc)) return _0x2e5760(0x19f)['format'](_0x8ec210(_0x116bb9['$1'])); else VisuMZ['ItemsEquipsCore']['Window_ShopStatus_setItem'][_0x2e5760(0x376)](this, _0x48a646); } }, Window_ShopStatus[_0x709961(0x5ef)]['setItemDelay'] = function (_0x5d54ed) { const _0x134ce4 = _0x709961; this[_0x134ce4(0x3c2)] = _0x5d54ed; const _0x9c4623 = Window_ShopStatus[_0x134ce4(0x37a)]; setTimeout(this[_0x134ce4(0x476)]['bind'](this, _0x5d54ed), _0x9c4623); }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x476)] = function (_0x1f9334) { const _0x307315 = _0x709961; if (this['_item'] === _0x1f9334) { if (_0x307315(0x443) !== _0x307315(0x691)) this[_0x307315(0x349)](); else return _0x307315(0x220); } }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x6ad)] = function () { return ![]; }, Window_ShopStatus[_0x709961(0x5ef)]['loadFaceImages'] = function () { const _0x3e6b81 = _0x709961; Window_StatusBase['prototype']['loadFaceImages'][_0x3e6b81(0x376)](this); for (const _0x3e370a of $gameParty[_0x3e6b81(0x293)]()) { ImageManager['loadCharacter'](_0x3e370a[_0x3e6b81(0x2a2)]()); } }, Window_ShopStatus['prototype'][_0x709961(0x2a1)] = function () { const _0x3d6f7a = _0x709961; return VisuMZ[_0x3d6f7a(0x3db)][_0x3d6f7a(0x6b0)]['StatusWindow'][_0x3d6f7a(0x597)]; }, Window_ShopStatus[_0x709961(0x5ef)]['refresh'] = function () { const _0x117d35 = _0x709961; this[_0x117d35(0x30a)]['clear'](), this[_0x117d35(0x544)][_0x117d35(0x556)](), this[_0x117d35(0x3c2)] && (this[_0x117d35(0x4e3)](), this['changePaintOpacity'](!![]), this[_0x117d35(0x365)](), this[_0x117d35(0x3fc)]() ? this['drawEquipData']() : this[_0x117d35(0x6ef)](), this[_0x117d35(0x4c5)]()); }, Window_ShopStatus[_0x709961(0x5ef)]['drawPossession'] = function (_0x177e33, _0x1c6045) { const _0x53bb9f = _0x709961; if (!this[_0x53bb9f(0x3fc)]() && !DataManager[_0x53bb9f(0x2f3)](this[_0x53bb9f(0x3c2)])) return; const _0x3f7515 = this[_0x53bb9f(0x224)] - this[_0x53bb9f(0x407)]() - _0x177e33, _0x52af36 = this[_0x53bb9f(0x48d)](_0x53bb9f(0x475)); this[_0x53bb9f(0x61c)](ColorManager['systemColor']()), this[_0x53bb9f(0x62c)](TextManager[_0x53bb9f(0x65d)], _0x177e33 + this[_0x53bb9f(0x407)](), _0x1c6045, _0x3f7515 - _0x52af36), this[_0x53bb9f(0x1c0)](), this['drawItemNumber'](this[_0x53bb9f(0x3c2)], _0x177e33, _0x1c6045, _0x3f7515); }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x533)] = function (_0x16cd5a, _0x150815, _0x1b7241, _0x250471, _0x1ff6d8) { const _0x3839fd = _0x709961; if (VisuMZ[_0x3839fd(0x3db)][_0x3839fd(0x6b0)][_0x3839fd(0x281)][_0x3839fd(0x372)] === ![]) return; _0x1ff6d8 = Math['max'](_0x1ff6d8 || 0x1, 0x1); while (_0x1ff6d8--) { _0x250471 = _0x250471 || this[_0x3839fd(0x361)](), this[_0x3839fd(0x544)][_0x3839fd(0x32b)] = 0xa0; const _0xeb1617 = ColorManager['getItemsEquipsCoreBackColor1'](); this[_0x3839fd(0x544)]['fillRect'](_0x16cd5a + 0x1, _0x150815 + 0x1, _0x1b7241 - 0x2, _0x250471 - 0x2, _0xeb1617), this['contentsBack'][_0x3839fd(0x32b)] = 0xff; } }, ColorManager[_0x709961(0x4ac)] = function () { const _0x2b7f7b = _0x709961, _0x5ab9cb = VisuMZ[_0x2b7f7b(0x3db)][_0x2b7f7b(0x6b0)][_0x2b7f7b(0x281)]; let _0x291142 = _0x5ab9cb[_0x2b7f7b(0x658)] !== undefined ? _0x5ab9cb[_0x2b7f7b(0x658)] : 0x13; return ColorManager[_0x2b7f7b(0x3fd)](_0x291142); }, Window_ShopStatus['prototype'][_0x709961(0x44e)] = function () { const _0x14032a = _0x709961; this[_0x14032a(0x342)] = null; if (VisuMZ['ItemsEquipsCore']['Settings'][_0x14032a(0x281)][_0x14032a(0x1f4)]) { VisuMZ[_0x14032a(0x3db)][_0x14032a(0x6b0)][_0x14032a(0x281)][_0x14032a(0x1f4)][_0x14032a(0x376)](this); return; } const _0x100145 = this[_0x14032a(0x361)](), _0x19dc1b = this[_0x14032a(0x471)]() + 0x8; let _0x443bc4 = 0x0, _0x2bea68 = 0x0, _0x575f10 = this[_0x14032a(0x224)], _0x2086d2 = this[_0x14032a(0x6ca)], _0x1de0e7 = Math[_0x14032a(0x4e5)](_0x575f10 / 0x2), _0x125b4f = _0x443bc4 + _0x575f10 - _0x1de0e7; this[_0x14032a(0x4dc)](this[_0x14032a(0x3c2)], _0x443bc4 + this[_0x14032a(0x407)](), _0x2bea68, _0x575f10 - this[_0x14032a(0x407)]() * 0x2), this[_0x14032a(0x533)](_0x443bc4, _0x2bea68, _0x575f10), _0x2bea68 += _0x100145; if (this[_0x14032a(0x4a3)](_0x443bc4, _0x2bea68, _0x1de0e7)) _0x2bea68 += 0x0; if (this['drawItemQuantity'](_0x125b4f, _0x2bea68, _0x1de0e7)) _0x2bea68 += _0x100145; const _0x552a0d = this[_0x14032a(0x2eb)](), _0x24b9d8 = _0x2bea68; _0x2bea68 = _0x2086d2 - _0x552a0d[_0x14032a(0x321)] * _0x19dc1b - 0x4; let _0x68e95a = _0x443bc4, _0x258ebe = 0x0, _0x2bbb94 = _0x2bea68; for (const _0x497f1f of _0x552a0d) { _0x258ebe = Math[_0x14032a(0x5f5)](this[_0x14032a(0x69a)](_0x497f1f, _0x443bc4 + 0x4, _0x2bea68 + 0x4, _0x575f10), _0x258ebe), _0x2bea68 += _0x19dc1b; } const _0x258565 = $gameParty[_0x14032a(0x213)](), _0x496d8f = Math[_0x14032a(0x4e5)]((_0x575f10 - _0x258ebe) / _0x258565); _0x258ebe = _0x575f10 - _0x496d8f * _0x258565; for (const _0x1cab7f of $gameParty['battleMembers']()) { const _0x543b51 = $gameParty[_0x14032a(0x481)]()['indexOf'](_0x1cab7f), _0xd54a64 = _0x68e95a + _0x258ebe + _0x543b51 * _0x496d8f; this[_0x14032a(0x403)](_0x1cab7f[_0x14032a(0x447)](this[_0x14032a(0x3c2)])), this[_0x14032a(0x587)](_0x1cab7f, _0xd54a64 + _0x496d8f / 0x2, _0x2bbb94); let _0x5f36c2 = _0x2bbb94; for (const _0x181fa5 of _0x552a0d) { if (_0x14032a(0x66d) !== 'czBmw') return 'icon'; else { const _0x3913dd = _0x5f36c2 - (_0x100145 - _0x19dc1b) / 0x2; this[_0x14032a(0x2af)](_0x1cab7f, _0x181fa5, _0xd54a64, _0x3913dd, _0x496d8f), _0x5f36c2 += _0x19dc1b; } } } this[_0x14032a(0x533)](_0x68e95a, _0x24b9d8, _0x258ebe, _0x2bbb94 - _0x24b9d8); for (let _0x18efbf = 0x0; _0x18efbf < _0x258565; _0x18efbf++) { if (_0x14032a(0x26a) === _0x14032a(0x26a)) { const _0x3d2615 = _0x68e95a + _0x258ebe + _0x18efbf * _0x496d8f; this[_0x14032a(0x533)](_0x3d2615, _0x24b9d8, _0x496d8f, _0x2bbb94 - _0x24b9d8); } else _0x574691[_0x14032a(0x3db)][_0x14032a(0x1d8)][_0x14032a(0x376)](this), this[_0x14032a(0x289)]() && this[_0x14032a(0x633)]['show'](), this['_sellWindow']['updateHelp'](); } for (const _0x2381a1 of _0x552a0d) { if (_0x14032a(0x421) === _0x14032a(0x421)) { this['drawItemDarkRect'](_0x68e95a, _0x2bbb94, _0x258ebe, _0x19dc1b); for (let _0x1455c5 = 0x0; _0x1455c5 < _0x258565; _0x1455c5++) { if (_0x14032a(0x5e3) !== 'lIeUg') return _0x54d0f5['ItemsEquipsCore']['Scene_Shop_numberWindowRect'][_0x14032a(0x376)](this); else { const _0x56ba11 = _0x68e95a + _0x258ebe + _0x1455c5 * _0x496d8f; this[_0x14032a(0x533)](_0x56ba11, _0x2bbb94, _0x496d8f, _0x19dc1b); } } _0x2bbb94 += _0x19dc1b; } else return _0x7782e0[_0x14032a(0x3db)]['Scene_Equip_commandWindowRect'][_0x14032a(0x376)](this); } }, Window_ShopStatus['prototype'][_0x709961(0x4a3)] = function (_0x1ecfec, _0x1833d3, _0x219b97) { const _0x2dee3f = _0x709961; if (!this[_0x2dee3f(0x3fc)]()) return ![]; const _0x278630 = $dataSystem[_0x2dee3f(0x2c9)][this[_0x2dee3f(0x3c2)][_0x2dee3f(0x5fe)]]; return this[_0x2dee3f(0x2c2)](_0x278630, _0x1ecfec, _0x1833d3, _0x219b97, !![]), this['drawItemDarkRect'](_0x1ecfec, _0x1833d3, _0x219b97), this[_0x2dee3f(0x4e3)](), !![]; }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x2e2)] = function () { const _0x3af5da = _0x709961, _0x49253e = VisuMZ['ItemsEquipsCore']['Settings']['ItemScene'][_0x3af5da(0x5b8)]; return _0x49253e['format']($gameParty[_0x3af5da(0x402)](this['_item'])); }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x2eb)] = function () { const _0x922261 = _0x709961; let _0x473099 = [0x0, 0x1, 0x2, 0x3, 0x4, 0x5, 0x6, 0x7]; return Imported['VisuMZ_0_CoreEngine'] && (_0x473099 = VisuMZ['CoreEngine']['Settings'][_0x922261(0x512)][_0x922261(0x283)]), _0x473099 = _0x473099['map'](_0x3730f => typeof _0x3730f === _0x922261(0x540) ? _0x3730f : _0x3730f[_0x922261(0x45c)]()['trim']()), _0x473099; }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x302)] = function () { const _0x479d21 = _0x709961; return VisuMZ[_0x479d21(0x3db)][_0x479d21(0x6b0)][_0x479d21(0x281)][_0x479d21(0x4d2)]; }, Window_ShopStatus['prototype'][_0x709961(0x69a)] = function (_0x24ca65, _0x3d208a, _0x4824cc, _0x11235e) { const _0x304aa6 = _0x709961; this[_0x304aa6(0x4e3)](), this['contents'][_0x304aa6(0x416)] = this['smallParamFontSize'](); let _0x5d2a3c = this[_0x304aa6(0x48d)](TextManager[_0x304aa6(0x307)](_0x24ca65)) + 0x4 + _0x3d208a; return Imported[_0x304aa6(0x615)] ? (this[_0x304aa6(0x623)](_0x3d208a, _0x4824cc, _0x11235e, _0x24ca65, !![]), VisuMZ[_0x304aa6(0x516)]['Settings'][_0x304aa6(0x512)][_0x304aa6(0x426)] && (_0x5d2a3c += ImageManager['iconWidth'] + 0x4)) : _0x304aa6(0x4f1) === _0x304aa6(0x4f1) ? (this['changeTextColor'](ColorManager[_0x304aa6(0x697)]()), this[_0x304aa6(0x62c)](TextManager[_0x304aa6(0x307)](_0x24ca65), _0x3d208a, _0x4824cc, _0x11235e)) : this[_0x304aa6(0x222)](), this[_0x304aa6(0x4e3)](), _0x5d2a3c; }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x2af)] = function (_0x3a627a, _0x39a86b, _0x11dfd2, _0x237782, _0x43095c) { const _0x56a877 = _0x709961; _0x11dfd2 += this[_0x56a877(0x407)](), _0x43095c -= this[_0x56a877(0x407)]() * 0x2; const _0x48676e = VisuMZ[_0x56a877(0x3db)][_0x56a877(0x6b0)]['StatusWindow']; this['contents'][_0x56a877(0x416)] = _0x48676e[_0x56a877(0x4d2)], this[_0x56a877(0x403)](_0x3a627a['canEquip'](this[_0x56a877(0x3c2)])); if (_0x3a627a[_0x56a877(0x51c)](this['_item']) && !_0x3a627a[_0x56a877(0x625)](this[_0x56a877(0x3c2)])) { const _0x1199bf = _0x48676e['AlreadyEquipMarker']; this[_0x56a877(0x62c)](_0x1199bf, _0x11dfd2, _0x237782, _0x43095c, 'center'); } else { if (_0x3a627a[_0x56a877(0x447)](this['_item'])) { if (_0x56a877(0x493) === _0x56a877(0x392)) _0x1d6933 = _0x531d07[_0x56a877(0x2c9)][_0x231165(_0x30a0d9['$1'])] || ''; else { const _0x59a606 = this[_0x56a877(0x6ea)](_0x3a627a); let _0x50d87b = 0x0, _0x818bac = 0x0, _0x4ae652 = 0x0; Imported[_0x56a877(0x615)] ? (_0x50d87b = _0x59a606['paramValueByName'](_0x39a86b), _0x818bac = _0x50d87b - _0x3a627a['paramValueByName'](_0x39a86b), this[_0x56a877(0x61c)](ColorManager[_0x56a877(0x4da)](_0x818bac)), _0x4ae652 = (_0x818bac >= 0x0 ? '+' : '') + VisuMZ[_0x56a877(0x45d)](_0x818bac, 0x0, _0x39a86b)) : (_0x50d87b = _0x59a606['param'](_0x39a86b), _0x818bac = _0x50d87b - _0x3a627a[_0x56a877(0x307)](_0x39a86b), this[_0x56a877(0x61c)](ColorManager[_0x56a877(0x4da)](_0x818bac)), _0x4ae652 = (_0x818bac >= 0x0 ? '+' : '') + _0x818bac), _0x4ae652 === '+0' && (_0x4ae652 = _0x48676e[_0x56a877(0x588)]), this[_0x56a877(0x62c)](_0x4ae652, _0x11dfd2, _0x237782, _0x43095c, _0x56a877(0x50b)); } } else { const _0x5a8ebb = _0x48676e[_0x56a877(0x444)]; this[_0x56a877(0x62c)](_0x5a8ebb, _0x11dfd2, _0x237782, _0x43095c, _0x56a877(0x50b)); } } this[_0x56a877(0x4e3)](), this[_0x56a877(0x403)](!![]); }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x6ea)] = function (_0x5b6480) { const _0x444c14 = _0x709961; if (this[_0x444c14(0x58f)](_0x5b6480)) { const _0x5ae431 = JsonEx[_0x444c14(0x340)](_0x5b6480); _0x5ae431[_0x444c14(0x342)] = !![]; const _0x4413f9 = _0x5ae431[_0x444c14(0x422)](this['_item']); _0x4413f9 >= 0x0 && _0x5ae431[_0x444c14(0x335)](_0x4413f9, this['_item']), this[_0x444c14(0x342)] = _0x5ae431; } return this['_tempActor']; }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x58f)] = function (_0x1d7de4) { const _0x4810cf = _0x709961; if (!this['_tempActor']) return !![]; return this[_0x4810cf(0x342)][_0x4810cf(0x385)]() !== _0x1d7de4['actorId'](); }, Game_Actor[_0x709961(0x5ef)][_0x709961(0x625)] = function (_0x11146b) { const _0x53112d = _0x709961; if (!_0x11146b) return ![]; const _0xec9538 = _0x11146b[_0x53112d(0x5fe)], _0x235847 = this[_0x53112d(0x252)](); for (let _0x5c1438 = 0x0; _0x5c1438 < _0x235847[_0x53112d(0x321)]; _0x5c1438++) { const _0x2d1425 = _0x235847[_0x5c1438]; if (_0x2d1425 !== _0xec9538) continue; if (!this[_0x53112d(0x673)]()[_0x5c1438]) return !![]; } return ![]; }, Game_Actor[_0x709961(0x5ef)][_0x709961(0x422)] = function (_0x3a5b72) { const _0x751c8e = _0x709961; if (!_0x3a5b72) return -0x1; const _0x1e2747 = _0x3a5b72[_0x751c8e(0x5fe)], _0x317285 = this[_0x751c8e(0x252)](); let _0x35f39f = -0x1; for (let _0x9f4766 = 0x0; _0x9f4766 < _0x317285[_0x751c8e(0x321)]; _0x9f4766++) { if ('DYiWs' === _0x751c8e(0x1a9)) this[_0x751c8e(0x1d6)](![]); else { const _0x47262e = _0x317285[_0x9f4766]; if (_0x47262e !== _0x1e2747) continue; if (!this[_0x751c8e(0x673)]()[_0x9f4766]) return _0x9f4766; if (_0x35f39f < 0x0) _0x35f39f = _0x9f4766; } } return _0x35f39f; }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x6ef)] = function () { const _0x4476f8 = _0x709961; VisuMZ[_0x4476f8(0x3db)]['Settings'][_0x4476f8(0x281)][_0x4476f8(0x489)]['call'](this); }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x4dc)] = function (_0x1b9f6b, _0xec6232, _0x23ca8a, _0x5edfc8) { const _0x7cea81 = _0x709961, _0x3be191 = DataManager['isSkill'](_0x1b9f6b, _0xec6232, _0x23ca8a, _0x5edfc8) && Imported['VisuMZ_1_SkillsStatesCore'], _0x1cd631 = _0x1b9f6b ? _0x1b9f6b['name'] : ''; if (_0x3be191) Window_SkillList[_0x7cea81(0x5ef)][_0x7cea81(0x499)][_0x7cea81(0x376)](this, _0x1b9f6b); Window_Base[_0x7cea81(0x5ef)][_0x7cea81(0x4dc)][_0x7cea81(0x376)](this, _0x1b9f6b, _0xec6232, _0x23ca8a, _0x5edfc8); if (_0x3be191) _0x1b9f6b[_0x7cea81(0x5a7)] = _0x1cd631; }, Window_ShopStatus[_0x709961(0x5ef)]['prepareItemCustomData'] = function () { const _0x5413c6 = _0x709961; this[_0x5413c6(0x3b8)] = {}; if (!this[_0x5413c6(0x3c2)]) return; const _0x51a074 = this['_item'][_0x5413c6(0x1e9)]; if (_0x51a074[_0x5413c6(0x1ed)](/<STATUS INFO>\s*([\s\S]*)\s*<\/STATUS INFO>/i)) { const _0x5af028 = String(RegExp['$1'])['split'](/[\r\n]+/); for (const _0x91f9e7 of _0x5af028) { if (_0x91f9e7[_0x5413c6(0x1ed)](/(.*):[ ](.*)/i)) { if (_0x5413c6(0x464) === _0x5413c6(0x406)) this[_0x5413c6(0x633)] = _0x1d78a3, this['callUpdateHelp'](); else { const _0x555dbc = String(RegExp['$1'])[_0x5413c6(0x45c)]()[_0x5413c6(0x3c4)](), _0x154454 = String(RegExp['$2'])['trim'](); this['_customItemInfo'][_0x555dbc] = _0x154454; } } } } }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x480)] = function () { const _0x48acba = _0x709961; return Math[_0x48acba(0x5f5)](0x1, $gameSystem[_0x48acba(0x58e)]() - 0x4); }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x4e3)] = function () { const _0x4ee8fc = _0x709961; Window_StatusBase[_0x4ee8fc(0x5ef)][_0x4ee8fc(0x4e3)]['call'](this), this[_0x4ee8fc(0x30a)][_0x4ee8fc(0x416)] = this['_resetFontSize'] || this[_0x4ee8fc(0x30a)][_0x4ee8fc(0x416)], this[_0x4ee8fc(0x30a)][_0x4ee8fc(0x637)] = this['_resetFontColor'] || this[_0x4ee8fc(0x30a)][_0x4ee8fc(0x637)]; }, Window_ShopStatus['prototype']['fontSizeRatio'] = function () { const _0x174193 = _0x709961; return this['contents'][_0x174193(0x416)] / $gameSystem[_0x174193(0x58e)](); }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x25a)] = function (_0x3fba0e, _0x4b3681, _0xaf69b8) { const _0x12c9ea = _0x709961, _0x46d1a4 = ImageManager[_0x12c9ea(0x35c)](_0x12c9ea(0x205)), _0x5ecf20 = ImageManager[_0x12c9ea(0x357)], _0x5158e0 = ImageManager[_0x12c9ea(0x2ea)], _0x30484d = _0x3fba0e % 0x10 * _0x5ecf20, _0x58f18d = Math['floor'](_0x3fba0e / 0x10) * _0x5158e0, _0x408f9d = Math[_0x12c9ea(0x20f)](_0x5ecf20 * this[_0x12c9ea(0x2d8)]()), _0x4600de = Math['ceil'](_0x5158e0 * this[_0x12c9ea(0x2d8)]()); this[_0x12c9ea(0x30a)][_0x12c9ea(0x60b)](_0x46d1a4, _0x30484d, _0x58f18d, _0x5ecf20, _0x5158e0, _0x4b3681, _0xaf69b8, _0x408f9d, _0x4600de); }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x61f)] = function (_0x596782, _0x55b728) { const _0x5ee429 = _0x709961; _0x55b728[_0x5ee429(0x5c9)] && this[_0x5ee429(0x25a)](_0x596782, _0x55b728['x'], _0x55b728['y'] + 0x2); _0x55b728['x'] += Math['ceil'](ImageManager[_0x5ee429(0x357)] * this['fontSizeRatio']()); if (this[_0x5ee429(0x2d8)]() === 0x1) _0x55b728['x'] += 0x4; }, Window_ShopStatus[_0x709961(0x5ef)]['drawItemKeyData'] = function (_0x5557bd, _0x5d4d19, _0x2fe20f, _0x4c2356, _0x5864b3, _0x54ddca) { const _0x1e6153 = _0x709961; _0x5557bd = _0x5557bd || '', _0x54ddca = _0x54ddca || _0x1e6153(0x316), this['_resetFontSize'] = this[_0x1e6153(0x480)](), this[_0x1e6153(0x389)] = _0x5864b3 ? ColorManager[_0x1e6153(0x697)]() : this[_0x1e6153(0x30a)][_0x1e6153(0x637)], _0x5d4d19 += this['itemPadding'](), _0x4c2356 -= this['itemPadding']() * 0x2; const _0x1a0015 = this[_0x1e6153(0x66a)](_0x5557bd); if (_0x54ddca === _0x1e6153(0x50b)) _0x5d4d19 = _0x5d4d19 + Math[_0x1e6153(0x4e5)]((_0x4c2356 - _0x1a0015[_0x1e6153(0x4ca)]) / 0x2); else _0x54ddca === _0x1e6153(0x4b9) && (_0x5d4d19 = _0x5d4d19 + _0x4c2356 - _0x1a0015[_0x1e6153(0x4ca)]); _0x2fe20f += (this[_0x1e6153(0x361)]() - _0x1a0015[_0x1e6153(0x232)]) / 0x2, this[_0x1e6153(0x6ba)](_0x5557bd, _0x5d4d19, _0x2fe20f, _0x4c2356), this[_0x1e6153(0x3f4)] = undefined, this[_0x1e6153(0x389)] = undefined, this['resetFontSettings'](); }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x336)] = function (_0x31614d, _0x133e0a, _0x27c3a0) { const _0x41b994 = _0x709961; if (!DataManager[_0x41b994(0x2f3)](this[_0x41b994(0x3c2)])) return ![]; const _0x3a10c9 = this[_0x41b994(0x3c9)](); this[_0x41b994(0x2c2)](_0x3a10c9, _0x31614d, _0x133e0a, _0x27c3a0, !![]); const _0x29dee1 = this[_0x41b994(0x2f1)](); return this[_0x41b994(0x2c2)](_0x29dee1, _0x31614d, _0x133e0a, _0x27c3a0, ![], 'right'), this['drawItemDarkRect'](_0x31614d, _0x133e0a, _0x27c3a0), this[_0x41b994(0x4e3)](), !![]; }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x3c9)] = function () { const _0x1c9cbf = _0x709961; return VisuMZ[_0x1c9cbf(0x3db)]['Settings'][_0x1c9cbf(0x281)][_0x1c9cbf(0x304)]; }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x2f1)] = function () { const _0x5bcd40 = _0x709961, _0x4938ef = _0x5bcd40(0x5b6); if (this[_0x5bcd40(0x3b8)][_0x4938ef]) return this[_0x5bcd40(0x3b8)][_0x4938ef]; return this['canConsumeItem']() ? VisuMZ['ItemsEquipsCore'][_0x5bcd40(0x6b0)]['StatusWindow']['Consumable'] : VisuMZ[_0x5bcd40(0x3db)][_0x5bcd40(0x6b0)][_0x5bcd40(0x281)][_0x5bcd40(0x5f6)]; }, Window_ShopStatus['prototype'][_0x709961(0x5c3)] = function () { const _0x530c65 = _0x709961; return VisuMZ[_0x530c65(0x516)] && VisuMZ[_0x530c65(0x516)][_0x530c65(0x6b0)]['QoL'][_0x530c65(0x6f2)] && DataManager[_0x530c65(0x239)](this['_item']) ? ![] : 'aJisa' === _0x530c65(0x22f) ? this['_item'][_0x530c65(0x6a5)] : _0x5aee34[_0x530c65(0x462)][_0x530c65(0x60c)](_0x237986(_0x59ba6b['$1'])); }, Window_ShopStatus['prototype'][_0x709961(0x31d)] = function (_0x52bbb5, _0x42640c, _0x521e19) { const _0x38c2bf = _0x709961; if (!this['isEquipItem']() && !DataManager['isItem'](this[_0x38c2bf(0x3c2)])) return ![]; if (DataManager[_0x38c2bf(0x239)](this[_0x38c2bf(0x3c2)]) && !$dataSystem[_0x38c2bf(0x33d)]) { const _0x1fd4f0 = TextManager[_0x38c2bf(0x44d)]; this['drawItemKeyData'](_0x1fd4f0, _0x52bbb5, _0x42640c, _0x521e19, !![], _0x38c2bf(0x50b)); } else { const _0x55b60e = TextManager[_0x38c2bf(0x65d)]; this['drawItemKeyData'](_0x55b60e, _0x52bbb5, _0x42640c, _0x521e19, !![]); const _0x3d16e3 = this[_0x38c2bf(0x2e2)](); this['drawItemKeyData'](_0x3d16e3, _0x52bbb5, _0x42640c, _0x521e19, ![], 'right'); } return this[_0x38c2bf(0x533)](_0x52bbb5, _0x42640c, _0x521e19), this['resetFontSettings'](), !![]; }, Window_ShopStatus[_0x709961(0x5ef)]['getItemQuantityText'] = function () { const _0x7c3ea3 = _0x709961, _0x2fd25e = 'QUANTITY'; if (this['_customItemInfo'][_0x2fd25e]) return this['_customItemInfo'][_0x2fd25e]; const _0x1f5c36 = VisuMZ[_0x7c3ea3(0x3db)][_0x7c3ea3(0x6b0)][_0x7c3ea3(0x309)]['ItemQuantityFmt']; return _0x1f5c36[_0x7c3ea3(0x60c)]($gameParty['numItems'](this['_item'])); }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x62d)] = function (_0x40d272, _0x40b111, _0xabb61f) { const _0x47f2d7 = _0x709961, _0xee0bba = this[_0x47f2d7(0x3b2)](); return this[_0x47f2d7(0x2c2)](_0xee0bba, _0x40d272, _0x40b111, _0xabb61f, ![], 'center'), this[_0x47f2d7(0x533)](_0x40d272, _0x40b111, _0xabb61f), this[_0x47f2d7(0x4e3)](), !![]; }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x3b2)] = function () { const _0x4723f0 = _0x709961, _0x30fdda = _0x4723f0(0x27e); if (this['_customItemInfo'][_0x30fdda]) return this[_0x4723f0(0x3b8)][_0x30fdda]; const _0xbe2c05 = VisuMZ[_0x4723f0(0x3db)]['Settings'][_0x4723f0(0x281)], _0x1c3795 = _0x4723f0(0x379)['format'](this[_0x4723f0(0x3c2)][_0x4723f0(0x378)]); return _0xbe2c05[_0x1c3795]; }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x31c)] = function (_0x52145e, _0x5074c9, _0xf5a1f3) { const _0x8ca518 = _0x709961, _0x532031 = this[_0x8ca518(0x6db)](); return this[_0x8ca518(0x2c2)](_0x532031, _0x52145e, _0x5074c9, _0xf5a1f3, ![], 'center'), this[_0x8ca518(0x533)](_0x52145e, _0x5074c9, _0xf5a1f3), this[_0x8ca518(0x4e3)](), !![]; }, Window_ShopStatus['prototype']['getItemScopeText'] = function () { const _0x547ad3 = _0x709961, _0x37e247 = 'SCOPE'; if (this['_customItemInfo'][_0x37e247]) return this[_0x547ad3(0x3b8)][_0x37e247]; const _0x242b67 = VisuMZ[_0x547ad3(0x3db)][_0x547ad3(0x6b0)][_0x547ad3(0x281)]; if (Imported[_0x547ad3(0x410)]) { const _0xf29b06 = this[_0x547ad3(0x3c2)][_0x547ad3(0x1e9)]; if (_0xf29b06[_0x547ad3(0x1ed)](/<TARGET:[ ](.*)>/i)) { const _0xc75da7 = String(RegExp['$1']); if (_0xc75da7[_0x547ad3(0x1ed)](/(\d+) RANDOM ANY/i)) return _0x547ad3(0x247) === 'mNvYs' ? _0x211ae5['VisuMZ_0_CoreEngine'] && _0x4ffbbd['prototype'][_0x547ad3(0x6d8)][_0x547ad3(0x376)](this) : _0x242b67[_0x547ad3(0x462)][_0x547ad3(0x60c)](Number(RegExp['$1'])); else { if (_0xc75da7['match'](/(\d+) RANDOM (?:ENEMY|ENEMIES|FOE|FOES)/i)) return _0x242b67[_0x547ad3(0x3a9)][_0x547ad3(0x60c)](Number(RegExp['$1'])); else { if (_0xc75da7['match'](/(\d+) RANDOM (?:ALLY|ALLIES|FRIEND|FRIENDS)/i)) return _0x242b67[_0x547ad3(0x682)][_0x547ad3(0x60c)](Number(RegExp['$1'])); else { if (_0xc75da7[_0x547ad3(0x1ed)](/ALL (?:ALLY|ALLIES|FRIEND|FRIENDS) (?:BUT|EXCEPT) (?:USER|SELF)/i)) return _0x242b67[_0x547ad3(0x55e)]; else { if (_0xc75da7[_0x547ad3(0x1ed)](/ALLY OR ENEMY/i)) return _0x242b67[_0x547ad3(0x2ae)] || _0x242b67['Scope7']; else { if (_0xc75da7['match'](/ENEMY OR ALLY/i)) return _0x242b67[_0x547ad3(0x3cd)] || _0x242b67[_0x547ad3(0x1c6)]; } } } } } } } const _0x200a68 = _0x547ad3(0x1e8)['format'](this[_0x547ad3(0x3c2)][_0x547ad3(0x34c)]); return _0x242b67[_0x200a68]; }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x575)] = function (_0x341f5d, _0x527cd2, _0xcf3c3f) { const _0x5a2ce3 = _0x709961, _0x4f132f = this[_0x5a2ce3(0x388)](); this[_0x5a2ce3(0x2c2)](_0x4f132f, _0x341f5d, _0x527cd2, _0xcf3c3f, !![]); const _0x54d6ec = this['getItemSpeedText'](); return this[_0x5a2ce3(0x2c2)](_0x54d6ec, _0x341f5d, _0x527cd2, _0xcf3c3f, ![], _0x5a2ce3(0x4b9)), this[_0x5a2ce3(0x533)](_0x341f5d, _0x527cd2, _0xcf3c3f), this[_0x5a2ce3(0x4e3)](), !![]; }, Window_ShopStatus['prototype']['getItemSpeedLabel'] = function () { const _0x3e46f3 = _0x709961; return VisuMZ[_0x3e46f3(0x3db)][_0x3e46f3(0x6b0)][_0x3e46f3(0x281)][_0x3e46f3(0x1ad)]; }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x3e3)] = function () { const _0x225941 = _0x709961, _0x493721 = _0x225941(0x69e); if (this[_0x225941(0x3b8)][_0x493721]) return this[_0x225941(0x3b8)][_0x493721]; const _0x518811 = this['_item']['speed']; if (_0x518811 >= 0x7d0) { if (_0x225941(0x223) === _0x225941(0x223)) return VisuMZ['ItemsEquipsCore']['Settings'][_0x225941(0x281)][_0x225941(0x253)]; else { _0x335a9b[_0x225941(0x615)] ? (_0x1442c4 = this[_0x225941(0x3bc)][_0x225941(0x29d)](_0x1511d7, ![]), _0x3c6c38 = this['_tempActor']['paramValueByName'](_0x188d0b, ![]), _0x2f77d8 = _0x1bf277(this[_0x225941(0x3bc)][_0x225941(0x29d)](_0x3af505, !![]))[_0x225941(0x1ed)](/([%％])/i)) : (_0x32fea2 = this[_0x225941(0x3bc)][_0x225941(0x307)](_0x4fef4a), _0x3c5440 = this[_0x225941(0x342)][_0x225941(0x307)](_0x3a8bc0), _0xc67988 = _0x17a5e4 % 0x1 !== 0x0 || _0x590f67 % 0x1 !== 0x0); const _0xfbad31 = _0x2455aa, _0x4be909 = _0xac13be, _0x97b9b9 = _0x4be909 - _0xfbad31; let _0x381028 = _0x97b9b9; if (_0x107e27) _0x381028 = _0x103531['round'](_0x97b9b9 * 0x64) + '%'; _0x97b9b9 !== 0x0 && (this['changeTextColor'](_0xc7b85d['paramchangeTextColor'](_0x97b9b9)), _0x381028 = (_0x97b9b9 > 0x0 ? _0x225941(0x60a) : '(%1)')[_0x225941(0x60c)](_0x381028), this[_0x225941(0x62c)](_0x381028, _0x5ca569 + _0x50d22e, _0x53880d, _0x501de0, 'left')); } } else { if (_0x518811 >= 0x3e8) { if ('VoYZp' !== 'VoYZp') _0x1c7339 = _0x28a3db[_0x225941(0x284)]((this['innerWidth'] - _0x4986cd) / 0x2); else return VisuMZ[_0x225941(0x3db)][_0x225941(0x6b0)][_0x225941(0x281)]['Speed1000']; } else { if (_0x518811 > 0x0) return VisuMZ[_0x225941(0x3db)][_0x225941(0x6b0)][_0x225941(0x281)][_0x225941(0x1ca)]; else { if (_0x518811 === 0x0) return VisuMZ[_0x225941(0x3db)][_0x225941(0x6b0)][_0x225941(0x281)][_0x225941(0x40d)]; else { if (_0x518811 > -0x3e8) { if (_0x225941(0x44c) === _0x225941(0x44c)) return VisuMZ[_0x225941(0x3db)][_0x225941(0x6b0)][_0x225941(0x281)]['SpeedNeg999']; else { let _0x1f4b46 = _0x2907bf[_0x225941(0x3db)][_0x225941(0x638)]['call'](this, _0x51aa80); for (const _0x550b30 of this[_0x225941(0x673)]()) { if (_0x550b30) _0x1f4b46 += this[_0x225941(0x23f)](_0x550b30, _0x203712); } return _0x1f4b46; } } else { if (_0x518811 > -0x7d0) return VisuMZ['ItemsEquipsCore'][_0x225941(0x6b0)]['StatusWindow'][_0x225941(0x599)]; else return _0x518811 <= -0x7d0 ? VisuMZ['ItemsEquipsCore']['Settings'][_0x225941(0x281)]['SpeedNeg2000'] : _0x225941(0x562); } } } } } }, Window_ShopStatus['prototype'][_0x709961(0x6e9)] = function (_0x14fdc2, _0x434ed4, _0x31d01b) { const _0x11f315 = _0x709961, _0x2c773f = this[_0x11f315(0x1e3)](); this[_0x11f315(0x2c2)](_0x2c773f, _0x14fdc2, _0x434ed4, _0x31d01b, !![]); const _0x2f288b = this[_0x11f315(0x424)](); return this[_0x11f315(0x2c2)](_0x2f288b, _0x14fdc2, _0x434ed4, _0x31d01b, ![], 'right'), this[_0x11f315(0x533)](_0x14fdc2, _0x434ed4, _0x31d01b), this[_0x11f315(0x4e3)](), !![]; }, Window_ShopStatus[_0x709961(0x5ef)]['getItemSuccessRateLabel'] = function () { const _0x50d2e6 = _0x709961; return VisuMZ[_0x50d2e6(0x3db)][_0x50d2e6(0x6b0)][_0x50d2e6(0x281)]['LabelSuccessRate']; }, Window_ShopStatus[_0x709961(0x5ef)]['getItemSuccessRateText'] = function () { const _0x3b4c04 = _0x709961, _0x5e89bd = _0x3b4c04(0x53d); if (this['_customItemInfo'][_0x5e89bd]) return this[_0x3b4c04(0x3b8)][_0x5e89bd]; if (Imported[_0x3b4c04(0x410)]) { const _0x1bb250 = this[_0x3b4c04(0x3c2)][_0x3b4c04(0x1e9)]; if (_0x1bb250['match'](/<ALWAYS HIT>/i)) { if (_0x3b4c04(0x4ff) !== _0x3b4c04(0x4ff)) { const _0x38593a = _0x3b4c04(0x4b5); if (!this[_0x3b4c04(0x6f3)]['removeStateBuffChanges'] && !this[_0x3b4c04(0x3b8)][_0x38593a]) return ![]; const _0x19c2c2 = this[_0x3b4c04(0x209)](); this[_0x3b4c04(0x2c2)](_0x19c2c2, _0x496ea8, _0x5528c1, _0x52b562, !![]); const _0x73ad2b = this[_0x3b4c04(0x4ee)](); return this[_0x3b4c04(0x2c2)](_0x73ad2b, _0x30ce3e, _0x5882e0, _0x587da0, ![], _0x3b4c04(0x4b9)), this[_0x3b4c04(0x533)](_0x449fd9, _0x48600a, _0x5019aa), this[_0x3b4c04(0x4e3)](), !![]; } else return _0x3b4c04(0x545); } else { if (_0x1bb250[_0x3b4c04(0x1ed)](/<ALWAYS HIT RATE: (\d+)([%％])>/i)) { if ('aAOfq' !== _0x3b4c04(0x2a8)) _0x48116f[_0x3b4c04(0x3db)][_0x3b4c04(0x6ae)]['call'](this, _0xbcb7c2); else return '%1%'[_0x3b4c04(0x60c)](Number(RegExp['$1'])); } } } return _0x3b4c04(0x400)[_0x3b4c04(0x60c)](this[_0x3b4c04(0x3c2)]['successRate']); }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x244)] = function (_0x2d2ff5, _0x1c62fd, _0x5757e0) { const _0x2fa566 = _0x709961, _0x63c4c8 = this[_0x2fa566(0x4b3)](); this[_0x2fa566(0x2c2)](_0x63c4c8, _0x2d2ff5, _0x1c62fd, _0x5757e0, !![]); const _0x556de7 = this[_0x2fa566(0x634)](); return this[_0x2fa566(0x2c2)](_0x556de7, _0x2d2ff5, _0x1c62fd, _0x5757e0, ![], _0x2fa566(0x4b9)), this['drawItemDarkRect'](_0x2d2ff5, _0x1c62fd, _0x5757e0), this['resetFontSettings'](), !![]; }, Window_ShopStatus[_0x709961(0x5ef)]['getItemRepeatsLabel'] = function () { const _0x475761 = _0x709961; return VisuMZ[_0x475761(0x3db)][_0x475761(0x6b0)]['StatusWindow']['LabelRepeats']; }, Window_ShopStatus['prototype']['getItemRepeatsText'] = function () { const _0x19750e = _0x709961, _0x30bdde = _0x19750e(0x29c); if (this[_0x19750e(0x3b8)][_0x30bdde]) return this[_0x19750e(0x3b8)][_0x30bdde]; const _0x312aa5 = '×%1'; return _0x312aa5[_0x19750e(0x60c)](this[_0x19750e(0x3c2)][_0x19750e(0x643)]); }, Window_ShopStatus['prototype']['drawItemHitType'] = function (_0x198125, _0x2b4cdd, _0x3e8e9d) { const _0x9d5daf = _0x709961, _0x46fdc6 = this['getItemHitTypeLabel'](); this[_0x9d5daf(0x2c2)](_0x46fdc6, _0x198125, _0x2b4cdd, _0x3e8e9d, !![]); const _0x7d4bae = this[_0x9d5daf(0x250)](); return this[_0x9d5daf(0x2c2)](_0x7d4bae, _0x198125, _0x2b4cdd, _0x3e8e9d, ![], _0x9d5daf(0x4b9)), this[_0x9d5daf(0x533)](_0x198125, _0x2b4cdd, _0x3e8e9d), this[_0x9d5daf(0x4e3)](), !![]; }, Window_ShopStatus[_0x709961(0x5ef)]['getItemHitTypeLabel'] = function () { const _0x5bfbff = _0x709961; return VisuMZ[_0x5bfbff(0x3db)][_0x5bfbff(0x6b0)]['StatusWindow']['LabelHitType']; }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x250)] = function () { const _0x40b911 = _0x709961, _0x4efd3e = _0x40b911(0x514); if (this[_0x40b911(0x3b8)][_0x4efd3e]) return this[_0x40b911(0x3b8)][_0x4efd3e]; const _0x6e3bf2 = VisuMZ['ItemsEquipsCore'][_0x40b911(0x6b0)][_0x40b911(0x281)], _0x52da29 = 'HitType%1'[_0x40b911(0x60c)](this[_0x40b911(0x3c2)][_0x40b911(0x1f8)]); return _0x6e3bf2[_0x52da29]; }, Window_ShopStatus['prototype'][_0x709961(0x4c2)] = function (_0x298499, _0x1660b9, _0x23f596) { const _0x4873a2 = _0x709961; if (this[_0x4873a2(0x3c2)][_0x4873a2(0x553)][_0x4873a2(0x44f)] <= 0x0) return _0x1660b9; if (this[_0x4873a2(0x4e0)](_0x298499, _0x1660b9, _0x23f596)) _0x1660b9 += this['lineHeight'](); if (this[_0x4873a2(0x57f)](_0x298499, _0x1660b9, _0x23f596)) _0x1660b9 += this[_0x4873a2(0x361)](); return this[_0x4873a2(0x4e3)](), _0x1660b9; }, Window_ShopStatus[_0x709961(0x5ef)]['drawItemDamageElement'] = function (_0x52f421, _0x119af9, _0x53b183) { const _0x5982e5 = _0x709961, _0x593d92 = this[_0x5982e5(0x699)](); this['drawItemKeyData'](_0x593d92, _0x52f421, _0x119af9, _0x53b183, !![]); const _0xc82f74 = this[_0x5982e5(0x6e3)](); return this['drawItemKeyData'](_0xc82f74, _0x52f421, _0x119af9, _0x53b183, ![], _0x5982e5(0x4b9)), this[_0x5982e5(0x533)](_0x52f421, _0x119af9, _0x53b183), this['resetFontSettings'](), !![]; }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x699)] = function () { const _0x245936 = _0x709961; return VisuMZ['ItemsEquipsCore']['Settings'][_0x245936(0x281)][_0x245936(0x63e)]; }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x6e3)] = function () { const _0x5aa728 = _0x709961, _0x397f03 = _0x5aa728(0x505); if (this[_0x5aa728(0x3b8)][_0x397f03]) return this[_0x5aa728(0x3b8)][_0x397f03]; if (this[_0x5aa728(0x3c2)][_0x5aa728(0x553)][_0x5aa728(0x2de)] <= -0x1) { if (_0x5aa728(0x2b6) === _0x5aa728(0x586)) this[_0x5aa728(0x222)](); else return VisuMZ['ItemsEquipsCore'][_0x5aa728(0x6b0)]['StatusWindow'][_0x5aa728(0x2cb)]; } else return this[_0x5aa728(0x3c2)][_0x5aa728(0x553)][_0x5aa728(0x2de)] === 0x0 ? VisuMZ[_0x5aa728(0x3db)][_0x5aa728(0x6b0)][_0x5aa728(0x281)][_0x5aa728(0x5d2)] : _0x5aa728(0x19d) !== _0x5aa728(0x1ef) ? $dataSystem[_0x5aa728(0x664)][this[_0x5aa728(0x3c2)][_0x5aa728(0x553)][_0x5aa728(0x2de)]] : _0x1457d0[_0x5aa728(0x3db)]['Scene_Equip_helpWindowRect']['call'](this); }, Window_ShopStatus[_0x709961(0x5ef)]['drawItemDamageAmount'] = function (_0x2d8952, _0x288c2e, _0x592e2c) { const _0x3aec0f = _0x709961, _0x151d4d = this['getItemDamageAmountLabel'](); this[_0x3aec0f(0x2c2)](_0x151d4d, _0x2d8952, _0x288c2e, _0x592e2c, !![]), this['setupItemDamageTempActors'](); const _0x494ee5 = this[_0x3aec0f(0x6f1)](), _0x3ee97f = ColorManager[_0x3aec0f(0x24c)]([0x0, 0x0, 0x2, 0x1, 0x3, 0x1, 0x3][this[_0x3aec0f(0x3c2)][_0x3aec0f(0x553)][_0x3aec0f(0x44f)]]); return this[_0x3aec0f(0x61c)](_0x3ee97f), this[_0x3aec0f(0x2c2)](_0x494ee5, _0x2d8952, _0x288c2e, _0x592e2c, ![], _0x3aec0f(0x4b9)), this[_0x3aec0f(0x533)](_0x2d8952, _0x288c2e, _0x592e2c), this[_0x3aec0f(0x4e3)](), !![]; }, Window_ShopStatus['prototype'][_0x709961(0x2df)] = function () { const _0x3f4a3f = _0x709961; if (Imported[_0x3f4a3f(0x410)] && DataManager[_0x3f4a3f(0x31f)](this[_0x3f4a3f(0x3c2)]) !== 'MANUAL') { if ('sNOzt' !== 'sNOzt') _0x2cd5f0 = _0x4f8361[_0x3f4a3f(0x36d)](_0x4e669f), _0x11e982[_0x3f4a3f(0x67a)](_0x3699a3) || _0x480a28[_0x3f4a3f(0x3b3)](_0x2d7497) ? this[_0x3f4a3f(0x2dd)](_0xc85a5f) : _0x507c55['ItemsEquipsCore'][_0x3f4a3f(0x301)][_0x3f4a3f(0x376)](this, _0x2e2901); else return this['getItemDamageAmountLabelBattleCore'](); } else { if (_0x3f4a3f(0x347) !== _0x3f4a3f(0x1a7)) return this[_0x3f4a3f(0x6ed)](); else { if (_0x2bf786[_0x3f4a3f(0x676)](_0x3ac8e6)) return ![]; if (!_0x5b6e1b[_0x3f4a3f(0x62e)](this, _0x1458d0)) return ![]; if (!_0x52f285[_0x3f4a3f(0x69f)](this, _0x26809e)) return ![]; return _0x5622e9[_0x3f4a3f(0x3db)][_0x3f4a3f(0x37c)]['call'](this, _0x5e1790); } } }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x6ed)] = function () { const _0x11cc3e = _0x709961, _0x3fd2aa = VisuMZ['ItemsEquipsCore']['Settings'][_0x11cc3e(0x281)], _0x4cf03d = _0x11cc3e(0x3a7)[_0x11cc3e(0x60c)](this[_0x11cc3e(0x3c2)]['damage'][_0x11cc3e(0x44f)]), _0x279e89 = [null, TextManager['hp'], TextManager['mp'], TextManager['hp'], TextManager['mp'], TextManager['hp'], TextManager['mp']][this[_0x11cc3e(0x3c2)][_0x11cc3e(0x553)][_0x11cc3e(0x44f)]]; return _0x3fd2aa[_0x4cf03d]['format'](_0x279e89); }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x2e8)] = function () { const _0x1da700 = _0x709961, _0x24b842 = $gameActors[_0x1da700(0x67f)](0x1); this[_0x1da700(0x3f6)] = JsonEx[_0x1da700(0x340)](_0x24b842), this[_0x1da700(0x53b)] = JsonEx[_0x1da700(0x340)](_0x24b842); }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x6f1)] = function () { const _0x3e72d0 = _0x709961, _0xda0d2f = _0x3e72d0(0x380); if (this['_customItemInfo'][_0xda0d2f]) return this['_customItemInfo'][_0xda0d2f]; return Imported[_0x3e72d0(0x410)] && DataManager['getDamageStyle'](this[_0x3e72d0(0x3c2)]) !== _0x3e72d0(0x554) ? this['getItemDamageAmountTextBattleCore']() : this[_0x3e72d0(0x501)](); }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x501)] = function () { const _0x54bb68 = _0x709961; window['a'] = this[_0x54bb68(0x3f6)], window['b'] = this[_0x54bb68(0x53b)], this[_0x54bb68(0x3f6)][_0x54bb68(0x6a1)](!![]), this[_0x54bb68(0x53b)][_0x54bb68(0x6a1)]([0x3, 0x4][_0x54bb68(0x3bb)](this[_0x54bb68(0x3c2)][_0x54bb68(0x553)][_0x54bb68(0x44f)])); let _0x37a13c = this['_item'][_0x54bb68(0x553)][_0x54bb68(0x246)]; try { if (_0x54bb68(0x313) === _0x54bb68(0x560)) return this[_0x54bb68(0x5cd)] && this[_0x54bb68(0x5cd)][_0x54bb68(0x6d8)](); else { const _0xf52975 = Math[_0x54bb68(0x5f5)](eval(_0x37a13c), 0x0) / window['a']['atk']; return this[_0x54bb68(0x36f)](), isNaN(_0xf52975) ? _0x54bb68(0x562) : _0x54bb68(0x400)['format'](Math['round'](_0xf52975 * 0x64)); } } catch (_0x2c763a) { return _0x54bb68(0x552) !== _0x54bb68(0x552) ? _0x5b4ec0[_0x54bb68(0x3db)][_0x54bb68(0x6b0)][_0x54bb68(0x281)]['LabelApply'] : ($gameTemp[_0x54bb68(0x38b)]() && (_0x54bb68(0x6c4) !== _0x54bb68(0x497) ? (console['log'](_0x54bb68(0x6cd)[_0x54bb68(0x60c)](this[_0x54bb68(0x3c2)][_0x54bb68(0x5a7)])), console[_0x54bb68(0x4df)](_0x2c763a)) : this['cursorPagedown']()), this[_0x54bb68(0x36f)](), _0x54bb68(0x562)); } }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x36f)] = function () { window['a'] = undefined, window['b'] = undefined; }, Window_ShopStatus['prototype'][_0x709961(0x440)] = function (_0x17fbcd, _0x2c1e05, _0xe88f03) { const _0x2410d5 = _0x709961; if (!this[_0x2410d5(0x3f5)]()) return _0x2c1e05; if (this[_0x2410d5(0x45b)](_0x17fbcd, _0x2c1e05, _0xe88f03)) _0x2c1e05 += this[_0x2410d5(0x361)](); if (this[_0x2410d5(0x3ea)](_0x17fbcd, _0x2c1e05, _0xe88f03)) _0x2c1e05 += this[_0x2410d5(0x361)](); if (this[_0x2410d5(0x2b1)](_0x17fbcd, _0x2c1e05, _0xe88f03)) _0x2c1e05 += this[_0x2410d5(0x361)](); if (this[_0x2410d5(0x5e1)](_0x17fbcd, _0x2c1e05, _0xe88f03)) _0x2c1e05 += this[_0x2410d5(0x361)](); if (this['drawItemEffectsMpDamage'](_0x17fbcd, _0x2c1e05, _0xe88f03)) _0x2c1e05 += this[_0x2410d5(0x361)](); if (this[_0x2410d5(0x596)](_0x17fbcd, _0x2c1e05, _0xe88f03)) _0x2c1e05 += this[_0x2410d5(0x361)](); if (this['drawItemEffectsSelfTpGain'](_0x17fbcd, _0x2c1e05, _0xe88f03)) _0x2c1e05 += this[_0x2410d5(0x361)](); if (this[_0x2410d5(0x487)](_0x17fbcd, _0x2c1e05, _0xe88f03)) _0x2c1e05 += this[_0x2410d5(0x361)](); if (this['drawItemEffectsRemovedStatesBuffs'](_0x17fbcd, _0x2c1e05, _0xe88f03)) _0x2c1e05 += this[_0x2410d5(0x361)](); return this[_0x2410d5(0x4e3)](), _0x2c1e05; }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x5ac)] = function () { const _0x3d6414 = _0x709961; return this[_0x3d6414(0x3c2)]['effects']; }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x3f5)] = function () { const _0x4f78ac = _0x709961; let _0x169207 = ![]; this[_0x4f78ac(0x6f3)] = { 'rateHP': 0x0, 'flatHP': 0x0, 'rateMP': 0x0, 'flatMP': 0x0, 'gainTP': 0x0, 'selfTP': 0x0, 'addState': [], 'removeState': [], 'changeBuff': [0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0], 'removeBuff': [], 'removeDebuff': [], 'addStateBuffChanges': ![], 'removeStateBuffChanges': ![] }; const _0x446902 = this[_0x4f78ac(0x5ac)](); for (const _0x5c7ff4 of _0x446902) { if (_0x4f78ac(0x46d) === _0x4f78ac(0x39e)) _0x59c6ab['prototype']['processCursorMoveModernControls'][_0x4f78ac(0x376)](this); else switch (_0x5c7ff4[_0x4f78ac(0x467)]) { case Game_Action[_0x4f78ac(0x574)]: this['_itemData']['rateHP'] += _0x5c7ff4[_0x4f78ac(0x3ab)], this[_0x4f78ac(0x6f3)][_0x4f78ac(0x2a3)] += _0x5c7ff4['value2'], _0x169207 = !![]; break; case Game_Action[_0x4f78ac(0x6c2)]: this['_itemData']['rateMP'] += _0x5c7ff4['value1'], this[_0x4f78ac(0x6f3)][_0x4f78ac(0x684)] += _0x5c7ff4[_0x4f78ac(0x450)], _0x169207 = !![]; break; case Game_Action['EFFECT_GAIN_TP']: this[_0x4f78ac(0x6f3)][_0x4f78ac(0x5b1)] += _0x5c7ff4[_0x4f78ac(0x3ab)], _0x169207 = !![]; break; case Game_Action[_0x4f78ac(0x21e)]: this[_0x4f78ac(0x6f3)][_0x4f78ac(0x210)][_0x4f78ac(0x4ba)](_0x5c7ff4[_0x4f78ac(0x66f)]), _0x169207 = !![]; break; case Game_Action[_0x4f78ac(0x660)]: this['_itemData'][_0x4f78ac(0x1d3)][_0x4f78ac(0x4ba)](_0x5c7ff4[_0x4f78ac(0x66f)]), this['_itemData'][_0x4f78ac(0x39c)] = !![], _0x169207 = !![]; break; case Game_Action['EFFECT_ADD_BUFF']: this[_0x4f78ac(0x6f3)][_0x4f78ac(0x6da)][_0x5c7ff4[_0x4f78ac(0x66f)]] += 0x1, _0x169207 = !![]; break; case Game_Action[_0x4f78ac(0x688)]: this[_0x4f78ac(0x6f3)][_0x4f78ac(0x6da)][_0x5c7ff4[_0x4f78ac(0x66f)]] -= 0x1, _0x169207 = !![]; break; case Game_Action['EFFECT_REMOVE_BUFF']: this[_0x4f78ac(0x6f3)][_0x4f78ac(0x279)]['push'](_0x5c7ff4[_0x4f78ac(0x66f)]), this[_0x4f78ac(0x6f3)][_0x4f78ac(0x39c)] = !![], _0x169207 = !![]; break; case Game_Action[_0x4f78ac(0x58c)]: this[_0x4f78ac(0x6f3)]['removeDebuff'][_0x4f78ac(0x4ba)](_0x5c7ff4[_0x4f78ac(0x66f)]), this['_itemData'][_0x4f78ac(0x39c)] = !![], _0x169207 = !![]; break; } } if (this['_itemData'][_0x4f78ac(0x210)]['length'] > 0x0) this[_0x4f78ac(0x6f3)]['addStateBuffChanges'] = !![]; for (let _0xa574d3 = 0x0; _0xa574d3 < this[_0x4f78ac(0x6f3)][_0x4f78ac(0x6da)][_0x4f78ac(0x321)]; _0xa574d3++) { if ('aUZsI' !== _0x4f78ac(0x3d5)) { if (this['_itemData'][_0x4f78ac(0x6da)][_0xa574d3] !== 0x0) this['_itemData']['addStateBuffChanges'] = !![]; } else _0x22a1f3 = _0xfe640b[_0x4f78ac(0x5e5)][_0x496fd5(_0x6f19b6['$1'])] || ''; } this['_item'][_0x4f78ac(0x36e)] !== 0x0 && (this['_itemData']['selfTP'] = this[_0x4f78ac(0x3c2)][_0x4f78ac(0x36e)], _0x169207 = !![]); const _0x43b878 = [_0x4f78ac(0x6c5), _0x4f78ac(0x613), _0x4f78ac(0x5fa), 'HP\x20DAMAGE', _0x4f78ac(0x1bf), 'TP\x20DAMAGE', _0x4f78ac(0x65c), _0x4f78ac(0x3eb), _0x4f78ac(0x4b5)]; for (const _0x230558 of _0x43b878) { if (this[_0x4f78ac(0x3b8)][_0x230558]) { if ('TUOsg' !== 'MqqTn') { _0x169207 = !![]; break; } else { const _0x306dac = _0x33c180['concat'](_0x32c3a0[_0x4f78ac(0x359)]()); return _0x306dac; } } } return _0x169207; }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x45b)] = function (_0xa3095, _0x2e9bb6, _0x3c4fec) { const _0x27cdac = _0x709961, _0x3a7036 = _0x27cdac(0x6c5); if (this[_0x27cdac(0x6f3)][_0x27cdac(0x395)] <= 0x0 && this[_0x27cdac(0x6f3)][_0x27cdac(0x2a3)] <= 0x0 && !this[_0x27cdac(0x3b8)][_0x3a7036]) return ![]; const _0x1765bb = this[_0x27cdac(0x52e)](); this[_0x27cdac(0x2c2)](_0x1765bb, _0xa3095, _0x2e9bb6, _0x3c4fec, !![]); const _0x3990c7 = this['getItemEffectsHpRecoveryText'](); return this[_0x27cdac(0x61c)](ColorManager[_0x27cdac(0x24c)](0x1)), this[_0x27cdac(0x2c2)](_0x3990c7, _0xa3095, _0x2e9bb6, _0x3c4fec, ![], _0x27cdac(0x4b9)), this[_0x27cdac(0x533)](_0xa3095, _0x2e9bb6, _0x3c4fec), this['resetFontSettings'](), !![]; }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x52e)] = function () { const _0x8f7f08 = _0x709961, _0x48a148 = VisuMZ[_0x8f7f08(0x3db)][_0x8f7f08(0x6b0)][_0x8f7f08(0x281)][_0x8f7f08(0x667)]; return _0x48a148[_0x8f7f08(0x60c)](TextManager['hp']); }, Window_ShopStatus[_0x709961(0x5ef)]['getItemEffectsHpRecoveryText'] = function () { const _0x3bd95f = _0x709961, _0x11a38f = _0x3bd95f(0x6c5); if (this[_0x3bd95f(0x3b8)][_0x11a38f]) return this['_customItemInfo'][_0x11a38f]; let _0x3527c2 = ''; if (this[_0x3bd95f(0x6f3)][_0x3bd95f(0x395)] > 0x0) _0x3527c2 += _0x3bd95f(0x621)['format'](Math[_0x3bd95f(0x4e5)](this[_0x3bd95f(0x6f3)][_0x3bd95f(0x395)] * 0x64)); if (this[_0x3bd95f(0x6f3)]['rateHP'] > 0x0 && this[_0x3bd95f(0x6f3)]['flatHP'] > 0x0) _0x3527c2 += '\x20'; if (this[_0x3bd95f(0x6f3)][_0x3bd95f(0x2a3)] > 0x0) _0x3527c2 += _0x3bd95f(0x367)[_0x3bd95f(0x60c)](this[_0x3bd95f(0x6f3)][_0x3bd95f(0x2a3)]); return _0x3527c2; }, Window_ShopStatus[_0x709961(0x5ef)]['drawItemEffectsMpRecovery'] = function (_0x354810, _0x29c2bd, _0x542926) { const _0x16441f = _0x709961, _0xcb5ad2 = _0x16441f(0x613); if (this['_itemData']['rateMP'] <= 0x0 && this[_0x16441f(0x6f3)][_0x16441f(0x684)] <= 0x0 && !this[_0x16441f(0x3b8)][_0xcb5ad2]) return ![]; const _0x5216cd = this[_0x16441f(0x58b)](); this[_0x16441f(0x2c2)](_0x5216cd, _0x354810, _0x29c2bd, _0x542926, !![]); const _0x1157f0 = this['getItemEffectsMpRecoveryText'](); return this['changeTextColor'](ColorManager[_0x16441f(0x24c)](0x3)), this['drawItemKeyData'](_0x1157f0, _0x354810, _0x29c2bd, _0x542926, ![], _0x16441f(0x4b9)), this[_0x16441f(0x533)](_0x354810, _0x29c2bd, _0x542926), this[_0x16441f(0x4e3)](), !![]; }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x58b)] = function () { const _0x3fb5e2 = _0x709961, _0x3bb0e8 = VisuMZ[_0x3fb5e2(0x3db)][_0x3fb5e2(0x6b0)][_0x3fb5e2(0x281)][_0x3fb5e2(0x54a)]; return _0x3bb0e8[_0x3fb5e2(0x60c)](TextManager['mp']); }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x311)] = function () { const _0x296b5e = _0x709961, _0x56ed34 = _0x296b5e(0x613); if (this[_0x296b5e(0x3b8)][_0x56ed34]) return this[_0x296b5e(0x3b8)][_0x56ed34]; let _0x2be804 = ''; if (this[_0x296b5e(0x6f3)][_0x296b5e(0x669)] > 0x0) _0x2be804 += _0x296b5e(0x621)['format'](Math['floor'](this[_0x296b5e(0x6f3)][_0x296b5e(0x669)] * 0x64)); if (this[_0x296b5e(0x6f3)][_0x296b5e(0x669)] > 0x0 && this[_0x296b5e(0x6f3)][_0x296b5e(0x684)] > 0x0) _0x2be804 += '\x20'; if (this[_0x296b5e(0x6f3)]['flatMP'] > 0x0) _0x2be804 += _0x296b5e(0x367)[_0x296b5e(0x60c)](this[_0x296b5e(0x6f3)][_0x296b5e(0x684)]); return _0x2be804; }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x2b1)] = function (_0x2bb68f, _0x39690c, _0x47c7cc) { const _0x35327f = _0x709961, _0x5e9744 = _0x35327f(0x5fa); if (this[_0x35327f(0x6f3)]['gainTP'] <= 0x0 && !this[_0x35327f(0x3b8)][_0x5e9744]) return ![]; const _0xeee1bd = this[_0x35327f(0x5e7)](); this['drawItemKeyData'](_0xeee1bd, _0x2bb68f, _0x39690c, _0x47c7cc, !![]); const _0x4e43b0 = this[_0x35327f(0x362)](); return this[_0x35327f(0x61c)](ColorManager[_0x35327f(0x35e)]()), this['drawItemKeyData'](_0x4e43b0, _0x2bb68f, _0x39690c, _0x47c7cc, ![], _0x35327f(0x4b9)), this[_0x35327f(0x533)](_0x2bb68f, _0x39690c, _0x47c7cc), this[_0x35327f(0x4e3)](), !![]; }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x5e7)] = function () { const _0xd44656 = _0x709961, _0x1b0096 = VisuMZ[_0xd44656(0x3db)][_0xd44656(0x6b0)][_0xd44656(0x281)][_0xd44656(0x4a1)]; return _0x1b0096[_0xd44656(0x60c)](TextManager['tp']); }, Window_ShopStatus[_0x709961(0x5ef)]['getItemEffectsTpRecoveryText'] = function () { const _0x4660de = _0x709961, _0x38893f = _0x4660de(0x5fa); if (this[_0x4660de(0x3b8)][_0x38893f]) return this['_customItemInfo'][_0x38893f]; let _0x2509d1 = ''; return _0x2509d1 += _0x4660de(0x367)['format'](this['_itemData'][_0x4660de(0x5b1)]), _0x2509d1; }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x1d2)] = function (_0x811144, _0x33b344, _0x3651a2) { const _0x487ad6 = _0x709961, _0x1c6c4d = _0x487ad6(0x65c); if (this[_0x487ad6(0x6f3)]['selfTP'] === 0x0 && !this[_0x487ad6(0x3b8)][_0x1c6c4d]) return ![]; const _0x1787e8 = this['getItemEffectsSelfTpGainLabel'](); this[_0x487ad6(0x2c2)](_0x1787e8, _0x811144, _0x33b344, _0x3651a2, !![]); const _0xc6ef2e = this[_0x487ad6(0x54f)](); return this[_0x487ad6(0x6f3)]['selfTP'] > 0x0 ? this[_0x487ad6(0x61c)](ColorManager[_0x487ad6(0x35e)]()) : this[_0x487ad6(0x61c)](ColorManager[_0x487ad6(0x298)]()), this[_0x487ad6(0x2c2)](_0xc6ef2e, _0x811144, _0x33b344, _0x3651a2, ![], 'right'), this[_0x487ad6(0x533)](_0x811144, _0x33b344, _0x3651a2), this[_0x487ad6(0x4e3)](), !![]; }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x24a)] = function () { const _0x1d06f0 = _0x709961, _0x501e78 = VisuMZ[_0x1d06f0(0x3db)][_0x1d06f0(0x6b0)][_0x1d06f0(0x281)][_0x1d06f0(0x506)]; return _0x501e78[_0x1d06f0(0x60c)](TextManager['tp']); }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x54f)] = function () { const _0x48bc23 = _0x709961, _0x194e96 = 'USER\x20TP\x20GAIN'; if (this[_0x48bc23(0x3b8)][_0x194e96]) return this['_customItemInfo'][_0x194e96]; let _0x270054 = ''; if (this[_0x48bc23(0x6f3)][_0x48bc23(0x69d)] > 0x0) { if (_0x48bc23(0x30c) === _0x48bc23(0x30c)) _0x270054 += _0x48bc23(0x367)[_0x48bc23(0x60c)](this[_0x48bc23(0x6f3)][_0x48bc23(0x69d)]); else { if (_0x545ee0 >= 0x0) _0x1446cb === this[_0x48bc23(0x624)]() && (this[_0x48bc23(0x56a)] = !![]), this[_0x48bc23(0x55a)](), this[_0x48bc23(0x2a0)](_0x597ca2); else _0x84d328[_0x48bc23(0x2bb)]() >= 0x0 && (this['deactivate'](), this[_0x48bc23(0x6cb)]()); } } else _0x48bc23(0x3e5) !== _0x48bc23(0x3e5) ? this['artifactIDs'][_0x48bc23(0x470)]['push'](_0x26492e['id']) : _0x270054 += '%1'[_0x48bc23(0x60c)](this[_0x48bc23(0x6f3)][_0x48bc23(0x69d)]); return _0x270054; }, Window_ShopStatus[_0x709961(0x5ef)]['drawItemEffectsHpDamage'] = function (_0x324bd4, _0x4340ec, _0x3a0484) { const _0x298b9f = _0x709961, _0x4611f0 = _0x298b9f(0x1fc); if (this[_0x298b9f(0x6f3)][_0x298b9f(0x395)] >= 0x0 && this[_0x298b9f(0x6f3)][_0x298b9f(0x2a3)] >= 0x0 && !this[_0x298b9f(0x3b8)][_0x4611f0]) return ![]; const _0x3cebbe = this[_0x298b9f(0x2c7)](); this[_0x298b9f(0x2c2)](_0x3cebbe, _0x324bd4, _0x4340ec, _0x3a0484, !![]); const _0x39ccb0 = this[_0x298b9f(0x331)](); return this[_0x298b9f(0x61c)](ColorManager['damageColor'](0x0)), this[_0x298b9f(0x2c2)](_0x39ccb0, _0x324bd4, _0x4340ec, _0x3a0484, ![], 'right'), this[_0x298b9f(0x533)](_0x324bd4, _0x4340ec, _0x3a0484), this[_0x298b9f(0x4e3)](), !![]; }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x2c7)] = function () { const _0x2634f6 = _0x709961, _0x4f2186 = VisuMZ[_0x2634f6(0x3db)][_0x2634f6(0x6b0)]['StatusWindow'][_0x2634f6(0x3d9)]; return _0x4f2186[_0x2634f6(0x60c)](TextManager['hp']); }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x331)] = function () { const _0x25218e = _0x709961, _0x54c5eb = 'HP\x20DAMAGE'; if (this[_0x25218e(0x3b8)][_0x54c5eb]) return this[_0x25218e(0x3b8)][_0x54c5eb]; let _0x24d69b = ''; if (this['_itemData']['rateHP'] < 0x0) _0x24d69b += _0x25218e(0x400)[_0x25218e(0x60c)](Math['floor'](this['_itemData'][_0x25218e(0x395)] * 0x64)); if (this['_itemData'][_0x25218e(0x395)] < 0x0 && this[_0x25218e(0x6f3)][_0x25218e(0x2a3)] < 0x0) _0x24d69b += '\x20'; if (this[_0x25218e(0x6f3)][_0x25218e(0x2a3)] < 0x0) _0x24d69b += '%1'[_0x25218e(0x60c)](this['_itemData'][_0x25218e(0x2a3)]); return _0x24d69b; }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x5ed)] = function (_0x2daa8e, _0x20fd9e, _0x120b8f) { const _0x3aa864 = _0x709961, _0x1a0889 = _0x3aa864(0x1bf); if (this[_0x3aa864(0x6f3)][_0x3aa864(0x669)] >= 0x0 && this['_itemData'][_0x3aa864(0x684)] >= 0x0 && !this['_customItemInfo'][_0x1a0889]) return ![]; const _0x366dc5 = this[_0x3aa864(0x412)](); this[_0x3aa864(0x2c2)](_0x366dc5, _0x2daa8e, _0x20fd9e, _0x120b8f, !![]); const _0x1e25cd = this[_0x3aa864(0x6eb)](); return this[_0x3aa864(0x61c)](ColorManager[_0x3aa864(0x24c)](0x2)), this[_0x3aa864(0x2c2)](_0x1e25cd, _0x2daa8e, _0x20fd9e, _0x120b8f, ![], _0x3aa864(0x4b9)), this['drawItemDarkRect'](_0x2daa8e, _0x20fd9e, _0x120b8f), this[_0x3aa864(0x4e3)](), !![]; }, Window_ShopStatus['prototype'][_0x709961(0x412)] = function () { const _0x26e30d = _0x709961, _0x1cfa4e = VisuMZ[_0x26e30d(0x3db)][_0x26e30d(0x6b0)][_0x26e30d(0x281)][_0x26e30d(0x5e6)]; return _0x1cfa4e[_0x26e30d(0x60c)](TextManager['mp']); }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x6eb)] = function () { const _0x5162d3 = _0x709961, _0x1714b2 = 'MP\x20DAMAGE'; if (this[_0x5162d3(0x3b8)][_0x1714b2]) return this[_0x5162d3(0x3b8)][_0x1714b2]; let _0x4901b1 = ''; if (this[_0x5162d3(0x6f3)][_0x5162d3(0x669)] < 0x0) _0x4901b1 += _0x5162d3(0x400)[_0x5162d3(0x60c)](Math[_0x5162d3(0x4e5)](this[_0x5162d3(0x6f3)][_0x5162d3(0x669)] * 0x64)); if (this['_itemData'][_0x5162d3(0x669)] < 0x0 && this[_0x5162d3(0x6f3)][_0x5162d3(0x684)] < 0x0) _0x4901b1 += '\x20'; if (this[_0x5162d3(0x6f3)][_0x5162d3(0x684)] < 0x0) _0x4901b1 += '%1'[_0x5162d3(0x60c)](this['_itemData'][_0x5162d3(0x684)]); return _0x4901b1; }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x596)] = function (_0x35c3d3, _0x47500e, _0x50db60) { const _0x1daaea = _0x709961, _0x34f23c = _0x1daaea(0x64c); if (this[_0x1daaea(0x6f3)][_0x1daaea(0x5b1)] >= 0x0 && !this[_0x1daaea(0x3b8)][_0x34f23c]) return ![]; const _0x1b9788 = this['getItemEffectsTpDamageLabel'](); this[_0x1daaea(0x2c2)](_0x1b9788, _0x35c3d3, _0x47500e, _0x50db60, !![]); const _0x176f90 = this[_0x1daaea(0x64e)](); return this[_0x1daaea(0x61c)](ColorManager[_0x1daaea(0x298)]()), this[_0x1daaea(0x2c2)](_0x176f90, _0x35c3d3, _0x47500e, _0x50db60, ![], 'right'), this[_0x1daaea(0x533)](_0x35c3d3, _0x47500e, _0x50db60), this[_0x1daaea(0x4e3)](), !![]; }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x1fa)] = function () { const _0x39d1f2 = _0x709961, _0x46f981 = VisuMZ[_0x39d1f2(0x3db)]['Settings'][_0x39d1f2(0x281)][_0x39d1f2(0x589)]; return _0x46f981['format'](TextManager['tp']); }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x64e)] = function () { const _0x35b02e = _0x709961, _0x4046e8 = _0x35b02e(0x64c); if (this[_0x35b02e(0x3b8)][_0x4046e8]) return this[_0x35b02e(0x3b8)][_0x4046e8]; let _0x346a23 = ''; return _0x346a23 += '%1'[_0x35b02e(0x60c)](this[_0x35b02e(0x6f3)][_0x35b02e(0x5b1)]), _0x346a23; }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x487)] = function (_0x3ea59c, _0x5ab4e6, _0x77eac1) { const _0x238cd9 = _0x709961, _0x4ed1d5 = _0x238cd9(0x3eb); if (!this['_itemData'][_0x238cd9(0x312)] && !this[_0x238cd9(0x3b8)][_0x4ed1d5]) return ![]; const _0x329e82 = this['getItemEffectsAddedStatesBuffsText'](); if (_0x329e82[_0x238cd9(0x321)] <= 0x0) return ![]; const _0x59953e = this['getItemEffectsAddedStatesBuffsLabel'](); return this['drawItemKeyData'](_0x59953e, _0x3ea59c, _0x5ab4e6, _0x77eac1, !![]), this['drawItemKeyData'](_0x329e82, _0x3ea59c, _0x5ab4e6, _0x77eac1, ![], _0x238cd9(0x4b9)), this[_0x238cd9(0x533)](_0x3ea59c, _0x5ab4e6, _0x77eac1), this[_0x238cd9(0x4e3)](), !![]; }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x5c5)] = function () { const _0x3b4c5a = _0x709961; return VisuMZ[_0x3b4c5a(0x3db)][_0x3b4c5a(0x6b0)][_0x3b4c5a(0x281)][_0x3b4c5a(0x583)]; }, Window_ShopStatus['prototype'][_0x709961(0x608)] = function () { const _0xf84aef = _0x709961, _0x30203d = _0xf84aef(0x3eb); if (this[_0xf84aef(0x3b8)][_0x30203d]) return this['_customItemInfo'][_0x30203d]; let _0x4c44c2 = '', _0x414d51 = 0x0; const _0x1bfb1f = 0x8; for (const _0xbd36c7 of this[_0xf84aef(0x6f3)][_0xf84aef(0x210)]) { const _0x342a3e = $dataStates[_0xbd36c7]; if (_0x342a3e && _0x342a3e[_0xf84aef(0x4a7)] > 0x0) { _0x4c44c2 += '\x5cI[%1]'[_0xf84aef(0x60c)](_0x342a3e['iconIndex']), _0x414d51++; if (_0x414d51 >= _0x1bfb1f) return _0x4c44c2; } } for (let _0x35dc08 = 0x0; _0x35dc08 < this[_0xf84aef(0x6f3)][_0xf84aef(0x6da)]['length']; _0x35dc08++) { if (_0xf84aef(0x2b2) === 'DkCoo') { const _0x100764 = this[_0xf84aef(0x6f3)][_0xf84aef(0x6da)][_0x35dc08], _0x9d8708 = Game_BattlerBase[_0xf84aef(0x5ef)][_0xf84aef(0x1ea)](_0x100764, _0x35dc08); if (_0x9d8708 > 0x0) { _0x4c44c2 += _0xf84aef(0x3d2)[_0xf84aef(0x60c)](_0x9d8708), _0x414d51++; if (_0x414d51 >= _0x1bfb1f) return _0x4c44c2; } } else _0x4fe42d[_0xf84aef(0x3db)][_0xf84aef(0x332)]['call'](this), this[_0xf84aef(0x289)]() && this[_0xf84aef(0x266)](); } return _0x4c44c2; }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x44a)] = function (_0x28d91e, _0x3d7be4, _0x2ae4a2) { const _0x424322 = _0x709961, _0x9911be = _0x424322(0x4b5); if (!this['_itemData'][_0x424322(0x39c)] && !this[_0x424322(0x3b8)][_0x9911be]) return ![]; const _0x56225b = this[_0x424322(0x209)](); this[_0x424322(0x2c2)](_0x56225b, _0x28d91e, _0x3d7be4, _0x2ae4a2, !![]); const _0x4be738 = this[_0x424322(0x4ee)](); return this[_0x424322(0x2c2)](_0x4be738, _0x28d91e, _0x3d7be4, _0x2ae4a2, ![], 'right'), this[_0x424322(0x533)](_0x28d91e, _0x3d7be4, _0x2ae4a2), this['resetFontSettings'](), !![]; }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x209)] = function () { const _0xbaa0b5 = _0x709961; return VisuMZ[_0xbaa0b5(0x3db)][_0xbaa0b5(0x6b0)][_0xbaa0b5(0x281)][_0xbaa0b5(0x67c)]; }, Window_ShopStatus['prototype'][_0x709961(0x4ee)] = function () { const _0x29080b = _0x709961, _0x2567be = _0x29080b(0x4b5); if (this['_customItemInfo'][_0x2567be]) return this[_0x29080b(0x3b8)][_0x2567be]; let _0x2ddbcb = '', _0xb8f9f2 = 0x0; const _0x3e0074 = VisuMZ['ItemsEquipsCore'][_0x29080b(0x6b0)][_0x29080b(0x281)]['MaxIcons']; for (const _0x1355ac of this[_0x29080b(0x6f3)][_0x29080b(0x1d3)]) { const _0x5d9ae2 = $dataStates[_0x1355ac]; if (_0x5d9ae2 && _0x5d9ae2[_0x29080b(0x4a7)] > 0x0) { _0x2ddbcb += _0x29080b(0x3d2)[_0x29080b(0x60c)](_0x5d9ae2[_0x29080b(0x4a7)]), _0xb8f9f2++; if (_0xb8f9f2 >= _0x3e0074) return _0x2ddbcb; } } for (let _0x2411ed = 0x0; _0x2411ed < this[_0x29080b(0x6f3)][_0x29080b(0x279)]['length']; _0x2411ed++) { const _0x4c3b82 = this[_0x29080b(0x6f3)][_0x29080b(0x279)][_0x2411ed], _0x171ffe = Game_BattlerBase[_0x29080b(0x5ef)][_0x29080b(0x1ea)](0x1, _0x4c3b82); if (_0x171ffe > 0x0) { _0x2ddbcb += _0x29080b(0x3d2)[_0x29080b(0x60c)](_0x171ffe), _0xb8f9f2++; if (_0xb8f9f2 >= _0x3e0074) return _0x2ddbcb; } } for (let _0x12c0a4 = 0x0; _0x12c0a4 < this[_0x29080b(0x6f3)][_0x29080b(0x6d1)]['length']; _0x12c0a4++) { if (_0x29080b(0x38f) !== 'OmdWX') { const _0x265a48 = this[_0x29080b(0x6f3)]['removeDebuff'][_0x12c0a4], _0x3eae31 = Game_BattlerBase[_0x29080b(0x5ef)]['buffIconIndex'](-0x1, _0x265a48); if (_0x3eae31 > 0x0) { _0x2ddbcb += _0x29080b(0x3d2)['format'](_0x3eae31), _0xb8f9f2++; if (_0xb8f9f2 >= _0x3e0074) return _0x2ddbcb; } } else return ![]; } return _0x2ddbcb; }, Window_ShopStatus[_0x709961(0x5ef)]['drawItemCustomEntries'] = function (_0x5f246d, _0x26255a, _0x30a883) { const _0x9ece3d = _0x709961; if (this[_0x9ece3d(0x3c2)][_0x9ece3d(0x1e9)][_0x9ece3d(0x1ed)](/<CUSTOM STATUS INFO>\s*([\s\S]*)\s*<\/CUSTOM STATUS INFO>/i)) { if ('aiUkS' === _0x9ece3d(0x612)) { const _0xe583e2 = String(RegExp['$1'])[_0x9ece3d(0x617)](/[\r\n]+/); for (const _0x166fb9 of _0xe583e2) { if ('bYgWD' === _0x9ece3d(0x437)) { const _0x2e35cb = this[_0x9ece3d(0x6f3)][_0x9ece3d(0x6da)][_0x146528], _0x46596a = _0x4b7abb[_0x9ece3d(0x5ef)][_0x9ece3d(0x1ea)](_0x2e35cb, _0x4704f3); if (_0x46596a > 0x0) { _0xf3ace0 += _0x9ece3d(0x3d2)['format'](_0x46596a), _0x39547d++; if (_0x519164 >= _0x12a7c8) return _0x3f7084; } } else { if (_0x166fb9[_0x9ece3d(0x1ed)](/(.*):[ ](.*)/i)) { if (_0x9ece3d(0x282) === _0x9ece3d(0x282)) { const _0x3323ea = String(RegExp['$1'])[_0x9ece3d(0x3c4)](), _0x23490c = String(RegExp['$2'])[_0x9ece3d(0x3c4)](); this[_0x9ece3d(0x3d0)](_0x3323ea, _0x23490c, _0x5f246d, _0x26255a, _0x30a883), _0x26255a += this[_0x9ece3d(0x361)](); } else this['drawRemoveItem'](_0x36cc75); } } } } else { const _0xeaba3e = _0x17c4a5(_0x142bfd['$1'])[_0x9ece3d(0x617)](',')[_0x9ece3d(0x1ac)](_0x45594c => _0x1cdc9f(_0x45594c)); if (_0xeaba3e[_0x9ece3d(0x217)](_0x709243 => _0x358ce5[_0x9ece3d(0x337)](_0x709243))) return ![]; } } return this[_0x9ece3d(0x4e3)](), _0x26255a; }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x3d0)] = function (_0x344af2, _0x518f43, _0x3fe7c2, _0x4f43e1, _0x29c4d9) { const _0x52927e = _0x709961; this[_0x52927e(0x2c2)](_0x344af2, _0x3fe7c2, _0x4f43e1, _0x29c4d9, !![]), this['drawItemKeyData'](_0x518f43, _0x3fe7c2, _0x4f43e1, _0x29c4d9, ![], _0x52927e(0x4b9)), this['drawItemDarkRect'](_0x3fe7c2, _0x4f43e1, _0x29c4d9), this[_0x52927e(0x4e3)](); }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x4c5)] = function () { const _0x3dc262 = _0x709961; if (!this[_0x3dc262(0x3c2)]) return; const _0x35fb0e = this['_item'][_0x3dc262(0x1e9)], _0x1f8fae = /<SHOP (?:PICTURE|IMAGE|PICTURE NAME|PICTURE FILENAME|IMAGE NAME|IMAGE FILENAME):[ ](.*)>/gi, _0x62f42e = _0x35fb0e[_0x3dc262(0x1ed)](_0x1f8fae); if (_0x62f42e) for (const _0x483322 of _0x62f42e) { if (_0x3dc262(0x56d) !== _0x3dc262(0x2b0)) { _0x483322['match'](_0x1f8fae); const _0x593414 = String(RegExp['$1'])[_0x3dc262(0x3c4)]() || ''; if (_0x593414 === '') continue; const _0x1f404e = ImageManager['loadPicture'](_0x593414); _0x1f404e[_0x3dc262(0x535)](this['drawCustomShopGraphicLoad']['bind'](this, _0x1f404e, this[_0x3dc262(0x3c2)])); } else { const _0xe4457e = 0x0, _0x31db96 = this[_0x3dc262(0x31b)](), _0x2e4745 = _0x3beba5[_0x3dc262(0x628)], _0x8072e3 = this['calcWindowHeight'](0x1, !![]); return new _0x3867bd(_0xe4457e, _0x31db96, _0x2e4745, _0x8072e3); } } }, Window_ShopStatus[_0x709961(0x5ef)][_0x709961(0x6ec)] = function (_0x609fca, _0x4e5614) { const _0x5006d4 = _0x709961; if (this[_0x5006d4(0x3c2)] !== _0x4e5614) return; if (!_0x609fca) return; if (_0x609fca['width'] <= 0x0 || _0x609fca[_0x5006d4(0x232)] <= 0x0) return; const _0x14472c = _0x4e5614[_0x5006d4(0x1e9)]; let _0x581443 = _0x5006d4(0x1c5); _0x14472c[_0x5006d4(0x1ed)](/<SHOP (?:PICTURE|IMAGE) LAYER:[ ]FOREGROUND>/i) && (_0x581443 = _0x5006d4(0x598)); const _0x3fa161 = _0x581443 === _0x5006d4(0x1c5) ? this[_0x5006d4(0x544)] : this[_0x5006d4(0x30a)]; let _0x13e7d8 = this[_0x5006d4(0x224)], _0x5adf1f = this[_0x5006d4(0x6ca)]; _0x14472c['match'](/<SHOP (?:PICTURE|IMAGE) MAX WIDTH:[ ](\d+)>/i) && (_0x13e7d8 = Number(RegExp['$1'])); _0x14472c[_0x5006d4(0x1ed)](/<SHOP (?:PICTURE|IMAGE) MAX HEIGHT:[ ](\d+)>/i) && (_0x5adf1f = Number(RegExp['$1'])); _0x14472c[_0x5006d4(0x1ed)](/<SHOP (?:PICTURE|IMAGE) MAX DIMENSIONS:[ ](\d+),[ ]*(\d+)>/i) && (_0x13e7d8 = Number(RegExp['$1']), _0x5adf1f = Number(RegExp['$2'])); const _0x2facba = Math[_0x5006d4(0x2d0)](0x1, _0x13e7d8 / _0x609fca[_0x5006d4(0x4ca)], _0x5adf1f / _0x609fca[_0x5006d4(0x232)]); let _0x5a7402 = 0x0, _0x3afd94 = 0x0, _0x20b938 = Math[_0x5006d4(0x4e5)](_0x609fca[_0x5006d4(0x4ca)] * _0x2facba), _0x30337b = Math['floor'](_0x609fca[_0x5006d4(0x232)] * _0x2facba), _0x4ed75c = _0x5006d4(0x50b); _0x14472c[_0x5006d4(0x1ed)](/<SHOP (?:PICTURE|IMAGE) (?:ALIGN|ALIGNMENT):[ ](LEFT|CENTER|RIGHT)>/i) && (_0x4ed75c = String(RegExp['$1'])[_0x5006d4(0x52f)]()[_0x5006d4(0x3c4)]()); if (_0x4ed75c === _0x5006d4(0x316)) 'LcWRr' !== _0x5006d4(0x4b2) ? this[_0x5006d4(0x3df)]() : _0x5a7402 = 0x0; else _0x4ed75c === _0x5006d4(0x50b) ? _0x5a7402 = Math[_0x5006d4(0x284)]((this[_0x5006d4(0x224)] - _0x20b938) / 0x2) : _0x5a7402 = this[_0x5006d4(0x224)] - _0x20b938; let _0x5d6f3c = 'middle'; _0x14472c['match'](/<SHOP (?:PICTURE|IMAGE) POSITION:[ ](TOP|MIDDLE|BOTTOM)>/i) && (_0x5d6f3c = String(RegExp['$1'])[_0x5006d4(0x52f)]()['trim']()); if (_0x5d6f3c === 'top') _0x3afd94 = 0x0; else { if (_0x5d6f3c === _0x5006d4(0x3de)) { if (_0x5006d4(0x5eb) !== _0x5006d4(0x5eb)) return this['isUseItemsEquipsCoreUpdatedLayout']() ? this[_0x5006d4(0x386)]() : _0xb45a01[_0x5006d4(0x3db)][_0x5006d4(0x58a)]['call'](this); else _0x3afd94 = Math[_0x5006d4(0x284)]((this[_0x5006d4(0x6ca)] - _0x30337b) / 0x2); } else _0x3afd94 = this[_0x5006d4(0x6ca)] - _0x30337b; } if (_0x14472c[_0x5006d4(0x1ed)](/<SHOP (?:PICTURE|IMAGE) OFFSET X:[ ]([\+\-]\d+)>/i)) { if (_0x5006d4(0x2e3) === 'nDHeY') { if (_0x364b23['value'](_0x2a4a0b)) return ![]; } else _0x5a7402 += Number(RegExp['$1']); } if (_0x14472c[_0x5006d4(0x1ed)](/<SHOP (?:PICTURE|IMAGE) OFFSET Y:[ ]([\+\-]\d+)>/i)) { if (_0x5006d4(0x30f) === _0x5006d4(0x238)) { const _0x593840 = _0x328cbd(_0x10d4bb['$1']) || 0x1; if (_0x365a21 >= _0x593840) return !![]; } else _0x3afd94 += Number(RegExp['$1']); } _0x14472c[_0x5006d4(0x1ed)](/<SHOP (?:PICTURE|IMAGE) OFFSET:[ ]([\+\-]\d+),[ ]*([\+\-]\d+)>/i) && (_0x5a7402 += Number(RegExp['$1']), _0x3afd94 += Number(RegExp['$2'])); let _0x4fd13f = 0xff; if (_0x14472c[_0x5006d4(0x1ed)](/<SHOP (?:PICTURE|IMAGE) OPACITY:[ ](\d+)>/i)) _0x4fd13f = Number(RegExp['$1']); else { if (_0x14472c[_0x5006d4(0x1ed)](/<SHOP (?:PICTURE|IMAGE) OPACITY:[ ](\d+)([%％])>/i)) { if (_0x5006d4(0x409) !== _0x5006d4(0x409)) return !![]; else _0x4fd13f = Math[_0x5006d4(0x284)](Number(RegExp['$1']) * 0.01 * 0xff)[_0x5006d4(0x371)](0x0, 0xff); } } _0x3fa161[_0x5006d4(0x32b)] = _0x4fd13f, _0x3fa161[_0x5006d4(0x60b)](_0x609fca, 0x0, 0x0, _0x609fca['width'], _0x609fca[_0x5006d4(0x232)], _0x5a7402, _0x3afd94, _0x20b938, _0x30337b), _0x3fa161[_0x5006d4(0x32b)] = 0xff; }, VisuMZ['ItemsEquipsCore'][_0x709961(0x40e)] = function (_0x43fb04) { const _0x19b848 = _0x709961; if (_0x43fb04 === null || typeof _0x43fb04 !== _0x19b848(0x2c6)) return _0x43fb04; const _0x444b98 = Array[_0x19b848(0x2ba)](_0x43fb04) ? [] : Object[_0x19b848(0x256)](Object['getPrototypeOf'](_0x43fb04)); for (const _0x5e0a45 in _0x43fb04) { if (_0x19b848(0x1a8) !== _0x19b848(0x1a8)) return _0x17c0eb; else { if (Object[_0x19b848(0x5ef)][_0x19b848(0x22d)][_0x19b848(0x376)](_0x43fb04, _0x5e0a45)) { if (_0x19b848(0x5a9) === _0x19b848(0x5a9)) _0x444b98[_0x5e0a45] = typeof _0x43fb04[_0x5e0a45] === 'object' && _0x43fb04[_0x5e0a45] !== null ? VisuMZ[_0x19b848(0x3db)][_0x19b848(0x40e)](_0x43fb04[_0x5e0a45]) : _0x43fb04[_0x5e0a45]; else { if (!this[_0x19b848(0x565)]()) return ![]; if (_0x451239[_0x19b848(0x6c1)][_0x19b848(0x3f7)] !== _0x3dbcf1) return ![]; return _0x35fcfe[_0x19b848(0x5c1)]('down') && this[_0x19b848(0x538)](), ![]; } } } } return _0x444b98; };