//=============================================================================
// VisuStella MZ - Core Engine
// VisuMZ_0_CoreEngine.js
//=============================================================================

var Imported = Imported || {};
Imported.VisuMZ_0_CoreEngine = true;

var VisuMZ = VisuMZ || {};
VisuMZ.CoreEngine = VisuMZ.CoreEngine || {};
VisuMZ.CoreEngine.version = 1.83;

//=============================================================================
/*:
* @target MZ
* @plugindesc [RPG Maker MZ] [Tier 0] [Version 1.83] [CoreEngine]
* @author VisuStella
* @url http://www.yanfly.moe/wiki/Core_Engine_VisuStella_MZ
*
* @help
 * ============================================================================
* 介绍
* ============================================================================
*
* 核心引擎插件旨在修复可能存在于 RPG Maker MZ 源代码中的任何 bug，并且为游戏开发者提供更多对 RPG Maker MZ 各种功能的控制，涵盖机制、美观和生活品质改进。
*
* 功能包括但不限于以下内容：
*
* * 修复 RPG Maker MZ 基础代码中的问题。
* * 为脚本调用相关的事件指令添加故障保护。
* * 通过插件参数激活的大量生活品质设置。
* * 控制游戏中使用的各种文本颜色。
* * 更改携带的最大金币数量，为其标签添加图标，并包括重叠细节的文本。
* * 在游戏启动时预加载图像。
* * 为游戏中找到的各种菜单添加特定的背景图像。
* * 在屏幕顶部或底部显示按钮辅助窗口，详细说明在菜单内哪些按钮有什么作用。此功能可关闭。
* * 选择在菜单内显示哪些游戏角色参数（如 ATK、DEF、AGI 等），并确定它们的最大值，以及通过装备、状态和其他特性对象控制参数、x-参数、s-参数奖励的大量备注标签。
* * 控制 UI 对象的外观（如菜单按钮、取消按钮、左/右角色切换按钮）。
* * 如果战斗分辨率较大，重新定位角色和敌人。
* * 允许在显示时支持文本代码的职业名称和昵称。
* * 确定游戏中窗口的行为方式，它们是否会遮挡其他窗口，它们的行高属性等等。

*
* ============================================================================
* 系统要求
* ============================================================================
*
* 此插件适用于 RPG Maker MZ。在其他版本的 RPG Maker 中不适用。
*
* ------ Tier 0 等级 ------
*
* 此插件属于 Tier 0 等级。请将其放置在插件管理器列表中低等级插件的下方（例如：0、1、2、3、4、5）。这样可以确保插件与 VisuStella MZ 插件库中的其他插件兼容性最佳。
*
* ============================================================================
* 重要变更：Bug 修复
* ============================================================================
*
* 此插件还用于修复 RPG Maker MZ 中存在的各种未解决或尚未处理的 bug。以下是由此插件修复的 bug 列表：
*
* ---
*
* 攻击技能特性
*
* 敌人不受攻击技能特性影响。这意味着如果他们有攻击行动，无论攻击技能特性如何更改，它们始终会反复使用攻击。此插件将更改此行为，使攻击技能遵循其攻击技能特性设置。
*
* ---
*
* 自动战斗角色技能使用
*
* 如果自动战斗的角色可以访问某个技能但没有访问该技能类型，该角色在自动战斗期间仍然能够使用该技能，尽管在手动输入时无法使用该技能。
*
* ---
* 
* 自动战斗攻击封印绕过
* 
* 默认情况下，如果攻击技能通过特性封印，并且角色有自动战斗，那么角色仍然可以通过自动战斗使用该动作。此问题现已修复，角色如果其攻击能力被封印，则不应通过自动战斗攻击。
* 
* ---
* 
* 自动战斗卡住
* 
* 如果自动战斗角色与防御力/魔法防御力过高的敌人战斗，它们将完全不使用任何动作。这可能导致潜在的游戏冻结和软锁定。此插件将更改此行为，并使它们默认执行普通攻击。
* 
* ---
* 
* 新游戏后自动保存
* 
* 通常情况下，通过“新游戏”选项开始新游戏时，不会触发自动保存。然而，如果你开始一个新游戏或加载一个已保存的游戏，然后转到游戏结束屏幕，返回标题画面，然后再开始新游戏，此时会触发自动保存，而这是不应该发生的。核心引擎现在将修复此问题，并阻止触发自动保存。
* 
* ---
* 
* 战斗强制结束动作崩溃
* 
* 根据各种情况，当前活跃的战斗者可以随意从战斗系统中清除，由于某些原因，如果恰好目标也被清除，剩余的动作将导致崩溃。此插件将防止这种情况发生。由 Olivia 进行修复。
* 
* ---
* 
* 调试控制台刷新 bug
* 
* 当打开调试控制台（DevTools）并按 F5 刷新时，某些图形可能无法正确加载。自从 RPG Maker MZ 1.5.0 更新以来，代码已经回滚到上一个稳定版本 1.4.4，其中图片加载问题已经解决。
* 
* ---
* 
* 游戏手柄重复输入
* 
* 游戏手柄上清除的输入没有停顿时间，会在下一帧触发相同的输入。这会导致某些 RPG Maker MZ 菜单的问题，需要在清除输入后，按键盘清除帧数后才能重新注册游戏手柄输入。此插件更改了此行为。
* 
* ---
* 
* 战斗中不可见的角色精灵
* 
* 如果在战斗中移除一个队伍成员，并将该成员再次添加到同一位置，他们的精灵将会变得不可见。VisuStella 核心引擎将修复此问题，防止其再次发生。

* ---
* 
* 立即文本差异问题，适用于 Window_Message
* 
* 当 Window_Message 逐字显示文字时，与瞬间显示文字时，显示的文字会有不同。在使用像 Arial 这样的字体时，这种差异非常明显。问题在于 Bitmap.measureTextWidth 函数在每个字母和每个单词的宽度计算中使用了不同的取整方式。核心引擎将提供一个 bug 修复，确保 Window_Message 在确定每个字母宽度时不会使用任何取整值，无论是瞬间显示还是逐字显示。此更改仅影响 Window_Message，不会影响其他窗口，以防止意外副作用。
* 
* 可通过以下方式禁用此功能：
* 
* 插件参数 > 生活品质设置 > 其他 > 字体宽度修复
* 
* ---
*
* 移动图片，原点差异
*
* 如果一个“显示图片”事件命令设置为“左上角”原点，然后随后有一个“移动图片”事件命令设置为“中心”原点，RPG Maker MZ 最初会立即跳到新的原点设置，而不是在它们之间进行平滑过渡。此插件将在不同原点之间创建平滑过渡效果。
*
* ---
* 
* 过度保护替身
* 
* 当一个生命值危急的盟友被友方非“必中”技能（如治疗或增益）瞄准时，另一个盟友拥有替身状态，该盟友会“保护”最初被瞄准的盟友并接受治疗或增益效果。
* 
* 新的改变行为是，现在替身将不会为任何目标为盟友的行动触发。
* 
* ---
* 
* 改变队伍成员后的技能列表激活
* 
* 如果技能列表处于激活状态（即玩家可以移动光标），并且通过按钮命令更改当前查看的队伍成员，那么以前，RPG Maker MZ 会仍然激活该窗口，尽管光标暂时隐藏。在按下方向按钮时，光标会显示，并且技能类型窗口和技能列表窗口都处于激活状态，可能会引发许多潜在问题。
* 
* ---
* 
* 精灵移除和销毁崩溃
* 
* 现在对正在移除和销毁的精灵进行纹理检查，以防止崩溃。如果通过脚本调用创建精灵，并通过此方式移除它，这种情况发生的可能性更高。这使得“销毁”属性在执行纹理检查时，确保了精灵移除时不会进行多余的步骤。
* 
* ---
* 
* 状态窗口名称垂直裁剪
* 
* 在战斗状态窗口中，当显示角色名称时，用于显示他们名称文本的位图在垂直方向上不完全扩展，导致像小写字母“q”和“g”这样的字母被裁剪，使它们难以区分。核心引擎将通过扩展位图来解决此问题，以确保有足够的空间。由 Irina 进行修复。
* 
* ---
* 
* 终止清除效果
* 
* 在 RPG Maker MZ 中，在场景切换时（例如从地图场景到战斗场景），请求动画可能会导致崩溃。这是因为动画队列不会立即取消注册，可能会导致场景的错误目标注册。此插件将在终止场景时强制清除任何已注册的动画和气泡效果，以防止崩溃。
* 
* ---
* 
* 计时器精灵
* 
* 默认情况下，RPG Maker MZ 将 Sprite_Timer 添加到其精灵组中，无论是地图还是战斗中。但是，这样做有一个主要问题：当精灵组受到滤镜、缩放和/或模糊效果影响时，会影响计时器精灵的可读性，使玩家感知信息变得比必要时更为困难。核心引擎将将计时器精灵添加到父场景中，而不是精灵组中，以确保其不被任何其他物体遮挡。
* 
* ---
* 
* 无法使用的战斗物品
* 
* 如果任何队员能够在战斗中使用物品，则所有队员都能够使用该物品，即使该队员本应不能使用该物品。现在已更改为基于个体检查战斗物品，而不是基于整个队伍。
* 
* ---
* 
* 水图块 Bug
* 
* 看起来在 RPG Maker MZ 版本 1.5.0+ 和 1.6.0+ 中，如果从头开始创建一个图块集，则会出现新的 bug！这个 bug 会导致许多图块意外成为水图块。你可以关闭项目中的所有插件，将船只或船只放置在通常的地面图块上，然后看看船只或船只是如何穿过它的。

* 
* 有两种方法可以解决这个问题。由于这是涉及到瓦片集 JSON 数据的问题，我们无法通过插件代码来修复它，但有办法可以绕过这个问题，以便你可以正确地设置水地形标志位。
* 
* 1. 将一个正常的、没有 bug 的瓦片集复制到当前有 bug 的瓦片集上，并重新应用通过性、地形标签等瓦片特性。这将确保水地形通过性的瓦片被正确地复制过来。
* 
* 2. 如果你使用的是 RPG Maker MZ 版本 1.5.0 或更高版本，请选择一个正常的、没有 bug 的瓦片集（通常是创建新项目时存在的瓦片集），点击“复制页面”按钮，然后切换到有 bug 的瓦片集，点击“粘贴页面”。你需要重新应用任何不同的属性，比如通过性和地形标签，但水瓦片标志应该会正常工作。
* 
* 插件本身不会修复这个问题，因为标志数据很精细，不应在游戏中途进行修改，插件所做的更改可能不会匹配所需的设置。
* 
* 然而，当遇到这样的瓦片时，插件会发送警告消息。请注意并执行上述两种步骤之一来解决问题。
* 
* ---
* 
* 窗口箭头精灵撕裂
* 
* 如果 RPG Maker MZ 中的窗口对象宽度设置为奇数，那么窗口中的箭头元素将会在半个像素上定位，使其看起来模糊，并且可能会出现精灵撕裂问题。现在通过将数字四舍五入到最接近的整数来修复此问题。
* 
* ---
* 
* 窗口客户区缩放 bug
* 
* 如果窗口的缩放值不是 1.0，则客户区（可交互部分）将无法正确缩放并显示被裁剪。现在通过将客户区调整为窗口的缩放值并向上四舍五入到最接近的整数来修复此问题。
* 
* ---
* 
* 窗口皮肤溢出
* 
* 此 bug 在 RPG Maker MZ v1.3.0+ 的核心脚本中已修复。
* 
* 自 v1.2.0 更新以来，Window.prototype._refreshBack 的帧值从 96 设置为 95。这导致窗口皮肤超出了窗口预期的边界。核心引擎现在恢复此更改，以防止出现溢出效果。
* 
* ---
*
* ============================================================================
* 主要更改：新的硬编码功能
* ============================================================================
*
* 此插件为 RPG Maker MZ 的功能添加了一些新的硬编码功能。以下是它们的列表。
*
* ---
*
* 滚动链接图片
*
* - 如果一个视差图像文件名以!开头，则与地图滚动绑定。现在同样适用于图片。如果一个图片文件名以!开头，则它也会与地图的滚动绑定。
*
* ---
*
* 运动路线脚本
*
* - 如果在运动路线脚本命令中的代码失败，不会导致游戏崩溃，而是会显示错误的原因并继续执行。
*
* ---
* 
* 脚本调用保护
* 
* - 如果在条件分支、控制变量和/或脚本调用中的代码执行失败，不会导致游戏崩溃，而是会显示错误的原因并继续执行。
* 
* ---
* 
* 数字分组
* 
* - 在你的游戏中，存在一种选项可以改变数字的显示和转换方式。你可以通过进入插件管理器 > VisuMZ_0_OptionsCore > 生活品质设置 > 数字分组，来启用或禁用你想要的选项。
* 
* - 数字分组将遵循插件参数设置的国家/地区规则。例如，如果默认设置为 'en-US'，那么 1234567.123456 将变成 1,234,567.123456。设置为 'es-ES' 将变成 1.234.567,123456。
* 
* - 这使用 JavaScript 的 Number.toLocaleString() 函数，并因此遵循它的规则。这意味着如果小数点后有尾随零，它将被截断。例如，123.45000 将变成 123.45。超过 6 位小数的数字将四舍五入。例如，0.123456789 将变成 0.123457。
* 
* - [ 和 ]、< 和 > 中的数字将被排除在数字分组之外，以便准确保留文本代码。\I[1234] 将保持为 \I[1234]。
* 
* - 如果你想输入一个不进行数字分组的数字，请使用 {{ 和 }} 将其包围起来。输入 {{1234567890}} 将得到 1234567890。

* 
* ---
* 
* 显示滚动文本，额外功能
* 
* 只要安装了VisuStella MZ核心引擎，事件命令“显示滚动文本”现在具有额外的功能。如果游戏开发者在滚动文本中插入 "// Script Call"（不带引号），那么整个“显示滚动文本”事件命令将作为一个巨大的脚本调用事件命令运行。
* 
* 添加这个功能的原因是因为“脚本...”事件命令最多只能包含12行。这意味着任何超过12行代码的脚本调用无法通过常规手段完成，因为每个脚本调用都会作为单独的实例运行。
* 
* 通过重新定位“显示滚动文本”事件命令，使其能够作为扩展的“脚本...”事件命令功能，现在可以更轻松地编写更多行的代码。
* 
* 如果“显示滚动文本”事件命令内容中没有包含“// Script Call”，则不会出现这种效果。
* 
* ---
*
* ============================================================================
* 注释标签
* ============================================================================
*
* 以下是通过此插件添加的注释标签。如果此插件处于关闭状态或不存在，则这些注释标签将无法在您的游戏中起作用。
*
* === 角色相关注释标签 ===
*
* 参数限制可以在插件参数中调整，但这不会解除在编辑器的限制下更改角色的初始或最大等级值的能力。因此，必须通过使用注释标签来完成这个功能。
*
* ---
*
* <最大等级: x>
*
* - 用于：角色注释标签
* - 将 'x' 替换为整数，确定角色的最大等级。
* - 这允许您超过数据库中的 99 限制。
* - 如果未使用此注释标签，默认为角色的数据库值。
*
* ---
*
* <初始等级: x>
*
* - 用于：角色注释标签
* - 将 'x' 替换为整数，确定角色的初始等级。
* - 这允许您超过数据库中的 99 限制。
* - 如果未使用此注释标签，默认为角色的数据库值。
*
* ---
*
* === 职业相关注释标签 ===
*
* 由于角色等级现在可以通过注释系统超过 99，因此您可能希望某些职业在超过 99 级后能学习特定技能。
*
* ---
* 
* <学习等级: x>
*
* - 用于：职业技能学习注释标签
* - 将 'x' 替换为整数，确定该职业将在该等级学习相关技能。
* - 这允许您超过数据库中的 99 限制。
* - 如果未使用此注释标签，默认为职业的数据库值。
*
* ---
*
* === 敌人相关注释标签 ===
*
* 现在给敌人添加了等级。等级本身并不起任何作用，只是作为一个数值容器存在。这样，等级可以在伤害公式中使用（例如：a.atk - b.level）而不会导致任何错误。要给敌人添加等级，请使用以下注释标签。这些注释标签还允许您调整超过数据库限制的基础参数、经验值和金钱。
*
* ---
*
* <等级: x>
*
* - 用于：敌人注释标签
* - 将 'x' 替换为整数，确定敌人的等级。
* - 如果未声明等级，则默认为 1。
*
* ---
*
* <param: x>
*
* - 用于：敌人注释标签
* - 将 'param' 替换为 'MaxHP'、'MaxMP'、'ATK'、'DEF'、'MAT'、'MDF'、'AGI' 或 'LUK'，确定要修改的参数。
*   - 此注释标签不适用于 X 参数、S 参数或任何自定义参数。此注释标签仅适用于基础参数。
* - 将 'x' 替换为整数，设置敌人的 'param' 基础值。
* - 这将覆盖敌人的数据库值，并且可以超过数据库中的原始值限制。
* - 如果未使用这些注释标签，默认为敌人的数据库值。
*
* ---
*
* <经验值: x>
* <金钱: x>
*
* - 用于：敌人注释标签
* - 将 'x' 替换为整数，确定敌人的经验值或金钱值。
* - 这将覆盖敌人的数据库值，并且可以超过数据库中的原始值限制。
* - 如果未使用这些注释标签，默认为敌人的数据库值。
*
* ---
* 
* === 动画相关注释标签 ===
* 
* RPG Maker MZ 中的动画由Effekseer完成，并且动画系统已经进行了重新设计。然而，现在动画只能居中在目标上，不能附加在头部或脚部。将这些标签插入数据库中动画的名称中，以调整它们的位置。
* 
* ---
* 
* <头部>
* <脚部>
* 
* - 用于：动画名称标签
* - 将动画设置为锚定在精灵顶部（如果使用 <头部>）或底部（如果使用 <脚部>）。
* 
* ---
* 
* <锚点X: x>
* <锚点Y: y>
* 
* <锚点: x, y>
* 
* - 用于：动画名称标签
* - 将动画锚定在精灵内的特定点，基于 'x' 和 'y' 值。
* - 将 'x' 和 'y' 替换为数值，表示它们的位置，从最左/最上（x、y 分别为 0.0）到最右/最下（x、y 分别为 1.0）的比例。

* 
* 示例:
* 
* <锚点X: 0.4>
* <锚点Y: 0.8>
* 
* <锚点: 0.2, 0.9>
* 
* ---
* 
* <偏移X: +x>
* <偏移X: -x>
* <偏移Y: +y>
* <偏移Y: -y>
* 
* <偏移: +x, +y>
* <偏移: -x, -y>
* 
* - 用于：动画名称标签
* - 将动画锚定并偏移指定的像素数。
* - 与编辑器相同，但允许输入大于999和小于-999的值。
* - 将 'x' 和 'y' 替换为精确的像素数，用于偏移动画的x和y坐标。
* 
* 示例:
* 
* <偏移X: +20>
* <偏移Y: -50>
* 
* <偏移: +10, -30>
* 
* ---
* 
* <镜像偏移X>
* <不镜像偏移X>
* 
* - 用于：动画名称标签
* - 如果动画被镜像，您可以选择使动画的偏移X值也镜像（或完全不镜像）。
* - 如果未发现任何名称标签，则将使用在插件参数 > QoL设置 > 杂项 > Ani: 镜像偏移X 设置中找到的设置。
* 
* ---
* 
* <速率: x>
* 
* - 用于：MV动画名称标签
* - 允许您调整此MV动画的更新速率。
*   - 不适用于Effekseer动画。
* - 数字越低，速度越快。
* - 将 'x' 替换为表示动画更新速率的数字。
*   - 默认速率: 4。
*   - 最小速率: 1。
*   - 最大速率: 10。
* 
* ---
*
* === 提升游戏体验相关注释标签 ===
*
* 默认情况下，RPG Maker MZ 在随机遭遇结束后没有提供最小遭遇步数。这意味着在结束战斗后的第一步，玩家可以立即进入另一场战斗。提升游戏体验：最小遭遇步数改进允许您设置在战斗之间的缓冲步数，让玩家有些喘息的时间。

*
* ---
*
* <最小遭遇步数: x>
*
* - 用于：地图标签
* - 将 'x' 替换为在玩家在该地图上进入随机遭遇之前的最小步数。
* - 如果未使用此注释标签，则地图的最小遭遇步数将默认为提升游戏体验设置 => 遭遇率最小值。
*
* ---
*
* 在地图编辑器中，某些类型的地砖会自动添加地砖阴影。这些地砖阴影可能适合某些类型的地图，也可能不适合。您可以使用提升游戏体验插件参数来打开/关闭它们，或者可以使用以下注释标签覆盖设置：
*
* ---
*
* <显示地砖阴影>
* <隐藏地砖阴影>
*
* - 用于：地图标签
* - 使用相应的注释标签来实现所需的功能。
* - 如果未使用此注释标签，则地图的最小遭遇步数将默认为提升游戏体验设置 => 没有地砖阴影。
*
* ---
* 
* <锁定滚动X>
* <锁定滚动Y>
* 
* - 用于：地图标签
* - 如果存在这些注释标签，将阻止地图能够左/右滚动（x）或上/下滚动（y）。
* - 当地图略小于正常大小且微小滚动令人分心时，这非常有用。
* - 这将使用在插件参数中找到的显示微调设置。
* - 如果地图处于缩放状态，此设置将被禁用。
* 
* ---
* 
* <锁定滚动X: x>
* <锁定滚动Y: y>
* 
* - 用于：地图标签
* - 如果存在这些注释标签，将阻止地图能够左/右滚动（x）或上/下滚动（y），并稍微微调地图相机。
* - 当地图略小于正常大小且微小滚动令人分心时，这非常有用。
* - 将 'x' 和 'y' 替换为介于0和1之间的数字，表示正在评估的量。
*   - 例如，对于1280x720分辨率，宽27个瓦片的地图将从0.15625的微调中受益。请尝试这些数字，以确定最适合您地图的最佳值。
* - 如果地图处于缩放状态，此设置将被禁用。
* 
* ---
*
* === 基础、X和S参数相关注释标签 ===
*
* 战斗者的参数，或一些开发者所知的状态，是决定战斗者表现的值。这些设置允许您以更受控制的方式修改行为，并在特征对象中提供增益。
*
* ---
*
* <参数加成: +x>
* <参数加成: -x>
*
* - 用于：角色、职业、武器、护甲、敌人、状态注释标签
* - 当计算总数时，向 '参数' 加值 'x' 或减去 'x'。
* - 将 '参数' 替换为 'MaxHP'、'MaxMP'、'ATK'、'DEF'、'MAT'、'MDF'、'AGI' 或 'LUK'，以确定要修改哪个参数。
* - 将 'x' 替换为要调整参数的整数值。
* - 这用于计算参数设置 => 基础参数 => 公式 中的 '加值' 部分。
*
* ---
*
* <参数倍率: x%>
* <参数倍率: x.x>
*
* - 用于：角色、职业、武器、护甲、敌人、状态注释标签
* - 将 '参数' 的倍率更改为 'x'，以更改总 '参数' 值。
* - 将 '参数' 替换为 'MaxHP'、'MaxMP'、'ATK'、'DEF'、'MAT'、'MDF'、'AGI' 或 'LUK'，以确定要修改哪个参数。
* - 将 'x' 替换为百分比（如150%）或倍率（如1.5）。
* - 这用于计算参数设置 => 基础参数 => 公式 中的 '倍率' 部分。
*
* ---
*
* <参数固定值: +x>
* <参数固定值: -x>
*
* - 用于：角色、职业、武器、护甲、敌人、状态注释标签
* - 当计算总数时，向 '参数' 加值 'x' 或减去 'x'。
* - 将 '参数' 替换为 'MaxHP'、'MaxMP'、'ATK'、'DEF'、'MAT'、'MDF'、'AGI' 或 'LUK'，以确定要修改哪个参数。
* - 将 'x' 替换为要调整参数的整数值。
* - 这用于计算参数设置 => 基础参数 => 公式 中的 '固定加成' 部分。

*
* ---
*
* <参数上限: x>
*
* - 用于：角色、职业、武器、护甲、敌人、状态注释标签
* - 设置 '参数' 的最大上限为 'x'。如果单位有多个最大上限可用，则选择最高值。
* - 将 '参数' 替换为 'MaxHP'、'MaxMP'、'ATK'、'DEF'、'MAT'、'MDF'、'AGI' 或 'LUK'，以确定要修改哪个参数。
* - 将 'x' 替换为整数，确定最大上限应为多少。
* - 这不会将最大上限设置低于默认上限。
*
* ---
*
* <x参数加成: +x%>
* <x参数加成: -x%>
*
* <x参数加成: +x.x>
* <x参数加成: -x.x>
*
* - 用于：角色、职业、武器、护甲、敌人、状态注释标签
* - 在计算总数时，向 'x参数' 加 'x' 或减去 'x'。
* - 将 'x参数' 替换为 'HIT'、'EVA'、'CRI'、'CEV'、'MEV'、'MRF'、'CNT'、
*   'HRG'、'MRG'、'TRG'，以确定要修改哪个X参数。
* - 将 'x' 替换为百分比（如150%）或倍率（如1.5）。
* - 这用于计算参数设置 => X参数 => 公式 中的 '加值' 部分。
*
* ---
*
* <x参数倍率: x%>
* <x参数倍率: x.x>
*
* - 用于：角色、职业、武器、护甲、敌人、状态注释标签
* - 将 '参数' 的倍率更改为 'x'，以更改总 'x参数' 值。
* - 将 'x参数' 替换为 'HIT'、'EVA'、'CRI'、'CEV'、'MEV'、'MRF'、'CNT'、
*   'HRG'、'MRG'、'TRG'，以确定要修改哪个X参数。
* - 将 'x' 替换为百分比（如150%）或倍率（如1.5）。
* - 这用于计算参数设置 => X参数 => 公式 中的 '倍率' 部分。
*
* ---
*
* <x参数固定值: +x%>
* <x参数固定值: -x%>
*
* <x参数固定值: +x.x>
* <x参数固定值: -x.x>
*
* - 用于：角色、职业、武器、护甲、敌人、状态注释标签
* - 在计算总数时，向 'x参数' 加 'x' 或减去 'x'。
* - 将 'x参数' 替换为 'HIT'、'EVA'、'CRI'、'CEV'、'MEV'、'MRF'、'CNT'、
*   'HRG'、'MRG'、'TRG'，以确定要修改哪个X参数。
* - 将 'x' 替换为百分比（如150%）或倍率（如1.5）。
* - 这用于计算参数设置 => X参数 => 公式 中的 '固定加成' 部分。
*
* ---
*
* <s参数加成: +x%>
* <s参数加成: -x%>
*
* <s参数加成: +x.x>
* <s参数加成: -x.x>
*
* - 用于：角色、职业、武器、护甲、敌人、状态注释标签
* - 在计算总数时，向 's参数' 加 'x' 或减去 'x'。
* - 将 's参数' 替换为 'TGR'、'GRD'、'REC'、'PHA'、'MCR'、'TCR'、'PDR'、
*   'MDR'、'FDR'、'EXR'，以确定要修改哪个S参数。
* - 将 'x' 替换为百分比（如150%）或倍率（如1.5）。
* - 这用于计算参数设置 => S参数 => 公式 中的 '加值' 部分。
*
* ---
*
* <s参数倍率: x%>
* <s参数倍率: x.x>
*
* - 用于：角色、职业、武器、护甲、敌人、状态注释标签
* - 将 '参数' 的倍率更改为 'x'，以更改总 's参数' 值。
* - 将 's参数' 替换为 'TGR'、'GRD'、'REC'、'PHA'、'MCR'、'TCR'、'PDR'、
*   'MDR'、'FDR'、'EXR'，以确定要修改哪个S参数。
* - 将 'x' 替换为百分比（如150%）或倍率（如1.5）。
* - 这用于计算参数设置 => S参数 => 公式 中的 '倍率' 部分。
*
* ---
*
* <s参数固定值: +x%>
* <s参数固定值: -x%>
*
* <s参数固定值: +x.x>
* <s参数固定值: -x.x>
*
* - 用于：角色、职业、武器、护甲、敌人、状态注释标签
* - 在计算总数时，向 's参数' 加 'x' 或减去 'x'。
* - 将 's参数' 替换为 'TGR'、'GRD'、'REC'、'PHA'、'MCR'、'TCR'、'PDR'、
*   'MDR'、'FDR'、'EXR'，以确定要修改哪个S参数。
* - 将 'x' 替换为百分比（如150%）或倍率（如1.5）。
* - 这用于计算参数设置 => S参数 => 公式 中的 '固定加成' 部分。
*
* === JavaScript注释标签：基础、X和S参数 ===
*
* 以下是为具有JavaScript知识的用户制作的注释标签。这些注释标签主要针对基础、X和S参数。
*
* ---
*
* <JS参数加成: code>
*
* - 用于：角色、职业、武器、护甲、敌人、状态注释标签
* - 运行 'code' 来更改 '参数' 的加成值。
* - 将 '参数' 替换为 'MaxHP'、'MaxMP'、'ATK'、'DEF'、'MAT'、'MDF'、'AGI' 或 'LUK'，以确定要修改哪个参数。
* - 将 'code' 替换为JavaScript代码，以确定如何更改参数的加成总计量。
* - 这用于计算参数设置 => 基础参数 => 公式 中的 '加值' 部分。

*
* ---
*
* <JS参数倍率: code>
*
* - 用于：角色、职业、武器、护甲、敌人、状态注释标签
* - 运行 'code' 来更改 '参数' 的倍率值。
* - 将 '参数' 替换为 'MaxHP'、'MaxMP'、'ATK'、'DEF'、'MAT'、'MDF'、'AGI' 或 'LUK'，以确定要修改哪个参数。
* - 将 'code' 替换为 JavaScript 代码，确定如何更改参数的倍率总计量。
* - 这用于计算参数设置 => 基础参数 => 公式 中的 '参数倍率' 部分。
*
* ---
*
* <JS参数固定值: code>
*
* - 用于：角色、职业、武器、护甲、敌人、状态注释标签
* - 运行 'code' 来更改 '参数' 的固定值。
* - 将 '参数' 替换为 'MaxHP'、'MaxMP'、'ATK'、'DEF'、'MAT'、'MDF'、'AGI' 或 'LUK'，以确定要修改哪个参数。
* - 将 'code' 替换为 JavaScript 代码，确定如何更改参数的固定加成总计量。
* - 这用于计算参数设置 => 基础参数 => 公式 中的 '固定加成' 部分。
*
* ---
*
* <JS参数上限: code>
*
* - 用于：角色、职业、武器、护甲、敌人、状态注释标签
* - 运行 'code' 来确定 '参数' 的最大上限。如果单位有多个最大上限可用，则选择最高值。
* - 将 '参数' 替换为 'MaxHP'、'MaxMP'、'ATK'、'DEF'、'MAT'、'MDF'、'AGI' 或 'LUK'，以确定要修改哪个参数。
* - 将 'code' 替换为 JavaScript 代码，确定所需参数的最大上限。
*
* ---
*
* <JS x参数加成: code>
*
* - 用于：角色、职业、武器、护甲、敌人、状态注释标签
* - 运行 'code' 来更改 'x参数' 的加成值。
* - 将 'x参数' 替换为 'HIT'、'EVA'、'CRI'、'CEV'、'MEV'、'MRF'、'CNT'、
*   'HRG'、'MRG'、'TRG'，以确定要修改哪个X参数。
* - 将 'code' 替换为 JavaScript 代码，确定如何更改X参数的加成总计量。
* - 这用于计算参数设置 => X参数 => 公式 中的 '加值' 部分。
*
* ---
*
* <JS x参数倍率: code>
*
* - 用于：角色、职业、武器、护甲、敌人、状态注释标签
* - 运行 'code' 来更改 'x参数' 的倍率值。
* - 将 'x参数' 替换为 'HIT'、'EVA'、'CRI'、'CEV'、'MEV'、'MRF'、'CNT'、
*   'HRG'、'MRG'、'TRG'，以确定要修改哪个X参数。
* - 将 'code' 替换为 JavaScript 代码，确定如何更改X参数的倍率总计量。
* - 这用于计算参数设置 => X参数 => 公式 中的 '参数倍率' 部分。
*
* ---
*
* <JS x参数固定值: code>
* - 用于：角色、职业、武器、护甲、敌人、状态注释标签
* - 运行 'code' 来更改 'x参数' 的固定值。
* - 将 'x参数' 替换为 'HIT'、'EVA'、'CRI'、'CEV'、'MEV'、'MRF'、'CNT'、
*   'HRG'、'MRG'、'TRG'，以确定要修改哪个X参数。
* - 将 'code' 替换为 JavaScript 代码，确定如何更改X参数的固定加成总计量。
* - 这用于计算参数设置 => X参数 => 公式 中的 '固定加成' 部分。
*
* ---
*
* <JS s参数加成: code>
*
* - 用于：角色、职业、武器、护甲、敌人、状态注释标签
* - 运行 'code' 来更改 's参数' 的加成值。
* - 将 's参数' 替换为 'TGR'、'GRD'、'REC'、'PHA'、'MCR'、'TCR'、'PDR'、
*   'MDR'、'FDR'、'EXR'，以确定要修改哪个S参数。
* - 将 'code' 替换为 JavaScript 代码，确定如何更改S参数的加成总计量。
* - 这用于计算参数设置 => S参数 => 公式 中的 '加值' 部分。
*
* ---
*
* <JS s参数倍率: code>
*
* - 用于：角色、职业、武器、护甲、敌人、状态注释标签
* - 运行 'code' 来更改 's参数' 的倍率值。
* - 将 's参数' 替换为 'TGR'、'GRD'、'REC'、'PHA'、'MCR'、'TCR'、'PDR'、
*   'MDR'、'FDR'、'EXR'，以确定要修改哪个S参数。
* - 将 'code' 替换为 JavaScript 代码，确定如何更改S参数的倍率总计量。
* - 这用于计算参数设置 => S参数 => 公式 中的 '参数倍率' 部分。

*
* ---
*
* <JS s参数固定值: code>
*
* - 用于：角色、职业、武器、护甲、敌人、状态注释标签
* - 运行 'code' 来更改 's参数' 的固定值。
* - 将 's参数' 替换为 'TGR'、'GRD'、'REC'、'PHA'、'MCR'、'TCR'、'PDR'、
*   'MDR'、'FDR'、'EXR'，以确定要修改哪个S参数。
* - 将 'code' 替换为 JavaScript 代码，确定如何更改S参数的固定加成总计量。
* - 这用于计算参数设置 => S参数 => 公式 中的 '固定加成' 部分。
*
* ---
*
* === 与战斗设置相关的注释标签 ===
*
* 这些标签将改变战斗的设置，无论战斗系统如何设置。将这些标签插入地图的注释框或敌群的名称中，以使其生效。如果特定战斗同时出现在地图的注释框和敌群名称中，则以敌群名称中的设置为优先。
*
* ---
*
* <FV>
* <正视图>
* <战斗视图: 正视图>
* 
* - 用于：地图注释标签、敌群名称标签和敌群注释标签
* - 将这个特定地图或战斗的视角改变为正视图。
* - 确保在 "img/enemies/" 文件夹中有敌人图像文件，因为它们将用于替代 "sv_enemies" 图像。
* - 如果使用敌群注释标签，在任何敌群页面的注释中出现该标签（即使它们不运行），该标签也会生效。
*
* ---
*
* <SV>
* <侧视图>
* <战斗视图: 侧视图>
* 
* - 用于：地图注释标签、敌群名称标签和敌群注释标签
* - 将这个特定地图或战斗的视角改变为侧视图。
* - 确保在 "img/sv_enemies/" 文件夹中有敌人图像文件，因为它们将用于替代 "enemies" 图像。
* - 确保你的角色有 "sv_actor" 图像附件。
* - 如果使用敌群注释标签，在任何敌群页面的注释中出现该标签（即使它们不运行），该标签也会生效。
*
* ---
*
* <DTB>
* <战斗系统: 默认>
* 
* - 用于：地图注释标签、敌群名称标签和敌群注释标签
* - 将战斗系统改变为默认的战斗系统（DTB）。
* - 如果使用敌群注释标签，在任何敌群页面的注释中出现该标签（即使它们不运行），该标签也会生效。
*
* ---
*
* <TPB 活跃>
* <ATB 活跃>
* <战斗系统: TPB 活跃>
* <战斗系统: ATB 活跃>
* 
* <TPB 等待>
* <ATB 等待>
* <战斗系统: TPB 等待>
* <战斗系统: ATB 等待>
* 
* - 用于：地图注释标签、敌群名称标签和敌群注释标签
* - 将战斗系统改变为时间进度战斗系统（TPB）或主动回合战斗系统（ATB），如果你已安装 VisuMZ_2_BattleSystemATB 插件。
* - 如果使用敌群注释标签，在任何敌群页面的注释中出现该标签（即使它们不运行），该标签也会生效。
*
* ---
*
* <BTB>
* <战斗系统: BTB>
* 
* <CTB>
* <战斗系统: CTB>
* 
* <ETB>
* <战斗系统: ETB>
* 
* <FTB>
* <战斗系统: FTB>
* 
* <OTB>
* <战斗系统: OTB>
* 
* <PTB>
* <战斗系统: PTB>
* 
* <STB>
* <战斗系统: STB>
* 
* - 用于：地图注释标签、敌群名称标签和敌群注释标签
* - 根据当前项目中安装的插件，将战斗系统改变为相应的战斗系统。
* - 如果使用敌群注释标签，在任何敌群页面的注释中出现该标签（即使它们不运行），该标签也会生效。
*
* ---
*
* <网格>
* <战斗网格>
* 
* <无网格>
* <无战斗网格>
* 
* - 用于：地图注释标签、敌群名称标签和敌群注释标签
* - 需要 VisuMZ_2_BattleGridSystem 插件支持！
* - 将战斗系统改变为使用战斗网格系统或不使用。
* - 如果使用敌群注释标签，在任何敌群页面的注释中出现该标签（即使它们不运行），该标签也会生效。
* - 如果找不到这些注释标签或注释标签，则参考插件参数中的默认设置。
*
* ---
*
* ============================================================================
* 插件命令
* ============================================================================
*
* 以下是随插件一起提供的插件命令。它们可以通过插件命令事件指令访问。

*
* ---
* 
* === 动画命令 ===
* 
* ---
* 
* Animation: Play at Coordinate
* - 在指定的 x, y 坐标上播放动画，即使没有附加精灵。
* 
*   动画 ID:
*   - 播放该动画。
* 
*   坐标:
* 
*     X:
*     Y:
*     - 用于动画的 X/Y 坐标。
*       您可以使用 JavaScript 代码。
* 
*   镜像动画?:
*   - 镜像动画？
* 
*   静音动画?:
*   - 静音动画？
* 
* ---
* 
* === 音频插件命令 ===
* 
* ---
* 
* Audio: Change Current BGM Volume
* - 更改当前 BGM 的音量，不改变任何当前 BGM 的其他属性，也不重新启动 BGM。
* 
*   音量:
*   - 将当前 BGM 的音量更改为多少？
*   - 您可以使用 JavaScript 代码。
*   - 使用范围从 0 到 100 的数字。
* 
* ---
* 
* Audio: Change Current BGM Pitch
* - 更改当前 BGM 的音调，不改变任何当前 BGM 的其他属性，也不重新启动 BGM。
* 
*   音调:
*   - 将当前 BGM 的音调更改为多少？
*   - 您可以使用 JavaScript 代码。
*   - 使用范围从 50 到 150 的数字。
* 
* ---
* 
* Audio: Change Current BGM Pan
* - 更改当前 BGM 的声像位置，不改变任何当前 BGM 的其他属性，也不重新启动 BGM。
* 
*   声像:
*   - 将当前 BGM 的声像位置更改为多少？
*   - 您可以使用 JavaScript 代码。
*   - 使用范围从 -100 到 100 的数字。
* 
* ---
* 
* === 调试插件命令 ===
* 
* ---
* 
* Debug: Current Controller ID
* - 仅用于测试播放。
* - 在调试控制台中显示当前控制器 ID。
* - 如果按键盘上的键，这些数据将被清除。
* - 如果可能，也会复制到计算机剪贴板中。
* 
* ---
* 
* === 导出插件命令 ===
* 
* ---
* 
* Export: All Maps Text
* - 仅用于测试播放。导出所有地图的所有文本，
*   它们的事件、事件页和任何相关的公共事件。
* 
*   - 导出 '显示文本' 事件命令。
*   - 导出 '显示选择项' 事件命令。
*   - 导出 '滚动显示文本' 事件命令。
*   - 导出 '注释' 事件命令。
*   - 只导出原始文本。
*   - 仅在游戏测试中可用。
* 
* ---
* 
* Export: All Troops Text
* - 仅用于测试播放。导出所有敌群的所有文本，
*   它们的事件页和任何相关的公共事件。
* 
*   - 导出 '显示文本' 事件命令。
*   - 导出 '显示选择项' 事件命令。
*   - 导出 '滚动显示文本' 事件命令。
*   - 导出 '注释' 事件命令。
*   - 只导出原始文本。
*   - 仅在游戏测试中可用。
* 
* ---
* 
* Export: Current Map Text
* - 仅用于测试播放。导出当前地图的所有文本，
*   它的事件、事件页和任何相关的公共事件。
* 
*   - 导出 '显示文本' 事件命令。
*   - 导出 '显示选择项' 事件命令。
*   - 导出 '滚动显示文本' 事件命令。
*   - 导出 '注释' 事件命令。
*   - 只导出原始文本。
*   - 仅在游戏测试中可用。
*   - 如果不在战斗中，则此插件命令将无效。
* 
* ---
* 
* Export: Current Troop Text
* - 仅用于测试播放。导出当前敌群的所有文本，
*   敌群的事件页和任何相关的公共事件。
* 
*   - 导出 '显示文本' 事件命令。
*   - 导出 '显示选择项' 事件命令。
*   - 导出 '滚动显示文本' 事件命令。
*   - 导出 '注释' 事件命令。
*   - 只导出原始文本。
*   - 仅在游戏测试中可用。
*   - 如果不在战斗中，则此插件命令将无效。
* 
* ---
* 
* === 游戏插件命令 ===
* 
* ---
*
* Game: Open URL
* - 从游戏中打开一个网站 URL。
*
*   网址:
*   - 想要带玩家去哪里？
*
* ---
* 
* === 金币插件命令 ===
* 
* ---
*
* Gold: Gain/Lose
* - 允许您给予/收取超过事件编辑器限制的金币数量。
*
*   数值:
*   - 玩家应该获得/失去多少金币？
*   - 使用负数值以移除金币。
*
* ---
* 
* === 地图插件命令 ===
* 
* ---
* 
* Map: Once Parallel
* - 在地图上只播放一次与事件并行执行的公共事件，执行完成后不重复。
* - 仅限于地图！
* 
*   公共事件 ID:
*   - 要播放的并行公共事件的 ID。
*   - 完成后不会重复执行。
*   - 当退出地图场景或切换地图时，所有一次并行事件都会被清除。
*   - 一次并行事件在重新进入场景或地图时不会保留。
*   - 一次并行事件不会存储在内存中，也不能保存。

* 
* ---
* 
* === 图片插件命令 ===
* 
* ---
* 
* Picture: Coordinates Mode
* - 仅在测试模式下有效！跟踪指定图片随屏幕移动时的坐标。
* 
*   图片 ID:
*   - 要跟踪坐标的图片 ID。
* 
* ---
* 
* Picture: Easing Type
* - 将缓动类型更改为多种选项之一。
*
*   图片 ID:
*   - 您想应用此缓动效果的图片是哪一个？
*
*   缓动类型:
*   - 选择要应用的缓动类型。
*
*   操作说明:
*   - 在“移动图片”事件命令后插入此插件命令。
*   - 关闭“等待完成”选项在“移动图片”事件中。
*   - 您可能需要在之后添加自己的“等待”事件命令。
*
* ---
* 
* Picture: Erase All
* - 删除屏幕上的所有图片，因为逐个删除非常繁琐。
* 
* ---
* 
* Picture: Erase Range
* - 删除一定范围内的所有图片，因为逐个删除非常繁琐。
* 
*   起始 ID:
*   - 要删除的图片起始 ID。
* 
*   结束 ID:
*   - 要删除的图片结束 ID。
* 
* ---
* 
* Picture: Rotate by Angle
* - 旋转目标图片至特定角度，持续一段设定的时间而不是持续旋转。
* 
*   图片 ID 号码:
*   - 您想旋转的图片的 ID 是多少？
*   - 使用介于 1 和 100 之间的数字。
*   - 您可以使用 JavaScript 代码。
* 
*   调整角度:
*   - 您想将图片旋转多少度？
*   - 使用度数（360 度是完整旋转）。
*   - 您可以使用 JavaScript 代码。
* 
*   缓动类型:
*   - 选择要应用的缓动类型。
* 
*   时长:
*   - 旋转效果的持续帧数。
*   - 60 帧 = 1 秒。
*   - 您可以使用 JavaScript 代码。
* 
*   等待完成:
*   - 是否等待动作完成后再执行下一个事件？
* 
* ---
* 
* Picture: Rotate to Angle
* - 将目标图片旋转至特定角度，持续一段设定的时间而不是持续旋转。
* 
*   图片 ID 号码:
*   - 您想旋转的图片的 ID 是多少？
*   - 使用介于 1 和 100 之间的数字。
*   - 您可以使用 JavaScript 代码。
* 
*   目标角度:
*   - 您想将图片旋转至的目标角度是多少？
*   - 使用度数（360 度是完整旋转）。
*   - 您可以使用 JavaScript 代码。
* 
*   缓动类型:
*   - 选择要应用的缓动类型。
* 
*   时长:
*   - 旋转效果的持续帧数。
*   - 60 帧 = 1 秒。
*   - 您可以使用 JavaScript 代码。
* 
*   等待完成:
*   - 是否等待动作完成后再执行下一个事件？
* 
* ---
* 
* Picture: Show Icon
* - 显示图标而不是图片图像。
* - 图标可以像其他图片一样进行控制。
* 
*   通用:
*
*     图片 ID 号码:
*     - 您想在哪个图片 ID 上显示？
*     - 使用介于 1 和 100 之间的数字。
*     - 您可以使用 JavaScript 代码。
*
*     图标索引:
*     - 选择用于该图片的图标索引。
*     - 您可以使用 JavaScript 代码。
*
*     平滑图标?:
*     - 这将使图标变得平滑或像素化。
* 
*   图片设置:
* 
*     位置:
*
*       原点:
*       - 此图片图标的原点是什么？
*         - 左上角
*         - 居中
*
*       X 坐标:
*       - 图片的 X 坐标。
*       - 您可以使用 JavaScript 代码。
*
*       Y 坐标:
*       - 图片的 Y 坐标。
*       - 您可以使用 JavaScript 代码。
* 
*     缩放:
*
*       宽度 %:
*       - 图片的水平缩放。
*       - 您可以使用 JavaScript 代码。
*       - 100 表示 100%。
*
*       高度 %:
*       - 图片的垂直缩放。
*       - 您可以使用 JavaScript 代码。
*       - 100 表示 100%。

* 
* === 图片插件命令 ===
* 
* ---
* 
* 图片: 混合模式
*
*   不透明度:
*   - 输入数字确定不透明度水平。
*   - 使用介于 0 和 255 之间的数字。
*   - 您可以使用 JavaScript 代码。
*
*   混合模式:
*   - 您希望应用于图片的混合模式是什么？
* 
* ---
* 
* === 屏幕抖动插件命令 ===
* 
* ---
* 
* 屏幕抖动: 自定义
* - 创建自定义的屏幕抖动效果，并将以下使用屏幕抖动的方式设置为此风格。
* 
*   抖动样式:
*   - 选择抖动样式类型。
*   - 原始 (Original)
*   - 随机 (Random)
*   - 水平 (Horizontal)
*   - 垂直 (Vertical)
* 
*   强度:
*   - 屏幕抖动的强度级别。
* 
*   速度:
*   - 屏幕抖动的速度级别。
* 
*   持续时间:
*   - 屏幕抖动的持续时间。
*   - 您也可以使用代码。
* 
*   等待完成:
*   - 在移动到下一个事件之前是否等待完成？
* 
* ---
* 
* === 开关插件命令 ===
* 
* ---
* 
* 开关: 随机化 ID
* - 选择特定的开关 ID 来随机设置开启/关闭。
* 
*   开关 ID(s):
*   - 选择要切换的开关 ID(s)。
* 
*   开启几率:
*   - 每 100 中的几率，决定开关是否开启。
* 
* ---
*
* 开关: 随机化范围
* - 选择特定的开关 ID 范围来随机设置开启/关闭。
* - 比例决定开/关的分布。
*
*   起始 ID:
*   - 要切换的开关起始 ID。
*
*   结束 ID:
*   - 要切换的开关结束 ID。
*
*   开启几率:
*   - 每 100 中的几率，决定开关是否开启。
*
* ---
*
* 开关: 切换 ID
* - 选择特定的开关 ID 来切换开启/关闭。
* - 开启变为关闭，关闭变为开启。
*
*   开关 ID(s):
*   - 选择要切换的开关 ID(s)。
*
* ---
*
* 开关: 切换范围
* - 选择特定的开关 ID 范围来切换开启/关闭。
* - 开启变为关闭，关闭变为开启。
*
*   起始 ID:
*   - 要切换的开关起始 ID。
*
*   结束 ID:
*   - 要切换的开关结束 ID。
*
* ---
* 
* === 系统插件命令 ===
* 
* ---
*
* 系统: 战斗系统更改
* - 切换到游戏中的不同战斗系统。
* - 一些战斗系统需要它们特定的插件支持！
*
*   切换到:
*   - 选择要切换到的战斗系统。
*     - 数据库默认 (Use game database setting)
*     - -
*     - DTB: 默认回合战斗
*     - TPB 活动: 时间进度战斗 (活动)
*     - TPB 等待: 时间进度战斗 (等待)
*     - -
*     - BTB: 勇者回合战斗 (需要 VisuMZ_2_BattleSystemBTB)
*     - CTB: 充能回合战斗 (需要 VisuMZ_2_BattleSystemCTB)
*     - OTB: 指令回合战斗 (需要 VisuMZ_2_BattleSystemOTB)
*     - STB: 标准回合战斗 (需要 VisuMZ_2_BattleSystemSTB)
*
* ---
* 
* 系统: 加载图片
* - 允许您提前加载图片。
*
*   img/animations/:
*   img/battlebacks1/:
*   img/battlebacks2/:
*   img/enemies/:
*   img/faces/:
*   img/parallaxes/:
*   img/pictures/:
*   img/sv_actors/:
*   img/sv_enemies/:
*   img/system/:
*   img/tilesets/:
*   img/titles1/:
*   img/titles2/:
*   - 您希望从此目录加载哪些文件？
* 
* ---
*
* 系统: 主要字体大小
* - 设置游戏的主要字体大小。
*
*   更改为:
*   - 将字体大小更改为此数字。
*
* ---
*
* 系统: 侧视战斗
* - 在战斗中切换前视或侧视。
*
*   更改到:
*   - 选择要切换到的视图类型。
*
* ---
*
* 系统: 窗口内边距
* - 更改游戏窗口的内边距量。
*
*   更改到:
*   - 将游戏的标准窗口内边距更改为此值。
*
* ---
* 
* === 文字弹出命令 ===
* 
* ---
* 
* 文字弹出: 显示文本
* - 将文本添加到文本弹出窗口中以简短显示。
* - 可以排队多个文本弹出。
* - 不会暂停游戏，与游戏活动并行工作。
* 
*   文本:
*   - 在这里写入您希望显示的文本。
*   - 您可以使用文本代码。
* 
* ---
* 
* === 变量插件命令 ===
* 
* ---
* 
* 变量: JS 计算
* - 选择一个变量 ID 和值，通过 JS 进行更改。
* - 允许变量 ID 和操作数的一行代码。
* - 类似于 RM2k3 的变量指针。
* 
*   变量 ID:
*   - 这是要更改的目标变量。
*   - 您可以使用 JavaScript。
*   - 例如：$gameVariables.value(1)
* 
*   操作类型:
*   - 您希望使用哪种操作来执行此插件命令？
* 
*   操作数修饰符:
*   - 用于计算目标变量的值。
*   - 您可以使用 JavaScript。
*   - 例如：$gameVariables.value(1)
* 
* ---
* 
* 变量: JS 代码块
* - 选择一个变量 ID 和值，通过 JS 进行更改。
* - 允许变量 ID 和操作数的 JS 代码块。
* - 类似于 RM2k3 的变量指针。
* 
*   变量 ID:
*   - 这是要更改的目标变量。
*   - 您可以使用 JavaScript。
*   - 例如：$gameVariables.value(1)
* 
*   操作类型:
*   - 您希望使用哪种操作来执行此插件命令？
* 
*   操作数修饰符:
*   - 用于计算目标变量的值。
*   - 您可以使用 JavaScript。
*   - 例如：$gameVariables.value(1)

* 
* ---
*
* ============================================================================
* 插件参数：生活质量设置
* ============================================================================
*
* 核心引擎增加了多种（可选）设置和更改，旨在提高游戏开发者和玩家的生活质量。
*
* ---
*
* 游戏测试
* 
*   启动时新游戏:
*   - 在游戏测试时自动开始一个新游戏？
*   - 仅在游戏测试期间有效。
*
*   非游戏测试模式:
*   - 在游戏测试时强制游戏处于非游戏测试模式？
* 
*   启动时打开控制台:
*   - 在启动游戏时是否打开调试控制台？
*   - 仅在游戏测试期间有效。
*
*   F6键：切换音效:
*   - F6键功能：将所有音效切换到100%或0%，在两者之间切换。
*   - 仅在游戏测试期间有效。
*
*   F7键：切换快速模式:
*   - F7键功能：切换快速模式。
*   - 仅在游戏测试期间有效。
* 
*   CTRL + n键：快速读取:
*   - 按下 CTRL + 1 到 9 中的任意数字将快速读取对应的存档文件。
*   - 不包括自动保存。
*
*   新游戏 > 公共事件:
*   - 每次开始新游戏时运行一个公共事件。
*   - 仅在游戏测试期间有效。
*
* ---
* 
* 战斗测试
* 
*   添加物品类型:
*   添加武器类型:
*   添加护甲类型:
*   - 添加每个数据库物品、武器和/或护甲的副本？
*   - 仅在战斗测试期间有效。
* 
*   添加数量:
*   - 决定战斗测试期间添加的物品数量，而不是最大量。
* 
*   Shift+R键：全体恢复:
*   - 仅供游戏测试使用！
*   - 在战斗中，按下 SHIFT + R 将完全恢复整个队伍的HP、MP和状态。
* 
*   Shift+T键：全TP:
*   - 仅供游戏测试使用！
*   - 在战斗中，按下 SHIFT + T 将完全恢复整个队伍的TP。
* 
* ---
*
* 数字分组
*
*   标准文本:
*   - 是否使1234567这样的数字在窗口内显示为1,234,567？
*
*   特殊文本:
*   - 是否使1234567这样的数字在通过drawTextEx（如消息）显示时为1,234,567？
*
*   伤害数字:
*   - 是否使1234567这样的数字在战斗中的伤害显示为1,234,567？
*
*   槽条数字:
*   - 是否使1234567这样的数字在可见的槽条（如HP、MP和TP槽）中显示为1,234,567？
* 
*   国家/地区
*   - 基于哪个国家/地区的数字分组规则？
*   - 这将遵循这里找到的所有数字分组规则：
*     https://www.w3schools.com/JSREF/jsref_tolocalestring_number.asp
*
* ---
*
* 玩家福利
*
*   遭遇减少最小值:
*   - 玩家可以在不遭遇随机战斗的最小步数。
*
*   总是逃跑:
*   - 如果玩家想要逃离战斗，让他们以100%的几率逃离战斗。
*
*   命中公式:
*   - 将命中率计算公式改为技能命中% *（使用者命中 - 目标回避），以获得更好的结果。
*
*   增加命中率:
*   - 增加命中和回避率，有利于玩家。
*
*   升级 -> 恢复全HP:
*   升级 -> 恢复全MP:
*   - 当角色升级时，恢复全HP或全MP。
*
* ---
* 
* 图片相关
* 
*   防止缩放的图片:
*   - 如果开启，防止图片受到缩放的影响。
* 
*   图片容器 > 战斗中分离:
*   - 如果分离，图片容器将在战斗场景中与spriteset分离。
*   - 这将防止任何影响整个spriteset的视觉效果影响到分离的图片容器。
* 
*   图片容器 > 地图中分离:
*   - 如果分离，图片容器将在地图场景中与spriteset分离。
*   - 这将防止任何影响整个spriteset的视觉效果影响到分离的图片容器。
* 
* ---
*
* 其它
* 
*   动画：镜像偏移X:
*   - 当动画被镜像时，也镜像它们的偏移X值。
*   - 动画名称标签 <Mirror Offset X> 和 <No Mirror Offset X> 将覆盖这个效果。
*
*   字体阴影:
*   - 如果开启，文本使用阴影而不是描边。
*
*   字体平滑:
*   - 如果开启，平滑显示游戏中的字体。
* 
*   字体宽度修正:
*   - 修正消息窗口中瞬间显示的非等宽字体的字体宽度问题。

*
*   关键物品保护:
*   - 如果开启，防止关键物品被出售或消耗。
* 
*   地图名称文本代码:
*   - 如果开启，地图名称将使用文本代码。
*   - 如果关闭，仅使用原始地图名称。
*
*   现代控制:
*   - 如果开启，允许使用Home/End键。
*   - Home键将滚动到列表中的第一项。
*   - End键将滚动到列表中的最后一项。
*   - Shift + 上箭头将向上翻页。
*   - Shift + 下箭头将向下翻页。
*
*   MV动画速率:
*   - 调整MV动画播放速率。
*   - 默认值：4。
*   - 较低值为快速。
*   - 较高值为慢速。
* 
*   新游戏 > 公共事件:
*   - 每次开始任何会话中的新游戏时运行一个公共事件。
*   - 适用于所有类型的会话，包括测试或非测试。
*
*   无图块阴影:
*   - 移除游戏中的图块阴影显示。
*
*   像素图像渲染:
*   - 如果开启，像素化图像渲染（适用于像素风格游戏）。
*
*   需要焦点？
*   - 是否需要游戏保持焦点？如果游戏失去焦点，且不是活动窗口，将暂停。
* 
*   快捷键脚本:
*   - 启用基于快捷键的脚本变量和函数，可用于脚本调用。
*   - 可使用的快捷键列表如下：
* 
*     $commonEvent(id)
*     - 排队一个公共事件。
*     - 这不会中断当前事件以运行所需的公共事件。任何排队的公共事件将在当前事件列表完成后运行。
*     - 将'id'替换为要排队的公共事件的ID。
*     - 公共事件仅在地图场景和战斗场景中运行。
* 
*     $onceParallel(id)
*     - 将公共事件作为一次性并行事件后台运行。
*     - 一次性并行事件将像并行处理一样在后台运行，但在完成后不会重复。
*     - 将'id'替换为要运行的公共事件的ID。
*     - 仅在地图场景和战斗场景中有效。战斗场景的使用需要VisuMZ_1_BattleCore。
* 
*     $scene
*     - 返回当前场景。
* 
*     $spriteset
*     - 如果存在，则返回当前场景的精灵集。
* 
*     $subject
*     - 返回战斗中最后记录的角色身份/使用者。
* 
*     $targets
*     - 返回战斗中最后记录的目标。
* 
*     $target
*     - 返回战斗中最后记录的单个目标。
*     - 与VisuMZ_1_BattleCore兼容性更好。
* 
*     $event
*     - 返回当前启动的地图事件。
*
*   智能事件碰撞:
*   - 使事件只能与优先级为“与角色相同”的其他事件发生碰撞。
* 
*   子文件夹名称清除:
*   - 清除插件参数中的子文件夹名称，以便正确读取数据以让插件命令正常工作。
*   - 这适用于使用VisuMZ插件的动态名称注册插件（如VisuMZ库）。如果计划使用VisuMZ插件的子文件夹，请开启此选项。
*
* ---
*
* ============================================================================
* 插件参数：战斗系统
* ============================================================================
* 
* 选择游戏中要使用的战斗系统。
* 
* 一些战斗系统需要特定的插件！这意味着如果您未安装所需的战斗系统插件，它将不会更改。
* 核心引擎插件并不包含其代码中所有战斗系统的数据。
* 
* ---
* 
*   数据库默认值（使用游戏数据库设置）
* 
*   -
* 
*   DTB：默认顺序战斗
*   TPB Active：时间进度战斗（主动）
*   TPB Wait：时间进度战斗（等待）
* 
*   -
* 
*   BTB：勇者顺序战斗（需要VisuMZ_2_BattleSystemBTB）
*   CTB：充能顺序战斗（需要VisuMZ_2_BattleSystemCTB）
*   ETB：能量顺序战斗（需要VisuMZ_2_BattleSystemETB）
*   FTB：自由顺序战斗（需要VisuMZ_2_BattleSystemFTB）
*   OTB：指令顺序战斗（需要VisuMZ_2_BattleSystemOTB）
*   PTB：按键顺序战斗（需要VisuMZ_2_BattleSystemPTB）
*   STB：标准顺序战斗（需要VisuMZ_2_BattleSystemSTB）
* 
*   -
* 
* ---
*
* ============================================================================
* 插件参数：颜色设置
* ============================================================================
*
* 这些设置允许您作为游戏开发者更好地控制游戏中各种条件下出现的颜色。您可以使用常规数字使用游戏窗口皮肤预定义的颜色，也可以使用#rrggbb格式使用十六进制颜色代码。
* 
* 如果在游戏中途更改游戏窗口皮肤，则使用的颜色仍将基于默认窗口皮肤的颜色。这是由于将它们存储在缓存中以避免额外处理和减少延迟。
*
* 您可以从以下网站查找哪些十六进制代码属于哪种颜色：
* https://htmlcolorcodes.com/
*
* ---
*
* 基本颜色
* - 这些是几乎永远不会改变的颜色，全局应用于游戏引擎中。
*
*   普通:
*   系统:
*   危机:
*   死亡:
*   槽条背景:
*   HP槽:
*   MP槽:
*   MP消耗:
*   力量增强:
*   力量减弱:
*   CT槽:
*   TP槽:
*   待定颜色:
*   经验槽:
*   最大等级槽:
*   - 使用#rrggbb设置自定义颜色或使用窗口皮肤中的常规数字设置文本颜色。

*
* ---
*
 * 透明颜色:
 * - 这些颜色具有一定的透明度，使用 'rgba(red, green, blue, alpha)' 格式指定。
 * - 将 'red' 替换为介于 0-255 之间的数字（整数）。
 * - 将 'green' 替换为介于 0-255 之间的数字（整数）。
 * - 将 'blue' 替换为介于 0-255 之间的数字（整数）。
 * - 将 'alpha' 替换为介于 0 和 1 之间的数字（小数）。
 * 
 *   窗口字体轮廓:
 *   计量数字轮廓:
 *   暗色:
 *   项目背景色:
 *   - 带有一定透明度设置的颜色。
 *   - 格式为 rgba(0-255, 0-255, 0-255, 0-1)
 *
 * ---
 *
 * 条件颜色:
 * - 这些需要一些 JavaScript 知识。用于根据情况决定使用哪种颜色，比如不同的HP、MP、TP值，用于比较装备，以及确定伤害弹出颜色。
 * 
 *   JS: 角色HP颜色:
 *   JS: 角色MP颜色:
 *   JS: 角色TP颜色:
 *   - 用于决定角色的HP、MP或TP使用的颜色的代码。
 *
 *   JS: 参数变化:
 *   - 用于决定参数变化使用的颜色的代码。
 *
 *   JS: 伤害颜色:
 *   - 用于决定伤害类型使用的颜色的代码。
 *
 * ---
 *
 * ============================================================================
 * 插件参数: 金币设置
 * ============================================================================
 *
 * 金币是RPG Maker MZ中的主要货币。这里提供的设置将决定金币在游戏中的显示方式及其行为。
 *
 * ---
 *
 * 金币设置
 *
 *   金币上限:
 *   - 队伍可以持有的最大金币数。
 *   - 默认 99999999
 *
 *   金币字体大小:
 *   - 用于在金币窗口中显示金币的字体大小。
 *   - 默认值: 26
 *
 *   金币图标:
 *   - 用于表示金币的图标。
 *   - 使用 0 表示没有图标。
 *
 *   金币重叠:
 *   - 文本使用了太多的金币以至于无法适应窗口。
 *
 * ---
 *
 * ============================================================================
 * 插件参数: 图像加载
 * ============================================================================
 *
 * 游戏中并非所有图像都一次加载。RPG Maker MZ使用异步加载，这意味着需要时加载图像。这可能导致希望某些图像出现时的延迟。
 * 然而，如果图像在前面加载过，则可以立即使用，只要它们没有从图像缓存中删除。
 *
 * ---
 *
 * 图像加载
 *
 *   img/animations/:
 *   img/battlebacks1/:
 *   img/battlebacks2/:
 *   img/enemies/:
 *   img/faces/:
 *   img/parallaxes/:
 *   img/pictures/:
 *   img/sv_actors/:
 *   img/sv_enemies/:
 *   img/system/:
 *   img/tilesets/:
 *   img/titles1/:
 *   img/titles2/:
 *   - 在游戏启动时，你希望从此目录加载哪些文件？
 *
 * ---
 *
 * ============================================================================
 * 插件参数: 键盘输入设置
 * ============================================================================
 *
 * 游戏中使用键盘输入的设置。主要用于名称输入场景（Scene_Name）和数字输入事件命令。这些设置仅在英文键盘上进行了测试，可能与其他语言不兼容，请在不适合您的游戏时禁用这些功能。
 * 
 * 如果在进入名称更改场景时连接了控制器，它将使用默认的手动输入模式，而不是键盘输入模式。如果在键盘输入模式下按下控制器按钮，它将自动切换到手动输入模式。
 * 
 * 此插件不支持RPG Maker MZ默认控制器支持中未检测到的控制器。
 *
 * ---
 * 
 * 控制
 * 
 *   WASD移动:
 *   - 启用或禁用游戏项目的WASD移动。
 *   - 将W页面下移按钮移动到E。
 * 
 *   R按钮: 冲刺开关:
 *   - 启用或禁用R按钮作为始终冲刺选项的切换。
 * 
 * ---
 *
 * 名称输入
 * 
 *   启用?:
 *   - 启用名称输入的键盘输入。
 *   - 仅与英文键盘测试过。
 *
 *   默认模式:
 *   - 进入场景时选择的默认模式。
 *     - 默认 - 使用箭头键选择字母。
 *     - 键盘 - 使用键盘输入字母。
 *
 *   QWERTY布局:
 *   - 用于手动输入的QWERTY布局。
 *
 *   键盘消息:
 *   - 允许键盘输入时显示的消息。
 *   - 您可以在此处使用文本代码。
 *
 *   禁止词语:
 *   - 玩家不能在名称中使用这些词语。
 *   - 这些词语包含在名称中。
 *   - 如果使用了禁止词语，将会播放蜂鸣器声音。
 *
 * ---
 *
 * 数字输入
 * 
 *   启用?:
 *   - 启用数字输入的键盘输入。
 *   - 仅与英文键盘测试过。
 *
 * ---
 * 
 * 按钮辅助
 * 
 *   完成输入:
 *   - 用于描述完成输入的文本。
 * 
 *   页面更改:
 *   - 用于描述字符页面更改的文本。
 * 
 *   切换到键盘:
 *   - 用于描述键盘切换的文本。
 * 
 *   切换到手动:
 *   - 用于描述手动输入切换的文本。


* 
* ---
*
* ============================================================================
* 插件参数: 菜单背景设置
* ============================================================================
*
* 这些插件参数允许您调整每个场景使用的背景图像。这些图像将从游戏项目文件夹img/titles1/和img/titles2/加载到游戏中。
*
* 这些设置仅适用于主菜单、商店场景和角色命名场景。
*
* ---
*
* 菜单背景设置:
* 
*   模糊强度:
*   - 用于菜单背景快照的强度。
*   - 默认: 8。数字越大，效果越强。数字越小，效果越弱。
*
*   Scene_Menu:
*   Scene_Item:
*   Scene_Skill:
*   Scene_Equip:
*   Scene_Status:
*   Scene_Options:
*   Scene_Save:
*   Scene_Load:
*   Scene_GameEnd:
*   Scene_Shop:
*   Scene_Name:
*   - 每个场景的单独背景设置。
*
*   Scene_Unlisted
*   - 未列出的其他场景的单独背景设置。
*
* ---
*
* 背景设置
*
*   快照不透明度:
*   - 场景的快照不透明度。
*
*   背景 1:
*   - 底部背景图像的文件名。
*   - 如果不希望使用，请留空。
*
*   背景 2:
*   - 上部背景图像的文件名。
*   - 如果不希望使用，请留空。
*
* ---
*
* ============================================================================
* 插件参数: 菜单按钮辅助窗口
* ============================================================================
*
* 在大多数现代RPG中，屏幕上会有小窗口显示当前场景的控制方案。本插件让您可以选择在菜单场景中添加这样的窗口，即按钮辅助窗口。
*
* ---
*
* 通用
* 
*   启用:
*   - 启用菜单按钮辅助窗口。
* 
*   位置:
*   - 确定按钮辅助窗口的位置。
*   - 需要插件参数 => UI => 启用侧边按钮。
*
*   背景类型:
*   - 选择此窗口的背景类型。
* 
*   分离“退出”:
*   - 仅供制作自定义键盘按键映射的人使用。
*   - “分离”选项会分别设置“取消”和“菜单”键的实例。
*   - “不分离”选项会合并成“退出”键。
*
* ---
*
* 文本
* 
*   文本格式:
*   - 按钮显示格式。
*   - 可以使用文本代码。%1 - 按键，%2 - 文本
* 
*   多键格式:
*   - 多键操作的格式。
*   - 可以使用文本代码。%1 - 按键1，%2 - 按键2
* 
*   确定文本:
*   取消文本:
*   切换角色文本:
*   - 显示这些操作的默认文本。
*
* ---
*
* 按键
* 
*   按键: 未列出格式:
*   - 如果下面未列出某个按键，使用此格式。
*   - 可以使用文本代码。%1 - 按键
* 
*   按键: 上:
*   按键: 下:
*   按键: 左:
*   按键: 右:
*   按键: Shift:
*   按键: Tab:
*   按键: A到Z:
*   - 游戏中显示此按键的方式。
*   - 可以使用文本代码。
*
* ---
*
* ============================================================================
* 插件参数: 控制器按钮辅助设置
* ============================================================================
*
* 这些是按钮辅助窗口插件参数的子设置。按钮辅助窗口插件参数专注于键盘输入，而这些部分则专注于游戏手柄控制器。
* 
* 添加多个游戏手柄到列表中，为它们提供不同的按钮辅助文本。如果正在使用某个游戏手柄但未在此处列出，按钮辅助文本将默认使用键盘版本。
* 
* 想要了解更多有关控制器的信息，请访问此网站：https://gamepad-tester.com/
*
* ---
*
* ID信息
* 
*   控制器ID名称:
*   - 用于此控制器ID的确切字符串。
*   - 插件命令“调试: 当前控制器ID”可用于帮助查看ID。
*   - 例如：Xbox 360控制器（XInput标准游戏手柄）
* 
*   相似性匹配:
*   - 用于检查控制器ID的部分字符串。
*   - 插件命令“调试: 当前控制器ID”可用于帮助查看ID。
*   - 此检查次于确切名称。
*   - 例如：Xbox
*
* ---
*
* 方向
* 
*   上:
*   左:
*   右:
*   下:
*   - 游戏中显示此按钮的方式。
*   - 可以使用文本代码。
*
* ---
*
* 操作
* 
*   确定:
*   取消:
*   菜单:
*   Shift:
*   上页:
*   下页:
*   - 游戏中显示此按钮的方式。
*   - 可以使用文本代码。
*   - *注意*：控制器使用与键盘不同的映射方案。
*     - “取消”按钮与“菜单”按钮通常是分开的，尽管大多数按钮辅助窗口帮助文本都会提到“取消”按钮。


*
* ---
*
* ============================================================================
* 插件参数: 菜单布局设置
* ============================================================================
*
* 这些设置允许您重新排列从主菜单、商店场景和角色命名场景访问的场景位置。这将需要您具备一些JavaScript知识，以使窗口按您希望的方式工作。
*
* ---
*
* 菜单布局设置
*
*   Scene_Title:
*   Scene_Menu:
*   Scene_Item:
*   Scene_Skill:
*   Scene_Equip:
*   Scene_Status:
*   Scene_Options:
*   Scene_Save:
*   Scene_Load:
*   Scene_GameEnd:
*   Scene_Shop:
*   Scene_Name:
*   - 调整所选场景的各种选项。
*
* ---
*
* 场景窗口设置
*
*   背景类型:
*   - 选择所选窗口的背景类型。
*   - 窗口
*   - 昏暗
*   - 透明
*
*   JS: X, Y, W, H
*   - 用于确定所选窗口尺寸的代码。
*
* ---
*
* Scene_Title 设置
* - 以下是 Scene_Title 特有的设置。
*
* 标题画面
*
*   文档标题格式:
*   - 在文档标题中显示文本的格式。
*   - %1 - 主标题，%2 - 副标题，%3 - 版本
*
*   副标题:
*   - 标题名称下要显示的副标题。
*   
*   版本:
*   - 在标题画面角落显示的版本。
*   
*   JS: 绘制标题:
*   - 用于绘制游戏标题的代码。
*   
*   JS: 绘制副标题:
*   - 用于绘制游戏副标题的代码。
*   
*   JS: 绘制版本:
*   - 用于绘制游戏版本的代码。
*   
*   按钮淡入速度:
*   - 按钮淡入速度 (1-255)。
*
* ---
*
* Scene_GameEnd 设置
* - 以下是 Scene_GameEnd 特有的设置。
*   
*   命令窗口列表:
*   - 标题画面使用的窗口命令。
*   - 在此添加新命令。
*
* ---
*
* 命令窗口列表
* - 这在 Scene_Title 和 Scene_GameEnd 设置中都可以找到。
*
*   符号:
*   - 此命令使用的符号。
* 
*   STR: 文本:
*   - 用于此标题命令的显示文本。
*   - 如果有值，则忽略 JS: 文本 版本。
* 
*   JS: 文本:
*   - 用于确定显示名称的字符串的JavaScript代码。
* 
*   JS: 显示:
*   - 用于确定项目是否显示的JavaScript代码。
* 
*   JS: 启用:
*   - 用于确定项目是否启用的JavaScript代码。
* 
*   JS: 扩展:
*   - 用于确定应添加的任何扩展数据的JavaScript代码。
* 
*   JS: 运行代码:
*   - 此命令被选择后运行的JavaScript代码。
* 
* ---
*
* 标题图片按钮:
* - 这在 Scene_Title 设置中找到。
* 
*   图片文件名:
*   - 图片使用的文件名。
*
*   按钮URL:
*   - 单击后按钮跳转到的URL。
*
*   JS: 位置:
*   - 帮助确定按钮位置的JavaScript代码。
*
*   JS: 载入时:
*   - 此按钮位图加载后运行的JavaScript代码。
*
*   JS: 运行代码:
*   - 单击此按钮后运行的JavaScript代码。
*
* ---
*
* ============================================================================
* 插件参数: 参数设置
* ============================================================================
*
* 战斗者的参数，或者一些开发者称之为状态，是决定战斗者表现的值。这些设置允许您以控制的方式改变它们的行为并给予特性对象增益。

*
* ---
*
* ============================================================================
* 插件参数: 参数设置
* ============================================================================
*
* 显示参数
* - 游戏中显示的参数列表。
* - 在装备菜单中显示。
* - 在状态菜单中显示。
*
* 扩展参数
* - 在其他VisuStella插件中显示的扩展场景列表。
*
* ---
*
* === 基础参数 ===
*
* MHP - 最大HP
* - 这是最大生命值。战斗者的生命值（HP）决定其是否处于生存状态或死亡状态。如果HP值大于0，则战斗者是活着的。如果为0或以下，则战斗者处于死亡状态，除非战斗者有一种方式抵消死亡（通常通过不死之身）。当战斗者受到伤害时，通常会减少其HP值。如果战斗者受到治疗，则HP值增加。MaxHP值确定了HP值可以达到的最大量，这意味着战斗者无法在该点之上被治愈。
*
* MMP - 最大MP
* - 这是最大魔法值。魔法值（MP）通常用于战斗中技能和法术的消耗。如果战斗者的MP足够支付所需技能的成本，则可以使用该技能，前提是技能的其他条件也满足。否则，战斗者将无法使用该技能。使用消耗MP的技能后，战斗者的MP会减少。但是，战斗者的MP可以恢复并导致MP的增益。MaxMP值确定了MP值可以达到的最大量，这意味着战斗者无法超过MaxMP值恢复MP。
*
* ATK - 攻击力
* - 这是战斗者的攻击值。默认情况下，此统计数据仅用于伤害计算，并通常用于表示战斗者的物理攻击力。根据通常的伤害公式，数值越高意味着物理攻击输出越高。
*
* DEF - 防御力
* - 这是战斗者的防御值。默认情况下，此统计数据仅用于伤害计算，并通常用于表示战斗者的物理防御力。根据通常的伤害公式，数值越高意味着从物理攻击中受到的伤害越少。
*
* MAT - 魔法攻击
* - 这是战斗者的魔法攻击值。默认情况下，此统计数据仅用于伤害计算，并通常用于表示战斗者的魔法攻击力。根据通常的伤害公式，数值越高意味着魔法攻击输出越高。
*
* MDF - 魔法防御
* - 这是战斗者的魔法防御值。默认情况下，此统计数据仅用于伤害计算，并通常用于表示战斗者的魔法防御力。根据通常的伤害公式，数值越高意味着从魔法攻击中受到的伤害越少。
*
* AGI - 敏捷度
* - 这是战斗者的敏捷值。默认情况下，此统计数据用于确定战斗者在战斗顺序中的位置。根据正常的轮换计算公式，数值越高，战斗者的速度越快，越有可能在轮换中较早地轮到战斗者。
*
* LUK - 幸运
* - 这是战斗者的幸运值。默认情况下，此统计数据用于影响战斗者施加和接收状态、增益和减益的成功率。如果用户的LUK值较高，则状态、增益或减益更有可能成功。如果目标的LUK值较高，则状态、增益或减益的成功率较低。
*
* ---
*
* 基础参数
* 
*   显示角色等级?:
*   - 在显示角色时显示角色等级？
*   - 影响游戏中大多数窗口。
*
*   HP 危机率:
*   - 角色处于危机状态的HP比率。
*
*   JS: 公式:
*   - 用于确定所有8个基础参数总值的公式：
*   - MaxHP, MaxMP, ATK, DEF, MAT, MDF, AGI, LUK。
*
* 参数上限:
*
*   MaxHP 上限:
*   MaxMP 上限:
*   ATK 上限:
*   DEF 上限:
*   MAT 上限:
*   MDF 上限:
*   AGI 上限:
*   LUK 上限:
*   - 用于确定所选参数上限的公式。
*   - 这些设置不会提升编辑器的最大值。如果要将敌人的最大参数值提升到默认上限之上，请使用相关的标签注释。
*
* ---
*
* === X 参数 ===
*
* HIT - 命中率%
* - 这决定了任何物理动作的物理命中成功率。所有物理攻击都会通过命中率进行检查，以查看攻击是否会命中。如果HIT值通过随机化检查，则攻击将命中。如果HIT值未通过随机化检查，则攻击将被视为MISS。
*
* EVA - 闪避率%
* - 这确定了对任何传入的物理动作的物理闪避率。如果HIT值通过，则将通过随机化检查将动作传递给EVA检查。如果随机化检查通过，则物理攻击被闪避，攻击将无法命中。如果随机化检查未通过，则尝试躲避动作将失败，并且动作将命中。
*
* CRI - 暴击率%
* - 任何启用暴击的动作将使用此数字进行随机化检查。如果随机化检查通过，则由启动的动作执行额外伤害。如果随机化检查失败，则不会增加额外伤害。
*
* CEV - 暴击闪避率%
* - 此值与暴击率%以乘法率对抗。如果暴击率为90%，暴击闪避率为20%，则随机化检查将检查72%作为值，因为值是通过源代码计算的CRI *（1 - CEV），因此，值为0.90 *（1 - 0.20）=== 0.72。
*
* MEV - 魔法闪避率%
* - 在EVA是对物理动作的闪避率时，MEV是对魔法动作的闪避率。由于没有魔法版本的HIT，所以当发起魔法动作时，将始终对MEV值进行检查。如果MEV的随机化检查通过，则魔法动作不会命中。如果MEV的随机化检查失败，则魔法动作将命中。
*
* MRF - 魔法反射率%
* - 如果魔法动作连接并通过，则有可能将魔法动作反弹回施法者。这个机会就是魔法反射率。如果魔法反射率的随机化检查通过，则魔法动作反弹回施法者，忽略施法者的魔法闪避率。如果魔法反射率的随机化检查失败，则魔法动作将与其目标连接。
*
* CNT - 反击率%
* - 如果物理动作连接并通过，则有可能避免物理动作，并由用户发动反击落在攻击单元上。这是反击率。如果反击率的随机化检查通过，则物理动作被回避，并且目标将对用户进行反击。如果随机化检查失败，则物理动作将连接到目标。
*
* HRG - HP% 回复
* - 在战斗者的再生阶段，战斗者将以其MaxHP的这一百分比作为获得的HP进行恢复，成功率为100%。
*
* MRG - MP% 回复
* - 在战斗者的再生阶段，战斗者将以其MaxMP的这一百分比作为获得的MP进行恢复，成功率为100%。
*
* TRG - TP% 回复
* - 在战斗者的再生阶段，战斗者将以其MaxTP的这一百分比作为获得的TP进行恢复，成功率为100%。
*
* ---
*
* X 参数
*
*   JS: 公式:
*   - 用于确定所有10个X参数总值的公式：
*   - HIT, EVA, CRI, CEV, MEV, MRF, CNT, HRG, MRG, TRG。
*
* 词汇表
*
*   HIT: 命中率
*   EVA: 闪避率
*   CRI: 暴击率
*   CEV: 暴击闪避率
*   MEV: 魔法闪避率
*   MRF: 魔法反射率
*   CNT: 反击率
*   HRG: HP% 回复
*   MRG: MP% 回复
*   TRG: TP% 回复
*   - 用于所选X参数的游戏内词汇。


*
* ---
*
* ============================================================================
* === S 参数 ===
*
* TGR - 目标率
* - 针对标准敌人，目标率决定敌人针对用户进行单一目标攻击的几率。当为0%时，
*   敌人几乎不会选择用户作为目标。当为100%时，将有普通的选择机会。
*   当为100%以上时，用户被选为目标的机会增加。
* *注意：对于使用战斗AI核心的玩家，任何具有特定目标条件的动作将绕过TGR率。
*
* GRD - 防守效果
* - 这影响防御的效果。这影响2的防御除数值。在100% GRD时，伤害将变为 '伤害 / (2 * 1.00)'。
*   在50% GRD时，伤害将变为 '伤害 / (2 * 0.50)'。在200% GRD时，伤害将变为 '伤害 / (2 * 2.00)'，依此类推。
*
* REC - 恢复效果
* - 这决定了对用户的治疗效果。REC率越高，用户的治疗效果越好。如果一个法术治愈100点生命值，
*   用户具有300% REC，则用户将被治愈300点生命值。
*
* PHA - 药效学
* - 这决定了用户使用物品时的效果。PHA率越高，物品效果越好。如果用户使用的是恢复目标盟友100%的药水，
*   用户具有300% PHA，则目标盟友将恢复300点生命值。
*
* MCR - MP 消耗率
* - 此率影响具有MP消耗的技能所需的MP量。如果用户具有100% MCR，则MP消耗将是标准的。
*   如果用户具有50% MCR，则所有消耗MP的技能将只需消耗所需MP的一半。如果用户具有200% MCR，
*   则所有技能的MP消耗将是其MP消耗的200%。
*
* TCR - TP 充能率
* - 此率影响通过各种行动获取TP时具有TP消耗的技能充电量。在100%时，TP将正常充电。
*   在50%时，TP将以一半的速度充电。在200%时，TP将以两倍速度充电。
*
* PDR - 物理伤害率
* - 此率影响用户从物理伤害中受到的伤害量。如果用户具有100% PDR，则用户受到正常数量的伤害。
*   如果用户具有50% PDR，则对用户造成的所有物理伤害减半。如果用户具有200% PDR，则对用户造成的所有物理伤害加倍。
*
* MDR - 魔法伤害率
* - 此率影响用户从魔法伤害中受到的伤害量。如果用户具有100% MDR，则用户受到正常数量的伤害。
*   如果用户具有50% MDR，则对用户造成的所有魔法伤害减半。如果用户具有200% MDR，则对用户造成的所有魔法伤害加倍。
*
* FDR - 地图伤害率
* - 在地图上，这会影响用户在走过对队伍造成伤害的瓷砖时受到的伤害量。FDR值仅影响特定角色的受到的伤害，
*   而不是整个队伍。如果FDR为100%，则用户将受到完整伤害。如果FDR为50%，则只有伤害的一半会造成效果。
*   如果FDR为200%，则该角色的地图伤害加倍。
*
* EXR - 经验率
* - 这决定用户在获得任何类型的经验时获得的经验量。在100% EXR时，经验增长率正常。在50%时，经验增长减半。
*   在200%时，用户的经验增长加倍。
*
* ---
*
* S 参数
*
*   JS: 公式
*   - 用于确定所有10个S参数总值的公式：
*   - TGR, GRD, REC, PHA, MCR, TCR, PDR, MDR, FDR, EXR。
*
* 词汇表
*
*   TGR: 目标率
*   GRD: 防守效果
*   REC: 恢复效果
*   PHA: 药效学
*   MCR: MP 消耗率
*   TCR: TP 充能率
*   PDR: 物理伤害率
*   MDR: 魔法伤害率
*   FDR: 地图伤害率
*   EXR: 经验率
*   - 用于所选S参数的游戏内词汇。
*
* ---
*
* 图标
* 
*   绘制图标？
*   - 在参数名称旁边绘制图标？
*
*   MaxHP, MaxMP, ATK, DEF, MAT, MDF, AGI, LUK:
*   HIT, EVA, CRI, CEV, MEV, MRF, CNT, HRG, MRG, TRG:
*   TGR, GRD, REC, PHA, MCR, TCR, PDR, MDR, FDR, EXR:
*   - 用于所选参数的图标。
*
* ---
*
* ============================================================================
* 插件参数: 自定义参数设置
* ============================================================================
*
* 自RPG Maker MZ版本1.07起，如果RPG Maker MZ的默认参数设置不足以满足您的需求，您可以向您的游戏中添加自定义参数。
* 这些参数可以根据您的编码方式具有不同的功能。更重要的是，这些与VisuStella MZ菜单和VisuStella核心引擎的参数设置兼容。
* 
* 为了澄清，这些设置不会为您创建全新的参数，并且也不支持VisuStella MZ库中其他插件的奖励。这些设置存在的目的是作为
* 一个桥梁，将非VisuStella MZ插件创建的其自己的参数值显示在VisuStella菜单中。
*
* ---
*
* 自定义参数
* 
*   参数名称:
*   - 参数的名称是什么？
*   - 用于VisuStella MZ菜单。
* 
*   缩写:
*   - 您想为参数使用什么缩写？
*   - 避免使用特殊字符。如果可能的话，避免使用数字。
* 
*   图标:
*   - 您想使用什么图标来表示此参数？
*   - 用于VisuStella MZ菜单。
* 
*   类型:
*   - 此参数返回什么类型的数字值？
*     - 整数（仅限整数）
*     - 浮点数（允许小数）
* 
*   JS: 值:
*   - 当此参数要返回值时运行此代码。
*
* ---
* 
* 在VisuStella菜单中添加自定义参数的说明
* 
* 在核心引擎和元素与状态菜单核心插件中，有插件参数字段供您插入要显示和对玩家可见的参数。
* 
* 在这些插件参数字段中插入自定义参数的缩写。例如，如果您要添加“力量”自定义参数，并且缩写是“str”，
* 那么在核心引擎/元素和状态菜单核心的插件参数字段中添加“str”，就会在游戏中显示“力量”。这里不区分大小写，
* 因此您可以插入“str”或“STR”，它们都将注册为相同的参数，使其在游戏中显示。
* 
* ---
* 
* 使用自定义参数作为机制的说明
* 
* 如果要在例如伤害公式中使用自定义参数，请参考您为自定义参数设置的缩写。例如，如果要调用“力量”自定义参数的值，
* 其设置的缩写是“str”，则以这样的方式引用它。这是区分大小写的。
* 
* 如果使用“str”作为“力量”和“con”作为“体质”的示例伤害公式将如下所示：
* 
*   a.str - b.con
* 
* 这些值附加到Game_Battlerbase原型类。
* 
* ---
* 
* 设置自定义参数值的说明
* 
* 这需要JavaScript知识。无法绕过这一点。无论您将什么代码插入到“JS: 值”字段中，它都将返回所需的值。
* 'user'变量将引用Game_Battlerbase原型对象，其中的信息将从中获取。
* 
* 根据您为自定义参数设置的“类型”，返回的值将使用Math.round进行四舍五入以获取整数，并且如果设置为
* 浮点数，则将其保留为它。
*
* ============================================================================
* 插件参数: 屏幕分辨率设置
* ============================================================================
*
* 修改各种属性以使游戏在不同的屏幕分辨率下看起来更好。这主要适用于RPG Maker MZ版本1.3.0及更高版本，
* 其中“敌群”选项卡已更新以匹配系统2数据库选项卡中的屏幕分辨率设置。
*
* ---
* 
* 地图
* 
*   锁定小X滚动？
*   锁定小Y滚动？
*   - 如果地图太小，自动锁定X / Y滚动？
*   - 对于1280x720分辨率，在地图宽27个瓷砖时非常有用。
*     - 这将消除从屏幕一半移到另一半时的微妙滚动。
*   - 如果地图被放大，则此设置将被禁用。
* 
*   锁定显示X？
*   锁定显示Y？
*   - 自动滚动锁定地图的显示X / Y值是多少？
*   - 最好使用0到1之间的数字。
* 
* ---
*
* 敌群
* 
*   重新定位角色：
*   - 如果屏幕分辨率更改以超过816x624，则在战斗中更新角色的位置。
*   - 如果使用VisuStella MZ战斗核心，则忽略。
*   - 使用VisuStella MZ战斗核心时，通过战斗核心 > 参数 > 角色战斗者设置 > JS: 主位置来调整位置。
*
*   重新定位敌人：
*   - 如果屏幕分辨率更改以超过816x624，则在战斗中更新敌人的位置。
* 
*     对于MZ 1.3.0+？：
*     - 当使用RPG Maker MZ 1.3.0+时，这个参数及其父参数都需要打开。
*     - 如果核心脚本低于1.3.0，则会忽略此设置。这不考虑编辑器的版本。请注意，因为插件不会自动调整。
*
* ---
*
* ============================================================================
* 插件参数: 屏幕震动设置
* ============================================================================
*
* 让游戏中添加更多屏幕震动效果！
* 
* 这些效果由Sheratan的Aries添加！
*
* ---
*
* 设置
* 
*   默认样式：
*   - 用于屏幕震动的默认样式。
*   - 原始
*   - 随机
*   - 水平
*   - 垂直
* 
*   JS: 原始样式：
*   JS: 随机样式
*   JS: 水平样式
*   JS: 垂直样式
*   - 此代码可控制此屏幕震动样式的屏幕震动。
* 

*
* ---
*
* ============================================================================
* 插件参数: 标题命令列表设置
* ============================================================================
*
* 此插件参数允许您调整显示在标题画面上的命令。需要一些JavaScript知识。
*
* ---
*
* 标题命令
* 
*   符号:
*   - 此命令使用的符号。
* 
*   STR: 文本:
*   - 用于此标题命令的显示文本。
*   - 如果此处有值，则忽略JS: Text版本。
* 
*   JS: Text:
*   - 用于确定显示名称的字符串的JavaScript代码。
* 
*   JS: Show:
*   - 用于确定项目是否显示的JavaScript代码。
* 
*   JS: Enable:
*   - 用于确定项目是否启用的JavaScript代码。
* 
*   JS: Ext:
*   - 用于确定应添加的任何扩展数据的JavaScript代码。
* 
*   JS: Run Code:
*   - 当选择此命令后运行的JavaScript代码。
*
* ---
*
* ============================================================================
* 插件参数: 标题图片按钮设置
* ============================================================================
*
* 这些参数允许您在标题画面上插入图片按钮，点击后可以发送用户到互联网上的各种链接。
*
* ---
*
* 设置
* 
*   图片文件名:
*   - 图片使用的文件名。
* 
*   按钮URL:
*   - 点击后按钮要转到的URL。
* 
*   JS: Position:
*   - 帮助确定按钮位置的JavaScript代码。
* 
*   JS: On Load:
*   - 此按钮位图加载后运行的JavaScript代码。
* 
*   JS: Run Code:
*   - 点击按钮后运行的JavaScript代码。
*
* ---
*
* ============================================================================
* 插件参数: 用户界面设置
* ============================================================================
*
* 在RPG Maker的早期版本中，核心引擎允许您更改屏幕分辨率。在MZ中，默认提供此功能，但仍保留了许多UI设置。
* 这些设置允许您调整如何显示某些游戏内对象和菜单。
*
* ---
*
* UI区域
*
*   淡入淡出速度:
*   - 过渡的默认淡入淡出速度。
*
*   边框间距:
*   - 设置屏幕边界的像素边框。
*
*   命令窗口宽度:
*   - 设置标准命令窗口的宽度。
*
*   底部帮助窗口:
*   - 将帮助窗口放置在屏幕底部？
*
*   右对齐菜单:
*   - 将大多数命令窗口放置在屏幕右侧。
*
*   显示按钮:
*   - 在游戏中显示可点击按钮？
* 
*     显示取消按钮:
*     显示菜单按钮:
*     显示页上/下:
*     显示数字按钮:
*     - 如果以上启用，显示/隐藏相应的按钮。
*     - 如果“显示按钮”为false，无论如何都会隐藏这些按钮。
*
*   按钮区域高度:
*   - 设置按钮区域的高度。
*
*   底部按钮:
*   - 将按钮放置在屏幕底部？
*
*   侧边按钮:
*   - 如果有空间，将按钮推到UI的一侧。
* 
*   状态图标非框架:
*   - 替换非框架状态图标系统。
*   - 适用于放大图标的任何情况。
*
* ---
*
* 更大的分辨率
*
* ---
*
* 菜单对象
*
*   等级 -> EXP条:
*   - 在绘制等级下方绘制EXP条。
*
*   参数箭头:
*   - 用于显示参数值变化的箭头。
*
* ---
*
* 文本代码支持
*
*   职业名称:
*   - 让职业名称支持文本代码？
*
*   昵称:
*   - 让昵称支持文本代码？
*
* ---
*
* ============================================================================
* 插件参数: 窗口设置
* ============================================================================
*
* 调整游戏中窗口的默认设置。从行高（以适应您的字体大小）到不透明度级别（以适应窗口皮肤）等等。
* 
* 这些设置还允许您向可滚动窗口添加滚动条，让玩家知道窗口内容的剩余部分可以滚动。滚动条可以启用、禁用、
* 更改其厚度、更改颜色等。
*
* ---
*
* 窗口默认值
* 
*   启用蒙版:
*   - 启用窗口蒙版（窗口隐藏其他窗口后面）？
*   - 警告：打开它可能会遮挡数据。
* 
*   修正皮肤出血:
*   - 允许您启用/禁用窗口皮肤出血修正，适用于希望使用95计算器而不是96来增强更高和更大屏幕分辨率的人。
*   - 如果不了解窗口皮肤出血问题，请阅读“Bug Fixes”部分。
* 
*   行高:
*   - 标准窗口使用的默认行高。
*   - 避免使用奇数。
*   - RPG Maker和一般游戏开发中的视觉效果与奇数不兼容，除非您希望游戏的视觉表现不一致，请避免使用奇数。
* 
*   项目间距:
*   - 标准窗口使用的默认项目间距。
*   - 避免使用奇数。
*   - RPG Maker和一般游戏开发中的视觉效果与奇数不兼容，除非您希望游戏的视觉表现不一致，请避免使用奇数。
* 
*   背景不透明度:
*   - 标准窗口使用的默认背景不透明度。
*   - 自版本1.3.0起，不再需要。
*   - 对于较低版本仍然有效。
* 
*   半透明不透明度:
*   - 标准窗口使用的默认半透明不透明度。
* 
*   窗口打开速度:
*   - 标准窗口使用的默认打开速度。
*   - 默认值：32（使用0-255之间的数字）
* 
*   列间距:
*   - 可选择窗口使用的默认列间距。
*   - 默认值：8
* 
*   行间距:
*   - 可选择窗口使用的默认行间距。
*   - 默认值：4
*
* ---
* 
* 滚动条
* 
*   显示滚动条？:
*   - 显示可滚动窗口的滚动条？
* 
*   厚度:
*   - 您希望滚动条有多厚？
* 
*   偏移量:
*   - 您希望通过多少偏移滚动条？
* 
*   滚动条主体颜色:
*   - 使用#rrggbb设置自定义颜色或从窗口皮肤选择文本颜色的常规数字。
* 
*   滚动条关闭颜色:
*   - 使用#rrggbb设置自定义颜色或从窗口皮肤选择文本颜色的常规数字。
* 
*   滚动条关闭不透明度:
*   - 您希望关闭滚动条的不透明度值是多少？
*   - 使用0到255之间的数字。
* 
* ---
* 
* 可选择项目:
* 
*   显示背景？:
*   - 可选择菜单项目在其后有暗色框。要显示吗？
* 
*   项目高度间距:
*   - 可选择项目的默认间距。
*   - 避免使用奇数。
*   - RPG Maker和一般游戏开发中的视觉效果与奇数不兼容，除非您希望游戏的视觉表现不一致，请避免使用奇数。
* 
*   JS: 绘制背景:
*   - 用于绘制可点击菜单对象背景矩形的代码。
* 
* ---
*
* ============================================================================
* 插件参数: JS: 快速功能
* ============================================================================
* 
* 警告：此功能非常实验性！请自行承担风险使用！
* 
* JavaScript快速功能允许您快速在全局命名空间中声明函数，以便在脚本调用、控制变量脚本输入、条件分支脚本输入、
* 伤害公式等中使用。这样，这些函数可以在需要时调用。
* 
* ---
* 
* JS: 快速功能
* 
*   函数名称:
*   - 全局命名空间中函数的名称。
*   - 不会覆盖同名的函数/变量。
* 
*   JS: 代码:
*   - 使用函数时运行的代码。
* 
* ---
* 
* 如果函数名称为“示例”，则在脚本调用、条件分支脚本输入或类似字段中输入“示例()”将返回代码指定的内容。
* 
* 如果全局命名空间中已存在类似名称的函数或变量，则快速函数将被忽略并且不会创建。
* 
* 如果快速函数包含有可能使游戏崩溃的错误代码，已实施安全保护措施以防止其发生，并显示错误日志，然后返回值0。
* 
* ---
*
* ============================================================================
* 使用条款
* ============================================================================
*
* 1. 可以在免费或商业游戏中使用这些插件，前提是它们是通过VisuStella.com和/或任何其他官方批准的VisuStella来源
*    获得的。特定情况和特殊情况可能会禁止使用，请在VisuStella.com上查看。
* 
* 2. 在您的游戏中必须给予此插件中列出的所有开发者在Credits部分的适当信用，或者作为一个集体以“VisuStella”的名义列
*    入。
* 
* 3. 您可以编辑源代码以满足您的需求，但不得声明源代码属于您所有。VisuStella对于插件的代码做出的任何更改不承担责任，
*    VisuStella也不对用户提供的用于自定义控制效果的自定义代码负责，包括高级JavaScript标签和/或允许JavaScript代码的插件参数。
* 
* 4. 您不得重新分发这些插件，也不得将此插件的代码用作您自己的。这些插件及其代码仅可从VisuStella.com和其他
*    官方/批准的VisuStella来源下载。VisuStella.com上也可以找到官方/批准的来源列表。
*
* 5. VisuStella不对因意外使用、与VisuStella MZ库之外的插件不兼容的问题、未及时更新的插件版本、以及由任何用户提供的
*    用于自定义控制效果的自定义代码，包括高级JavaScript标签和/或允许JavaScript代码的插件参数而导致的问题负责。
* 
* 6. 如果需要通过与VisuStella无关的第三方进行兼容性修补程序，其中涉及使用VisuStella MZ库的代码，必须与VisuStella的
*    成员联系并获得批准。该补丁将被放置在VisuStella.com上作为公开免费下载。此类补丁不能以赚取金钱为目的，包括佣金、
*    众筹和/或捐赠。
*
* --- END OF TRANSLATION ---

*
* ============================================================================
* 鸣谢
* ============================================================================
* 
* 如果您在游戏中使用此插件，请在游戏中鸣谢以下人员：
*
* Team VisuStella
* * Yanfly
* * Arisu
* * Olivia
* * Irina
*
* ============================================================================
* 更新日志
* ============================================================================
* 
* 版本 1.83：2024年6月13日
* * 文档更新！
* ** 帮助文件已更新以适应新功能。
* ** 更新了<param Max: x> 标签注释的文档。
* *** 这不会将最大上限设置为低于默认上限。
* * 新功能！
* ** Olivia 添加的新插件参数：
* *** 插件参数 > 用户界面设置 > 状态图标非框架
* **** 替换非框架状态图标系统。
* **** 适用于放大图标的任何情况。
* 
* 版本 1.82：2024年4月18日
* * 文档更新！
* ** 帮助文件已更新以适应新功能。
* * 功能更新！
* ** 为 $textPopup 添加了失败安全机制，以防某些窗口未初始化时请求文本弹出。
* * 新功能！
* ** Arisu 添加的新插件参数和快速测试快捷键：
* *** 插件参数 > QoL 设置 > 快速测试 > CTRL + n：快速加载
* **** 按下 1 到 9 的数字加 CTRL 键会快速加载对应的存档文件。
* **** 不包括自动保存。
* * 优化更新！
* ** 插件应该运行得更加优化。
* 
* 版本 1.81：2024年2月15日
* * 兼容性更新！
* ** 增加了对未来插件的兼容功能。
* * 文档更新！
* ** 帮助文件已更新以适应新功能。
* * 新功能！
* ** 为未来插件 VisuMZ_2_BattleGridSystem 添加了新的标签注释：
* *** <Grid>
* *** <No Grid>
* **** 需要未来的插件 VisuMZ_2_BattleGridSystem！
* **** 详细信息请查看帮助部分。
* ** Arisu 添加的新插件参数：
* *** 插件参数 > 窗口 > 修正皮肤出血
* **** 允许您启用/禁用窗口皮肤出血修正，
*      适用于希望使用95计算器而不是96来增强更高和更大屏幕分辨率的人。
* **** 如果不了解窗口皮肤出血问题，请阅读“Bug Fixes”部分。
* 
* 版本 1.80：2024年1月18日
* * Bug 修复！
* ** RPG Maker MZ Bug 修复！
* *** 新游戏后自动保存
* **** 通常情况下，通过“新游戏”选项开始新游戏时，不会触发自动保存。但是，如果开始新游戏或加载保存的游戏，
*      然后转到游戏结束画面，返回标题画面，再开始新游戏，则会在不应该发生的时候触发自动保存。核心引擎现在将修补此问题，
*      防止触发发生。
* 
* 版本 1.79：2023年11月16日
* * 文档更新！
* ** 帮助文件已更新以适应新功能。
* * Arisu 添加的新插件命令：
* ** 文本弹出：显示文本
* *** 向文本弹出窗口添加文本以简短显示。
* *** 可以排队显示多个文本弹出。
* *** 不会阻碍游戏进程，与游戏活动并行工作。
* 
* 版本 1.78：2023年10月12日
* * 文档更新！
* ** 帮助文件已更新以适应新功能。
* * 新功能！
* ** Olivia 和 AndyL 赞助的新插件参数：
* *** QoL 设置 > 战斗测试 > Shift+R：全队恢复
* **** 仅用于快速测试！在战斗中，按 SHIFT + R 将恢复整个队伍的HP和MP及状态。
* *** QoL 设置 > 战斗测试 > Shift+T：全TP
* **** 仅用于快速测试！在战斗中，按 SHIFT + T 将恢复整个队伍的TP。
* 
* 版本 1.77：2023年8月17日
* * Bug 修复！
* ** 修复了与BGS相关的插件命令可能导致崩溃的问题。Arisu修复。
* * 文档更新！
* ** 帮助文件已更新以适应新功能。
* * 功能更新！
* ** 如果图像文件位于img/pictures/文件夹中的文件夹中，无需在文件夹名称前面加上！，则现在可以使用滚动链接图片。
* * 新功能！
* ** Arisu 添加的新插件命令：
* *** 图片：按角度旋转
* **** 以设置的角度旋转目标图片，持续一段时间而非连续旋转。
* **** 详细信息请查看帮助文件中的插件命令。
* *** 图片：旋转至角度
* **** 将目标图片旋转到特定角度，持续一段时间而非连续旋转。
* **** 详细信息请查看帮助文件中的插件命令。
* ** Irina 添加的新插件参数：
* *** 参数 > 菜单按钮辅助 > 通用 > 拆分“Escape”：
* **** 仅用于制作自定义键盘按键映射的人。
* **** “拆分”选项将“取消”和“菜单”键分开。
* **** “不”选项将两者合并为“Escape”键。
* 
* 版本 1.76：2023年6月15日
* * Bug 修复！
* ** 修复了名称输入处理中取消操作的按钮按键显示错误的问题。Olivia修复。
* 
* 版本 1.75：2023年3月16日
* * 文档更新！
* ** 帮助文件已更新以适应新功能。
* * 功能更新！
* ** 在 Scene_Name 中，使用键盘输入时，按钮辅助窗口将不再显示Ok和Cancel的键盘快捷键，而是显示ENTER和BKSP的快捷键。Arisu更新。
* ** 在 Scene_Name 中，手动输入时，Page Up/Dn键现在用于显示更改角色页面。
* * 新功能！
* ** Arisu 和 AndyL 赞助的新插件参数：
* *** 参数 > 键盘输入 > 按钮辅助 > 完成输入
* **** 用于描述完成输入的文本。
* *** 参数 > 键盘输入 > 按钮辅助 > 页面更改
* **** 用于描述更改角色页面的文本。
* *** 参数 > 窗口设置 > 滚动条
* **** 这些设置还允许您为可滚动窗口添加滚动条，让玩家了解窗口内容的剩余部分可以滚动。
* 
* 版本 1.74：2023年2月16日
* * 兼容性更新！
* ** 插件命令：音频：更改当前BGM/BGS音量/音调/平移 现在应该与更新的RPG Maker MZ版本和WebAudio更改正常工作。Arisu更新。
* 
* 版本 1.73：2023年1月20日
* * 兼容性更新！
* ** 添加了更好的Effekseer版本兼容性。
* 
* 版本 1.72：2022年12月15日
* * Bug 修复！
* ** RPG Maker MZ Bug 修复！
* *** 成员更换后技能列表活动
* **** 如果技能列表处于活动状态（即玩家可以移动光标），并且通过按钮命令更改当前查看的成员，则此前，RPG Maker MZ 仍然会使窗口保持活动状态，尽管临时隐藏了光标。按下方向按钮后，光标会显现出来，并且技能类型窗口和技能列表窗口都保持活动状态，可能会导致多种潜在问题。
* ** 水图块Bug
* *** 在RPG Maker MZ版本1.5.0+和1.6.0+中，如果从头开始创建一个图块集，会出现一个新的bug！此bug会导致许多图块意外变成水图块。您可以通过关闭项目中的所有插件，将船只放置在通常的地面图块上，然后看船只是否能通过，来检查此问题。
* *** 有两种方法可以解决这个问题。我们不能通过插件代码修复它，因为这个问题涉及到图块集json数据，但是有一些解决方法可以确保水标志正确放置在需要的位置。
* **** 1. 将一个正常的未出bug的图块集复制到当前有问题的图块集上，并重新应用通行性、地形标签等特性。这将确保水通行图块正确复制过来。
* **** 2. 如果您使用的是RPG Maker MZ版本1.5.0或更高版本，请选择一个正常的未出bug的图块集（通常是新建项目时的预设图块集），点击“复制页”按钮，然后进入有问题的图块集并按“粘贴页”按钮。您将需要重新应用任何不同的属性，如通行性和地形标签，但是水图块标志现在应该可以正常工作了。
* *** 插件将不会自行修复问题，因为标志数据很微妙，不应该在游戏进行中随意更改，插件的更改可能与所需的设置不匹配。
* *** 然而，插件在遇到这样的图块时也会发送警告消息。请注意并执行上述两个步骤中的任意一个来解决问题。
* * 文档更新！
* ** 在“重要更改：Bug 修复”部分添加了“技能列表成员更换后活动”小节。
* ** 在“重要更改：Bug 修复”部分添加了“水图块Bug”小节。
* ** 帮助文件已更新以适应新功能。
* * 新功能！
* ** Irina 添加的新插件参数：
* *** 插件参数 > 菜单背景 > 模糊强度
* **** 用于菜单背景快照的强度设置。
* 
* 版本 1.71：2022年11月10日
* * Bug 修复！
* ** 标题命令窗口现在应该允许超过4个自定义命令而没有隐藏命令了。Irina修复。
* ** 修复了来自视觉状态效果的重复动画导致软锁的问题。Olivia修复。
* 
* 版本 1.70：2022年10月6日
* * Bug 修复！
* ** RPG Maker MZ Bug 修复！
* *** 现在将对即将被移除和销毁的精灵进行纹理检查，以防止崩溃。如果通过脚本调用创建精灵并通过这样的方式移除它，这种情况发生的可能性将会增加。这使得销毁属性在执行纹理检查时会减少额外步骤。
* * 文档更新！
* ** 在“重要更改：Bug 修复”部分添加了“精灵移除和销毁崩溃”小节。
* * 优化更新！
* ** 插件应该运行得更加优化。
* 

* 
* 版本 1.69: 2022年9月8日
* * Bug修复！
* ** 修复了按钮辅助位置：顶部与帮助位置：底部组合不正常工作的问题。由Irina修复。

* 版本 1.68: 2022年8月4日
* * 文档更新！
* ** 帮助文件已更新，适应新功能。
* * 新功能！
* ** Olivia 添加的新插件命令，由Archeia赞助：
* *** 音频：更改当前BGM音量
* *** 音频：更改当前BGM音调
* *** 音频：更改当前BGM平移
* *** 音频：更改当前BGS音量
* *** 音频：更改当前BGS音调
* *** 音频：更改当前BGS平移
* **** 更改当前BGM/BGS的音量/音调/平移，不影响当前BGM/BGS的其他属性，也不重新启动BGM/BGS。

* 版本 1.67: 2022年7月28日
* * 文档更新！
* ** 帮助文件已更新，适应新功能。
* ** 增加了行高和项目内边距参数的注意事项：
* *** 避免使用奇数。
* *** RPG Maker和一般游戏开发中，奇数通常会导致视觉效果不一致，除非您希望游戏的视觉效果表现不一致。
* *** 如果地图进行了放大，此设置将被禁用。

* 版本 1.66: 2022年7月14日
* * Bug修复！
* ** RPG Maker MZ Bug修复！
* *** 调试控制台刷新Bug
* **** 当调试控制台（DevTools）打开时，按下F5进行刷新，某些图形将无法正确加载。自RPG Maker MZ 1.5.0更新以来，代码已回滚至上一个稳定版本1.4.4。
* * 文档更新！
* ** 帮助文件已更新，适应重大Bug修复。

* 版本 1.65: 2022年6月30日
* * 文档更新！
* ** 帮助文件已更新，适应新功能。
* * 新功能！
* ** Irina 添加的新插件参数：
* *** 插件参数 > 参数设置 > 显示角色等级？
* **** 在显示角色时显示角色等级？
* **** 用于游戏中的大多数窗口。

* 版本 1.64: 2022年6月9日
* * 文档更新！
* ** 帮助文件已更新，适应新功能。
* * 新功能！
* ** Arisu 添加的新插件命令，由ImGonnaPutMyGameOnXboxAndYouCantStopMe赞助：
* *** 调试：当前控制器ID
* **** 仅限播放测试。显示调试控制台中的当前控制器ID。
* **** 如可能，还会复制到计算机剪贴板。
* ** Arisu 添加的新插件参数，由ImGonnaPutMyGameOnXboxAndYouCantStopMe赞助：
* *** 按钮辅助窗口的子设置：控制器按钮辅助
* **** 这些是按钮辅助窗口插件参数的子设置。按钮辅助窗口插件参数专注于键盘输入，而这些部分专注于游戏手柄控制器。
* **** 将多个游戏手柄添加到列表中，以便为它们提供不同的按钮辅助文本。如果使用游戏手柄但未在此处列出，则按钮辅助文本将默认为键盘版本。

* 版本 1.63: 2022年5月2日
* * 文档更新！
* ** 帮助文件已更新，适应新功能。
* * 新功能！
* ** Irina 添加的新插件参数：
* *** 插件参数 > QoL 设置 > 其他 > 地图名称文本代码
* **** 如果启用，地图名称将使用文本代码。
* **** 如果禁用，将仅使用原始地图名称。
* * 功能更新！
* ** 地图名称文本代码变更现在不会强制启用，而是可以通过插件参数进行切换。Irina更新。

* 版本 1.62: 2022年4月28日
* * 文档更新！
* ** 帮助文件已更新，适应新功能。
* * 新功能！
* ** Arisu 添加的新插件命令，由Archeia赞助：
* *** 变量：JS评估
* **** 选择变量ID和通过JS更改其值。
* **** 允许变量ID和操作数的一行代码。
* **** 类似于RM2k3的变量指针。
* *** 变量：JS块
* **** 选择变量ID和通过JS更改其值。
* **** 允许变量ID和操作数的JS块代码。
* **** 类似于RM2k3的变量指针。
* ** 地图名称现在可以使用文本代码。由Arisu添加，由Archeia赞助。

* 版本 1.61: 2022年4月21日
* * Bug修复！
* ** RPG Maker MZ Bug修复！
* *** 战斗强制结束动作崩溃
* **** 根据各种情况，当前活动的战斗者可以因多种原因被清除出战斗系统。但是，如果恰巧目标也被清除，并且动作仍然存在，则会跟随崩溃。此插件将防止此更改。由Olivia修复。

* 版本 1.60: 2022年4月14日
* * Bug修复！
* ** 数字输入窗口现在将正确响应Home/End键。
* *** 由Olivia修复。

* 版本 1.59: 2022年4月7日
* * 兼容性更新！
* ** RPG Maker MZ 1.4.4兼容性更新！
* *** 当从Node JS客户端在其他操作系统上运行时，“Shutdown”命令现在应更兼容客户端的其他方面。

* 版本 1.58: 2022年3月24日
* * 功能更新！
* ** 插件命令现在具有分隔符，以便更轻松选择。

* 版本 1.57: 2022年3月3日
* * 兼容性更新！
* ** 标题画面的“Shutdown”命令现在应与RPG Maker MZ 1.4.4及更高版本兼容。由Olivia更新。

* 版本 1.56: 2022年2月10日
* * 文档更新！
* ** 帮助文件已更新，适应新功能。
* * 新功能！
* ** Arisu添加的新功能，由Anon赞助：
* *** 插件参数 > QoL > 其他 > 快捷脚本
* **** 启用基于快捷键的脚本变量和函数，用于脚本调用。
* **** 此快捷列表启用为：
* ***** $commonEvent(id), $onceParallel(id), $scene, $spriteset, $subject, 
*       $targets, $target, $event
* ***** 欲了解更多信息，请查阅帮助文件。

* 版本 1.55: 2022年1月27日
* * 功能更新！
* ** 地图上的Once Parallel现在能够在其他事件运行时更新。由Arisu更新。

* 版本 1.54: 2022年1月13日
* * Bug修复！
* ** RPG Maker MZ Bug修复！
* *** 过度保护替代
* **** 当一个处于危急健康状态的盟友被友方非必中技能（如治疗或增益）目标，并且另一个盟友具有替代状态时，另一个盟友会“保护”最初的目标并接受治疗或增益。
* **** 新的更改行为是现在，替代将不会为目标为盟友的任何行动触发。
* *** 由Olivia修复。

* 版本 1.53: 2021年12月30日
* * 文档更新！
* ** 帮助文件已更新，适应新功能。
* * 新功能！
* ** Olivia添加的新注释：
* *** <Rate: x>
* **** 允许您调整此MV动画的更新频率。
* ***** 与Effekseer动画不兼容。
* **** 数字越低，更新越快。
* **** 用数字替换'x'，表示动画更新速率。
* ***** 默认速率：4。
* ***** 最小速率：1。
* ***** 最大速率：10。
* ** Olivia添加的新插件参数：
* *** 插件参数 > QoL设置 > MV动画速率
* **** 调整MV动画播放速率。
* **** 默认值：4。越低越快，越高越慢。

* 版本 1.52: 2021年12月16日
* * 兼容性更新！
* ** RPG Maker MZ 1.4.0兼容性更新！
* *** 屏幕级别播放的MV动画现在将正确显示在屏幕中央。

* 版本 1.51: 2021年12月9日
* * Bug修复！
* ** RPG Maker MZ Bug修复！
* *** 在战斗状态窗口中，每当显示角色名称时，用于显示其名称文本的位图不会垂直延伸到底部，导致像小写字母“Q”和“G”这样的字母被切断，使它们难以区分。
* *** 由Irina修复。

* 版本 1.50: 2021年11月4日
* * Bug修复！
* ** RPG Maker MZ Bug修复！
* *** 默认情况下，如果攻击技能通过特性封印，并且角色具有自动战斗，则可以继续通过自动战斗使用该动作。现在已修复，角色如果攻击能力被封印，将不能通过自动战斗攻击。
* ** 帮助文件已更新，适应新的RPG Maker MZ Bug修复。

* 版本 1.49: 2021年10月28日
* * 文档更新！
* ** 帮助文件已更新，适应新功能。
* * 新功能！
* ** Arisu添加的新插件命令，由Anon赞助：
* *** 地图：一次并行
* **** 在事件并行地图场景中，播放一次性公共事件而不重复。仅适用于地图！
* **** 当退出地图场景或更改地图时，所有一次并行将被清除。
* **** 重新进入场景或地图时，一次并行不会保留。
* **** 一次并行不会保存在内存中，也不能保存。

* 版本 1.48: 2021年10月21日
* * 功能更新！
* ** Bitmap.blt函数现在在源坐标和目标X、Y坐标上四舍五入，以防止模糊。由Olivia更新。

* 
Version 1.47: 2021年10月14日

Bug修复！
** 修复了由于按住快进键导致数字输入窗口出现NaN值的问题。修复由Arisu完成。

兼容性更新
** 增加了对未来插件的兼容性功能。

文档更新！
** 帮助文件已更新以反映新功能。

新功能！
** Yanfly添加了新的插件参数：

*** 插件参数 > QoL设置 > 杂项 > 字体宽度修复

**** 解决了消息窗口中非等宽字体的字宽问题。这现在是一个可选修复。

Version 1.46: 2021年9月23日

文档更新！
** 在插件命令"System: Battle System Change"中添加了一行：

*** 一些战斗系统需要特定的插件支持！

** 在"插件参数: 战斗系统"中添加了几行：

*** 一些战斗系统需要特定的插件支持！这意味着如果未安装必需的战斗系统插件，战斗系统将不会更改。核心引擎插件中不包含所有战斗系统的数据。

Version 1.45: 2021年9月17日

Bug修复！
** 修复了“图片: 坐标模式”存在的问题，以正确地利用正确的图片ID。修复由Arisu完成。

** RPG Maker MZ Bug修复：

*** "窗口消息"的即时文本不一致

**** 当窗口消息以逐字绘制和即时显示文本时，显示的文本会有所不同。使用默认字体时几乎看不出来，但使用如Arial之类的字体时非常明显。这个错误是由于Bitmap.measureTextWidth函数对每个字母和每个单词产生的舍入值不同引起的。核心引擎将提供一个修复bug的更新，使得只有“窗口消息”在确定每个字母的宽度时不再使用任何舍入值，无论文本是否即时显示。这个改变只会影响到“窗口消息”，不会影响其他窗口，以防止意外副作用。

**** 修复由Yanfly完成。

兼容性更新！
** 兼容RPG Maker MZ 1.3.3版本。

*** 更新了如何绘制测量条。

文档更新！
** 帮助文件已更新以反映新的RPG Maker MZ Bug修复。

Version 1.44: 2021年8月20日

文档更新！
** 帮助文件已更新以反映新功能。

新功能！
** Irina新增了一个由Anon赞助的新插件命令：

*** "动画: 播放坐标"

**** 在屏幕上特定的x，y坐标处播放动画，即使没有精灵附加。

Version 1.43: 2021年7月23日

文档更新！
** 帮助文件已更新以反映新功能。

新功能！
** Irina新增了一个由Archeia赞助的新插件命令！

*** "图片: 坐标模式"

**** 仅限测试模式！

**** 在你移动图片时获取特定图片的坐标，以便更轻松地确定放置图片时的屏幕坐标。

Version 1.42: 2021年7月16日

文档更新
** 在"插件参数: 颜色设置"中添加了以下说明文本：

*** 如果游戏的窗口皮肤在游戏中途更改，使用的颜色仍将基于默认窗口皮肤的颜色。这是因为将它们存储在缓存中以避免额外处理，并减少延迟。

Version 1.41: 2021年7月2日

兼容性更新
** 进一步与RPG Maker MZ 1.3.0+兼容。

文档更新
** 在"重要变更: Bug修复"部分为"窗口皮肤渗透"错误添加了额外说明：

*** 这个错误在RPG Maker MZ v1.3.0+的核心脚本中已修复。

Version 1.40: 2021年6月25日

兼容性更新
** 与RPG Maker MZ 1.3.0+兼容性更新。

文档更新：
** 插件参数 > 窗口设置 > 背景透明度

*** 从版本1.3.0开始，这不再需要。

*** 对于较低版本仍然有效。

** 帮助文件已更新以反映新功能。

功能更新！
** 窗口皮肤渗透修复更新至最新版本。

添加了新的插件参数：
** 插件参数 > 屏幕分辨率设置

*** 这些设置已从UI设置移至独立设置。

**** 这主要是针对RPG Maker MZ版本1.3.0及以上，其中“敌人”选项卡已更新以匹配System 2 Database选项卡中找到的屏幕分辨率设置。

*** 重新定位敌人 > 适用于MZ 1.3.0+？

**** 这两个插件参数都需要设置为true才能使MZ v1.3.0的重新定位工作。

**** 如果核心脚本低于1.3.0，此设置将被忽略。这不考虑编辑器的版本。请注意，插件将不会自动调整。

这些是关于版本1.47到版本1.40的汉化内容。
* 
Version 1.39: 2021年6月18日

Bug修复！
** 如果启用了键盘数字输入，现在数字输入将能够与控制器一起工作。修复由Olivia完成。

** RPG Maker Bug修复：终止清除效果

*** 在RPG Maker MZ中，在场景转换期间请求动画（例如从地图场景到战斗场景）可能导致崩溃。这是因为动画队列不会立即启动，并且可能会将错误的目标注册为场景。此插件将在终止场景时强制清除任何已注册的动画和气泡效果，以防止崩溃。

文档更新！
** 帮助文件已更新以反映更新的功能。

功能更新！
** <Battle View: x> 队伍名称标签现在可以使用注释标签。

** <Battle System: x> 队伍名称标签现在可以使用注释标签。

*** 更新由Irina完成。

Version 1.38: 2021年6月11日

文档更新！
** 帮助文件已更新以反映新功能。

新功能！
** Irina新增的由Caz赞助的新插件命令：

*** Picture: Show Icon

**** 显示一个图标而不是图片。

**** 图标图片可以像其他图片一样控制。

Version 1.37: 2021年5月21日

文档更新！
** 帮助文件已更新以反映新功能。

新功能！
** Arisu新增的新插件命令：

*** Switches: Randomize ID(s)

*** Switches: Randomize Range

*** Switches: Toggle ID(s)

*** Switches: Toggle Range

**** 这些插件命令允许您随机化开关的开/关状态或切换它们，以翻转它们的开/关状态。

Version 1.36: 2021年5月14日

文档更新！
** 帮助文件已更新以反映新功能。

新功能！
** Irina新增的新插件命令：

*** Export: All Maps Text

*** Export: All Troops Text

*** Export: Current Map Text

*** Export: Current Troop Text

**** 仅供游戏测试使用的插件命令。这些插件命令用于提取所有消息、选择、注释和滚动文本，将其解析并导出为TXT文件。非常适合向声优提供游戏剧本。

Version 1.35: 2021年5月7日

文档更新！
** 在“参数设置”插件参数下添加了以下文本，以便更清晰地了解参数上限：

*** 这些设置不会提高编辑器的最大值。如果要将敌人的最大参数值提高超过默认上限，请使用相应的标签。

Version 1.34: 2021年4月23日

Bug修复！
** 对于原始的装备状态窗口，具有整数值的自定义参数现在将显示为整数而不是百分比。修复由Olivia完成。

文档更新！
** 对于敌人的<param: x>标签添加了清晰说明：

*** 此标签不适用于X参数、S参数或任何自定义参数。此标签仅适用于基本参数。

Version 1.33: 2021年4月9日

Bug修复！
** RPG Maker MZ Bug修复：窗口皮肤渗透

*** 自从v1.2.0更新以来，Window.prototype._refreshBack的帧值从96设置为95。这导致窗口皮肤超出了其预期的边界。核心引擎现在回滚此更改，以防止发生渗透效果。

Version 1.32: 2021年4月2日

文档更新！
** 帮助文件已更新以反映新功能。

新功能！
** Yanfly新增的新插件参数：

*** Plugin Parameters > QoL Settings > Battle Test > Add Item Type

*** Plugin Parameters > QoL Settings > Battle Test > Add Weapon Type

*** Plugin Parameters > QoL Settings > Battle Test > Add Armor Type

*** Plugin Parameters > QoL Settings > Battle Test > Added Quantity

**** 默认情况下，RPG Maker MZ仅添加99个物品，而不是武器或盔甲，这使得测试特定战斗机制变得尴尬。这些设置允许您添加自定义数量的物品、武器和/或盔甲。

Version 1.31: 2021年3月26日

功能更新！
** 当标题屏幕按钮悬停时，现在将完全不透明显示，而不仅仅在按下时。更新由Yanfly完成。

Version 1.30: 2021年3月19日

Bug修复！
** RPG Maker MZ Bug修复：战斗中角色精灵不可见

*** 如果在战斗中移除一个队伍成员，并在同一位置重新添加该队伍成员，则其精灵将会变为不可见。VisuStella核心引擎将修复此问题并防止其发生。

Version 1.29: 2021年3月12日

Bug修复！
** RPG Maker MZ Bug修复：可交互窗口客户区在比例不为1.0时不符合窗口声明的比例。现在通过此插件修复。修复由Olivia完成。

Version 1.28: 2021年3月5日

Bug修复！
** RPG Maker MZ Bug修复：当窗口大小为奇数时，窗口皮肤绘制的箭头将不再放置在半像素上。这将导致精灵撕裂问题和外观糟糕。修复由Irina完成。

Version 1.27: 2021年2月26日

文档更新！
** 帮助文件已更新以反映新功能。

** 将“Show Scrolling Text, additional functionality”部分从Bug修复移动到主要更改中，因为它放错了位置。

新功能！
** Yanfly新增的新插件参数：

*** Plugin Parameters > Keyboard Input > Name Input > Banned Words

**** 插入不希望玩家用于角色名称的词语。

Version 1.26: 2021年2月19日

Bug修复！
** 某些插件参数不再限制为最多1个的设置。修复由Arisu完成。

功能更新！
** 在Play Testing时，默认JS插件参数“New Game > Common Event”现在设置为0以防止混淆。更新由Arisu完成。

Version 1.25: 2021年2月5日

文档更新！
** 帮助文件已更新以反映新功能。

新功能！
** Arisu添加的额外功能“Show Scrolling Text”：

*** 事件命令“Show Scrolling Text”现在具有额外功能，只要安装了VisuStella MZ核心引擎。如果游戏开发者在滚动文本中插入“// Script Call”（不带引号），则整个Show Scrolling Text事件命令将作为一个大型脚本调用事件命令运行。

Version 1.24: 2021年1月29日

文档更新！
** 对于“参数设置”插件参数，自定义参数设置添加了以下说明：

*** 为了澄清，这些设置不会为您创建全新的参数，并添加到您的游戏中，也不支持VisuStella MZ库中其他插件创建的奖励。这些设置存在是为了作为非VisuStella MZ插件的桥梁，这些插件创建了它们自己的参数值，并将它们显示在VisuStella菜单中。

Version 1.23: 2021年1月22日

优化更新！
** 插件应该更加优化运行。

Version 1.22: 2021年1月15日

文档更新！
** 添加了新的RPG Maker MZ Bug修复的文档！

Version 1.21: 2021年1月8日

文档更新！
** 添加了新功能的文档！

新功能！
** Arisu添加的新插件参数：

*** Plugin Parameters > Keyboard Input > Controls > WASD Movement

*** Plugin Parameters > Keyboard Input > Controls > R Button: Dash Toggle

Version 1.20: 2021年1月1日

兼容性更新！
** 为未来插件添加了兼容性功能。

Version 1.19: 2020年12月25日

文档更新！
** 添加了新功能和功能更新的文档！

Bug修复！
** 修正了JS: Quick Functions中的拼写错误。

功能更新！
** 插件参数 > Color Settings > Outline Color 现已更名为 Font Outline。

新功能！
** Shaz新增的新插件参数：

*** Plugin Parameters > Color Settings > Gauge Number Outline

这是对每个版本的简要汉化，希望对您有帮助！
* 
版本 1.18: 2020年12月18日
Bug修复！
** 项目和装备核心的兼容字符串文本将不再将MaxHP和MaxMP注册为信息窗口的百分比值。
** RPG Maker MZ Bug修复：清除输入后，游戏手柄不再快速触发。现在在清除输入后游戏手柄会有一段延迟时间。
** RPG Maker MZ Bug修复：个别角色基础上无法使用的物品不再被战斗中基于队伍的可用性所覆盖。修复由Yanfly完成。
** RPG Maker MV动画将不再因无法播放的声音效果而崩溃。修复由Yanfly完成。
兼容性更新！
** 插件应该更加兼容彼此。
文档更新！
** 添加了新功能的文档！
** 添加了新的RPG Maker MZ Bug修复的文档！
新功能！
** Yanfly添加了新的插件参数！
*** 插件参数 > 按钮辅助 > 键：Shift
*** 插件参数 > 按钮辅助 > 键：Tab
**** 这些参数允许你为按钮辅助窗口的Shift和Tab按钮分配文本代码。
*** 插件参数 > QoL设置 > 杂项 > NewGame > 公共事件
**** 为所有版本（包括非测试版）的公共事件，用于开始新游戏。
版本 1.06: 2020年9月27日
Bug修复！
** RPG Maker MZ现在可以在未命中时显示闪避姿势。在RPG Maker MZ中，这两者被分开，未命中不会触发闪避姿势。修复由Olivia完成。
新功能！
** Yanfly添加了地图和敌群的新标签！
*** <Frontview>、<Sideview> 可以改变特定地图或敌群的战斗视图，不受其他设置的影响。
*** <DTB>、<TPB Active>、<TPB Wait> 可以改变特定地图或敌群的战斗系统，不受其他设置的影响。
版本 1.05: 2020年9月20日
Bug修复！
** 修复了敌人的<Level: x>标签！修复由Arisu完成。
文档更新！
** 为新的“System: Battle System Change”插件命令添加了文档，并移除了旧的“System: Set Time Progress Battle”。
功能更新！
** 插件命令“System: Set Time Progress Battle”已被“System: Battle System Change”取代。这是为了支持允许不同战斗系统的未来插件。由Yanfly添加。
*** 如果你之前使用过“System: Set Time Progress Battle”，请进行替换。对此造成的不便，我们深感抱歉。
新功能！
** 在核心引擎的插件参数中，现在可以设置使用的战斗系统。这将默认为游戏数据库的设置。这个功能用于未来新增战斗系统时使用。由Yanfly添加。
版本 1.04: 2020年9月13日
文档更新！
** 为“Title Command List”和“Title Picture Buttons”插件参数添加了新文档。它们现在各有一个专门的部分。
功能更新！
** 将“Title Command List”和“Title Picture Buttons”参数从菜单布局 > 标题设置中移动出来。它们原本隐藏得太深，用户很难找到。由Yanfly更新。
*** 之前自定义了这些设置的用户需要重新调整。对此造成的不便，我们深感抱歉。
版本 1.03: 2020年9月6日
Bug修复！
** 现在关闭QoL > Modern Controls（为什么要这样做）不会再导致向下按钮无法使用。修复由Yanfly完成。
新功能！
** 插件默认设置现在在标题画面上增加了“Game End”选项。对于从1.02版本或更早的版本更新的用户，可以通过打开Core Engine > 插件参数 > 菜单布局设置 > 在Scene_Title上按“delete”键 > 打开它，然后新设置将自动填充。
新的实验性功能添加：
** 添加了屏幕抖动设置到插件参数中。
*** 屏幕抖动：自定义插件命令添加！
*** 特别感谢Sheratan的Aries允许我们使用她的公式。
*** 我们将在未来扩展更多的屏幕抖动选项。
优化更新
** 数字分组现在工作更高效。
版本 1.02: 2020年8月30日
新功能！
** 新插件命令：“Picture: Erase All”。由Olivia添加。
*** 一次性擦除屏幕上的所有图片，因为逐个擦除实在太繁琐。
** 新插件命令：“Picture: Erase Range”
*** 在数字范围内擦除所有图片，因为逐个擦除实在太繁琐。
优化更新
** 添加了更准确的数字分组解析方式。
** Window_Base.prototype.textSizeEx现在将数据存储到缓存中。
文档更新
** 在主要更改：新硬编码功能部分添加了数字分组，并解释了其复杂性。
** 在插件参数 > UI > 重新定位角色中添加了一条注释，如果使用了Battle Core，则忽略该设置。
版本 1.01: 2020年8月23日
Bug修复！
** 修复了数字分组，使文本代码能够检测到大于1000的值。修复由Olivia和Yanfly完成。
** 修复了Param Plus、Rate、Flat标签。修复由Yanfly完成。
新的实验性功能添加：
** 在插件参数中添加了JS：Quick Functions。
版本 1.00: 2020年8月20日
完成的插件！
*
* ============================================================================
* End of Helpfile
* ============================================================================
*
* @ --------------------------------------------------------------------------
*
* @command Separator_Animation
* @text -
* @desc -
*
* @ --------------------------------------------------------------------------
*
* @command AnimationPoint
* @text Animation: Play at Coordinate
* @desc Plays an animation on the screen at a specific x, y
* coordinate even if there is no sprite attached.
*
* @arg AnimationID:num
* @text Animation ID
* @parent Animation
* @type animation
* @desc Plays this animation.
* @default 1
* 
* @arg Coordinates
*
* @arg pointX:eval
* @text X
* @parent Coordinates
* @desc X coordinate used for the animation.
* You may use JavaScript code.
* @default Graphics.width / 2
*
* @arg pointY:eval
* @text Y
* @parent Coordinates
* @desc Y coordinate used for the animation.
* You may use JavaScript code.
* @default Graphics.height / 2
*
* @arg Mirror:eval
* @text Mirror Animation?
* @parent Animation
* @type boolean
* @on Mirror
* @off Normal
* @desc Mirror the animation?
* @default false
*
* @arg Mute:eval
* @text Mute Animation?
* @parent Animation
* @type boolean
* @on Mute
* @off Normal
* @desc Mute the animation?
* @default false
* 
* @ --------------------------------------------------------------------------
*
* @command Separator_Audio
* @text -
* @desc -
*
* @ --------------------------------------------------------------------------
*
* @command AudioChangeBgmVolume
* @text Audio: Change Current BGM Volume
* @desc Changes the current BGM volume without changing any of the
* current BGM's other properties and without restarting the BGM.
*
* @arg volume:eval
* @text Volume
* @desc Change the current BGM's volume to what amount?
* You may use JavaScript code. Use numbers from 0 to 100.
* @default 100
* 
* @ --------------------------------------------------------------------------
*
* @command AudioChangeBgmPitch
* @text Audio: Change Current BGM Pitch
* @desc Changes the current BGM pitch without changing any of the
* current BGM's other properties and without restarting the BGM.
*
* @arg pitch:eval
* @text Pitch
* @desc Change the current BGM's pitch to what amount?
* You may use JavaScript code. Use numbers from 50 to 150.
* @default 100
* 
* @ --------------------------------------------------------------------------
*
* @command AudioChangeBgmPan
* @text Audio: Change Current BGM Pan
* @desc Changes the current BGM pan without changing any of the
* current BGM's other properties and without restarting the BGM.
*
* @arg pan:eval
* @text Pan
* @desc Change the current BGM's pan to what amount?
* You may use JavaScript code. Use numbers from -100 to 100.
* @default 0
* 
* @ --------------------------------------------------------------------------
*
* @command AudioChangeBgsVolume
* @text Audio: Change Current BGS Volume
* @desc Changes the current BGS volume without changing any of the
* current BGS's other properties and without restarting the BGS.
*
* @arg volume:eval
* @text Volume
* @desc Change the current BGS's volume to what amount?
* You may use JavaScript code. Use numbers from 0 to 100.
* @default 100
* 
* @ --------------------------------------------------------------------------
*
* @command AudioChangeBgsPitch
* @text Audio: Change Current BGS Pitch
* @desc Changes the current BGS pitch without changing any of the
* current BGS's other properties and without restarting the BGS.
*
* @arg pitch:eval
* @text Pitch
* @desc Change the current BGS's pitch to what amount?
* You may use JavaScript code. Use numbers from 50 to 150.
* @default 100
* 
* @ --------------------------------------------------------------------------
*
* @command AudioChangeBgsPan
* @text Audio: Change Current BGS Pan
* @desc Changes the current BGS pan without changing any of the
* current BGS's other properties and without restarting the BGS.
*
* @arg pan:eval
* @text Pan
* @desc Change the current BGS's pan to what amount?
* You may use JavaScript code. Use numbers from -100 to 100.
* @default 0
* 
* @ --------------------------------------------------------------------------
*
* @command Separator_Debug
* @text -
* @desc -
*
* @ --------------------------------------------------------------------------
*
* @command DebugConsoleLastControllerID
* @text Debug: Current Controller ID
* @desc PLAY TEST ONLY. Shows current controller ID in debug console.
* Also copies to computer clipboard if possible.
* 
* @ --------------------------------------------------------------------------
*
* @command Separator_Export
* @text -
* @desc -
*
* @ --------------------------------------------------------------------------
*
* @command ExportAllMapText
* @text Export: All Maps Text
* @desc PLAY TEST ONLY. Exports all of the text from all maps,
* their events, event pages, and any associated Common Events.
* 
* @ --------------------------------------------------------------------------
*
* @command ExportAllTroopText
* @text Export: All Troops Text
* @desc PLAY TEST ONLY. Exports all of the text from all troops,
* their event pages, and any associated Common Events.
* 
* @ --------------------------------------------------------------------------
*
* @command ExportCurMapText
* @text Export: Current Map Text
* @desc PLAY TEST ONLY. Exports all of the text on the current map,
* its events, the event pages, and any associated Common Events.
* 
* @ --------------------------------------------------------------------------
*
* @command ExportCurTroopText
* @text Export: Current Troop Text
* @desc PLAY TEST ONLY. Exports all of the text on the current troop,
* the troop's event pages, and any associated Common Events.
* 
* @ --------------------------------------------------------------------------
*
* @command Separator_Game
* @text -
* @desc -
*
* @ --------------------------------------------------------------------------
*
* @command OpenURL
* @text Game: Open URL
* @desc Opens a website URL from the game.
*
* @arg URL:str
* @text URL
* @desc Where do you want to take the player?
* @default https://www.google.com/
* 
* @ --------------------------------------------------------------------------
*
* @command Separator_Gold
* @text -
* @desc -
*
* @ --------------------------------------------------------------------------
*
* @command GoldChange
* @text Gold: Gain/Lose
* @desc Allows you to give/take more gold than the event editor limit.
*
* @arg value:eval
* @text Value
* @desc How much gold should the player gain/lose?
* Use negative values to remove gold. You may use JS.
* @default 0
*
* @ --------------------------------------------------------------------------
*
* @command Separator_Map
* @text -
* @desc -
*
* @ --------------------------------------------------------------------------
*
* @command MapOnceParallel
* @text Map: Once Parallel
* @desc Plays a Common Event parallel to the event once without
* repeating itself when done. Map only!
*
* @arg CommonEventID:num
* @text Common Event ID
* @type common_event
* @desc The ID of the parallel Common Event to play.
* Does NOT repeat itself when finished.
* @default 1
*
* @ --------------------------------------------------------------------------
*
* @command Separator_Picture
* @text -
* @desc -
*
* @ --------------------------------------------------------------------------
*
* @command PictureCoordinatesMode
* @text Picture: Coordinates Mode
* @desc Play Test Mode only! Gets the coordinates of a specific
* picture as you move it across the screen.
*
* @arg PictureID:num
* @text Picture ID
* @type number
* @min 1
* @max 100
* @desc The ID of the pictures to track the coordinates of.
* @default 1
*
* @ --------------------------------------------------------------------------
*
* @command PictureEasingType
* @text Picture: Easing Type
* @desc Changes the easing type to a number of options.
*
* @arg pictureId:num
* @text Picture ID
* @type number
* @min 1
* @max 100
* @desc Which picture do you wish to apply this easing to?
* @default 1
*
* @arg easingType:str
* @text Easing Type
* @type combo
* @option Linear
* @option InSine
* @option OutSine
* @option InOutSine
* @option InQuad
* @option OutQuad
* @option InOutQuad
* @option InCubic
* @option OutCubic
* @option InOutCubic
* @option InQuart
* @option OutQuart
* @option InOutQuart
* @option InQuint
* @option OutQuint
* @option InOutQuint
* @option InExpo
* @option OutExpo
* @option InOutExpo
* @option InCirc
* @option OutCirc
* @option InOutCirc
* @option InBack
* @option OutBack
* @option InOutBack
* @option InElastic
* @option OutElastic
* @option InOutElastic
* @option InBounce
* @option OutBounce
* @option InOutBounce
* @desc Select which easing type you wish to apply.
* @default Linear
*
* @arg LineBreak
* @text ------------------------
* @default --------------------------------
*
* @arg Instructions1
* @text Instructions
* @default Insert this Plugin Command after
*
* @arg Instructions2
* @text -
* @default a "Move Picture" event command.
* 
* @arg Instructions3
* @text -
* @default Turn off "Wait for Completion"
*
* @arg Instructions4
* @text -
* @default in the "Move Picture" event.
*
* @arg Instructions5
* @text -
* @default You may have to add in your own
*
* @arg Instructions6
* @text -
* @default "Wait" event command after.
*
* @ --------------------------------------------------------------------------
*
* @command PictureEraseAll
* @text Picture: Erase All
* @desc Erases all pictures on the screen because it's extremely
* tedious to do it one by one.
*
* @ --------------------------------------------------------------------------
*
* @command PictureEraseRange
* @text Picture: Erase Range
* @desc Erases all pictures within a range of numbers because it's
* extremely tedious to do it one by one.
*
* @arg StartID:num
* @text Starting ID
* @type number
* @min 1
* @max 100
* @desc The starting ID of the pictures to erase.
* @default 1
*
* @arg EndingID:num
* @text Ending ID
* @type number
* @min 1
* @max 100
* @desc The ending ID of the pictures to erase.
* @default 100
*
* @ --------------------------------------------------------------------------
*
* @command PictureRotateBy
* @text Picture: Rotate By Angle
* @desc Rotates target picture by a amount angle over a set duration
* instead of continuously.
* 
* @arg PictureID:eval
* @text Picture ID Number
* @desc What is the ID of the picture you wish to rotate? Use a
* number between 1 and 100. You may use JavaScript code.
* @default 1
* 
* @arg AdjustAngle:eval
* @text Adjust Angle
* @desc What is the angle you wish to rotate the picture by?
* Use degrees (360 degrees per full rotation).
* @default 0
*
* @arg easingType:str
* @text Easing Type
* @type combo
* @option Linear
* @option InSine
* @option OutSine
* @option InOutSine
* @option InQuad
* @option OutQuad
* @option InOutQuad
* @option InCubic
* @option OutCubic
* @option InOutCubic
* @option InQuart
* @option OutQuart
* @option InOutQuart
* @option InQuint
* @option OutQuint
* @option InOutQuint
* @option InExpo
* @option OutExpo
* @option InOutExpo
* @option InCirc
* @option OutCirc
* @option InOutCirc
* @option InBack
* @option OutBack
* @option InOutBack
* @option InElastic
* @option OutElastic
* @option InOutElastic
* @option InBounce
* @option OutBounce
* @option InOutBounce
* @desc Select which easing type you wish to apply.
* @default Linear
*
* @arg Duration:eval
* @text Duration
* @desc Duration of rotation effect in frames.
* 60 frames = 1 second. You may use JavaScript code.
* @default 60
*
* @arg Wait:eval
* @text Wait for Completion
* @parent Duration:eval
* @type boolean
* @on Wait
* @off Don't Wait
* @desc Wait until completion before moving onto the next event?
* @default true
*
* @ --------------------------------------------------------------------------
*
* @command PictureRotate
* @text Picture: Rotate to Angle
* @desc Rotates target picture to a certain angle over a set duration
* instead of continuously.
* 
* @arg PictureID:eval
* @text Picture ID Number
* @desc What is the ID of the picture you wish to rotate? Use a
* number between 1 and 100. You may use JavaScript code.
* @default 1
* 
* @arg TargetAngle:eval
* @text Target Angle
* @desc What is the target angle you wish to rotate the picture?
* Use degrees (360 degrees per full rotation).
* @default 0
*
* @arg easingType:str
* @text Easing Type
* @type combo
* @option Linear
* @option InSine
* @option OutSine
* @option InOutSine
* @option InQuad
* @option OutQuad
* @option InOutQuad
* @option InCubic
* @option OutCubic
* @option InOutCubic
* @option InQuart
* @option OutQuart
* @option InOutQuart
* @option InQuint
* @option OutQuint
* @option InOutQuint
* @option InExpo
* @option OutExpo
* @option InOutExpo
* @option InCirc
* @option OutCirc
* @option InOutCirc
* @option InBack
* @option OutBack
* @option InOutBack
* @option InElastic
* @option OutElastic
* @option InOutElastic
* @option InBounce
* @option OutBounce
* @option InOutBounce
* @desc Select which easing type you wish to apply.
* @default Linear
*
* @arg Duration:eval
* @text Duration
* @desc Duration of rotation effect in frames.
* 60 frames = 1 second. You may use JavaScript code.
* @default 60
*
* @arg Wait:eval
* @text Wait for Completion
* @parent Duration:eval
* @type boolean
* @on Wait
* @off Don't Wait
* @desc Wait until completion before moving onto the next event?
* @default true
*
* @ --------------------------------------------------------------------------
* 
* @command PictureShowIcon
* @text Picture: Show Icon
* @desc Shows an icon instead of a picture image.
* The picture icon can be controlled like any other picture.
* 
* @arg General
* 
* @arg PictureID:eval
* @text Picture ID Number
* @parent General
* @desc What is the ID of the picture you wish to show at? Use a
* number between 1 and 100. You may use JavaScript code.
* @default 1
* 
* @arg IconIndex:eval
* @text Icon Index
* @parent General
* @desc Select the icon index to use for this picture.
* You may use JavaScript code.
* @default 23
*
* @arg Smooth:eval
* @text Smooth Icon?
* @parent General
* @type boolean
* @on Smooth
* @off Pixelate
* @desc This will make the icon smoothed out or pixelated.
* @default false
* 
* @arg PictureSettings
* @text Picture Settings
*
* @arg Settings:struct
* @text Settings
* @parent PictureSettings
* @type struct<ShowPicture>
* @desc Alter the settings for how the picture will be shown.
* @default {"Position":"","Origin:num":"0","PositionX:eval":"0","PositionY:eval":"0","Scale":"","ScaleX:eval":"100","ScaleY:eval":"100","Blend":"","Opacity:eval":"255","BlendMode:num":"0"}
* 
* @ --------------------------------------------------------------------------
*
* @command Separator_ScreenShake
* @text -
* @desc -
*
* @ --------------------------------------------------------------------------
*
* @command ScreenShake
* @text Screen Shake: Custom
* @desc Creates a custom screen shake effect and also sets
* the following uses of screen shake to this style.
*
* @arg Type:str
* @text Shake Style
* @type select
* @option Original
* @value original
* @option Random
* @value random
* @option Horizontal
* @value horizontal
* @option Vertical
* @value vertical
* @desc Select shake style type.
* @default random
*
* @arg Power:num
* @text Power
* @type number
* @min 1
* @max 9
* @desc Power level for screen shake.
* @default 5
*
* @arg Speed:num
* @text Speed
* @type number
* @min 1
* @max 9
* @desc Speed level for screen shake.
* @default 5
*
* @arg Duration:eval
* @text Duration
* @desc Duration of screenshake.
* You can use code as well.
* @default 60
*
* @arg Wait:eval
* @text Wait for Completion
* @parent Duration:eval
* @type boolean
* @on Wait
* @off Don't Wait
* @desc Wait until completion before moving onto the next event?
* @default true
*
* @ --------------------------------------------------------------------------
*
* @command Separator_Switch
* @text -
* @desc -
*
* @ --------------------------------------------------------------------------
*
* @command SwitchRandomizeOne
* @text Switches: Randomize ID(s)
* @desc Select specific Switch ID's to randomize ON/OFF.
*
* @arg IDs:arraynum
* @text Switch ID(s)
* @type switch[]
* @desc Select which Switch ID(s) to toggle.
* @default ["1"]
*
* @arg Chance:num
* @text Chance for ON
* @type number
* @min 1
* @max 100
* @desc Chance out of 100 that determines the switches to be ON.
* @default 50
*
* @ --------------------------------------------------------------------------
*
* @command SwitchRandomizeRange
* @text Switches: Randomize Range
* @desc Select specific Switch ID Range to randomize ON/OFF.
* The ratio determines the ON/OFF distribution.
*
* @arg StartID:num
* @text Starting ID
* @type switch
* @desc The starting ID of the Switch to toggle.
* @default 1
*
* @arg EndingID:num
* @text Ending ID
* @type switch
* @desc The ending ID of the Switch to toggle.
* @default 20
*
* @arg Chance:num
* @text Chance for ON
* @type number
* @min 1
* @max 100
* @desc Chance out of 100 that determines the switches to be ON.
* @default 50
*
* @ --------------------------------------------------------------------------
*
* @command SwitchToggleOne
* @text Switches: Toggle ID(s)
* @desc Select specific Switch ID's to toggle ON/OFF.
* ON becomes OFF. OFF becomes ON.
*
* @arg IDs:arraynum
* @text Switch ID(s)
* @type switch[]
* @desc Select which Switch ID(s) to toggle.
* @default ["1"]
*
* @ --------------------------------------------------------------------------
*
* @command SwitchToggleRange
* @text Switches: Toggle Range
* @desc Select specific Switch ID Range to toggle ON/OFF.
* ON becomes OFF. OFF becomes ON.
*
* @arg StartID:num
* @text Starting ID
* @type switch
* @desc The starting ID of the Switch to toggle.
* @default 1
*
* @arg EndingID:num
* @text Ending ID
* @type switch
* @desc The ending ID of the Switch to toggle.
* @default 20
*
* @ --------------------------------------------------------------------------
*
* @command Separator_System
* @text -
* @desc -
*
* @ --------------------------------------------------------------------------
*
* @command SystemSetBattleSystem
* @text System: Battle System Change
* @desc Switch to a different battle system in-game.
* Some battle systems REQUIRE their specific plugins!
*
* @arg option:str
* @text Change To
* @type select
* @option Database Default (Use game database setting)
* @value database
* @option -
* @value database
* @option DTB: Default Turn Battle
* @value dtb
* @option TPB Active: Time Progress Battle (Active)
* @value tpb active
* @option TPB Wait: Time Progress Battle (Wait)
* @value tpb wait
* @option -
* @value database
* @option BTB: Brave Turn Battle (Req VisuMZ_2_BattleSystemBTB)
* @value btb
* @option CTB: Charge Turn Battle (Req VisuMZ_2_BattleSystemCTB)
* @value ctb
* @option ETB: Energy Turn Battle (Req VisuMZ_2_BattleSystemETB)
* @value etb
* @option FTB: Free Turn Battle (Req VisuMZ_2_BattleSystemFTB)
* @value ftb
* @option OTB: Order Turn Battle (Req VisuMZ_2_BattleSystemOTB)
* @value otb
* @option PTB: Press Turn Battle (Req VisuMZ_2_BattleSystemPTB)
* @value ptb
* @option STB: Standard Turn Battle (Req VisuMZ_2_BattleSystemSTB)
* @value stb
* @desc Choose which battle system to switch to.
* @default database
*
* @ --------------------------------------------------------------------------
*
* @command SystemLoadImages
* @text System: Load Images
* @desc Allows you to (pre) load up images ahead of time.
*
* @arg animations:arraystr
* @text img/animations/
* @type file[]
* @dir img/animations/
* @desc Which files do you wish to load from this directory?
* @default []
*
* @arg battlebacks1:arraystr
* @text img/battlebacks1/
* @type file[]
* @dir img/battlebacks1/
* @desc Which files do you wish to load from this directory?
* @default []
*
* @arg battlebacks2:arraystr
* @text img/battlebacks2/
* @type file[]
* @dir img/battlebacks2/
* @desc Which files do you wish to load from this directory?
* @default []
*
* @arg characters:arraystr
* @text img/characters/
* @type file[]
* @dir img/characters/
* @desc Which files do you wish to load from this directory?
* @default []
*
* @arg enemies:arraystr
* @text img/enemies/
* @type file[]
* @dir img/enemies/
* @desc Which files do you wish to load from this directory?
* @default []
*
* @arg faces:arraystr
* @text img/faces/
* @type file[]
* @dir img/faces/
* @desc Which files do you wish to load from this directory?
* @default []
*
* @arg parallaxes:arraystr
* @text img/parallaxes/
* @type file[]
* @dir img/parallaxes/
* @desc Which files do you wish to load from this directory?
* @default []
*
* @arg pictures:arraystr
* @text img/pictures/
* @type file[]
* @dir img/pictures/
* @desc Which files do you wish to load from this directory?
* @default []
*
* @arg sv_actors:arraystr
* @text img/sv_actors/
* @type file[]
* @dir img/sv_actors/
* @desc Which files do you wish to load from this directory?
* @default []
*
* @arg sv_enemies:arraystr
* @text img/sv_enemies/
* @type file[]
* @dir img/sv_enemies/
* @desc Which files do you wish to load from this directory?
* @default []
*
* @arg system:arraystr
* @text img/system/
* @type file[]
* @dir img/system/
* @desc Which files do you wish to load from this directory?
* @default []
*
* @arg tilesets:arraystr
* @text img/tilesets/
* @type file[]
* @dir img/tilesets/
* @desc Which files do you wish to load from this directory?
* @default []
*
* @arg titles1:arraystr
* @text img/titles1/
* @type file[]
* @dir img/titles1/
* @desc Which files do you wish to load from this directory?
* @default []
*
* @arg titles2:arraystr
* @text img/titles2/
* @type file[]
* @dir img/titles2/
* @desc Which files do you wish to load from this directory?
* @default []
*
* @ --------------------------------------------------------------------------
*
* @command SystemSetFontSize
* @text System: Main Font Size
* @desc Set the game's main font size.
*
* @arg option:num
* @text Change To
* @type number
* @min 1
* @desc Change the font size to this number.
* @default 26
*
* @ --------------------------------------------------------------------------
*
* @command SystemSetSideView
* @text System: Side View Battle
* @desc Switch between Front View or Side View for battle.
*
* @arg option:str
* @text Change To
* @type select
* @option Front View
* @value Front View
* @option Side View
* @value Side View
* @option Toggle
* @value Toggle
* @desc Choose which view type to switch to.
* @default Toggle
*
* @ --------------------------------------------------------------------------
*
* @command SystemSetWindowPadding
* @text System: Window Padding
* @desc Change the game's window padding amount.
*
* @arg option:num
* @text Change To
* @type number
* @min 1
* @desc Change the game's standard window padding to this value.
* Default: 12
* @default 12
*
* @ --------------------------------------------------------------------------
*
* @command Separator_TextPopup
* @text -
* @desc -
*
* @ --------------------------------------------------------------------------
*
* @command TextPopupShow
* @text Text Popup: Show Text
* @desc Adds text to a text popup window to briefly appear.
* Multiple text popups will be queued.
*
* @arg text:json
* @text Text
* @type note
* @desc Write the text that you want to appear here.
* You may use text codes.
* @default "Insert message here."
*
* @ --------------------------------------------------------------------------
*
* @command Separator_Variable
* @text -
* @desc -
*
* @ --------------------------------------------------------------------------
*
* @command VariableEvalReference
* @text Variable: JS Eval
* @desc Pick a variable ID and value to alter through JS.
* Functions like RM2k3's Variable Pointers.
*
* @arg id:eval
* @text Variable ID
* @desc This is the target variable to alter.
* You may use JavaScript. ie: $gameVariables.value(1)
* @default 1
*
* @arg operation:str
* @text Operation Type
* @type select
* @option Set
* @value =
* @option Add
* @value +
* @option Sub
* @value -
* @option Mul
* @value *
* @option Div
* @value /
* @option Mod
* @value %
* @desc What operation do you wish to use for this Plugin Command?
* @default =
*
* @arg operand:eval
* @text Operand Modifier
* @desc Value to be used in calculating the target variable.
* You may use JavaScript. ie: $gameVariables.value(1)
* @default 0
*
* @ --------------------------------------------------------------------------
*
* @command VariableJsBlock
* @text Variable: JS Block
* @desc Pick a variable ID and value to alter through JS.
* Functions like RM2k3's Variable Pointers.
*
* @arg id:func
* @text Variable ID
* @type note
* @desc This is the target variable to alter.
* You may use JavaScript. ie: $gameVariables.value(1)
* @default "// Declare Variables\nlet varID = 1;\n\n// Perform Calculations\n\n// Return Variable ID\nreturn varID;"
*
* @arg operation:str
* @text Operation Type
* @type select
* @option Set
* @value =
* @option Add
* @value +
* @option Sub
* @value -
* @option Mul
* @value *
* @option Div
* @value /
* @option Mod
* @value %
* @desc What operation do you wish to use for this Plugin Command?
* @default =
*
* @arg operand:func
* @text Operand Modifier
* @type note
* @desc Value to be used in calculating the target variable.
* You may use JavaScript. ie: $gameVariables.value(1)
* @default "// Declare Variables\nlet value = 0;\n\n// Perform Calculations\n\n// Return Variable ID\nreturn value;"
*
* @ --------------------------------------------------------------------------
*
* @command Separator_End
* @text -
* @desc -
*
* @ --------------------------------------------------------------------------
*
* @ ==========================================================================
* @ Plugin Parameters
* @ ==========================================================================
*
* @param BreakHead
* @text --------------------------
* @default ----------------------------------
*
* @param CoreEngine
* @default 插件参数
* @param ATTENTION
* @default 请阅读帮助文件

*
* @param BreakSettings
* @text --------------------------
* @default ----------------------------------
*
* @param QoL:struct
* @text 生活质量设置
* @type struct<QoLSettings>
* @desc 开发者和玩家的生活质量设置。
* @default {"PlayTest":"","NewGameBoot:eval":"true","ForceNoPlayTest:eval":"false","OpenConsole:eval":"true","F6key:eval":"true","F7key:eval":"true","NewGameCommonEvent:num":"0","BattleTest":"","BTestItems:eval":"true","BTestWeapons:eval":"true","BTestArmors:eval":"true","BTestAddedQuantity:num":"90","ShiftR_Toggle:eval":"true","ShiftT_Toggle:eval":"true","DigitGrouping":"","DigitGroupingStandardText:eval":"true","DigitGroupingExText:eval":"true","DigitGroupingDamageSprites:eval":"true","DigitGroupingGaugeSprites:eval":"true","DigitGroupingLocale:str":"en-US","PlayerBenefit":"","EncounterRateMinimum:num":"10","EscapeAlways:eval":"true","ImprovedAccuracySystem:eval":"true","AccuracyBoost:eval":"true","LevelUpFullHp:eval":"true","LevelUpFullMp:eval":"true","Pictures":"","AntiZoomPictures:eval":"true","PictureContainers":"","DetachBattlePictureContainer:eval":"false","DetachMapPictureContainer:eval":"false","Misc":"","AnimationMirrorOffset:eval":"false","AutoStretch:str":"default","FontShadows:eval":"false","FontSmoothing:eval":"true","FontWidthFix:eval":"true","KeyItemProtect:eval":"true","MapNameTextCode:eval":"true","ModernControls:eval":"true","MvAnimationRate:num":"4","NewGameCommonEventAll:num":"0","NoTileShadows:eval":"false","PixelateImageRendering:eval":"false","RequireFocus:eval":"false","ShortcutScripts:eval":"true","SmartEventCollisionPriority:eval":"true","SubfolderParse:eval":"true"}
* 
* @param BattleSystem:str
* @text 战斗系统
* @type select
* @option 数据库默认（使用游戏数据库设置）
* @value database
* @option -
* @value database
* @option DTB：默认轮次战斗
* @value dtb
* @option TPB 主动：时间进度战斗（主动）
* @value tpb active
* @option TPB 等待：时间进度战斗（等待）
* @value tpb wait
* @option -
* @value database
* @option BTB：勇者轮次战斗（需要 VisuMZ_2_BattleSystemBTB 插件）
* @value btb
* @option CTB：充能轮次战斗（需要 VisuMZ_2_BattleSystemCTB 插件）
* @value ctb
* @option ETB：能量轮次战斗（需要 VisuMZ_2_BattleSystemETB 插件）
* @value etb
* @option FTB：自由轮次战斗（需要 VisuMZ_2_BattleSystemFTB 插件）
* @value ftb
* @option OTB：指令轮次战斗（需要 VisuMZ_2_BattleSystemOTB 插件）
* @value otb
* @option PTB：按键轮次战斗（需要 VisuMZ_2_BattleSystemPTB 插件）
* @value ptb
* @option STB：标准轮次战斗（需要 VisuMZ_2_BattleSystemSTB 插件）
* @value stb
* @desc 选择游戏中使用的战斗系统。
* 一些战斗系统需要使用特定的插件！
* @default database
*
* @param Color:struct
* @text 颜色设置
* @type struct<Color>
* @desc 修改游戏中使用的文本颜色。
* @default {"BasicColors":"","ColorNormal:str":"0","ColorSystem:str":"16","ColorCrisis:str":"17","ColorDeath:str":"18","ColorGaugeBack:str":"19","ColorHPGauge1:str":"20","ColorHPGauge2:str":"21","ColorMPGauge1:str":"22","ColorMPGauge2:str":"23","ColorMPCost:str":"23","ColorPowerUp:str":"24","ColorPowerDown:str":"25","ColorCTGauge1:str":"26","ColorCTGauge2:str":"27","ColorTPGauge1:str":"28","ColorTPGauge2:str":"29","ColorTPCost:str":"29","ColorPending:str":"#2a847d","ColorExpGauge1:str":"30","ColorExpGauge2:str":"31","ColorMaxLvGauge1:str":"14","ColorMaxLvGauge2:str":"6","AlphaColors":"","OutlineColor:str":"rgba(0, 0, 0, 0.6)","DimColor1:str":"rgba(0, 0, 0, 0.6)","DimColor2:str":"rgba(0, 0, 0, 0)","ItemBackColor1:str":"rgba(32, 32, 32, 0.5)","ItemBackColor2:str":"rgba(0, 0, 0, 0.5)","ConditionalColors":"","ActorHPColor:func":"\"// Set the variables used in this function.\\nlet actor = arguments[0];\\n\\n// Check if the actor exists. If not, return normal.\\nif (!actor) {\\n    return this.normalColor();\\n\\n// If the actor is dead, return death color.\\n} else if (actor.isDead()) {\\n    return this.deathColor();\\n\\n// If the actor is dying, return crisis color.\\n} else if (actor.isDying()) {\\n    return this.crisisColor();\\n\\n// Otherwise, return the normal color.\\n} else {\\n    return this.normalColor();\\n}\"","ActorMPColor:func":"\"// Set the variables used in this function.\\nlet actor = arguments[0];\\n\\n// Check if the actor exists. If not, return normal.\\nif (!actor) {\\n    return this.normalColor();\\n\\n// If MP rate is below 25%, return crisis color.\\n} else if (actor.mpRate() < 0.25) {\\n    return this.crisisColor();\\n\\n// Otherwise, return the normal color.\\n} else {\\n    return this.normalColor();\\n}\"","ActorTPColor:func":"\"// Set the variables used in this function.\\nlet actor = arguments[0];\\n\\n// Check if the actor exists. If not, return normal.\\nif (!actor) {\\n    return this.normalColor();\\n\\n// If TP rate is below 25%, return crisis color.\\n} else if (actor.tpRate() < 0.25) {\\n    return this.crisisColor();\\n\\n// Otherwise, return the normal color.\\n} else {\\n    return this.normalColor();\\n}\"","ParamChange:func":"\"// Set the variables used in this function.\\nlet change = arguments[0];\\n\\n// If a positive change, use power up color.\\nif (change > 0) {\\n    return this.powerUpColor();\\n\\n// If a negative change, use power down color.\\n} else if (change < 0) {\\n    return this.powerDownColor();\\n\\n// Otherwise, return the normal color.\\n} else {\\n    return this.normalColor();\\n}\"","DamageColor:func":"\"// Set the variables used in this function.\\nlet colorType = arguments[0];\\n\\n// Check the value of the color type\\n// and return an appropriate color.\\nswitch (colorType) {\\n\\n    case 0: // HP damage\\n        return \\\"#ffffff\\\";\\n\\n    case 1: // HP recover\\n        return \\\"#b9ffb5\\\";\\n\\n    case 2: // MP damage\\n        return \\\"#bb88bb\\\";\\n\\n    case 3: // MP recover\\n        return \\\"#80b0ff\\\";\\n\\n    default:\\n        return \\\"#808080\\\";\\n}\""}
*
* @param Gold:struct
* @text 金币设置
* @type struct<Gold>
* @desc 修改游戏中黄金的操作和显示方式。
* @default {"GoldMax:num":"999999999","GoldFontSize:num":"24","GoldIcon:num":"314","GoldOverlap:str":"很多","ItemStyle:eval":"true"}

*
** @param ImgLoad:struct
* @text 图片加载
* @type struct<ImgLoad>
* @desc 游戏启动时将加载的游戏图片。
* 负责任地使用此功能！！！
* @default {"animations:arraystr":"[]","battlebacks1:arraystr":"[]","battlebacks2:arraystr":"[]","characters:arraystr":"[]","enemies:arraystr":"[]","faces:arraystr":"[]","parallaxes:arraystr":"[]","pictures:arraystr":"[]","sv_actors:arraystr":"[]","sv_enemies:arraystr":"[]","system:arraystr":"[\"Balloon\",\"IconSet\"]","tilesets:arraystr":"[]","titles1:arraystr":"[]","titles2:arraystr":"[]"}
*
* @param KeyboardInput:struct
* @text 键盘输入
* @type struct<KeyboardInput>
* @desc 使用键盘输入的游戏设置。
* @default {"Controls":"","WASD:eval":"false","DashToggleR:eval":"false","NameInput":"","EnableNameInput:eval":"true","DefaultMode:str":"keyboard","QwertyLayout:eval":"true","NameInputMessage:eval":"\"Type in this character's name.\\nPress \\\\c[5]ENTER\\\\c[0] when you're done.\\n\\n-or-\\n\\nPress \\\\c[5]arrow keys\\\\c[0]/\\\\c[5]TAB\\\\c[0] to switch\\nto manual character entry.\\n\\nPress \\\\c[5]ESC\\\\c[0]/\\\\c[5]TAB\\\\c[0] to use to keyboard.\"","NumberInput":"","EnableNumberInput:eval":"true","ButtonAssist":"","Keyboard:str":"Keyboard","Manual:str":"Manual"}
*
* @param MenuBg:struct
* @text 菜单背景设置
* @type struct<MenuBg>
* @desc 修改每个场景菜单背景的外观。
* @default {"Scene_Menu:struct":"{\"SnapshotOpacity:num\":\"192\",\"BgFilename1:str\":\"\",\"BgFilename2:str\":\"\"}","Scene_Item:struct":"{\"SnapshotOpacity:num\":\"192\",\"BgFilename1:str\":\"\",\"BgFilename2:str\":\"\"}","Scene_Skill:struct":"{\"SnapshotOpacity:num\":\"192\",\"BgFilename1:str\":\"\",\"BgFilename2:str\":\"\"}","Scene_Equip:struct":"{\"SnapshotOpacity:num\":\"192\",\"BgFilename1:str\":\"\",\"BgFilename2:str\":\"\"}","Scene_Status:struct":"{\"SnapshotOpacity:num\":\"192\",\"BgFilename1:str\":\"\",\"BgFilename2:str\":\"\"}","Scene_Options:struct":"{\"SnapshotOpacity:num\":\"192\",\"BgFilename1:str\":\"\",\"BgFilename2:str\":\"\"}","Scene_Save:struct":"{\"SnapshotOpacity:num\":\"192\",\"BgFilename1:str\":\"\",\"BgFilename2:str\":\"\"}","Scene_Load:struct":"{\"SnapshotOpacity:num\":\"192\",\"BgFilename1:str\":\"\",\"BgFilename2:str\":\"\"}","Scene_GameEnd:struct":"{\"SnapshotOpacity:num\":\"128\",\"BgFilename1:str\":\"\",\"BgFilename2:str\":\"\"}","Scene_Shop:struct":"{\"SnapshotOpacity:num\":\"192\",\"BgFilename1:str\":\"\",\"BgFilename2:str\":\"\"}","Scene_Name:struct":"{\"SnapshotOpacity:num\":\"192\",\"BgFilename1:str\":\"\",\"BgFilename2:str\":\"\"}","Scene_Unlisted:struct":"{\"SnapshotOpacity:num\":\"192\",\"BgFilename1:str\":\"\",\"BgFilename2:str\":\"\"}"}
*
* @param ButtonAssist:struct
* @text 菜单按钮辅助窗口
* @type struct<ButtonAssist>
* @desc 关于游戏菜单中按钮辅助窗口的设置。
* @default {"General":"","Enable:eval":"true","Location:str":"bottom","BgType:num":"0","Text":"","TextFmt:str":"%1:%2","MultiKeyFmt:str":"%1/%2","OkText:str":"Select","CancelText:str":"Back","SwitchActorText:str":"Switch Ally","Keys":"","KeyUnlisted:str":"\\}❪%1❫\\{","KeyUP:str":"^","KeyDOWN:str":"v","KeyLEFT:str":"<<","KeyRIGHT:str":">>","KeySHIFT:str":"\\}❪SHIFT❫\\{","KeyTAB:str":"\\}❪TAB❫\\{","KeyA:str":"A","KeyB:str":"B","KeyC:str":"C","KeyD:str":"D","KeyE:str":"E","KeyF:str":"F","KeyG:str":"G","KeyH:str":"H","KeyI:str":"I","KeyJ:str":"J","KeyK:str":"K","KeyL:str":"L","KeyM:str":"M","KeyN:str":"N","KeyO:str":"O","KeyP:str":"P","KeyQ:str":"Q","KeyR:str":"R","KeyS:str":"S","KeyT:str":"T","KeyU:str":"U","KeyV:str":"V","KeyW:str":"W","KeyX:str":"X","KeyY:str":"Y","KeyZ:str":"Z"}
*
* @param ControllerButtons:arraystruct
* @text 控制器按钮辅助
* @parent ButtonAssist:struct
* @type struct<ControllerButtons>[]
* @desc 当使用不同的控制器时，在按钮辅助窗口中显示不同的图标。
* @default []
*
* @param MenuLayout:struct
* @text 菜单布局设置
* @type struct<MenuLayout>
* @desc 修改每个场景中菜单布局的外观。

* @default {"Title:struct":"{\"TitleScreen\":\"\",\"DocumentTitleFmt:str\":\"%1: %2 - Version %3\",\"Subtitle:str\":\"Subtitle\",\"Version:str\":\"0.00\",\"drawGameTitle:func\":\"\\\"const x = 20;\\\\nconst y = Graphics.height / 4;\\\\nconst maxWidth = Graphics.width - x * 2;\\\\nconst text = $dataSystem.gameTitle;\\\\nconst bitmap = this._gameTitleSprite.bitmap;\\\\nbitmap.fontFace = $gameSystem.mainFontFace();\\\\nbitmap.outlineColor = \\\\\\\"black\\\\\\\";\\\\nbitmap.outlineWidth = 8;\\\\nbitmap.fontSize = 72;\\\\nbitmap.drawText(text, x, y, maxWidth, 48, \\\\\\\"center\\\\\\\");\\\"\",\"drawGameSubtitle:func\":\"\\\"const x = 20;\\\\nconst y = Graphics.height / 4 + 72;\\\\nconst maxWidth = Graphics.width - x * 2;\\\\nconst text = Scene_Title.subtitle;\\\\nconst bitmap = this._gameTitleSprite.bitmap;\\\\nbitmap.fontFace = $gameSystem.mainFontFace();\\\\nbitmap.outlineColor = \\\\\\\"black\\\\\\\";\\\\nbitmap.outlineWidth = 6;\\\\nbitmap.fontSize = 48;\\\\nbitmap.drawText(text, x, y, maxWidth, 48, \\\\\\\"center\\\\\\\");\\\"\",\"drawGameVersion:func\":\"\\\"const bitmap = this._gameTitleSprite.bitmap;\\\\nconst x = 0;\\\\nconst y = Graphics.height - 20;\\\\nconst width = Math.round(Graphics.width / 4);\\\\nconst height = 20;\\\\nconst c1 = ColorManager.dimColor1();\\\\nconst c2 = ColorManager.dimColor2();\\\\nconst text = 'Version ' + Scene_Title.version;\\\\nbitmap.gradientFillRect(x, y, width, height, c1, c2);\\\\nbitmap.fontFace = $gameSystem.mainFontFace();\\\\nbitmap.outlineColor = \\\\\\\"black\\\\\\\";\\\\nbitmap.outlineWidth = 3;\\\\nbitmap.fontSize = 16;\\\\nbitmap.drawText(text, x + 4, y, Graphics.width, height, \\\\\\\"left\\\\\\\");\\\"\",\"CommandRect:func\":\"\\\"const offsetX = $dataSystem.titleCommandWindow.offsetX;\\\\nconst offsetY = $dataSystem.titleCommandWindow.offsetY;\\\\nconst rows = this.commandWindowRows();\\\\nconst width = this.mainCommandWidth();\\\\nconst height = this.calcWindowHeight(rows, true);\\\\nconst x = (Graphics.boxWidth - width) / 2 + offsetX;\\\\nconst y = Graphics.boxHeight - height - 96 + offsetY;\\\\nreturn new Rectangle(x, y, width, height);\\\"\",\"ButtonFadeSpeed:num\":\"4\"}","MainMenu:struct":"{\"CommandWindow\":\"\",\"CommandBgType:num\":\"0\",\"CommandRect:func\":\"\\\"const width = this.mainCommandWidth();\\\\nconst height = this.mainAreaHeight() - this.goldWindowRect().height;\\\\nconst x = this.isRightInputMode() ? Graphics.boxWidth - width : 0;\\\\nconst y = this.mainAreaTop();\\\\nreturn new Rectangle(x, y, width, height);\\\"\",\"GoldWindow\":\"\",\"GoldBgType:num\":\"0\",\"GoldRect:func\":\"\\\"const rows = 1;\\\\nconst width = this.mainCommandWidth();\\\\nconst height = this.calcWindowHeight(rows, true);\\\\nconst x = this.isRightInputMode() ? Graphics.boxWidth - width : 0;\\\\nconst y = this.mainAreaBottom() - height;\\\\nreturn new Rectangle(x, y, width, height);\\\"\",\"StatusWindow\":\"\",\"StatusBgType:num\":\"0\",\"StatusRect:func\":\"\\\"const width = Graphics.boxWidth - this.mainCommandWidth();\\\\nconst height = this.mainAreaHeight();\\\\nconst x = this.isRightInputMode() ? 0 : Graphics.boxWidth - width;\\\\nconst y = this.mainAreaTop();\\\\nreturn new Rectangle(x, y, width, height);\\\"\"}","ItemMenu:struct":"{\"HelpWindow\":\"\",\"HelpBgType:num\":\"0\",\"HelpRect:func\":\"\\\"const x = 0;\\\\nconst y = this.helpAreaTop();\\\\nconst width = Graphics.boxWidth;\\\\nconst height = this.helpAreaHeight();\\\\nreturn new Rectangle(x, y, width, height);\\\"\",\"CategoryWindow\":\"\",\"CategoryBgType:num\":\"0\",\"CategoryRect:func\":\"\\\"const x = 0;\\\\nconst y = this.mainAreaTop();\\\\nconst rows = 1;\\\\nconst width = Graphics.boxWidth;\\\\nconst height = this.calcWindowHeight(rows, true);\\\\nreturn new Rectangle(x, y, width, height);\\\"\",\"ItemWindow\":\"\",\"ItemBgType:num\":\"0\",\"ItemRect:func\":\"\\\"const x = 0;\\\\nconst y = this._categoryWindow.y + this._categoryWindow.height;\\\\nconst width = Graphics.boxWidth;\\\\nconst height = this.mainAreaBottom() - y;\\\\nreturn new Rectangle(x, y, width, height);\\\"\",\"ActorWindow\":\"\",\"ActorBgType:num\":\"0\",\"ActorRect:func\":\"\\\"const x = 0;\\\\nconst y = this.mainAreaTop();\\\\nconst width = Graphics.boxWidth;\\\\nconst height = this.mainAreaHeight();\\\\nreturn new Rectangle(x, y, width, height);\\\"\"}","SkillMenu:struct":"{\"HelpWindow\":\"\",\"HelpBgType:num\":\"0\",\"HelpRect:func\":\"\\\"const x = 0;\\\\nconst y = this.helpAreaTop();\\\\nconst width = Graphics.boxWidth;\\\\nconst height = this.helpAreaHeight();\\\\nreturn new Rectangle(x, y, width, height);\\\"\",\"SkillTypeWindow\":\"\",\"SkillTypeBgType:num\":\"0\",\"SkillTypeRect:func\":\"\\\"const rows = 3;\\\\nconst width = this.mainCommandWidth();\\\\nconst height = this.calcWindowHeight(rows, true);\\\\nconst x = this.isRightInputMode() ? Graphics.boxWidth - width : 0;\\\\nconst y = this.mainAreaTop();\\\\nreturn new Rectangle(x, y, width, height);\\\"\",\"StatusWindow\":\"\",\"StatusBgType:num\":\"0\",\"StatusRect:func\":\"\\\"const width = Graphics.boxWidth - this.mainCommandWidth();\\\\nconst height = this._skillTypeWindow.height;\\\\nconst x = this.isRightInputMode() ? 0 : Graphics.boxWidth - width;\\\\nconst y = this.mainAreaTop();\\\\nreturn new Rectangle(x, y, width, height);\\\"\",\"ItemWindow\":\"\",\"ItemBgType:num\":\"0\",\"ItemRect:func\":\"\\\"const x = 0;\\\\nconst y = this._statusWindow.y + this._statusWindow.height;\\\\nconst width = Graphics.boxWidth;\\\\nconst height = this.mainAreaHeight() - this._statusWindow.height;\\\\nreturn new Rectangle(x, y, width, height);\\\"\",\"ActorWindow\":\"\",\"ActorBgType:num\":\"0\",\"ActorRect:func\":\"\\\"const x = 0;\\\\nconst y = this.mainAreaTop();\\\\nconst width = Graphics.boxWidth;\\\\nconst height = this.mainAreaHeight();\\\\nreturn new Rectangle(x, y, width, height);\\\"\"}","EquipMenu:struct":"{\"HelpWindow\":\"\",\"HelpBgType:num\":\"0\",\"HelpRect:func\":\"\\\"const x = 0;\\\\nconst y = this.helpAreaTop();\\\\nconst width = Graphics.boxWidth;\\\\nconst height = this.helpAreaHeight();\\\\nreturn new Rectangle(x, y, width, height);\\\"\",\"StatusWindow\":\"\",\"StatusBgType:num\":\"0\",\"StatusRect:func\":\"\\\"const x = 0;\\\\nconst y = this.mainAreaTop();\\\\nconst width = this.statusWidth();\\\\nconst height = this.mainAreaHeight();\\\\nreturn new Rectangle(x, y, width, height);\\\"\",\"CommandWindow\":\"\",\"CommandBgType:num\":\"0\",\"CommandRect:func\":\"\\\"const x = this.statusWidth();\\\\nconst y = this.mainAreaTop();\\\\nconst rows = 1;\\\\nconst width = Graphics.boxWidth - this.statusWidth();\\\\nconst height = this.calcWindowHeight(rows, true);\\\\nreturn new Rectangle(x, y, width, height);\\\"\",\"SlotWindow\":\"\",\"SlotBgType:num\":\"0\",\"SlotRect:func\":\"\\\"const commandWindowRect = this.commandWindowRect();\\\\nconst x = this.statusWidth();\\\\nconst y = commandWindowRect.y + commandWindowRect.height;\\\\nconst width = Graphics.boxWidth - this.statusWidth();\\\\nconst height = this.mainAreaHeight() - commandWindowRect.height;\\\\nreturn new Rectangle(x, y, width, height);\\\"\",\"ItemWindow\":\"\",\"ItemBgType:num\":\"0\",\"ItemRect:func\":\"\\\"return this.slotWindowRect();\\\"\"}","StatusMenu:struct":"{\"ProfileWindow\":\"\",\"ProfileBgType:num\":\"0\",\"ProfileRect:func\":\"\\\"const width = Graphics.boxWidth;\\\\nconst height = this.profileHeight();\\\\nconst x = 0;\\\\nconst y = this.mainAreaBottom() - height;\\\\nreturn new Rectangle(x, y, width, height);\\\"\",\"StatusWindow\":\"\",\"StatusBgType:num\":\"0\",\"StatusRect:func\":\"\\\"const x = 0;\\\\nconst y = this.mainAreaTop();\\\\nconst width = Graphics.boxWidth;\\\\nconst height = this.statusParamsWindowRect().y - y;\\\\nreturn new Rectangle(x, y, width, height);\\\"\",\"StatusParamsWindow\":\"\",\"StatusParamsBgType:num\":\"0\",\"StatusParamsRect:func\":\"\\\"const width = this.statusParamsWidth();\\\\nconst height = this.statusParamsHeight();\\\\nconst x = 0;\\\\nconst y = this.mainAreaBottom() - this.profileHeight() - height;\\\\nreturn new Rectangle(x, y, width, height);\\\"\",\"StatusEquipWindow\":\"\",\"StatusEquipBgType:num\":\"0\",\"StatusEquipRect:func\":\"\\\"const width = Graphics.boxWidth - this.statusParamsWidth();\\\\nconst height = this.statusParamsHeight();\\\\nconst x = this.statusParamsWidth();\\\\nconst y = this.mainAreaBottom() - this.profileHeight() - height;\\\\nreturn new Rectangle(x, y, width, height);\\\"\"}","OptionsMenu:struct":"{\"OptionsWindow\":\"\",\"OptionsBgType:num\":\"0\",\"OptionsRect:func\":\"\\\"const n = Math.min(this.maxCommands(), this.maxVisibleCommands());\\\\nconst width = 400;\\\\nconst height = this.calcWindowHeight(n, true);\\\\nconst x = (Graphics.boxWidth - width) / 2;\\\\nconst y = (Graphics.boxHeight - height) / 2;\\\\nreturn new Rectangle(x, y, width, height);\\\"\"}","SaveMenu:struct":"{\"HelpWindow\":\"\",\"HelpBgType:num\":\"0\",\"HelpRect:func\":\"\\\"const x = 0;\\\\nconst y = this.mainAreaTop();\\\\nconst rows = 1;\\\\nconst width = Graphics.boxWidth;\\\\nconst height = this.calcWindowHeight(rows, false);\\\\nreturn new Rectangle(x, y, width, height);\\\"\",\"ListWindow\":\"\",\"ListBgType:num\":\"0\",\"ListRect:func\":\"\\\"const x = 0;\\\\nconst y = this.mainAreaTop() + this._helpWindow.height;\\\\nconst width = Graphics.boxWidth;\\\\nconst height = this.mainAreaHeight() - this._helpWindow.height;\\\\nreturn new Rectangle(x, y, width, height);\\\"\"}","LoadMenu:struct":"{\"HelpWindow\":\"\",\"HelpBgType:num\":\"0\",\"HelpRect:func\":\"\\\"const x = 0;\\\\nconst y = this.mainAreaTop();\\\\nconst rows = 1;\\\\nconst width = Graphics.boxWidth;\\\\nconst height = this.calcWindowHeight(rows, false);\\\\nreturn new Rectangle(x, y, width, height);\\\"\",\"ListWindow\":\"\",\"ListBgType:num\":\"0\",\"ListRect:func\":\"\\\"const x = 0;\\\\nconst y = this.mainAreaTop() + this._helpWindow.height;\\\\nconst width = Graphics.boxWidth;\\\\nconst height = this.mainAreaHeight() - this._helpWindow.height;\\\\nreturn new Rectangle(x, y, width, height);\\\"\"}","GameEnd:struct":"{\"CommandList:arraystruct\":\"[\\\"{\\\\\\\"Symbol:str\\\\\\\":\\\\\\\"toTitle\\\\\\\",\\\\\\\"TextStr:str\\\\\\\":\\\\\\\"Untitled\\\\\\\",\\\\\\\"TextJS:func\\\\\\\":\\\\\\\"\\\\\\\\\\\\\\\"return TextManager.toTitle;\\\\\\\\\\\\\\\"\\\\\\\",\\\\\\\"ShowJS:func\\\\\\\":\\\\\\\"\\\\\\\\\\\\\\\"return true;\\\\\\\\\\\\\\\"\\\\\\\",\\\\\\\"EnableJS:func\\\\\\\":\\\\\\\"\\\\\\\\\\\\\\\"return true;\\\\\\\\\\\\\\\"\\\\\\\",\\\\\\\"ExtJS:func\\\\\\\":\\\\\\\"\\\\\\\\\\\\\\\"return null;\\\\\\\\\\\\\\\"\\\\\\\",\\\\\\\"CallHandlerJS:func\\\\\\\":\\\\\\\"\\\\\\\\\\\\\\\"SceneManager._scene.commandToTitle();\\\\\\\\\\\\\\\"\\\\\\\"}\\\",\\\"{\\\\\\\"Symbol:str\\\\\\\":\\\\\\\"cancel\\\\\\\",\\\\\\\"TextStr:str\\\\\\\":\\\\\\\"Untitled\\\\\\\",\\\\\\\"TextJS:func\\\\\\\":\\\\\\\"\\\\\\\\\\\\\\\"return TextManager.cancel;\\\\\\\\\\\\\\\"\\\\\\\",\\\\\\\"ShowJS:func\\\\\\\":\\\\\\\"\\\\\\\\\\\\\\\"return true;\\\\\\\\\\\\\\\"\\\\\\\",\\\\\\\"EnableJS:func\\\\\\\":\\\\\\\"\\\\\\\\\\\\\\\"return true;\\\\\\\\\\\\\\\"\\\\\\\",\\\\\\\"ExtJS:func\\\\\\\":\\\\\\\"\\\\\\\\\\\\\\\"return null;\\\\\\\\\\\\\\\"\\\\\\\",\\\\\\\"CallHandlerJS:func\\\\\\\":\\\\\\\"\\\\\\\\\\\\\\\"SceneManager._scene.popScene();\\\\\\\\\\\\\\\"\\\\\\\"}\\\"]\",\"CommandBgType:num\":\"0\",\"CommandRect:func\":\"\\\"const rows = 2;\\\\nconst width = this.mainCommandWidth();\\\\nconst height = this.calcWindowHeight(rows, true);\\\\nconst x = (Graphics.boxWidth - width) / 2;\\\\nconst y = (Graphics.boxHeight - height) / 2;\\\\nreturn new Rectangle(x, y, width, height);\\\"\"}","ShopMenu:struct":"{\"HelpWindow\":\"\",\"HelpBgType:num\":\"0\",\"HelpRect:func\":\"\\\"const wx = 0;\\\\nconst wy = this.helpAreaTop();\\\\nconst ww = Graphics.boxWidth;\\\\nconst wh = this.helpAreaHeight();\\\\nreturn new Rectangle(wx, wy, ww, wh);\\\"\",\"GoldWindow\":\"\",\"GoldBgType:num\":\"0\",\"GoldRect:func\":\"\\\"const rows = 1;\\\\nconst width = this.mainCommandWidth();\\\\nconst height = this.calcWindowHeight(rows, true);\\\\nconst x = Graphics.boxWidth - width;\\\\nconst y = this.mainAreaTop();\\\\nreturn new Rectangle(x, y, width, height);\\\"\",\"CommandWindow\":\"\",\"CommandBgType:num\":\"0\",\"CommandRect:func\":\"\\\"const x = 0;\\\\nconst y = this.mainAreaTop();\\\\nconst rows = 1;\\\\nconst width = this._goldWindow.x;\\\\nconst height = this.calcWindowHeight(rows, true);\\\\nreturn new Rectangle(x, y, width, height);\\\"\",\"DummyWindow\":\"\",\"DummyBgType:num\":\"0\",\"DummyRect:func\":\"\\\"const x = 0;\\\\nconst y = this._commandWindow.y + this._commandWindow.height;\\\\nconst width = Graphics.boxWidth;\\\\nconst height = this.mainAreaHeight() - this._commandWindow.height;\\\\nreturn new Rectangle(x, y, width, height);\\\"\",\"NumberWindow\":\"\",\"NumberBgType:num\":\"0\",\"NumberRect:func\":\"\\\"const x = 0;\\\\nconst y = this._dummyWindow.y;\\\\nconst width = Graphics.boxWidth - this.statusWidth();\\\\nconst height = this._dummyWindow.height;\\\\nreturn new Rectangle(x, y, width, height);\\\"\",\"StatusWindow\":\"\",\"StatusBgType:num\":\"0\",\"StatusRect:func\":\"\\\"const width = this.statusWidth();\\\\nconst height = this._dummyWindow.height;\\\\nconst x = Graphics.boxWidth - width;\\\\nconst y = this._dummyWindow.y;\\\\nreturn new Rectangle(x, y, width, height);\\\"\",\"BuyWindow\":\"\",\"BuyBgType:num\":\"0\",\"BuyRect:func\":\"\\\"const x = 0;\\\\nconst y = this._dummyWindow.y;\\\\nconst width = Graphics.boxWidth - this.statusWidth();\\\\nconst height = this._dummyWindow.height;\\\\nreturn new Rectangle(x, y, width, height);\\\"\",\"CategoryWindow\":\"\",\"CategoryBgType:num\":\"0\",\"CategoryRect:func\":\"\\\"const x = 0;\\\\nconst y = this._dummyWindow.y;\\\\nconst rows = 1;\\\\nconst width = Graphics.boxWidth;\\\\nconst height = this.calcWindowHeight(rows, true);\\\\nreturn new Rectangle(x, y, width, height);\\\"\",\"SellWindow\":\"\",\"SellBgType:num\":\"0\",\"SellRect:func\":\"\\\"const x = 0;\\\\nconst y = this._categoryWindow.y + this._categoryWindow.height;\\\\nconst width = Graphics.boxWidth;\\\\nconst height =\\\\n    this.mainAreaHeight() -\\\\n    this._commandWindow.height -\\\\n    this._categoryWindow.height;\\\\nreturn new Rectangle(x, y, width, height);\\\"\"}","NameMenu:struct":"{\"EditWindow\":\"\",\"EditBgType:num\":\"0\",\"EditRect:func\":\"\\\"const rows = 9;\\\\nconst inputWindowHeight = this.calcWindowHeight(rows, true);\\\\nconst padding = $gameSystem.windowPadding();\\\\nconst width = 600;\\\\nconst height = Math.min(ImageManager.faceHeight + padding * 2, this.mainAreaHeight() - inputWindowHeight);\\\\nconst x = (Graphics.boxWidth - width) / 2;\\\\nconst y = (this.mainAreaHeight() - (height + inputWindowHeight)) / 2 + this.mainAreaTop();\\\\nreturn new Rectangle(x, y, width, height);\\\"\",\"InputWindow\":\"\",\"InputBgType:num\":\"0\",\"InputRect:func\":\"\\\"const x = this._editWindow.x;\\\\nconst y = this._editWindow.y + this._editWindow.height;\\\\nconst rows = 9;\\\\nconst width = this._editWindow.width;\\\\nconst height = this.calcWindowHeight(rows, true);\\\\nreturn new Rectangle(x, y, width, height);\\\"\"}"}
*
* @param Param:struct
* @text 参数设置
* @type struct<Param>
* @desc 修改参数的限制和计算方式。

* @default {"DisplayedParams:arraystr":"[\"ATK\",\"DEF\",\"MAT\",\"MDF\",\"AGI\",\"LUK\"]","ExtDisplayedParams:arraystr":"[\"MaxHP\",\"MaxMP\",\"ATK\",\"DEF\",\"MAT\",\"MDF\",\"AGI\",\"LUK\"]","BasicParameters":"","CrisisRate:num":"0.25","BasicParameterFormula:func":"\"// Determine the variables used in this calculation.\\nlet paramId = arguments[0];\\nlet base = this.paramBase(paramId);\\nlet plus = this.paramPlus(paramId);\\nlet paramRate = this.paramRate(paramId);\\nlet buffRate = this.paramBuffRate(paramId);\\nlet flatBonus = this.paramFlatBonus(paramId);\\n\\n// Formula to determine total parameter value.\\nlet value = (base + plus) * paramRate * buffRate + flatBonus;\\n\\n// Determine the limits\\nconst maxValue = this.paramMax(paramId);\\nconst minValue = this.paramMin(paramId);\\n\\n// Final value\\nreturn Math.round(value.clamp(minValue, maxValue));\"","BasicParamCaps":"","BasicActorParamCaps":"","BasicActorParamMax0:str":"9999","BasicActorParamMax1:str":"9999","BasicActorParamMax2:str":"999","BasicActorParamMax3:str":"999","BasicActorParamMax4:str":"999","BasicActorParamMax5:str":"999","BasicActorParamMax6:str":"999","BasicActorParamMax7:str":"999","BasicEnemyParamCaps":"","BasicEnemyParamMax0:str":"999999","BasicEnemyParamMax1:str":"9999","BasicEnemyParamMax2:str":"999","BasicEnemyParamMax3:str":"999","BasicEnemyParamMax4:str":"999","BasicEnemyParamMax5:str":"999","BasicEnemyParamMax6:str":"999","BasicEnemyParamMax7:str":"999","XParameters":"","XParameterFormula:func":"\"// Determine the variables used in this calculation.\\nlet xparamId = arguments[0];\\nlet base = this.traitsSum(Game_BattlerBase.TRAIT_XPARAM, xparamId);\\nlet plus = this.xparamPlus(xparamId);\\nlet paramRate = this.xparamRate(xparamId);\\nlet flatBonus = this.xparamFlatBonus(xparamId);\\n\\n// Formula to determine total parameter value.\\nlet value = (base + plus) * paramRate + flatBonus;\\n\\n// Final value\\nreturn value;\"","XParamVocab":"","XParamVocab0:str":"Hit","XParamVocab1:str":"Evasion","XParamVocab2:str":"Critical Rate","XParamVocab3:str":"Critical Evade","XParamVocab4:str":"Magic Evade","XParamVocab5:str":"Magic Reflect","XParamVocab6:str":"Counter","XParamVocab7:str":"HP Regen","XParamVocab8:str":"MP Regen","XParamVocab9:str":"TP Regen","SParameters":"","SParameterFormula:func":"\"// Determine the variables used in this calculation.\\nlet sparamId = arguments[0];\\nlet base = this.traitsPi(Game_BattlerBase.TRAIT_SPARAM, sparamId);\\nlet plus = this.sparamPlus(sparamId);\\nlet paramRate = this.sparamRate(sparamId);\\nlet flatBonus = this.sparamFlatBonus(sparamId);\\n\\n// Formula to determine total parameter value.\\nlet value = (base + plus) * paramRate + flatBonus;\\n\\n// Final value\\nreturn value;\"","SParamVocab":"","SParamVocab0:str":"Aggro","SParamVocab1:str":"Guard","SParamVocab2:str":"Recovery","SParamVocab3:str":"Item Effect","SParamVocab4:str":"MP Cost","SParamVocab5:str":"TP Charge","SParamVocab6:str":"Physical DMG","SParamVocab7:str":"Magical DMG","SParamVocab8:str":"Floor DMG","SParamVocab9:str":"EXP Gain","Icons":"","DrawIcons:eval":"true","IconParam0:str":"84","IconParam1:str":"165","IconParam2:str":"76","IconParam3:str":"81","IconParam4:str":"101","IconParam5:str":"133","IconParam6:str":"140","IconParam7:str":"87","IconXParam0:str":"102","IconXParam1:str":"82","IconXParam2:str":"78","IconXParam3:str":"82","IconXParam4:str":"171","IconXParam5:str":"222","IconXParam6:str":"77","IconXParam7:str":"72","IconXParam8:str":"72","IconXParam9:str":"72","IconSParam0:str":"5","IconSParam1:str":"128","IconSParam2:str":"72","IconSParam3:str":"176","IconSParam4:str":"165","IconSParam5:str":"164","IconSParam6:str":"76","IconSParam7:str":"79","IconSParam8:str":"141","IconSParam9:str":"73"}
*
* @param CustomParam:arraystruct
* @text 自定义参数
* @parent Param:struct
* @type struct<CustomParam>[]
* @desc 创建游戏中的自定义参数！
* 这些将出现在 VisuStella MZ 菜单中。

* @default ["{\"ParamName:str\":\"Strength\",\"Abbreviation:str\":\"str\",\"Icon:num\":\"77\",\"Type:str\":\"integer\",\"ValueJS:json\":\"\\\"// Declare Constants\\\\nconst user = this;\\\\n\\\\n// Calculations\\\\nreturn (user.atk * 0.75) + (user.def * 0.25);\\\"\"}","{\"ParamName:str\":\"Dexterity\",\"Abbreviation:str\":\"dex\",\"Icon:num\":\"82\",\"Type:str\":\"integer\",\"ValueJS:json\":\"\\\"// Declare Constants\\\\nconst user = this;\\\\n\\\\n// Calculations\\\\nreturn (user.agi * 0.75) + (user.atk * 0.25);\\\"\"}","{\"ParamName:str\":\"Constitution\",\"Abbreviation:str\":\"con\",\"Icon:num\":\"81\",\"Type:str\":\"integer\",\"ValueJS:json\":\"\\\"// Declare Constants\\\\nconst user = this;\\\\n\\\\n// Calculations\\\\nreturn (user.def * 0.75) + (user.mdf * 0.25);\\\"\"}","{\"ParamName:str\":\"Intelligence\",\"Abbreviation:str\":\"int\",\"Icon:num\":\"79\",\"Type:str\":\"integer\",\"ValueJS:json\":\"\\\"// Declare Constants\\\\nconst user = this;\\\\n\\\\n// Calculations\\\\nreturn (user.mat * 0.75) + (user.mdf * 0.25);\\\"\"}","{\"ParamName:str\":\"Wisdom\",\"Abbreviation:str\":\"wis\",\"Icon:num\":\"72\",\"Type:str\":\"integer\",\"ValueJS:json\":\"\\\"// Declare Constants\\\\nconst user = this;\\\\n\\\\n// Calculations\\\\nreturn (user.mdf * 0.75) + (user.luk * 0.25);\\\"\"}","{\"ParamName:str\":\"Charisma\",\"Abbreviation:str\":\"cha\",\"Icon:num\":\"84\",\"Type:str\":\"integer\",\"ValueJS:json\":\"\\\"// Declare Constants\\\\nconst user = this;\\\\n\\\\n// Calculations\\\\nreturn (user.luk * 0.75) + (user.agi * 0.25);\\\"\"}"]
*
* @param ScreenResolution:struct
* @text 屏幕分辨率设置
* @type struct<ScreenResolution>
* @desc 调整各种属性，使游戏在不同的屏幕分辨率下表现更佳。

* @default {"Maps":"","AutoScrollLockX:eval":"true","AutoScrollLockY:eval":"true","DisplayLockX:num":"0.15625","DisplayLockY:num":"0.00000","Troops":"","RepositionActors:eval":"true","RepositionEnemies:eval":"true","RepositionEnemies130:eval":"false"}
*
* @param ScreenShake:struct
* @text Screen Shake Settings
* @type struct<ScreenShake>
* @desc Get more screen shake effects into your game!
* @default {"DefaultStyle:str":"random","originalJS:func":"\"// Calculation\\nthis.x += Math.round($gameScreen.shake());\"","randomJS:func":"\"// Calculation\\n// Original Formula by Aries of Sheratan\\nconst power = $gameScreen._shakePower * 0.75;\\nconst speed = $gameScreen._shakeSpeed * 0.60;\\nconst duration = $gameScreen._shakeDuration;\\nthis.x += Math.round(Math.randomInt(power) - Math.randomInt(speed)) * (Math.min(duration, 30) * 0.5);\\nthis.y += Math.round(Math.randomInt(power) - Math.randomInt(speed)) * (Math.min(duration, 30) * 0.5);\"","horzJS:func":"\"// Calculation\\n// Original Formula by Aries of Sheratan\\nconst power = $gameScreen._shakePower * 0.75;\\nconst speed = $gameScreen._shakeSpeed * 0.60;\\nconst duration = $gameScreen._shakeDuration;\\nthis.x += Math.round(Math.randomInt(power) - Math.randomInt(speed)) * (Math.min(duration, 30) * 0.5);\"","vertJS:func":"\"// Calculation\\n// Original Formula by Aries of Sheratan\\nconst power = $gameScreen._shakePower * 0.75;\\nconst speed = $gameScreen._shakeSpeed * 0.60;\\nconst duration = $gameScreen._shakeDuration;\\nthis.y += Math.round(Math.randomInt(power) - Math.randomInt(speed)) * (Math.min(duration, 30) * 0.5);\""}
*
* @param TitleCommandList:arraystruct
* @text 标题命令列表
* @type struct<Command>[]
* @desc 标题画面使用的窗口命令。
* 在这里添加新的命令。

* @default ["{\"Symbol:str\":\"newGame\",\"TextStr:str\":\"Untitled\",\"TextJS:func\":\"\\\"return TextManager.newGame;\\\"\",\"ShowJS:func\":\"\\\"return true;\\\"\",\"EnableJS:func\":\"\\\"return true;\\\"\",\"ExtJS:func\":\"\\\"return null;\\\"\",\"CallHandlerJS:func\":\"\\\"SceneManager._scene.commandNewGame();\\\"\"}","{\"Symbol:str\":\"continue\",\"TextStr:str\":\"Untitled\",\"TextJS:func\":\"\\\"return TextManager.continue_;\\\"\",\"ShowJS:func\":\"\\\"return true;\\\"\",\"EnableJS:func\":\"\\\"return DataManager.isAnySavefileExists();\\\"\",\"ExtJS:func\":\"\\\"return null;\\\"\",\"CallHandlerJS:func\":\"\\\"SceneManager._scene.commandContinue();\\\"\"}","{\"Symbol:str\":\"options\",\"TextStr:str\":\"Untitled\",\"TextJS:func\":\"\\\"return TextManager.options;\\\"\",\"ShowJS:func\":\"\\\"return true;\\\"\",\"EnableJS:func\":\"\\\"return true;\\\"\",\"ExtJS:func\":\"\\\"return null;\\\"\",\"CallHandlerJS:func\":\"\\\"SceneManager._scene.commandOptions();\\\"\"}","{\"Symbol:str\":\"shutdown\",\"TextStr:str\":\"Untitled\",\"TextJS:func\":\"\\\"return TextManager.gameEnd;\\\"\",\"ShowJS:func\":\"\\\"return Utils.isNwjs();\\\"\",\"EnableJS:func\":\"\\\"return true;\\\"\",\"ExtJS:func\":\"\\\"return null;\\\"\",\"CallHandlerJS:func\":\"\\\"SceneManager.exit();\\\\n\\\\n// Note!\\\\n// Do NOT use this command with mobile devices or\\\\n// browser games. All it does is cause the game to\\\\n// display a blank, black canvas which the player\\\\n// is unable to do anything with. It does NOT force\\\\n// close the browser tab nor the app.\\\"\"}"]
*
* @param TitlePicButtons:arraystruct
* @text 标题图片按钮
* @type struct<TitlePictureButton>[]
* @desc 可以插入标题画面的按钮。
* 在这里添加新的标题按钮。

* @default []
*
* @param UI:struct
* @text UI 设置
* @type struct<UI>
* @desc 修改游戏中各种UI的外观。

* @default {"UIArea":"","FadeSpeed:num":"24","BoxMargin:num":"4","CommandWidth:num":"240","BottomHelp:eval":"false","RightMenus:eval":"true","ShowButtons:eval":"true","cancelShowButton:eval":"true","menuShowButton:eval":"true","pagedownShowButton:eval":"true","numberShowButton:eval":"true","ButtonHeight:num":"52","BottomButtons:eval":"false","SideButtons:eval":"true","MenuObjects":"","LvExpGauge:eval":"true","ParamArrow:str":"→","TextCodeSupport":"","TextCodeClassNames:eval":"true","TextCodeNicknames:eval":"true"}
*
* @param Window:struct
* @text 窗口设置
* @type struct<Window>
* @desc 调整游戏中各种窗口的设置。

* @default {"WindowDefaults":"","EnableMasking:eval":"false","LineHeight:num":"36","ItemPadding:num":"8","BackOpacity:num":"192","TranslucentOpacity:num":"160","OpenSpeed:num":"32","ColSpacing:num":"8","RowSpacing:num":"4","ScrollBar":"","ShowScrollBar:eval":"true","BarThickness:num":"2","BarOffset:num":"+2","BarBodyColor:str":"0","OffBarColor:str":"7","OffBarOpacity:num":"128","SelectableItems":"","ShowItemBackground:eval":"true","ItemHeight:num":"8","DrawItemBackgroundJS:func":"\"const rect = arguments[0];\\nconst c1 = ColorManager.itemBackColor1();\\nconst c2 = ColorManager.itemBackColor2();\\nconst x = rect.x;\\nconst y = rect.y;\\nconst w = rect.width;\\nconst h = rect.height;\\nthis.contentsBack.gradientFillRect(x, y, w, h, c1, c2, true);\\nthis.contentsBack.strokeRect(x, y, w, h, c1);\"","TextPopup":"","DurationPerChat:num":"1.5","MinDuration:num":"90","MaxDuration:num":"300"}
*
* @param jsQuickFunc:arraystruct
* @text JS：快速函数
* @type struct<jsQuickFunc>[]
* @desc 创建可以从全局命名空间调用的快速 JavaScript 函数。
* 使用时请谨慎并适度使用！！！
* @default ["{\"FunctionName:str\":\"Example\",\"CodeJS:json\":\"\\\"// Insert this as a function anywhere you can input code\\\\n// such as Script Calls or Conditional Branch Scripts.\\\\n\\\\n// Process Code\\\\nreturn 'Example';\\\"\"}","{\"FunctionName:str\":\"Bad  Code  Name\",\"CodeJS:json\":\"\\\"// If a function name has spaces in them, the spaces will\\\\n// be removed. \\\\\\\"Bad  Code  Name\\\\\\\" becomes \\\\\\\"BadCodeName\\\\\\\".\\\\n\\\\n// Process Code\\\\nOhNoItsBadCode()\\\\n\\\\n// If a function has bad code, a fail safe will catch the\\\\n// error and display it in the console.\\\"\"}","{\"FunctionName:str\":\"RandomNumber\",\"CodeJS:json\":\"\\\"// This generates a random number from 0 to itself.\\\\n// Example: RandomNumber(10)\\\\n\\\\n// Process Code\\\\nconst number = (arguments[0] || 0) + 1;\\\\nreturn Math.floor(number * Math.random());\\\"\"}","{\"FunctionName:str\":\"RandomBetween\",\"CodeJS:json\":\"\\\"// This generates a random number between two arguments.\\\\n// Example: RandomBetween(5, 10)\\\\n\\\\n// Process Code\\\\nlet min = Math.min(arguments[0] || 0, arguments[1] || 0);\\\\nlet max = Math.max(arguments[0] || 0, arguments[1] || 0);\\\\nreturn Math.floor(Math.random() * (max - min + 1) + min);\\\"\"}","{\"FunctionName:str\":\"RandomFrom\",\"CodeJS:json\":\"\\\"// Selects a number from the list of inserted numbers.\\\\n// Example: RandomFrom(5, 10, 15, 20)\\\\n\\\\n// Process Code\\\\nreturn arguments[Math.randomInt(arguments.length)];\\\"\"}"]
*
* @param BreakEnd1
* @text --------------------------
* @default ----------------------------------
*
* @param End Of
* @default Plugin Parameters
*
* @param BreakEnd2
* @text --------------------------
* @default ----------------------------------
*
*/
/* ----------------------------------------------------------------------------
 * Quality of Life Settings
 * ----------------------------------------------------------------------------
 */
/*~struct~QoLSettings:
 *
 * @param PlayTest
 * @text 游戏测试
 *
 * @param NewGameBoot:eval
 * @text 启动时开始新游戏
 * @parent PlayTest
 * @type boolean
 * @on 启动新游戏
 * @off 保留标题画面
 * @desc 在游戏测试时自动开始新游戏？
 * 仅在游戏测试期间有效。
 * @default false
 *
 * @param ForceNoPlayTest:eval
 * @text 非游戏测试模式
 * @parent PlayTest
 * @type boolean
 * @on 取消游戏测试
 * @off 保持游戏测试
 * @desc 在游戏测试时强制退出游戏测试模式。
 * @default false
 *
 * @param OpenConsole:eval
 * @text 启动时打开控制台
 * @parent PlayTest
 * @type boolean
 * @on 打开
 * @off 不打开
 * @desc 启动游戏时是否打开调试控制台？
 * 仅在游戏测试期间有效。
 * @default true

 *
 * @param F6key:eval
 * @text F6键：切换声音
 * @parent PlayTest
 * @type boolean
 * @on 启用
 * @off 禁用
 * @desc F6键功能：切换所有声音为100%或0%，在两者之间切换。
 * @default true
 *
 * @param F7key:eval
 * @text F7键：切换快速模式
 * @parent PlayTest
 * @type boolean
 * @on 启用
 * @off 禁用
 * @desc F7键功能：切换快速模式。
 * @default true
 *
 * @param CtrlQuickLoad:eval
 * @text Ctrl + n：快速加载
 * @parent PlayTest
 * @type boolean
 * @on 启用
 * @off 禁用
 * @desc 按下Ctrl + 数字键（1到9），可以快速加载相应的存档文件。不包括自动保存。
 * @default true
 *
 * @param NewGameCommonEvent:num
 * @text 新游戏 > 公共事件
 * @parent PlayTest
 * @type common_event
 * @desc 在游戏测试会话中每次启动新游戏时运行的公共事件。
 * @default 0
 *
 * @param BattleTest
 * @text 战斗测试
 *
 * @param BTestItems:eval
 * @text 添加道具类型
 * @parent BattleTest
 * @type boolean
 * @on 添加
 * @off 不添加
 * @desc 是否添加数据库中每个道具的副本？
 * 仅在战斗测试期间有效。
 * @default true
 *
 * @param BTestWeapons:eval
 * @text 添加武器类型
 * @parent BattleTest
 * @type boolean
 * @on 添加
 * @off 不添加
 * @desc 是否添加数据库中每个武器的副本？
 * 仅在战斗测试期间有效。
 * @default true
 *
 * @param BTestArmors:eval
 * @text 添加防具类型
 * @parent BattleTest
 * @type boolean
 * @on 添加
 * @off 不添加
 * @desc 是否添加数据库中每个防具的副本？
 * 仅在战斗测试期间有效。
 * @default true
 *
 * @param BTestAddedQuantity:num
 * @text 添加数量
 * @parent BattleTest
 * @type number
 * @min 1
 * @desc 在战斗测试中替代最大数量添加的道具数量。
 * @default 90
 *
 * @param ShiftR_Toggle:eval
 * @text Shift+R：全员恢复
 * @parent BattleTest
 * @type boolean
 * @on 启用
 * @off 禁用
 * @desc 仅用于游戏测试！在战斗中，按下SHIFT + R将恢复整队的HP、MP和状态。
 * @default true

 *
 * @param ShiftT_Toggle:eval
 * @text Shift+T键：全员TP恢复
 * @parent BattleTest
 * @type boolean
 * @on 启用
 * @off 禁用
 * @desc 仅用于游戏测试！在战斗中，按下SHIFT + T将恢复整队的TP。
 * @default true
 *
 * @param DigitGrouping
 * @text 数字分组
 *
 * @param DigitGroupingStandardText:eval
 * @text 标准文本
 * @parent DigitGrouping
 * @type boolean
 * @on 启用
 * @off 禁用
 * @desc 在窗口内显示的文本中，像1234567这样的数字会显示为1,234,567。
 * @default true
 *
 * @param DigitGroupingExText:eval
 * @text 扩展文本
 * @parent DigitGrouping
 * @type boolean
 * @on 启用
 * @off 禁用
 * @desc 通过drawTextEx（如消息）显示的文本中，像1234567这样的数字会显示为1,234,567。
 * @default true
 *
 * @param DigitGroupingDamageSprites:eval
 * @text 伤害精灵
 * @parent DigitGrouping
 * @type boolean
 * @on 启用
 * @off 禁用
 * @desc 战斗中的伤害显示精灵中，像1234567这样的数字会显示为1,234,567。
 * @default true
 *
 * @param DigitGroupingGaugeSprites:eval
 * @text 测量精灵
 * @parent DigitGrouping
 * @type boolean
 * @on 启用
 * @off 禁用
 * @desc HP、MP和TP等可见测量精灵中，像1234567这样的数字会显示为1,234,567。
 * @default true
 *
 * @param DigitGroupingLocale:str
 * @text 国家/地区
 * @parent DigitGrouping
 * @type combo
 * @option ar-SA
 * @option bn-BD
 * @option bn-IN
 * @option cs-CZ
 * @option da-DK
 * @option de-AT
 * @option de-CH
 * @option de-DE
 * @option el-GR
 * @option en-AU
 * @option en-CA
 * @option en-GB
 * @option en-IE
 * @option en-IN
 * @option en-NZ
 * @option en-US
 * @option en-ZA
 * @option es-AR
 * @option es-CL
 * @option es-CO
 * @option es-ES
 * @option es-MX
 * @option es-US
 * @option fi-FI
 * @option fr-BE
 * @option fr-CA
 * @option fr-CH
 * @option fr-FR
 * @option he-IL
 * @option hi-IN
 * @option hu-HU
 * @option id-ID
 * @option it-CH
 * @option it-IT
 * @option jp-JP
 * @option ko-KR
 * @option nl-BE
 * @option nl-NL
 * @option no-NO
 * @option pl-PL
 * @option pt-BR
 * @option pt-PT
 * @option ro-RO
 * @option ru-RU
 * @option sk-SK
 * @option sv-SE
 * @option ta-IN
 * @option ta-LK
 * @option th-TH
 * @option tr-TR
 * @option zh-CN
 * @option zh-HK
 * @option zh-TW
 * @desc 基于哪个国家/地区进行数字分组？
 * @default en-US
 *
 * @param PlayerBenefit
 * @text 玩家效益
 *
 * @param EncounterRateMinimum:num
 * @text 遭遇率最小值
 * @parent PlayerBenefit
 * @min 1
 * @desc 玩家可以不遇敌行走的最小步数。
 * @default 10
 *
 * @param EscapeAlways:eval
 * @text 总是逃跑
 * @parent PlayerBenefit
 * @type boolean
 * @on 总是
 * @off 默认
 * @desc 如果玩家想逃离战斗，让他们有100%的逃跑成功率。
 * @default true
 *
 * @param ImprovedAccuracySystem:eval
 * @text 命中率公式
 * @parent PlayerBenefit
 * @type boolean
 * @on 改进
 * @off 默认
 * @desc 命中率计算公式改为技能命中率 * (使用者命中 - 目标闪避)，以获得更好的效果。
 * @default true
 *
 * @param AccuracyBoost:eval
 * @text 命中率提升
 * @parent PlayerBenefit
 * @type boolean
 * @on 提升
 * @off 默认
 * @desc 提升命中率和闪避率，有利于玩家。
 * @default true
 *
 * @param LevelUpFullHp:eval
 * @text 升级 -> 满HP
 * @parent PlayerBenefit
 * @type boolean
 * @on 恢复
 * @off 默认
 * @desc 角色升级时，恢复满HP。
 * @default true
 *
 * @param LevelUpFullMp:eval
 * @text 升级 -> 满MP
 * @parent PlayerBenefit
 * @type boolean
 * @on 恢复
 * @off 默认
 * @desc 角色升级时，恢复满MP。
 * @default true
 *
 * @param Pictures
 * @text 图片相关
 *
 * @param AntiZoomPictures:eval
 * @text 防止缩放图片
 * @parent Pictures
 * @type boolean
 * @on 防止缩放
 * @off 正常
 * @desc 如果启用，防止图片受缩放影响。
 * @default true
 * 
 * @param PictureContainers
 * @text 图片容器
 * @parent Pictures
 *
 * @param DetachBattlePictureContainer:eval
 * @text 战斗中分离
 * @parent PictureContainers
 * @type boolean
 * @on 分离
 * @off 正常
 * @desc 如果分离，战斗场景中图片容器将与精灵集分离。
 * @default false
 *
 * @param DetachMapPictureContainer:eval
 * @text 地图中分离
 * @parent PictureContainers
 * @type boolean
 * @on 分离
 * @off 正常
 * @desc 如果分离，地图场景中图片容器将与精灵集分离。
 * @default false
 *
 * @param Misc
 * @text 其他
 *
 * @param AnimationMirrorOffset:eval
 * @text 动画：镜像偏移
 * @parent Misc
 * @type boolean
 * @on 镜像
 * @off 不镜像
 * @desc 当动画被镜像时，也镜像它们的X偏移值。
 * @default false

 *
 * @param AutoStretch:str
 * @text 自动拉伸
 * @parent Misc
 * @type select
 * @option 默认
 * @value default
 * @option 拉伸
 * @value stretch
 * @option 正常
 * @value normal
 * @desc 自动拉伸游戏以适应客户端大小？
 * @default default
 *
 * @param FontShadows:eval
 * @text 字体阴影
 * @parent Misc
 * @type boolean
 * @on 使用阴影
 * @off 使用轮廓
 * @desc 如果启用，文本使用阴影而不是轮廓。
 * @default false
 *
 * @param FontSmoothing:eval
 * @text 字体平滑
 * @parent Misc
 * @type boolean
 * @on 平滑
 * @off 无
 * @desc 如果启用，在游戏中显示平滑的字体。
 * @default true
 *
 * @param FontWidthFix:eval
 * @text 字体宽度修复
 * @parent Misc
 * @type boolean
 * @on 修复
 * @off 默认
 * @desc 修复消息窗口中非等宽字体的即时显示宽度问题。
 * @default true
 *
 * @param KeyItemProtect:eval
 * @text 关键道具保护
 * @parent Misc
 * @type boolean
 * @on 不可出售
 * @off 可出售
 * @desc 如果启用，防止关键道具被出售和被消耗。
 * @default true
 *
 * @param MapNameTextCode:eval
 * @text 地图名称文本代码
 * @parent Misc
 * @type boolean
 * @on 使用文本代码
 * @off 原始文本
 * @desc 如果启用，地图名称将使用文本代码。
 * 如果禁用，仅使用原始地图名称。
 * @default true
 *
 * @param ModernControls:eval
 * @text 现代控制
 * @parent Misc
 * @type boolean
 * @on 启用
 * @off 默认
 * @desc 如果启用，允许使用Home/End等现代配置。影响其他VisuStella插件。
 * @default true
 *
 * @param MvAnimationRate:num
 * @text MV动画速率
 * @parent Misc
 * @min 1
 * @max 10
 * @desc 调整MV动画播放速率。
 * 默认：4。越低越快，越高越慢。
 * @default 4
 *
 * @param NewGameCommonEventAll:num
 * @text 新游戏 > 公共事件
 * @parent Misc
 * @type common_event
 * @desc 每次开始任何会话期间的新游戏时运行的公共事件。
 * @default 0
 *
 * @param NoTileShadows:eval
 * @text 禁用地图阴影
 * @parent Misc
 * @type boolean
 * @on 禁用地图阴影
 * @off 默认
 * @desc 在游戏中移除地图阴影的显示。
 * @default false
 *
 * @param PixelateImageRendering:eval
 * @text 像素图像渲染
 * @parent Misc
 * @type boolean
 * @on 像素化
 * @off 平滑
 * @desc 如果启用，像素化图像渲染（用于像素游戏）。
 * @default false
 *
 * @param RequireFocus:eval
 * @text 需要焦点？
 * @parent Misc
 * @type boolean
 * @on 需要
 * @off 无需
 * @desc 是否需要游戏获得焦点？如果游戏不在焦点中，不是活动窗口时会暂停。
 * @default true
 *
 * @param ShortcutScripts:eval
 * @text 快捷脚本
 * @parent Misc
 * @type boolean
 * @on 启用
 * @off 禁用
 * @desc 启用基于快捷方式的脚本。
 * 查看帮助文件获取更多信息。
 * @default true
 *
 * @param SmartEventCollisionPriority:eval
 * @text 智能事件碰撞优先级
 * @parent Misc
 * @type boolean
 * @on 仅相同优先级
 * @off 默认
 * @desc 使事件仅能在它们是“与角色相同”优先级时相互碰撞。
 * @default true
 *
 * @param SubfolderParse:eval
 * @text 子文件夹名称清除
 * @parent Misc
 * @type boolean
 * @on 清除子文件夹名称
 * @off 不清除名称
 * @desc 在读取数据时，从插件参数中清除子文件夹名称，以确保插件命令正常工作。
 * @default true

 *
 */
/* ----------------------------------------------------------------------------
 * Color Settings
 * ----------------------------------------------------------------------------
 */
/*~struct~Color:
 *
 * @param BasicColors
 * @text 基本颜色
 *
 * @param ColorNormal:str
 * @text 普通
 * @parent BasicColors
 * @desc 使用 #rrggbb 自定义颜色或从窗口皮肤中选择文本颜色的常规编号。
 * @default 0
 *
 * @param ColorSystem:str
 * @text 系统
 * @parent BasicColors
 * @desc 使用 #rrggbb 自定义颜色或从窗口皮肤中选择文本颜色的常规编号。
 * @default 16
 *
 * @param ColorCrisis:str
 * @text 危机
 * @parent BasicColors
 * @desc 使用 #rrggbb 自定义颜色或从窗口皮肤中选择文本颜色的常规编号。
 * @default 17
 *
 * @param ColorDeath:str
 * @text 死亡
 * @parent BasicColors
 * @desc 使用 #rrggbb 自定义颜色或从窗口皮肤中选择文本颜色的常规编号。
 * @default 18
 *
 * @param ColorGaugeBack:str
 * @text 进度条背景
 * @parent BasicColors
 * @desc 使用 #rrggbb 自定义颜色或从窗口皮肤中选择文本颜色的常规编号。
 * @default 19
 *
 * @param ColorHPGauge1:str
 * @text 生命条 1
 * @parent BasicColors
 * @desc 使用 #rrggbb 自定义颜色或从窗口皮肤中选择文本颜色的常规编号。
 * @default 20
 *
 * @param ColorHPGauge2:str
 * @text 生命条 2
 * @parent BasicColors
 * @desc 使用 #rrggbb 自定义颜色或从窗口皮肤中选择文本颜色的常规编号。
 * @default 21
 *
 * @param ColorMPGauge1:str
 * @text 魔法条 1
 * @parent BasicColors
 * @desc 使用 #rrggbb 自定义颜色或从窗口皮肤中选择文本颜色的常规编号。
 * @default 22
 *
 * @param ColorMPGauge2:str
 * @text 魔法条 2
 * @parent BasicColors
 * @desc 使用 #rrggbb 自定义颜色或从窗口皮肤中选择文本颜色的常规编号。
 * @default 23
 *
 * @param ColorMPCost:str
 * @text 魔法消耗
 * @parent BasicColors
 * @desc 使用 #rrggbb 自定义颜色或从窗口皮肤中选择文本颜色的常规编号。
 * @default 23
 *
 * @param ColorPowerUp:str
 * @text 力量增加
 * @parent BasicColors
 * @desc 使用 #rrggbb 自定义颜色或从窗口皮肤中选择文本颜色的常规编号。
 * @default 24
 *
 * @param ColorPowerDown:str
 * @text 力量减少
 * @parent BasicColors
 * @desc 使用 #rrggbb 自定义颜色或从窗口皮肤中选择文本颜色的常规编号。
 * @default 25
 *
 * @param ColorCTGauge1:str
 * @text CT条 1
 * @parent BasicColors
 * @desc 使用 #rrggbb 自定义颜色或从窗口皮肤中选择文本颜色的常规编号。
 * @default 26
 *
 * @param ColorCTGauge2:str
 * @text CT条 2
 * @parent BasicColors
 * @desc 使用 #rrggbb 自定义颜色或从窗口皮肤中选择文本颜色的常规编号。
 * @default 27
 *
 * @param ColorTPGauge1:str
 * @text TP条 1
 * @parent BasicColors
 * @desc 使用 #rrggbb 自定义颜色或从窗口皮肤中选择文本颜色的常规编号。
 * @default 28
 *
 * @param ColorTPGauge2:str
 * @text TP条 2
 * @parent BasicColors
 * @desc 使用 #rrggbb 自定义颜色或从窗口皮肤中选择文本颜色的常规编号。
 * @default 29
 *
 * @param ColorTPCost:str
 * @text TP消耗
 * @parent BasicColors
 * @desc 使用 #rrggbb 自定义颜色或从窗口皮肤中选择文本颜色的常规编号。
 * @default 29
 *
 * @param ColorPending:str
 * @text 待定颜色
 * @parent BasicColors
 * @desc 使用 #rrggbb 自定义颜色或从窗口皮肤中选择文本颜色的常规编号。
 * @default #2a847d
 *
 * @param ColorExpGauge1:str
 * @text 经验条 1
 * @parent BasicColors
 * @desc 使用 #rrggbb 自定义颜色或从窗口皮肤中选择文本颜色的常规编号。
 * @default 30
 *
 * @param ColorExpGauge2:str
 * @text 经验条 2
 * @parent BasicColors
 * @desc 使用 #rrggbb 自定义颜色或从窗口皮肤中选择文本颜色的常规编号。
 * @default 31
 *
 * @param ColorMaxLvGauge1:str
 * @text 最大等级条 1
 * @parent BasicColors
 * @desc 使用 #rrggbb 自定义颜色或从窗口皮肤中选择文本颜色的常规编号。
 * @default 14
 *
 * @param ColorMaxLvGauge2:str
 * @text 最大等级条 2
 * @parent BasicColors
 * @desc 使用 #rrggbb 自定义颜色或从窗口皮肤中选择文本颜色的常规编号。
 * @default 6
 *
 * @param AlphaColors
 * @text 半透明颜色
 *
 * @param OutlineColor:str
 * @text 窗口字体轮廓
 * @parent AlphaColors
 * @desc 包含一些alpha设置的颜色。
 * 格式 rgba(0-255, 0-255, 0-255, 0-1)
 * @default rgba(0, 0, 0, 0.6)
 *
 * @param OutlineColorGauge:str
 * @text 进度条数字轮廓
 * @parent AlphaColors
 * @desc 包含一些alpha设置的颜色。
 * 格式 rgba(0-255, 0-255, 0-255, 0-1)
 * @default rgba(0, 0, 0, 1.0)
 *
 * @param DimColor1:str
 * @text 暗色 1
 * @parent AlphaColors
 * @desc 包含一些alpha设置的颜色。
 * 格式 rgba(0-255, 0-255, 0-255, 0-1)
 * @default rgba(0, 0, 0, 0.6)
 *
 * @param DimColor2:str
 * @text 暗色 2
 * @parent AlphaColors
 * @desc 包含一些alpha设置的颜色。
 * 格式 rgba(0-255, 0-255, 0-255, 0-1)
 * @default rgba(0, 0, 0, 0)
 *
 * @param ItemBackColor1:str
 * @text 物品背景色 1
 * @parent AlphaColors
 * @desc 包含一些alpha设置的颜色。
 * 格式 rgba(0-255, 0-255, 0-255, 0-1)
 * @default rgba(32, 32, 32, 0.5)
 *
 * @param ItemBackColor2:str
 * @text 物品背景色 2
 * @parent AlphaColors
 * @desc 包含一些alpha设置的颜色。
 * 格式 rgba(0-255, 0-255, 0-255, 0-1)
 * @default rgba(0, 0, 0, 0.5)

 *
 * @param ConditionalColors
 * @text 条件颜色
 *
 * @param ActorHPColor:func
 * @text JS：角色生命值颜色
 * @type note
 * @parent ConditionalColors
 * @desc 用于确定角色生命值颜色的代码。
 * @default "// 设置在此函数中使用的变量。\nlet actor = arguments[0];\n\n// 检查角色是否存在。如果不存在，则返回普通颜色。\nif (!actor) {\n    return this.normalColor();\n\n// 如果角色已死亡，则返回死亡颜色。\n} else if (actor.isDead()) {\n    return this.deathColor();\n\n// 如果角色濒死，则返回危机颜色。\n} else if (actor.isDying()) {\n    return this.crisisColor();\n\n// 否则，返回普通颜色。\n} else {\n    return this.normalColor();\n}"
 *
 * @param ActorMPColor:func
 * @text JS：角色魔法值颜色
 * @type note
 * @parent ConditionalColors
 * @desc 用于确定角色魔法值颜色的代码。
 * @default "// 设置在此函数中使用的变量。\nlet actor = arguments[0];\n\n// 检查角色是否存在。如果不存在，则返回普通颜色。\nif (!actor) {\n    return this.normalColor();\n\n// 如果魔法值比例低于25%，则返回危机颜色。\n} else if (actor.mpRate() < 0.25) {\n    return this.crisisColor();\n\n// 否则，返回普通颜色。\n} else {\n    return this.normalColor();\n}"
 *
 * @param ActorTPColor:func
 * @text JS：角色TP颜色
 * @type note
 * @parent ConditionalColors
 * @desc 用于确定角色TP颜色的代码。
 * @default "// 设置在此函数中使用的变量。\nlet actor = arguments[0];\n\n// 检查角色是否存在。如果不存在，则返回普通颜色。\nif (!actor) {\n    return this.normalColor();\n\n// 如果TP比例低于25%，则返回危机颜色。\n} else if (actor.tpRate() < 0.25) {\n    return this.crisisColor();\n\n// 否则，返回普通颜色。\n} else {\n    return this.normalColor();\n}"
 *
 * @param ParamChange:func
 * @text JS：参数变化颜色
 * @type note
 * @parent ConditionalColors
 * @desc 用于确定参数变化颜色的代码。
 * @default "// 设置在此函数中使用的变量。\nlet change = arguments[0];\n\n// 如果变化是正的，则使用增加颜色。\nif (change > 0) {\n    return this.powerUpColor();\n\n// 如果变化是负的，则使用减少颜色。\n} else if (change < 0) {\n    return this.powerDownColor();\n\n// 否则，返回普通颜色。\n} else {\n    return this.normalColor();\n}"
 *
 * @param DamageColor:func
 * @text JS：伤害颜色
 * @type note
 * @parent ConditionalColors
 * @desc 用于确定伤害类型颜色的代码。
 * @default "// 可以添加你的汉化"
 * @default "// 设置在此函数中使用的变量。\nlet colorType = arguments[0];\n\n// 检查颜色类型的值\n// 并返回适当的颜色。\nswitch (colorType) {\n\n    case 0: // 生命值损失\n        return \"#ffffff\";\n\n    case 1: // 生命值恢复\n        return \"#b9ffb5\";\n\n    case 2: // 魔法值损失\n        return \"#bb88bb\";\n\n    case 3: // 魔法值恢复\n        return \"#80b0ff\";\n\n    default:\n        return \"#808080\";\n}"

 */
/* ----------------------------------------------------------------------------
 * Gold Settings
 * ----------------------------------------------------------------------------
 */
/*~struct~Gold:
 *
 * @param GoldMax:num
 * @text 金币上限
 * @type num
 * @min 1
 * @desc 队伍可以持有的最大金币数量。
 * 默认值 99999999
 * @default 99999999
 *
 * @param GoldFontSize:num
 * @text 金币字体大小
 * @type number
 * @min 1
 * @desc 金币窗口内显示的字体大小。
 * 默认值：26
 * @default 24
 *
 * @param GoldIcon:num
 * @text 金币图标
 * @desc 用于表示金币的图标。
 * 使用 0 表示无图标。
 * @default 314
 *
 * @param GoldOverlap:str
 * @text 金币溢出文本
 * @desc 当金币数过多无法显示在窗口内时的文本。
 * @default 大量
 *
 * @param ItemStyle:eval
 * @text 物品风格
 * @type boolean
 * @on 启用
 * @off 正常
 * @desc 在物品风格中绘制金币？
 * 即：图标、标签、数值
 * @default true
 *
 */
/* ----------------------------------------------------------------------------
 * 图片加载设置
 * ----------------------------------------------------------------------------
 */
/*~struct~ImgLoad:
 *
 * @param animations:arraystr
 * @text img/animations/
 * @type file[]
 * @dir img/animations/
 * @desc 游戏启动时要从此目录加载的文件。
 * @default []
 *
 * @param battlebacks1:arraystr
 * @text img/battlebacks1/
 * @type file[]
 * @dir img/battlebacks1/
 * @desc 游戏启动时要从此目录加载的文件。
 * @default []
 *
 * @param battlebacks2:arraystr
 * @text img/battlebacks2/
 * @type file[]
 * @dir img/battlebacks2/
 * @desc 游戏启动时要从此目录加载的文件。
 * @default []
 *
 * @param characters:arraystr
 * @text img/characters/
 * @type file[]
 * @dir img/characters/
 * @desc 游戏启动时要从此目录加载的文件。
 * @default []
 *
 * @param enemies:arraystr
 * @text img/enemies/
 * @type file[]
 * @dir img/enemies/
 * @desc 游戏启动时要从此目录加载的文件。
 * @default []
 *
 * @param faces:arraystr
 * @text img/faces/
 * @type file[]
 * @dir img/faces/
 * @desc 游戏启动时要从此目录加载的文件。
 * @default []
 *
 * @param parallaxes:arraystr
 * @text img/parallaxes/
 * @type file[]
 * @dir img/parallaxes/
 * @desc 游戏启动时要从此目录加载的文件。
 * @default []
 *
 * @param pictures:arraystr
 * @text img/pictures/
 * @type file[]
 * @dir img/pictures/
 * @desc 游戏启动时要从此目录加载的文件。
 * @default []
 *
 * @param sv_actors:arraystr
 * @text img/sv_actors/
 * @type file[]
 * @dir img/sv_actors/
 * @desc 游戏启动时要从此目录加载的文件。
 * @default []
 *
 * @param sv_enemies:arraystr
 * @text img/sv_enemies/
 * @type file[]
 * @dir img/sv_enemies/
 * @desc 游戏启动时要从此目录加载的文件。
 * @default []
 *
 * @param system:arraystr
 * @text img/system/
 * @type file[]
 * @dir img/system/
 * @desc 游戏启动时要从此目录加载的文件。
 * @default ["Balloon","IconSet"]
 *
 * @param tilesets:arraystr
 * @text img/tilesets/
 * @type file[]
 * @dir img/tilesets/
 * @desc 游戏启动时要从此目录加载的文件。
 * @default []
 *
 * @param titles1:arraystr
 * @text img/titles1/
 * @type file[]
 * @dir img/titles1/
 * @desc 游戏启动时要从此目录加载的文件。
 * @default []
 *
 * @param titles2:arraystr
 * @text img/titles2/
 * @type file[]
 * @dir img/titles2/
 * @desc 游戏启动时要从此目录加载的文件。
 * @default []
 */


/* ----------------------------------------------------------------------------
 * 键盘输入设置
 * ----------------------------------------------------------------------------
 */
/*~struct~KeyboardInput:
 *
 * @param Controls
 * @text 控制设置
 *
 * @param WASD:eval
 * @text WASD 移动
 * @parent Controls
 * @type boolean
 * @on 启用
 * @off 禁用
 * @desc 启用或禁用 WASD 键盘移动。
 * 将 W 键设为向下页按钮。
 * @default false
 *
 * @param DashToggleR:eval
 * @text R 键：冲刺切换
 * @parent Controls
 * @type boolean
 * @on 启用
 * @off 禁用
 * @desc 启用或禁用 R 键作为始终冲刺选项的切换键。
 * @default false
 *
 * @param NameInput
 * @text 名称输入
 *
 * @param EnableNameInput:eval
 * @text 启用？
 * @parent NameInput
 * @type boolean
 * @on 启用
 * @off 禁用
 * @desc 启用键盘输入姓名功能。
 * 仅测试过英文键盘。
 * @default true
 * 
 * @param DefaultMode:str
 * @text 默认模式
 * @parent NameInput
 * @type select
 * @option 默认 - 使用方向键选择字母。
 * @value default
 * @option 键盘 - 使用键盘输入字母。
 * @value keyboard
 * @desc 进入场景时选择的默认输入模式。
 * @default keyboard
 *
 * @param QwertyLayout:eval
 * @text QWERTY 键盘布局
 * @parent NameInput
 * @type boolean
 * @on QWERTY 布局
 * @off ABCDEF 布局
 * @desc 使用 QWERTY 键盘布局进行手动输入。
 * @default true
 *
 * @param NameInputMessage:eval
 * @text 键盘消息
 * @parent NameInput
 * @type note
 * @desc 允许键盘输入时显示的消息。
 * 您可以在此处使用文本代码。
 * @default "输入角色名称。\n按下 \\c[5]回车\\c[0] 完成输入。\n\n或者\n\n按下 \\c[5]方向键\\c[0]/\\c[5]TAB\\c[0] 切换到手动输入。\n\n按下 \\c[5]ESC\\c[0]/\\c[5]TAB\\c[0] 使用键盘输入。"
 * 
 * @param BannedWords:arraystr
 * @text 禁用词汇
 * @parent NameInput
 * @type string[]
 * @desc 玩家不能使用这些词汇作为名称。
 * 包括名称中的词汇。
 * @default []
 *
 * @param NumberInput
 * @text 数字输入
 *
 * @param EnableNumberInput:eval
 * @text 启用？
 * @parent NumberInput
 * @type boolean
 * @on 启用
 * @off 禁用
 * @desc 启用键盘输入数字功能。
 * 仅测试过英文键盘。
 * @default true
 *
 * @param ButtonAssist
 * @text 按钮辅助
 * 
 * @param Finish:str
 * @text 完成输入
 * @parent ButtonAssist
 * @desc 描述完成输入的文本。
 * @default 完成
 * 
 * @param PageChange:str
 * @text 页面切换
 * @parent ButtonAssist
 * @desc 描述字符页面切换的文本。
 * @default 页面
 * 
 * @param Keyboard:str
 * @text 切换到键盘
 * @parent ButtonAssist
 * @desc 描述切换到键盘输入的文本。
 * @default 键盘
 * 
 * @param Manual:str
 * @text 切换到手动
 * @parent ButtonAssist
 * @desc 描述切换到手动输入的文本。
 * @default 手动
 */

/* ----------------------------------------------------------------------------
 * 菜单背景设置
 * ----------------------------------------------------------------------------
 */
/*~struct~MenuBg:
 * 
 * @param BlurStrength:num
 * @text 模糊强度
 * @desc 菜单背景快照使用的强度。
 * 默认值：8。数值越高，效果越强，数值越低，效果越弱。
 * @default 8
 *
 * @param Scene_Menu:struct
 * @text 场景_菜单
 * @type struct<BgSettings>
 * @desc 此场景的单独背景设置。
 * @default {"SnapshotOpacity:num":"192","BgFilename1:str":"","BgFilename2:str":""}
 *
 * @param Scene_Item:struct
 * @text 场景_物品
 * @type struct<BgSettings>
 * @desc 此场景的单独背景设置。
 * @default {"SnapshotOpacity:num":"192","BgFilename1:str":"","BgFilename2:str":""}
 *
 * @param Scene_Skill:struct
 * @text 场景_技能
 * @type struct<BgSettings>
 * @desc 此场景的单独背景设置。
 * @default {"SnapshotOpacity:num":"192","BgFilename1:str":"","BgFilename2:str":""}
 *
 * @param Scene_Equip:struct
 * @text 场景_装备
 * @type struct<BgSettings>
 * @desc 此场景的单独背景设置。
 * @default {"SnapshotOpacity:num":"192","BgFilename1:str":"","BgFilename2:str":""}
 *
 * @param Scene_Status:struct
 * @text 场景_状态
 * @type struct<BgSettings>
 * @desc 此场景的单独背景设置。
 * @default {"SnapshotOpacity:num":"192","BgFilename1:str":"","BgFilename2:str":""}
 *
 * @param Scene_Options:struct
 * @text 场景_选项
 * @type struct<BgSettings>
 * @desc 此场景的单独背景设置。
 * @default {"SnapshotOpacity:num":"192","BgFilename1:str":"","BgFilename2:str":""}
 *
 * @param Scene_Save:struct
 * @text 场景_保存
 * @type struct<BgSettings>
 * @desc 此场景的单独背景设置。
 * @default {"SnapshotOpacity:num":"192","BgFilename1:str":"","BgFilename2:str":""}
 *
 * @param Scene_Load:struct
 * @text 场景_读取
 * @type struct<BgSettings>
 * @desc 此场景的单独背景设置。
 * @default {"SnapshotOpacity:num":"192","BgFilename1:str":"","BgFilename2:str":""}
 *
 * @param Scene_GameEnd:struct
 * @text 场景_游戏结束
 * @type struct<BgSettings>
 * @desc 此场景的单独背景设置。
 * @default {"SnapshotOpacity:num":"128","BgFilename1:str":"","BgFilename2:str":""}
 *
 * @param Scene_Shop:struct
 * @text 场景_商店
 * @type struct<BgSettings>
 * @desc 此场景的单独背景设置。
 * @default {"SnapshotOpacity:num":"192","BgFilename1:str":"","BgFilename2:str":""}
 *
 * @param Scene_Name:struct
 * @text 场景_命名
 * @type struct<BgSettings>
 * @desc 此场景的单独背景设置。
 * @default {"SnapshotOpacity:num":"192","BgFilename1:str":"","BgFilename2:str":""}
 *
 * @param Scene_Unlisted:struct
 * @text 场景_未列出
 * @type struct<BgSettings>
 * @desc 未在此处列出的其他任何场景的单独背景设置。
 * @default {"SnapshotOpacity:num":"192","BgFilename1:str":"","BgFilename2:str":""}
 */

/* ----------------------------------------------------------------------------
 * 背景设置
 * ----------------------------------------------------------------------------
 */
/*~struct~BgSettings:
 *
 * @param SnapshotOpacity:num
 * @text 快照不透明度
 * @type number
 * @min 0
 * @max 255
 * @desc 场景的快照不透明度。
 * @default 192
 *
 * @param BgFilename1:str
 * @text 背景1
 * @type file
 * @dir img/titles1/
 * @desc 底部背景图片的文件名。
 * 如果不希望使用背景，请留空。
 * @default 
 *
 * @param BgFilename2:str
 * @text 背景2
 * @type file
 * @dir img/titles2/
 * @desc 顶部背景图片的文件名。
 * 如果不希望使用背景，请留空。
 * @default 
 *
 */
/* ----------------------------------------------------------------------------
 * 菜单按钮辅助设置
 * ----------------------------------------------------------------------------
 */
/*~struct~ButtonAssist:
 *
 * @param General
 *
 * @param Enable:eval
 * @text 启用
 * @parent General
 * @type boolean
 * @on 使用
 * @off 不使用
 * @desc 启用菜单按钮辅助窗口。
 * @default true
 *
 * @param Location:str
 * @text 位置
 * @parent General
 * @type select
 * @option 屏幕顶部
 * @value top
 * @option 屏幕底部
 * @value bottom
 * @desc 确定按钮辅助窗口的位置。
 * 需要插件参数 => UI => 侧按钮ON。
 * @default bottom
 *
 * @param BgType:num
 * @text 背景类型
 * @parent General
 * @type select
 * @option 0 - 窗口
 * @value 0
 * @option 1 - 模糊
 * @value 1
 * @option 2 - 透明
 * @value 2
 * @desc 选择此窗口的背景类型。
 * @default 0
 *
 * @param SplitEscape:eval
 * @text 分开 "取消"
 * @parent General
 * @type boolean
 * @on 分开
 * @off 不分开
 * @desc "分开" 将取消按钮和菜单按钮分开。
 * "不分开" 将二者合并为一个 "取消" 按钮。
 * @default false
 *
 * @param Text
 *
 * @param TextFmt:str
 * @text 文本格式
 * @parent Text
 * @desc 显示按钮的格式。
 * 可以使用文本代码。%1 - 按键，%2 - 文本
 * @default %1：%2
 *
 * @param MultiKeyFmt:str
 * @text 多按键格式
 * @parent Text
 * @desc 具有多个按键的动作的格式。
 * 可以使用文本代码。%1 - 按键1，%2 - 按键2
 * @default %1/%2
 *
 * @param OkText:str
 * @text 确定文本
 * @parent Text
 * @desc 显示确认按键的默认文本。
 * 可以使用文本代码。
 * @default 选择
 *
 * @param CancelText:str
 * @text 取消文本
 * @parent Text
 * @desc 显示取消按键的默认文本。
 * 可以使用文本代码。
 * @default 返回
 *
 * @param SwitchActorText:str
 * @text 切换角色文本
 * @parent Text
 * @desc 显示切换角色动作的默认文本。
 * 可以使用文本代码。
 * @default 切换盟友
 *
 * @param Keys
 *
 * @param KeyUnlisted:str
 * @text 按键：未列出格式
 * @parent Keys
 * @desc 如果按键未在下面列出，则使用此格式。
 * 可以使用文本代码。%1 - 按键
 * @default \}❪%1❫\{
 *
 * @param KeyUP:str
 * @text 按键：上
 * @parent Keys
 * @desc 游戏中显示此按键的方式。
 * 可以使用文本代码。
 * @default ^
 *
 * @param KeyDOWN:str
 * @text 按键：下
 * @parent Keys
 * @desc 游戏中显示此按键的方式。
 * 可以使用文本代码。
 * @default v
 *
 * @param KeyLEFT:str
 * @text 按键：左
 * @parent Keys
 * @desc 游戏中显示此按键的方式。
 * 可以使用文本代码。
 * @default <<
 *
 * @param KeyRIGHT:str
 * @text 按键：右
 * @parent Keys
 * @desc 游戏中显示此按键的方式。
 * 可以使用文本代码。
 * @default >>
 *
 * @param KeySHIFT:str
 * @text 按键：Shift
 * @parent Keys
 * @desc 游戏中显示此按键的方式。
 * 可以使用文本代码。
 * @default \}❪SHIFT❫\{
 *
 * @param KeyTAB:str
 * @text 按键：Tab
 * @parent Keys
 * @desc 游戏中显示此按键的方式。
 * 可以使用文本代码。
 * @default \}❪TAB❫\{
 *
 * @param KeyA:str
 * @text 按键：A
 * @parent Keys
 * @desc 游戏中显示此按键的方式。
 * 可以使用文本代码。
 * @default A
 *
 * @param KeyB:str
 * @text 按键：B
 * @parent Keys
 * @desc 游戏中显示此按键的方式。
 * 可以使用文本代码。
 * @default B
 *
 * @param KeyC:str
 * @text 按键：C
 * @parent Keys
 * @desc 游戏中显示此按键的方式。
 * 可以使用文本代码。
 * @default C
 *
 * @param KeyD:str
 * @text 按键：D
 * @parent Keys
 * @desc 游戏中显示此按键的方式。
 * 可以使用文本代码。
 * @default D
 *
 * @param KeyE:str
 * @text 按键：E
 * @parent Keys
 * @desc 游戏中显示此按键的方式。
 * 可以使用文本代码。
 * @default E
 *
 * @param KeyF:str
 * @text 按键：F
 * @parent Keys
 * @desc 游戏中显示此按键的方式。
 * 可以使用文本代码。
 * @default F
 *
 * @param KeyG:str
 * @text 按键：G
 * @parent Keys
 * @desc 游戏中显示此按键的方式。
 * 可以使用文本代码。
 * @default G
 *
 * @param KeyH:str
 * @text 按键：H
 * @parent Keys
 * @desc 游戏中显示此按键的方式。
 * 可以使用文本代码。
 * @default H
 *
 * @param KeyI:str
 * @text 按键：I
 * @parent Keys
 * @desc 游戏中显示此按键的方式。
 * 可以使用文本代码。
 * @default I
 *
 * @param KeyJ:str
 * @text 按键：J
 * @parent Keys
 * @desc 游戏中显示此按键的方式。
 * 可以使用文本代码。
 * @default J
 *
 * @param KeyK:str
 * @text 按键：K
 * @parent Keys
 * @desc 游戏中显示此按键的方式。
 * 可以使用文本代码。
 * @default K
 *
 * @param KeyL:str
 * @text 按键：L
 * @parent Keys
 * @desc 游戏中显示此按键的方式。
 * 可以使用文本代码。
 * @default L
 *
 * @param KeyM:str
 * @text 按键：M
 * @parent Keys
 * @desc 游戏中显示此按键的方式。
 * 可以使用文本代码。
 * @default M
 *
 * @param KeyN:str
 * @text 按键：N
 * @parent Keys
 * @desc 游戏中显示此按键的方式。
 * 可以使用文本代码。
 * @default N
 *
 * @param KeyO:str
 * @text 按键：O
 * @parent Keys
 * @desc 游戏中显示此按键的方式。
 * 可以使用文本代码。
 * @default O
 *
 * @param KeyP:str
 * @text 按键：P
 * @parent Keys
 * @desc 游戏中显示此按键的方式。
 * 可以使用文本代码。
 * @default P
 *
 * @param KeyQ:str
 * @text 按键：Q
 * @parent Keys
 * @desc 游戏中显示此按键的方式。
 * 可以使用文本代码。
 * @default Q
 *
 * @param KeyR:str
 * @text 按键：R
 * @parent Keys
 * @desc 游戏中显示此按键的方式。
 * 可以使用文本代码。
 * @default R
 *
 * @param KeyS:str
 * @text 按键：S
 * @parent Keys
 * @desc 游戏中显示此按键的方式。
 * 可以使用文本代码。
 * @default S
 *
 * @param KeyT:str
 * @text 按键：T
 * @parent Keys
 * @desc 游戏中显示此按键的方式。
 * 可以使用文本代码。
 * @default T
 *
 * @param KeyU:str
 * @text 按键：U
 * @parent Keys
 * @desc 游戏中显示此按键的方式。
 * 可以使用文本代码。
 * @default U
 *
 * @param KeyV:str
 * @text 按键：V
 * @parent Keys
 * @desc 游戏中显示此按键的方式。
 * 可以使用文本代码。
 * @default V
 *
 * @param KeyW:str
 * @text 按键：W
 * @parent Keys
 * @desc 游戏中显示此按键的方式。
 * 可以使用文本代码。
 * @default W
 *
 * @param KeyX:str
 * @text 按键：X
 * @parent Keys
 * @desc 游戏中显示此按键的方式。
 * 可以使用文本代码。
 * @default X
 *
 * @param KeyY:str
 * @text 按键：Y
 * @parent Keys
 * @desc 游戏中显示此按键的方式。
 * 可以使用文本代码。
 * @default Y
 *
 * @param KeyZ:str
 * @text 按键：Z
 * @parent Keys
 * @desc 游戏中显示此按键的方式。
 * 可以使用文本代码。
 * @default Z
 */

/* ----------------------------------------------------------------------------
 * 控制器按钮设置
 * ----------------------------------------------------------------------------
 */
/*~struct~ControllerButtons:
 *
 * @param ID
 * @text ID信息
 *
 * @param Name:str
 * @text 控制器ID名称
 * @parent ID
 * @desc 用于此控制器ID的确切字符串。插件命令 "Debug: Current Controller ID" 可以提供ID帮助。
 * @default 未命名
 *
 * @param Match:str
 * @text 相似性匹配
 * @parent ID
 * @desc 用于此控制器ID的相似文本。插件命令 "Debug: Current Controller ID" 可以提供ID帮助。
 * @default 未命名
 * 
 * @param Directions
 *
 * @param up:str
 * @text 上
 * @parent Directions
 * @desc 游戏中显示此按钮的方式。
 * 可以使用文本代码。
 * @default 
 *
 * @param left:str
 * @text 左
 * @parent Directions
 * @desc 游戏中显示此按钮的方式。
 * 可以使用文本代码。
 * @default 
 *
 * @param right:str
 * @text 右
 * @parent Directions
 * @desc 游戏中显示此按钮的方式。
 * 可以使用文本代码。
 * @default 
 *
 * @param down:str
 * @text 下
 * @parent Directions
 * @desc 游戏中显示此按钮的方式。
 * 可以使用文本代码。
 * @default 
 * 
 * @param Actions
 *
 * @param ok:str
 * @text 确定
 * @parent Actions
 * @desc 游戏中显示此按钮的方式。
 * 可以使用文本代码。
 * @default 
 *
 * @param cancel:str
 * @text 取消
 * @parent Actions
 * @desc 游戏中显示此按钮的方式。
 * 可以使用文本代码。
 * @default 
 *
 * @param menu:str
 * @text 菜单
 * @parent Actions
 * @desc 游戏中显示此按钮的方式。
 * 可以使用文本代码。
 * @default 
 *
 * @param shift:str
 * @text Shift
 * @parent Actions
 * @desc 游戏中显示此按钮的方式。
 * 可以使用文本代码。
 * @default 
 *
 * @param pageup:str
 * @text 上一页
 * @parent Actions
 * @desc 游戏中显示此按钮的方式。
 * 可以使用文本代码。
 * @default 
 *
 * @param pagedown:str
 * @text 下一页
 * @parent Actions
 * @desc 游戏中显示此按钮的方式。
 * 可以使用文本代码。
 * @default 
 */

/* ----------------------------------------------------------------------------
 * Menu Layout Settings
 * ----------------------------------------------------------------------------
 */
/*~struct~MenuLayout:
 *
 * @param Title:struct
 * @text Scene_Title
 * @parent SceneSettings
 * @type struct<Title>
 * @desc Various options on adjusting the Title Scene.
 * @default {"TitleScreen":"","DocumentTitleFmt:str":"%1: %2 - Version %3","Subtitle:str":"Subtitle","Version:str":"0.00","drawGameTitle:func":"\"const x = 20;\\nconst y = Graphics.height / 4;\\nconst maxWidth = Graphics.width - x * 2;\\nconst text = $dataSystem.gameTitle;\\nconst bitmap = this._gameTitleSprite.bitmap;\\nbitmap.fontFace = $gameSystem.mainFontFace();\\nbitmap.outlineColor = \\\"black\\\";\\nbitmap.outlineWidth = 8;\\nbitmap.fontSize = 72;\\nbitmap.drawText(text, x, y, maxWidth, 48, \\\"center\\\");\"","drawGameSubtitle:func":"\"const x = 20;\\nconst y = Graphics.height / 4 + 72;\\nconst maxWidth = Graphics.width - x * 2;\\nconst text = Scene_Title.subtitle;\\nconst bitmap = this._gameTitleSprite.bitmap;\\nbitmap.fontFace = $gameSystem.mainFontFace();\\nbitmap.outlineColor = \\\"black\\\";\\nbitmap.outlineWidth = 6;\\nbitmap.fontSize = 48;\\nbitmap.drawText(text, x, y, maxWidth, 48, \\\"center\\\");\"","drawGameVersion:func":"\"const bitmap = this._gameTitleSprite.bitmap;\\nconst x = 0;\\nconst y = Graphics.height - 20;\\nconst width = Math.round(Graphics.width / 4);\\nconst height = 20;\\nconst c1 = ColorManager.dimColor1();\\nconst c2 = ColorManager.dimColor2();\\nconst text = 'Version ' + Scene_Title.version;\\nbitmap.gradientFillRect(x, y, width, height, c1, c2);\\nbitmap.fontFace = $gameSystem.mainFontFace();\\nbitmap.outlineColor = \\\"black\\\";\\nbitmap.outlineWidth = 3;\\nbitmap.fontSize = 16;\\nbitmap.drawText(text, x + 4, y, Graphics.width, height, \\\"left\\\");\"","CommandRect:func":"\"const offsetX = $dataSystem.titleCommandWindow.offsetX;\\nconst offsetY = $dataSystem.titleCommandWindow.offsetY;\\nconst rows = this.commandWindowRows();\\nconst width = this.mainCommandWidth();\\nconst height = this.calcWindowHeight(rows, true);\\nconst x = (Graphics.boxWidth - width) / 2 + offsetX;\\nconst y = Graphics.boxHeight - height - 96 + offsetY;\\nreturn new Rectangle(x, y, width, height);\"","ButtonFadeSpeed:num":"4"}
 *
 * @param MainMenu:struct
 * @text Scene_Menu
 * @parent SceneSettings
 * @type struct<MainMenu>
 * @desc Various options on adjusting the Main Menu Scene.
 * @default {"CommandWindow":"","CommandBgType:num":"0","CommandRect:func":"\"const width = this.mainCommandWidth();\\nconst height = this.mainAreaHeight() - this.goldWindowRect().height;\\nconst x = this.isRightInputMode() ? Graphics.boxWidth - width : 0;\\nconst y = this.mainAreaTop();\\nreturn new Rectangle(x, y, width, height);\"","GoldWindow":"","GoldBgType:num":"0","GoldRect:func":"\"const rows = 1;\\nconst width = this.mainCommandWidth();\\nconst height = this.calcWindowHeight(rows, true);\\nconst x = this.isRightInputMode() ? Graphics.boxWidth - width : 0;\\nconst y = this.mainAreaBottom() - height;\\nreturn new Rectangle(x, y, width, height);\"","StatusWindow":"","StatusBgType:num":"0","StatusRect:func":"\"const width = Graphics.boxWidth - this.mainCommandWidth();\\nconst height = this.mainAreaHeight();\\nconst x = this.isRightInputMode() ? 0 : Graphics.boxWidth - width;\\nconst y = this.mainAreaTop();\\nreturn new Rectangle(x, y, width, height);\""}
 *
 * @param ItemMenu:struct
 * @text Scene_Item
 * @parent SceneSettings
 * @type struct<ItemMenu>
 * @desc Various options on adjusting the Item Menu Scene.
 * @default {"HelpWindow":"","HelpBgType:num":"0","HelpRect:func":"\"const x = 0;\\nconst y = this.helpAreaTop();\\nconst width = Graphics.boxWidth;\\nconst height = this.helpAreaHeight();\\nreturn new Rectangle(x, y, width, height);\"","CategoryWindow":"","CategoryBgType:num":"0","CategoryRect:func":"\"const x = 0;\\nconst y = this.mainAreaTop();\\nconst rows = 1;\\nconst width = Graphics.boxWidth;\\nconst height = this.calcWindowHeight(rows, true);\\nreturn new Rectangle(x, y, width, height);\"","ItemWindow":"","ItemBgType:num":"0","ItemRect:func":"\"const x = 0;\\nconst y = this._categoryWindow.y + this._categoryWindow.height;\\nconst width = Graphics.boxWidth;\\nconst height = this.mainAreaBottom() - y;\\nreturn new Rectangle(x, y, width, height);\"","ActorWindow":"","ActorBgType:num":"0","ActorRect:func":"\"const x = 0;\\nconst y = this.mainAreaTop();\\nconst width = Graphics.boxWidth;\\nconst height = this.mainAreaHeight();\\nreturn new Rectangle(x, y, width, height);\""}
 *
 * @param SkillMenu:struct
 * @text Scene_Skill
 * @parent SceneSettings
 * @type struct<SkillMenu>
 * @desc Various options on adjusting the Skill Menu Scene.
 * @default {"HelpWindow":"","HelpBgType:num":"0","HelpRect:func":"\"const x = 0;\\nconst y = this.helpAreaTop();\\nconst width = Graphics.boxWidth;\\nconst height = this.helpAreaHeight();\\nreturn new Rectangle(x, y, width, height);\"","SkillTypeWindow":"","SkillTypeBgType:num":"0","SkillTypeRect:func":"\"const rows = 3;\\nconst width = this.mainCommandWidth();\\nconst height = this.calcWindowHeight(rows, true);\\nconst x = this.isRightInputMode() ? Graphics.boxWidth - width : 0;\\nconst y = this.mainAreaTop();\\nreturn new Rectangle(x, y, width, height);\"","StatusWindow":"","StatusBgType:num":"0","StatusRect:func":"\"const width = Graphics.boxWidth - this.mainCommandWidth();\\nconst height = this._skillTypeWindow.height;\\nconst x = this.isRightInputMode() ? 0 : Graphics.boxWidth - width;\\nconst y = this.mainAreaTop();\\nreturn new Rectangle(x, y, width, height);\"","ItemWindow":"","ItemBgType:num":"0","ItemRect:func":"\"const x = 0;\\nconst y = this._statusWindow.y + this._statusWindow.height;\\nconst width = Graphics.boxWidth;\\nconst height = this.mainAreaHeight() - this._statusWindow.height;\\nreturn new Rectangle(x, y, width, height);\"","ActorWindow":"","ActorBgType:num":"0","ActorRect:func":"\"const x = 0;\\nconst y = this.mainAreaTop();\\nconst width = Graphics.boxWidth;\\nconst height = this.mainAreaHeight();\\nreturn new Rectangle(x, y, width, height);\""}
 *
 * @param EquipMenu:struct
 * @text Scene_Equip
 * @parent SceneSettings
 * @type struct<EquipMenu>
 * @desc Various options on adjusting the Equip Menu Scene.
 * @default {"HelpWindow":"","HelpBgType:num":"0","HelpRect:func":"\"const x = 0;\\nconst y = this.helpAreaTop();\\nconst width = Graphics.boxWidth;\\nconst height = this.helpAreaHeight();\\nreturn new Rectangle(x, y, width, height);\"","StatusWindow":"","StatusBgType:num":"0","StatusRect:func":"\"const x = 0;\\nconst y = this.mainAreaTop();\\nconst width = this.statusWidth();\\nconst height = this.mainAreaHeight();\\nreturn new Rectangle(x, y, width, height);\"","CommandWindow":"","CommandBgType:num":"0","CommandRect:func":"\"const x = this.statusWidth();\\nconst y = this.mainAreaTop();\\nconst rows = 1;\\nconst width = Graphics.boxWidth - this.statusWidth();\\nconst height = this.calcWindowHeight(rows, true);\\nreturn new Rectangle(x, y, width, height);\"","SlotWindow":"","SlotBgType:num":"0","SlotRect:func":"\"const commandWindowRect = this.commandWindowRect();\\nconst x = this.statusWidth();\\nconst y = commandWindowRect.y + commandWindowRect.height;\\nconst width = Graphics.boxWidth - this.statusWidth();\\nconst height = this.mainAreaHeight() - commandWindowRect.height;\\nreturn new Rectangle(x, y, width, height);\"","ItemWindow":"","ItemBgType:num":"0","ItemRect:func":"\"return this.slotWindowRect();\""}
 *
 * @param StatusMenu:struct
 * @text Scene_Status
 * @parent SceneSettings
 * @type struct<StatusMenu>
 * @desc Various options on adjusting the Status Menu Scene.
 * @default {"ProfileWindow":"","ProfileBgType:num":"0","ProfileRect:func":"\"const width = Graphics.boxWidth;\\nconst height = this.profileHeight();\\nconst x = 0;\\nconst y = this.mainAreaBottom() - height;\\nreturn new Rectangle(x, y, width, height);\"","StatusWindow":"","StatusBgType:num":"0","StatusRect:func":"\"const x = 0;\\nconst y = this.mainAreaTop();\\nconst width = Graphics.boxWidth;\\nconst height = this.statusParamsWindowRect().y - y;\\nreturn new Rectangle(x, y, width, height);\"","StatusParamsWindow":"","StatusParamsBgType:num":"0","StatusParamsRect:func":"\"const width = this.statusParamsWidth();\\nconst height = this.statusParamsHeight();\\nconst x = 0;\\nconst y = this.mainAreaBottom() - this.profileHeight() - height;\\nreturn new Rectangle(x, y, width, height);\"","StatusEquipWindow":"","StatusEquipBgType:num":"0","StatusEquipRect:func":"\"const width = Graphics.boxWidth - this.statusParamsWidth();\\nconst height = this.statusParamsHeight();\\nconst x = this.statusParamsWidth();\\nconst y = this.mainAreaBottom() - this.profileHeight() - height;\\nreturn new Rectangle(x, y, width, height);\""}
 *
 * @param OptionsMenu:struct
 * @text Scene_Options
 * @parent SceneSettings
 * @type struct<OptionsMenu>
 * @desc Various options on adjusting the Options Menu Scene.
 * @default {"OptionsWindow":"","OptionsBgType:num":"0","OptionsRect:func":"\"const n = Math.min(this.maxCommands(), this.maxVisibleCommands());\\nconst width = 400;\\nconst height = this.calcWindowHeight(n, true);\\nconst x = (Graphics.boxWidth - width) / 2;\\nconst y = (Graphics.boxHeight - height) / 2;\\nreturn new Rectangle(x, y, width, height);\""}
 *
 * @param SaveMenu:struct
 * @text Scene_Save
 * @parent SceneSettings
 * @type struct<SaveMenu>
 * @desc Various options on adjusting the Save Menu Scene.
 * @default {"HelpWindow":"","HelpBgType:num":"0","HelpRect:func":"\"const x = 0;\\nconst y = this.mainAreaTop();\\nconst rows = 1;\\nconst width = Graphics.boxWidth;\\nconst height = this.calcWindowHeight(rows, false);\\nreturn new Rectangle(x, y, width, height);\"","ListWindow":"","ListBgType:num":"0","ListRect:func":"\"const x = 0;\\nconst y = this.mainAreaTop() + this._helpWindow.height;\\nconst width = Graphics.boxWidth;\\nconst height = this.mainAreaHeight() - this._helpWindow.height;\\nreturn new Rectangle(x, y, width, height);\""}
 *
 * @param LoadMenu:struct
 * @text Scene_Load
 * @parent SceneSettings
 * @type struct<LoadMenu>
 * @desc Various options on adjusting the Load Menu Scene.
 * @default {"HelpWindow":"","HelpBgType:num":"0","HelpRect:func":"\"const x = 0;\\nconst y = this.mainAreaTop();\\nconst rows = 1;\\nconst width = Graphics.boxWidth;\\nconst height = this.calcWindowHeight(rows, false);\\nreturn new Rectangle(x, y, width, height);\"","ListWindow":"","ListBgType:num":"0","ListRect:func":"\"const x = 0;\\nconst y = this.mainAreaTop() + this._helpWindow.height;\\nconst width = Graphics.boxWidth;\\nconst height = this.mainAreaHeight() - this._helpWindow.height;\\nreturn new Rectangle(x, y, width, height);\""}
 *
 * @param GameEnd:struct
 * @text Scene_GameEnd
 * @parent SceneSettings
 * @type struct<GameEnd>
 * @desc Various options on adjusting the Game End Scene.
 * @default {"CommandList:arraystruct":"[\"{\\\"Symbol:str\\\":\\\"toTitle\\\",\\\"TextStr:str\\\":\\\"Untitled\\\",\\\"TextJS:func\\\":\\\"\\\\\\\"return TextManager.toTitle;\\\\\\\"\\\",\\\"ShowJS:func\\\":\\\"\\\\\\\"return true;\\\\\\\"\\\",\\\"EnableJS:func\\\":\\\"\\\\\\\"return true;\\\\\\\"\\\",\\\"ExtJS:func\\\":\\\"\\\\\\\"return null;\\\\\\\"\\\",\\\"CallHandlerJS:func\\\":\\\"\\\\\\\"SceneManager._scene.commandToTitle();\\\\\\\"\\\"}\",\"{\\\"Symbol:str\\\":\\\"cancel\\\",\\\"TextStr:str\\\":\\\"Untitled\\\",\\\"TextJS:func\\\":\\\"\\\\\\\"return TextManager.cancel;\\\\\\\"\\\",\\\"ShowJS:func\\\":\\\"\\\\\\\"return true;\\\\\\\"\\\",\\\"EnableJS:func\\\":\\\"\\\\\\\"return true;\\\\\\\"\\\",\\\"ExtJS:func\\\":\\\"\\\\\\\"return null;\\\\\\\"\\\",\\\"CallHandlerJS:func\\\":\\\"\\\\\\\"SceneManager._scene.popScene();\\\\\\\"\\\"}\"]","CommandBgType:num":"0","CommandRect:func":"\"const rows = 2;\\nconst width = this.mainCommandWidth();\\nconst height = this.calcWindowHeight(rows, true);\\nconst x = (Graphics.boxWidth - width) / 2;\\nconst y = (Graphics.boxHeight - height) / 2;\\nreturn new Rectangle(x, y, width, height);\""}
 *
 * @param ShopMenu:struct
 * @text Scene_Shop
 * @parent SceneSettings
 * @type struct<ShopMenu>
 * @desc Various options on adjusting the Shop Menu Scene.
 * @default {"HelpWindow":"","HelpBgType:num":"0","HelpRect:func":"\"const wx = 0;\\nconst wy = this.helpAreaTop();\\nconst ww = Graphics.boxWidth;\\nconst wh = this.helpAreaHeight();\\nreturn new Rectangle(wx, wy, ww, wh);\"","GoldWindow":"","GoldBgType:num":"0","GoldRect:func":"\"const rows = 1;\\nconst width = this.mainCommandWidth();\\nconst height = this.calcWindowHeight(rows, true);\\nconst x = Graphics.boxWidth - width;\\nconst y = this.mainAreaTop();\\nreturn new Rectangle(x, y, width, height);\"","CommandWindow":"","CommandBgType:num":"0","CommandRect:func":"\"const x = 0;\\nconst y = this.mainAreaTop();\\nconst rows = 1;\\nconst width = this._goldWindow.x;\\nconst height = this.calcWindowHeight(rows, true);\\nreturn new Rectangle(x, y, width, height);\"","DummyWindow":"","DummyBgType:num":"0","DummyRect:func":"\"const x = 0;\\nconst y = this._commandWindow.y + this._commandWindow.height;\\nconst width = Graphics.boxWidth;\\nconst height = this.mainAreaHeight() - this._commandWindow.height;\\nreturn new Rectangle(x, y, width, height);\"","NumberWindow":"","NumberBgType:num":"0","NumberRect:func":"\"const x = 0;\\nconst y = this._dummyWindow.y;\\nconst width = Graphics.boxWidth - this.statusWidth();\\nconst height = this._dummyWindow.height;\\nreturn new Rectangle(x, y, width, height);\"","StatusWindow":"","StatusBgType:num":"0","StatusRect:func":"\"const width = this.statusWidth();\\nconst height = this._dummyWindow.height;\\nconst x = Graphics.boxWidth - width;\\nconst y = this._dummyWindow.y;\\nreturn new Rectangle(x, y, width, height);\"","BuyWindow":"","BuyBgType:num":"0","BuyRect:func":"\"const x = 0;\\nconst y = this._dummyWindow.y;\\nconst width = Graphics.boxWidth - this.statusWidth();\\nconst height = this._dummyWindow.height;\\nreturn new Rectangle(x, y, width, height);\"","CategoryWindow":"","CategoryBgType:num":"0","CategoryRect:func":"\"const x = 0;\\nconst y = this._dummyWindow.y;\\nconst rows = 1;\\nconst width = Graphics.boxWidth;\\nconst height = this.calcWindowHeight(rows, true);\\nreturn new Rectangle(x, y, width, height);\"","SellWindow":"","SellBgType:num":"0","SellRect:func":"\"const x = 0;\\nconst y = this._categoryWindow.y + this._categoryWindow.height;\\nconst width = Graphics.boxWidth;\\nconst height =\\n    this.mainAreaHeight() -\\n    this._commandWindow.height -\\n    this._categoryWindow.height;\\nreturn new Rectangle(x, y, width, height);\""}
 *
 * @param NameMenu:struct
 * @text Scene_Name
 * @parent SceneSettings
 * @type struct<NameMenu>
 * @desc Various options on adjusting the Actor Rename Scene.
 * @default {"EditWindow":"","EditBgType:num":"0","EditRect:func":"\"const rows = 9;\\nconst inputWindowHeight = this.calcWindowHeight(rows, true);\\nconst padding = $gameSystem.windowPadding();\\nconst width = 600;\\nconst height = Math.min(ImageManager.faceHeight + padding * 2, this.mainAreaHeight() - inputWindowHeight);\\nconst x = (Graphics.boxWidth - width) / 2;\\nconst y = (this.mainAreaHeight() - (height + inputWindowHeight)) / 2 + this.mainAreaTop();\\nreturn new Rectangle(x, y, width, height);\"","InputWindow":"","InputBgType:num":"0","InputRect:func":"\"const x = this._editWindow.x;\\nconst y = this._editWindow.y + this._editWindow.height;\\nconst rows = 9;\\nconst width = this._editWindow.width;\\nconst height = this.calcWindowHeight(rows, true);\\nreturn new Rectangle(x, y, width, height);\""}
 *
 */
/* ----------------------------------------------------------------------------
 * 主菜单设置
 * ----------------------------------------------------------------------------
 */
/*~struct~MainMenu:
 *
 * @param CommandWindow
 * @text 命令窗口
 *
 * @param CommandBgType:num
 * @text 背景类型
 * @parent CommandWindow
 * @type select
 * @option 0 - 窗口
 * @value 0
 * @option 1 - 暗淡
 * @value 1
 * @option 2 - 透明
 * @value 2
 * @desc 选择此窗口的背景类型。
 * @default 0
 *
 * @param CommandRect:func
 * @text JS: X, Y, W, H
 * @parent CommandWindow
 * @type note
 * @desc 用于确定此窗口尺寸的代码。
 * @default "const width = this.mainCommandWidth();\nconst height = this.mainAreaHeight() - this.goldWindowRect().height;\nconst x = this.isRightInputMode() ? Graphics.boxWidth - width : 0;\nconst y = this.mainAreaTop();\nreturn new Rectangle(x, y, width, height);"
 *
 * @param GoldWindow
 * @text 金币窗口
 *
 * @param GoldBgType:num
 * @text 背景类型
 * @parent GoldWindow
 * @type select
 * @option 0 - 窗口
 * @value 0
 * @option 1 - 暗淡
 * @value 1
 * @option 2 - 透明
 * @value 2
 * @desc 选择此窗口的背景类型。
 * @default 0
 *
 * @param GoldRect:func
 * @text JS: X, Y, W, H
 * @parent GoldWindow
 * @type note
 * @desc 用于确定此窗口尺寸的代码。
 * @default "const rows = 1;\nconst width = this.mainCommandWidth();\nconst height = this.calcWindowHeight(rows, true);\nconst x = this.isRightInputMode() ? Graphics.boxWidth - width : 0;\nconst y = this.mainAreaBottom() - height;\nreturn new Rectangle(x, y, width, height);"
 *
 * @param StatusWindow
 * @text 状态窗口
 *
 * @param StatusBgType:num
 * @text 背景类型
 * @parent StatusWindow
 * @type select
 * @option 0 - 窗口
 * @value 0
 * @option 1 - 暗淡
 * @value 1
 * @option 2 - 透明
 * @value 2
 * @desc 选择此窗口的背景类型。
 * @default 0
 *
 * @param StatusRect:func
 * @text JS: X, Y, W, H
 * @parent StatusWindow
 * @type note
 * @desc 用于确定此窗口尺寸的代码。
 * @default "const width = Graphics.boxWidth - this.mainCommandWidth();\nconst height = this.mainAreaHeight();\nconst x = this.isRightInputMode() ? 0 : Graphics.boxWidth - width;\nconst y = this.mainAreaTop();\nreturn new Rectangle(x, y, width, height);"
 */

/* ----------------------------------------------------------------------------
 * 物品菜单设置
 * ----------------------------------------------------------------------------
 */
/*~struct~ItemMenu:
 *
 * @param HelpWindow
 * @text 帮助窗口
 *
 * @param HelpBgType:num
 * @text 背景类型
 * @parent HelpWindow
 * @type select
 * @option 0 - 窗口
 * @value 0
 * @option 1 - 暗淡
 * @value 1
 * @option 2 - 透明
 * @value 2
 * @desc 选择此窗口的背景类型。
 * @default 0
 *
 * @param HelpRect:func
 * @text JS: X, Y, W, H
 * @parent HelpWindow
 * @type note
 * @desc 用于确定此窗口尺寸的代码。
 * @default "const x = 0;\nconst y = this.helpAreaTop();\nconst width = Graphics.boxWidth;\nconst height = this.helpAreaHeight();\nreturn new Rectangle(x, y, width, height);"
 *
 * @param CategoryWindow
 * @text 分类窗口
 *
 * @param CategoryBgType:num
 * @text 背景类型
 * @parent CategoryWindow
 * @type select
 * @option 0 - 窗口
 * @value 0
 * @option 1 - 暗淡
 * @value 1
 * @option 2 - 透明
 * @value 2
 * @desc 选择此窗口的背景类型。
 * @default 0
 *
 * @param CategoryRect:func
 * @text JS: X, Y, W, H
 * @parent CategoryWindow
 * @type note
 * @desc 用于确定此窗口尺寸的代码。
 * @default "const x = 0;\nconst y = this.mainAreaTop();\nconst rows = 1;\nconst width = Graphics.boxWidth;\nconst height = this.calcWindowHeight(rows, true);\nreturn new Rectangle(x, y, width, height);"
 *
 * @param ItemWindow
 * @text 物品窗口
 *
 * @param ItemBgType:num
 * @text 背景类型
 * @parent ItemWindow
 * @type select
 * @option 0 - 窗口
 * @value 0
 * @option 1 - 暗淡
 * @value 1
 * @option 2 - 透明
 * @value 2
 * @desc 选择此窗口的背景类型。
 * @default 0
 *
 * @param ItemRect:func
 * @text JS: X, Y, W, H
 * @parent ItemWindow
 * @type note
 * @desc 用于确定此窗口尺寸的代码。
 * @default "const x = 0;\nconst y = this._categoryWindow.y + this._categoryWindow.height;\nconst width = Graphics.boxWidth;\nconst height = this.mainAreaBottom() - y;\nreturn new Rectangle(x, y, width, height);"
 *
 * @param ActorWindow
 * @text 角色窗口
 *
 * @param ActorBgType:num
 * @text 背景类型
 * @parent ActorWindow
 * @type select
 * @option 0 - 窗口
 * @value 0
 * @option 1 - 暗淡
 * @value 1
 * @option 2 - 透明
 * @value 2
 * @desc 选择此窗口的背景类型。
 * @default 0
 *
 * @param ActorRect:func
 * @text JS: X, Y, W, H
 * @parent ActorWindow
 * @type note
 * @desc 用于确定此窗口尺寸的代码。
 * @default "const x = 0;\nconst y = this.mainAreaTop();\nconst width = Graphics.boxWidth;\nconst height = this.mainAreaHeight();\nreturn new Rectangle(x, y, width, height);"
 */

/* ----------------------------------------------------------------------------
 * 技能菜单设置
 * ----------------------------------------------------------------------------
 */
/*~struct~SkillMenu:
 *
 * @param HelpWindow
 * @text 帮助窗口
 *
 * @param HelpBgType:num
 * @text 背景类型
 * @parent HelpWindow
 * @type select
 * @option 0 - 窗口
 * @value 0
 * @option 1 - 暗淡
 * @value 1
 * @option 2 - 透明
 * @value 2
 * @desc 选择此窗口的背景类型。
 * @default 0
 *
 * @param HelpRect:func
 * @text JS: X, Y, W, H
 * @parent HelpWindow
 * @type note
 * @desc 用于确定此窗口尺寸的代码。
 * @default "const x = 0;\nconst y = this.helpAreaTop();\nconst width = Graphics.boxWidth;\nconst height = this.helpAreaHeight();\nreturn new Rectangle(x, y, width, height);"
 *
 * @param SkillTypeWindow
 * @text 技能类型窗口
 *
 * @param SkillTypeBgType:num
 * @text 背景类型
 * @parent SkillTypeWindow
 * @type select
 * @option 0 - 窗口
 * @value 0
 * @option 1 - 暗淡
 * @value 1
 * @option 2 - 透明
 * @value 2
 * @desc 选择此窗口的背景类型。
 * @default 0
 *
 * @param SkillTypeRect:func
 * @text JS: X, Y, W, H
 * @parent SkillTypeWindow
 * @type note
 * @desc 用于确定此窗口尺寸的代码。
 * @default "const rows = 3;\nconst width = this.mainCommandWidth();\nconst height = this.calcWindowHeight(rows, true);\nconst x = this.isRightInputMode() ? Graphics.boxWidth - width : 0;\nconst y = this.mainAreaTop();\nreturn new Rectangle(x, y, width, height);"
 *
 * @param StatusWindow
 * @text 状态窗口
 *
 * @param StatusBgType:num
 * @text 背景类型
 * @parent StatusWindow
 * @type select
 * @option 0 - 窗口
 * @value 0
 * @option 1 - 暗淡
 * @value 1
 * @option 2 - 透明
 * @value 2
 * @desc 选择此窗口的背景类型。
 * @default 0
 *
 * @param StatusRect:func
 * @text JS: X, Y, W, H
 * @parent StatusWindow
 * @type note
 * @desc 用于确定此窗口尺寸的代码。
 * @default "const width = Graphics.boxWidth - this.mainCommandWidth();\nconst height = this._skillTypeWindow.height;\nconst x = this.isRightInputMode() ? 0 : Graphics.boxWidth - width;\nconst y = this.mainAreaTop();\nreturn new Rectangle(x, y, width, height);"
 *
 * @param ItemWindow
 * @text 物品窗口
 *
 * @param ItemBgType:num
 * @text 背景类型
 * @parent ItemWindow
 * @type select
 * @option 0 - 窗口
 * @value 0
 * @option 1 - 暗淡
 * @value 1
 * @option 2 - 透明
 * @value 2
 * @desc 选择此窗口的背景类型。
 * @default 0
 *
 * @param ItemRect:func
 * @text JS: X, Y, W, H
 * @parent ItemWindow
 * @type note
 * @desc 用于确定此窗口尺寸的代码。
 * @default "const x = 0;\nconst y = this._statusWindow.y + this._statusWindow.height;\nconst width = Graphics.boxWidth;\nconst height = this.mainAreaHeight() - this._statusWindow.height;\nreturn new Rectangle(x, y, width, height);"
 *
 * @param ActorWindow
 * @text 角色窗口
 *
 * @param ActorBgType:num
 * @text 背景类型
 * @parent ActorWindow
 * @type select
 * @option 0 - 窗口
 * @value 0
 * @option 1 - 暗淡
 * @value 1
 * @option 2 - 透明
 * @value 2
 * @desc 选择此窗口的背景类型。
 * @default 0
 *
 * @param ActorRect:func
 * @text JS: X, Y, W, H
 * @parent ActorWindow
 * @type note
 * @desc 用于确定此窗口尺寸的代码。
 * @default "const x = 0;\nconst y = this.mainAreaTop();\nconst width = Graphics.boxWidth;\nconst height = this.mainAreaHeight();\nreturn new Rectangle(x, y, width, height);"
 */

/* ----------------------------------------------------------------------------
 * 装备菜单设置
 * ----------------------------------------------------------------------------
 */
/*~struct~EquipMenu:
 *
 * @param HelpWindow
 * @text 帮助窗口
 *
 * @param HelpBgType:num
 * @text 背景类型
 * @parent HelpWindow
 * @type select
 * @option 0 - 窗口
 * @value 0
 * @option 1 - 暗淡
 * @value 1
 * @option 2 - 透明
 * @value 2
 * @desc 选择此窗口的背景类型。
 * @default 0
 *
 * @param HelpRect:func
 * @text JS: X, Y, W, H
 * @parent HelpWindow
 * @type note
 * @desc 用于确定此窗口尺寸的代码。
 * @default "const x = 0;\nconst y = this.helpAreaTop();\nconst width = Graphics.boxWidth;\nconst height = this.helpAreaHeight();\nreturn new Rectangle(x, y, width, height);"
 *
 * @param StatusWindow
 * @text 状态窗口
 *
 * @param StatusBgType:num
 * @text 背景类型
 * @parent StatusWindow
 * @type select
 * @option 0 - 窗口
 * @value 0
 * @option 1 - 暗淡
 * @value 1
 * @option 2 - 透明
 * @value 2
 * @desc 选择此窗口的背景类型。
 * @default 0
 *
 * @param StatusRect:func
 * @text JS: X, Y, W, H
 * @parent StatusWindow
 * @type note
 * @desc 用于确定此窗口尺寸的代码。
 * @default "const x = 0;\nconst y = this.mainAreaTop();\nconst width = this.statusWidth();\nconst height = this.mainAreaHeight();\nreturn new Rectangle(x, y, width, height);"
 *
 * @param CommandWindow
 * @text 命令窗口
 *
 * @param CommandBgType:num
 * @text 背景类型
 * @parent CommandWindow
 * @type select
 * @option 0 - 窗口
 * @value 0
 * @option 1 - 暗淡
 * @value 1
 * @option 2 - 透明
 * @value 2
 * @desc 选择此窗口的背景类型。
 * @default 0
 *
 * @param CommandRect:func
 * @text JS: X, Y, W, H
 * @parent CommandWindow
 * @type note
 * @desc 用于确定此窗口尺寸的代码。
 * @default "const x = this.statusWidth();\nconst y = this.mainAreaTop();\nconst rows = 1;\nconst width = Graphics.boxWidth - this.statusWidth();\nconst height = this.calcWindowHeight(rows, true);\nreturn new Rectangle(x, y, width, height);"
 *
 * @param SlotWindow
 * @text 插槽窗口
 *
 * @param SlotBgType:num
 * @text 背景类型
 * @parent SlotWindow
 * @type select
 * @option 0 - 窗口
 * @value 0
 * @option 1 - 暗淡
 * @value 1
 * @option 2 - 透明
 * @value 2
 * @desc 选择此窗口的背景类型。
 * @default 0
 *
 * @param SlotRect:func
 * @text JS: X, Y, W, H
 * @parent SlotWindow
 * @type note
 * @desc 用于确定此窗口尺寸的代码。
 * @default "const commandWindowRect = this.commandWindowRect();\nconst x = this.statusWidth();\nconst y = commandWindowRect.y + commandWindowRect.height;\nconst width = Graphics.boxWidth - this.statusWidth();\nconst height = this.mainAreaHeight() - commandWindowRect.height;\nreturn new Rectangle(x, y, width, height);"
 *
 * @param ItemWindow
 * @text 物品窗口
 *
 * @param ItemBgType:num
 * @text 背景类型
 * @parent ItemWindow
 * @type select
 * @option 0 - 窗口
 * @value 0
 * @option 1 - 暗淡
 * @value 1
 * @option 2 - 透明
 * @value 2
 * @desc 选择此窗口的背景类型。
 * @default 0
 *
 * @param ItemRect:func
 * @text JS: X, Y, W, H
 * @parent ItemWindow
 * @type note
 * @desc 用于确定此窗口尺寸的代码。
 * @default "return this.slotWindowRect();"
 */

/* ----------------------------------------------------------------------------
 * 状态菜单设置
 * ----------------------------------------------------------------------------
 */
/*~struct~StatusMenu:
 *
 * @param ProfileWindow
 * @text 个人简介窗口
 *
 * @param ProfileBgType:num
 * @text 背景类型
 * @parent ProfileWindow
 * @type select
 * @option 0 - 窗口
 * @value 0
 * @option 1 - 暗淡
 * @value 1
 * @option 2 - 透明
 * @value 2
 * @desc 选择此窗口的背景类型。
 * @default 0
 *
 * @param ProfileRect:func
 * @text JS: X, Y, W, H
 * @parent ProfileWindow
 * @type note
 * @desc 用于确定此窗口尺寸的代码。
 * @default "const width = Graphics.boxWidth;\nconst height = this.profileHeight();\nconst x = 0;\nconst y = this.mainAreaBottom() - height;\nreturn new Rectangle(x, y, width, height);"
 *
 * @param StatusWindow
 * @text 状态窗口
 *
 * @param StatusBgType:num
 * @text 背景类型
 * @parent StatusWindow
 * @type select
 * @option 0 - 窗口
 * @value 0
 * @option 1 - 暗淡
 * @value 1
 * @option 2 - 透明
 * @value 2
 * @desc 选择此窗口的背景类型。
 * @default 0
 *
 * @param StatusRect:func
 * @text JS: X, Y, W, H
 * @parent StatusWindow
 * @type note
 * @desc 用于确定此窗口尺寸的代码。
 * @default "const x = 0;\nconst y = this.mainAreaTop();\nconst width = Graphics.boxWidth;\nconst height = this.statusParamsWindowRect().y - y;\nreturn new Rectangle(x, y, width, height);"
 *
 * @param StatusParamsWindow
 * @text 参数窗口
 *
 * @param StatusParamsBgType:num
 * @text 背景类型
 * @parent StatusParamsWindow
 * @type select
 * @option 0 - 窗口
 * @value 0
 * @option 1 - 暗淡
 * @value 1
 * @option 2 - 透明
 * @value 2
 * @desc 选择此窗口的背景类型。
 * @default 0
 *
 * @param StatusParamsRect:func
 * @text JS: X, Y, W, H
 * @parent StatusParamsWindow
 * @type note
 * @desc 用于确定此窗口尺寸的代码。
 * @default "const width = this.statusParamsWidth();\nconst height = this.statusParamsHeight();\nconst x = 0;\nconst y = this.mainAreaBottom() - this.profileHeight() - height;\nreturn new Rectangle(x, y, width, height);"
 *
 * @param StatusEquipWindow
 * @text 装备窗口
 *
 * @param StatusEquipBgType:num
 * @text 背景类型
 * @parent StatusEquipWindow
 * @type select
 * @option 0 - 窗口
 * @value 0
 * @option 1 - 暗淡
 * @value 1
 * @option 2 - 透明
 * @value 2
 * @desc 选择此窗口的背景类型。
 * @default 0
 *
 * @param StatusEquipRect:func
 * @text JS: X, Y, W, H
 * @parent StatusEquipWindow
 * @type note
 * @desc 用于确定此窗口尺寸的代码。
 * @default "const width = Graphics.boxWidth - this.statusParamsWidth();\nconst height = this.statusParamsHeight();\nconst x = this.statusParamsWidth();\nconst y = this.mainAreaBottom() - this.profileHeight() - height;\nreturn new Rectangle(x, y, width, height);"
 *
 */
/* ----------------------------------------------------------------------------
 * 选项菜单设置
 * ----------------------------------------------------------------------------
 */
/*~struct~OptionsMenu:
 *
 * @param OptionsWindow
 * @text 选项窗口
 *
 * @param OptionsBgType:num
 * @text 背景类型
 * @parent OptionsWindow
 * @type select
 * @option 0 - 窗口
 * @value 0
 * @option 1 - 暗淡
 * @value 1
 * @option 2 - 透明
 * @value 2
 * @desc 选择此窗口的背景类型。
 * @default 0
 *
 * @param OptionsRect:func
 * @text JS: X, Y, W, H
 * @parent OptionsWindow
 * @type note
 * @desc 用于确定此窗口尺寸的代码。
 * @default "const n = Math.min(this.maxCommands(), this.maxVisibleCommands());\nconst width = 400;\nconst height = this.calcWindowHeight(n, true);\nconst x = (Graphics.boxWidth - width) / 2;\nconst y = (Graphics.boxHeight - height) / 2;\nreturn new Rectangle(x, y, width, height);"
 *
 */
/* ----------------------------------------------------------------------------
 * 存档菜单设置
 * ----------------------------------------------------------------------------
 */
/*~struct~SaveMenu:
 *
 * @param HelpWindow
 * @text 帮助窗口
 *
 * @param HelpBgType:num
 * @text 背景类型
 * @parent HelpWindow
 * @type select
 * @option 0 - 窗口
 * @value 0
 * @option 1 - 暗淡
 * @value 1
 * @option 2 - 透明
 * @value 2
 * @desc 选择此窗口的背景类型。
 * @default 0
 *
 * @param HelpRect:func
 * @text JS: X, Y, W, H
 * @parent HelpWindow
 * @type note
 * @desc 用于确定此窗口尺寸的代码。
 * @default "const x = 0;\nconst y = this.mainAreaTop();\nconst rows = 1;\nconst width = Graphics.boxWidth;\nconst height = this.calcWindowHeight(rows, false);\nreturn new Rectangle(x, y, width, height);"
 *
 * @param ListWindow
 * @text 列表窗口
 *
 * @param ListBgType:num
 * @text 背景类型
 * @parent ListWindow
 * @type select
 * @option 0 - 窗口
 * @value 0
 * @option 1 - 暗淡
 * @value 1
 * @option 2 - 透明
 * @value 2
 * @desc 选择此窗口的背景类型。
 * @default 0
 *
 * @param ListRect:func
 * @text JS: X, Y, W, H
 * @parent ListWindow
 * @type note
 * @desc 用于确定此窗口尺寸的代码。
 * @default "const x = 0;\nconst y = this.mainAreaTop() + this._helpWindow.height;\nconst width = Graphics.boxWidth;\nconst height = this.mainAreaHeight() - this._helpWindow.height;\nreturn new Rectangle(x, y, width, height);"
 *
 */

/* ----------------------------------------------------------------------------
 * 载入菜单设置
 * ----------------------------------------------------------------------------
 */
/*~struct~LoadMenu:
 *
 * @param HelpWindow
 * @text 帮助窗口
 *
 * @param HelpBgType:num
 * @text 背景类型
 * @parent HelpWindow
 * @type select
 * @option 0 - 窗口
 * @value 0
 * @option 1 - 暗淡
 * @value 1
 * @option 2 - 透明
 * @value 2
 * @desc 选择此窗口的背景类型。
 * @default 0
 *
 * @param HelpRect:func
 * @text JS: X, Y, W, H
 * @parent HelpWindow
 * @type note
 * @desc 用于确定此窗口尺寸的代码。
 * @default "const x = 0;\nconst y = this.mainAreaTop();\nconst rows = 1;\nconst width = Graphics.boxWidth;\nconst height = this.calcWindowHeight(rows, false);\nreturn new Rectangle(x, y, width, height);"
 *
 * @param ListWindow
 * @text 列表窗口
 *
 * @param ListBgType:num
 * @text 背景类型
 * @parent ListWindow
 * @type select
 * @option 0 - 窗口
 * @value 0
 * @option 1 - 暗淡
 * @value 1
 * @option 2 - 透明
 * @value 2
 * @desc 选择此窗口的背景类型。
 * @default 0
 *
 * @param ListRect:func
 * @text JS: X, Y, W, H
 * @parent ListWindow
 * @type note
 * @desc 用于确定此窗口尺寸的代码。
 * @default "const x = 0;\nconst y = this.mainAreaTop() + this._helpWindow.height;\nconst width = Graphics.boxWidth;\nconst height = this.mainAreaHeight() - this._helpWindow.height;\nreturn new Rectangle(x, y, width, height);"
 *
 */
/* ----------------------------------------------------------------------------
 * 游戏结束设置
 * ----------------------------------------------------------------------------
 */
/*~struct~GameEnd:
 *
 * @param CommandList:arraystruct
 * @text 命令窗口列表
 * @type struct<Command>[]
 * @desc 游戏结束界面使用的窗口命令。
 * 在这里添加新命令。
 * @default ["{\"Symbol:str\":\"toTitle\",\"TextStr:str\":\"未命名\",\"TextJS:func\":\"\\\"return TextManager.toTitle;\\\"\",\"ShowJS:func\":\"\\\"return true;\\\"\",\"EnableJS:func\":\"\\\"return true;\\\"\",\"ExtJS:func\":\"\\\"return null;\\\"\",\"CallHandlerJS:func\":\"\\\"SceneManager._scene.commandToTitle();\\\"\"}","{\"Symbol:str\":\"cancel\",\"TextStr:str\":\"未命名\",\"TextJS:func\":\"\\\"return TextManager.cancel;\\\"\",\"ShowJS:func\":\"\\\"return true;\\\"\",\"EnableJS:func\":\"\\\"return true;\\\"\",\"ExtJS:func\":\"\\\"return null;\\\"\",\"CallHandlerJS:func\":\"\\\"SceneManager._scene.popScene();\\\"\"}"]
 *
 * @param CommandBgType:num
 * @text 背景类型
 * @parent CommandList:arraystruct
 * @type select
 * @option 0 - 窗口
 * @value 0
 * @option 1 - 暗淡
 * @value 1
 * @option 2 - 透明
 * @value 2
 * @desc 选择此窗口的背景类型。
 * @default 0
 *
 * @param CommandRect:func
 * @text JS: X, Y, W, H
 * @parent CommandList:arraystruct
 * @type note
 * @desc 用于确定此窗口尺寸的代码。
 * @default "const rows = 2;\nconst width = this.mainCommandWidth();\nconst height = this.calcWindowHeight(rows, true);\nconst x = (Graphics.boxWidth - width) / 2;\nconst y = (Graphics.boxHeight - height) / 2;\nreturn new Rectangle(x, y, width, height);"
 *
 */
/* ----------------------------------------------------------------------------
 * 商店菜单设置
 * ----------------------------------------------------------------------------
 */
/*~struct~ShopMenu:
 *
 * @param HelpWindow
 * @text 帮助窗口
 *
 * @param HelpBgType:num
 * @text 背景类型
 * @parent HelpWindow
 * @type select
 * @option 0 - 窗口
 * @value 0
 * @option 1 - 暗淡
 * @value 1
 * @option 2 - 透明
 * @value 2
 * @desc 选择此窗口的背景类型。
 * @default 0
 *
 * @param HelpRect:func
 * @text JS: X, Y, W, H
 * @parent HelpWindow
 * @type note
 * @desc 用于确定此窗口尺寸的代码。
 * @default "const wx = 0;\nconst wy = this.helpAreaTop();\nconst ww = Graphics.boxWidth;\nconst wh = this.helpAreaHeight();\nreturn new Rectangle(wx, wy, ww, wh);"
 *
 * @param GoldWindow
 * @text 金币窗口
 *
 * @param GoldBgType:num
 * @text 背景类型
 * @parent GoldWindow
 * @type select
 * @option 0 - 窗口
 * @value 0
 * @option 1 - 暗淡
 * @value 1
 * @option 2 - 透明
 * @value 2
 * @desc 选择此窗口的背景类型。
 * @default 0
 *
 * @param GoldRect:func
 * @text JS: X, Y, W, H
 * @parent GoldWindow
 * @type note
 * @desc 用于确定此窗口尺寸的代码。
 * @default "const rows = 1;\nconst width = this.mainCommandWidth();\nconst height = this.calcWindowHeight(rows, true);\nconst x = Graphics.boxWidth - width;\nconst y = this.mainAreaTop();\nreturn new Rectangle(x, y, width, height);"
 *
 * @param CommandWindow
 * @text 命令窗口
 *
 * @param CommandBgType:num
 * @text 背景类型
 * @parent CommandWindow
 * @type select
 * @option 0 - 窗口
 * @value 0
 * @option 1 - 暗淡
 * @value 1
 * @option 2 - 透明
 * @value 2
 * @desc 选择此窗口的背景类型。
 * @default 0
 *
 * @param CommandRect:func
 * @text JS: X, Y, W, H
 * @parent CommandWindow
 * @type note
 * @desc 用于确定此窗口尺寸的代码。
 * @default "const x = 0;\nconst y = this.mainAreaTop();\nconst rows = 1;\nconst width = this._goldWindow.x;\nconst height = this.calcWindowHeight(rows, true);\nreturn new Rectangle(x, y, width, height);"
 *
 * @param DummyWindow
 * @text 虚拟窗口
 *
 * @param DummyBgType:num
 * @text 背景类型
 * @parent DummyWindow
 * @type select
 * @option 0 - 窗口
 * @value 0
 * @option 1 - 暗淡
 * @value 1
 * @option 2 - 透明
 * @value 2
 * @desc 选择此窗口的背景类型。
 * @default 0
 *
 * @param DummyRect:func
 * @text JS: X, Y, W, H
 * @parent DummyWindow
 * @type note
 * @desc 用于确定此窗口尺寸的代码。
 * @default "const x = 0;\nconst y = this._commandWindow.y + this._commandWindow.height;\nconst width = Graphics.boxWidth;\nconst height = this.mainAreaHeight() - this._commandWindow.height;\nreturn new Rectangle(x, y, width, height);"
 *
 * @param NumberWindow
 * @text 数字窗口
 *
 * @param NumberBgType:num
 * @text 背景类型
 * @parent NumberWindow
 * @type select
 * @option 0 - 窗口
 * @value 0
 * @option 1 - 暗淡
 * @value 1
 * @option 2 - 透明
 * @value 2
 * @desc 选择此窗口的背景类型。
 * @default 0
 *
 * @param NumberRect:func
 * @text JS: X, Y, W, H
 * @parent NumberWindow
 * @type note
 * @desc 用于确定此窗口尺寸的代码。
 * @default "const x = 0;\nconst y = this._dummyWindow.y;\nconst width = Graphics.boxWidth - this.statusWidth();\nconst height = this._dummyWindow.height;\nreturn new Rectangle(x, y, width, height);"
 *
 * @param StatusWindow
 * @text 状态窗口
 *
 * @param StatusBgType:num
 * @text 背景类型
 * @parent StatusWindow
 * @type select
 * @option 0 - 窗口
 * @value 0
 * @option 1 - 暗淡
 * @value 1
 * @option 2 - 透明
 * @value 2
 * @desc 选择此窗口的背景类型。
 * @default 0
 *
 * @param StatusRect:func
 * @text JS: X, Y, W, H
 * @parent StatusWindow
 * @type note
 * @desc 用于确定此窗口尺寸的代码。
 * @default "const width = this.statusWidth();\nconst height = this._dummyWindow.height;\nconst x = Graphics.boxWidth - width;\nconst y = this._dummyWindow.y;\nreturn new Rectangle(x, y, width, height);"
 *
 * @param BuyWindow
 * @text 购买窗口
 *
 * @param BuyBgType:num
 * @text 背景类型
 * @parent BuyWindow
 * @type select
 * @option 0 - 窗口
 * @value 0
 * @option 1 - 暗淡
 * @value 1
 * @option 2 - 透明
 * @value 2
 * @desc 选择此窗口的背景类型。
 * @default 0
 *
 * @param BuyRect:func
 * @text JS: X, Y, W, H
 * @parent BuyWindow
 * @type note
 * @desc 用于确定此窗口尺寸的代码。
 * @default "const x = 0;\nconst y = this._dummyWindow.y;\nconst width = Graphics.boxWidth - this.statusWidth();\nconst height = this._dummyWindow.height;\nreturn new Rectangle(x, y, width, height);"
 *
 * @param CategoryWindow
 * @text 分类窗口
 *
 * @param CategoryBgType:num
 * @text 背景类型
 * @parent CategoryWindow
 * @type select
 * @option 0 - 窗口
 * @value 0
 * @option 1 - 暗淡
 * @value 1
 * @option 2 - 透明
 * @value 2
 * @desc 选择此窗口的背景类型。
 * @default 0
 *
 * @param CategoryRect:func
 * @text JS: X, Y, W, H
 * @parent CategoryWindow
 * @type note
 * @desc 用于确定此窗口尺寸的代码。
 * @default "const x = 0;\nconst y = this._dummyWindow.y;\nconst rows = 1;\nconst width = Graphics.boxWidth;\nconst height = this.calcWindowHeight(rows, true);\nreturn new Rectangle(x, y, width, height);"
 *
 * @param SellWindow
 * @text 出售窗口
 *
 * @param SellBgType:num
 * @text 背景类型
 * @parent SellWindow
 * @type select
 * @option 0 - 窗口
 * @value 0
 * @option 1 - 暗淡
 * @value 1
 * @option 2 - 透明
 * @value 2
 * @desc 选择此窗口的背景类型。
 * @default 0
 *
 * @param SellRect:func
 * @text JS: X, Y, W, H
 * @parent SellWindow
 * @type note
 * @desc 用于确定此窗口尺寸的代码。
 * @default "const x = 0;\nconst y = this._categoryWindow.y + this._categoryWindow.height;\nconst width = Graphics.boxWidth;\nconst height =\n    this.mainAreaHeight() -\n    this._commandWindow.height -\n    this._categoryWindow.height;\nreturn new Rectangle(x, y, width, height);"
 *
 */

/* ----------------------------------------------------------------------------
 * 名称菜单设置
 * ----------------------------------------------------------------------------
 */
/*~struct~NameMenu:
 *
 * @param EditWindow
 * @text 编辑窗口
 *
 * @param EditBgType:num
 * @text 背景类型
 * @parent EditWindow
 * @type select
 * @option 0 - 窗口
 * @value 0
 * @option 1 - 暗淡
 * @value 1
 * @option 2 - 透明
 * @value 2
 * @desc 选择此窗口的背景类型。
 * @default 0
 *
 * @param EditRect:func
 * @text JS: X, Y, W, H
 * @parent EditWindow
 * @type note
 * @desc 用于确定此窗口尺寸的代码。
 * @default "const rows = 9;\nconst inputWindowHeight = this.calcWindowHeight(rows, true);\nconst padding = $gameSystem.windowPadding();\nconst width = 600;\nconst height = Math.min(ImageManager.faceHeight + padding * 2, this.mainAreaHeight() - inputWindowHeight);\nconst x = (Graphics.boxWidth - width) / 2;\nconst y = (this.mainAreaHeight() - (height + inputWindowHeight)) / 2 + this.mainAreaTop();\nreturn new Rectangle(x, y, width, height);"
 *
 * @param InputWindow
 * @text 输入窗口
 *
 * @param InputBgType:num
 * @text 背景类型
 * @parent InputWindow
 * @type select
 * @option 0 - 窗口
 * @value 0
 * @option 1 - 暗淡
 * @value 1
 * @option 2 - 透明
 * @value 2
 * @desc 选择此窗口的背景类型。
 * @default 0
 *
 * @param InputRect:func
 * @text JS: X, Y, W, H
 * @parent InputWindow
 * @type note
 * @desc 用于确定此窗口尺寸的代码。
 * @default "const x = this._editWindow.x;\nconst y = this._editWindow.y + this._editWindow.height;\nconst rows = 9;\nconst width = this._editWindow.width;\nconst height = this.calcWindowHeight(rows, true);\nreturn new Rectangle(x, y, width, height);"
 *
 */
/* ----------------------------------------------------------------------------
 * 标题设置
 * ----------------------------------------------------------------------------
 */
/*~struct~Title:
 *
 * @param TitleScreen
 * @text 标题界面
 *
 * @param DocumentTitleFmt:str
 * @text 文档标题格式
 * @parent TitleScreen
 * @desc 在文档标题中显示文本的格式。
 * %1 - 主标题，%2 - 副标题，%3 - 版本
 * @default %1: %2 - 版本 %3
 *
 * @param Subtitle:str
 * @text 副标题
 * @parent TitleScreen
 * @desc 标题名称下要显示的副标题。
 * @default 副标题
 *
 * @param Version:str
 * @text 版本
 * @parent TitleScreen
 * @desc 在标题屏幕角落显示的版本。
 * @default 0.00
 *
 * @param drawGameTitle:func
 * @text JS: 绘制标题
 * @type note
 * @parent TitleScreen
 * @desc 用于绘制游戏标题的代码。
 * @default "const x = 20;\nconst y = Graphics.height / 4;\nconst maxWidth = Graphics.width - x * 2;\nconst text = $dataSystem.gameTitle;\nconst bitmap = this._gameTitleSprite.bitmap;\nbitmap.fontFace = $gameSystem.mainFontFace();\nbitmap.outlineColor = \"black\";\nbitmap.outlineWidth = 8;\nbitmap.fontSize = 72;\nbitmap.drawText(text, x, y, maxWidth, 48, \"center\");"
 *
 * @param drawGameSubtitle:func
 * @text JS: 绘制副标题
 * @type note
 * @parent TitleScreen
 * @desc 用于绘制游戏副标题的代码。
 * @default "const x = 20;\nconst y = Graphics.height / 4 + 72;\nconst maxWidth = Graphics.width - x * 2;\nconst text = Scene_Title.subtitle;\nconst bitmap = this._gameTitleSprite.bitmap;\nbitmap.fontFace = $gameSystem.mainFontFace();\nbitmap.outlineColor = \"black\";\nbitmap.outlineWidth = 6;\nbitmap.fontSize = 48;\nbitmap.drawText(text, x, y, maxWidth, 48, \"center\");"
 *
 * @param drawGameVersion:func
 * @text JS: 绘制版本
 * @type note
 * @parent TitleScreen
 * @desc 用于绘制游戏版本的代码。
 * @default "const bitmap = this._gameTitleSprite.bitmap;\nconst x = 0;\nconst y = Graphics.height - 20;\nconst width = Math.round(Graphics.width / 4);\nconst height = 20;\nconst c1 = ColorManager.dimColor1();\nconst c2 = ColorManager.dimColor2();\nconst text = '版本 ' + Scene_Title.version;\nbitmap.gradientFillRect(x, y, width, height, c1, c2);\nbitmap.fontFace = $gameSystem.mainFontFace();\nbitmap.outlineColor = \"black\";\nbitmap.outlineWidth = 3;\nbitmap.fontSize = 16;\nbitmap.drawText(text, x + 4, y, Graphics.width, height, \"left\");"
 *
 * @param CommandRect:func
 * @text JS: X, Y, W, H
 * @parent TitleScreen
 * @type note
 * @desc 用于确定此窗口尺寸的代码。
 * @default "const offsetX = $dataSystem.titleCommandWindow.offsetX;\nconst offsetY = $dataSystem.titleCommandWindow.offsetY;\nconst rows = this.commandWindowRows();\nconst width = this.mainCommandWidth();\nconst height = this.calcWindowHeight(rows, true);\nconst x = (Graphics.boxWidth - width) / 2 + offsetX;\nconst y = Graphics.boxHeight - height - 96 + offsetY;\nreturn new Rectangle(x, y, width, height);"
 *
 * @param ButtonFadeSpeed:num
 * @text 按钮淡入速度
 * @parent TitleScreen
 * @type number
 * @min 1
 * @max 255
 * @desc 按钮淡入的速度 (1-255)。
 * @default 4
 *
 */

/* ----------------------------------------------------------------------------
 * 参数设置
 * ----------------------------------------------------------------------------
 */
/*~struct~Param:
 *
 * @param DisplayedParams:arraystr
 * @text 显示参数
 * @type combo[]
 * @option 最大HP
 * @option 最大MP
 * @option 攻击力
 * @option 防御力
 * @option 魔法攻击
 * @option 魔法防御
 * @option 敏捷度
 * @option 幸运值
 * @desc 游戏中显示的参数列表。
 * @default ["攻击力","防御力","魔法攻击","魔法防御","敏捷度","幸运值"]
 *
 * @param ExtDisplayedParams:arraystr
 * @text 扩展参数
 * @parent DisplayedParams:arraystr
 * @type combo[]
 * @option 最大HP
 * @option 最大MP
 * @option 攻击力
 * @option 防御力
 * @option 魔法攻击
 * @option 魔法防御
 * @option 敏捷度
 * @option 幸运值
 * @desc 在扩展场景中显示的参数列表（用于其他VisuStella插件）。
 * @default ["最大HP","最大MP","攻击力","防御力","魔法攻击","魔法防御","敏捷度","幸运值"]
 *
 * @param BasicParameters
 * @text 基本参数
 *
 * @param ShowActorLevel:eval
 * @text 显示角色等级？
 * @parent BasicParameters
 * @type boolean
 * @on 显示
 * @off 不显示
 * @desc 在显示角色时是否显示角色等级？
 * 适用于游戏中的大多数窗口。
 * @default true
 *
 * @param CrisisRate:num
 * @text HP 危机率
 * @parent BasicParameters
 * @desc 角色被视为处于危机状态的HP比率。
 * @default 0.25
 *
 *
 /* ----------------------------------------------------------------------------
 * 基本参数公式
 * ----------------------------------------------------------------------------
 */
/*~struct~Param:
 *
 * @param DisplayedParams:arraystr
 * @text 显示参数
 * @type combo[]
 * @option 最大HP
 * @option 最大MP
 * @option 攻击力
 * @option 防御力
 * @option 魔法攻击
 * @option 魔法防御
 * @option 敏捷度
 * @option 幸运值
 * @desc 游戏中显示的参数列表。
 * @default ["攻击力","防御力","魔法攻击","魔法防御","敏捷度","幸运值"]
 *
 * @param ExtDisplayedParams:arraystr
 * @text 扩展参数
 * @parent DisplayedParams:arraystr
 * @type combo[]
 * @option 最大HP
 * @option 最大MP
 * @option 攻击力
 * @option 防御力
 * @option 魔法攻击
 * @option 魔法防御
 * @option 敏捷度
 * @option 幸运值
 * @desc 在扩展场景中显示的参数列表（用于其他VisuStella插件）。
 * @default ["最大HP","最大MP","攻击力","防御力","魔法攻击","魔法防御","敏捷度","幸运值"]
 *
 * @param BasicParameters
 * @text 基本参数
 *
 * @param ShowActorLevel:eval
 * @text 显示角色等级？
 * @parent BasicParameters
 * @type boolean
 * @on 显示
 * @off 不显示
 * @desc 在显示角色时是否显示角色等级？
 * 适用于游戏中的大多数窗口。
 * @default true
 *
 * @param CrisisRate:num
 * @text HP 危机率
 * @parent BasicParameters
 * @desc 角色被视为处于危机状态的HP比率。
 * @default 0.25
 *
 * @param BasicParameterFormula:func
 * @text JS：参数公式
 * @parent BasicParameters
 * @type note
 * @desc 用于计算所有8个基本参数总值的公式：最大HP、最大MP、攻击力、防御力、魔法攻击、魔法防御、敏捷度、幸运值。
 * @default "// 确定在此计算中使用的变量。\nlet paramId = arguments[0];\nlet base = this.paramBase(paramId);\nlet plus = this.paramPlus(paramId);\nlet paramRate = this.paramRate(paramId);\nlet buffRate = this.paramBuffRate(paramId);\nlet flatBonus = this.paramFlatBonus(paramId);\n\n// 计算总参数值的公式。\nlet value = (base + plus) * paramRate * buffRate + flatBonus;\n\n// 确定极限值\nconst maxValue = this.paramMax(paramId);\nconst minValue = this.paramMin(paramId);\n\n// 最终值\nreturn Math.round(value.clamp(minValue, maxValue));"
 *
 * @param BasicParamCaps
 * @text 参数上限
 * @parent BasicParameters
 *
 * @param BasicActorParamCaps
 * @text 角色
 * @parent BasicParamCaps
 *
 * @param BasicActorParamMax0:str
 * @text 最大HP上限
 * @parent BasicActorParamCaps
 * @desc 用于确定最大HP上限的公式。
 * 如果不希望该参数有上限，请使用0。
 * @default 9999
 *
 * @param BasicActorParamMax1:str
 * @text 最大MP上限
 * @parent BasicActorParamCaps
 * @desc 用于确定最大MP上限的公式。
 * 如果不希望该参数有上限，请使用0。
 * @default 9999
 *
 * @param BasicActorParamMax2:str
 * @text 攻击力上限
 * @parent BasicActorParamCaps
 * @desc 用于确定攻击力上限的公式。
 * 如果不希望该参数有上限，请使用0。
 * @default 999
 *
 * @param BasicActorParamMax3:str
 * @text 防御力上限
 * @parent BasicActorParamCaps
 * @desc 用于确定防御力上限的公式。
 * 如果不希望该参数有上限，请使用0。
 * @default 999
 *
 * @param BasicActorParamMax4:str
 * @text 魔法攻击上限
 * @parent BasicActorParamCaps
 * @desc 用于确定魔法攻击上限的公式。
 * 如果不希望该参数有上限，请使用0。
 * @default 999
 *
 * @param BasicActorParamMax5:str
 * @text 魔法防御上限
 * @parent BasicActorParamCaps
 * @desc 用于确定魔法防御上限的公式。
 * 如果不希望该参数有上限，请使用0。
 * @default 999
 *
 * @param BasicActorParamMax6:str
 * @text 敏捷度上限
 * @parent BasicActorParamCaps
 * @desc 用于确定敏捷度上限的公式。
 * 如果不希望该参数有上限，请使用0。
 * @default 999
 *
 * @param BasicActorParamMax7:str
 * @text 幸运值上限
 * @parent BasicActorParamCaps
 * @desc 用于确定幸运值上限的公式。
 * 如果不希望该参数有上限，请使用0。
 * @default 999
 *
 * @param BasicEnemyParamCaps
 * @text 敌人
 * @parent BasicParamCaps
 *
 * @param BasicEnemyParamMax0:str
 * @text 最大HP上限
 * @parent BasicEnemyParamCaps
 * @desc 用于确定最大HP上限的公式。
 * 如果不希望该参数有上限，请使用0。
 * @default 999999
 *
 * @param BasicEnemyParamMax1:str
 * @text 最大MP上限
 * @parent BasicEnemyParamCaps
 * @desc 用于确定最大MP上限的公式。
 * 如果不希望该参数有上限，请使用0。
 * @default 9999
 *
 * @param BasicEnemyParamMax2:str
 * @text 攻击力上限
 * @parent BasicEnemyParamCaps
 * @desc 用于确定攻击力上限的公式。
 * 如果不希望该参数有上限，请使用0。
 * @default 999
 *
 * @param BasicEnemyParamMax3:str
 * @text 防御力上限
 * @parent BasicEnemyParamCaps
 * @desc 用于确定防御力上限的公式。
 * 如果不希望该参数有上限，请使用0。
 * @default 999
 *
 * @param BasicEnemyParamMax4:str
 * @text 魔法攻击上限
 * @parent BasicEnemyParamCaps
 * @desc 用于确定魔法攻击上限的公式。
 * 如果不希望该参数有上限，请使用0。
 * @default 999
 *
 * @param BasicEnemyParamMax5:str
 * @text 魔法防御上限
 * @parent BasicEnemyParamCaps
 * @desc 用于确定魔法防御上限的公式。
 * 如果不希望该参数有上限，请使用0。
 * @default 999
 *
 * @param BasicEnemyParamMax6:str
 * @text 敏捷度上限
 * @parent BasicEnemyParamCaps
 * @desc 用于确定敏捷度上限的公式。
 * 如果不希望该参数有上限，请使用0。
 * @default 999
 *
 * @param BasicEnemyParamMax7:str
 * @text 幸运值上限
 * @parent BasicEnemyParamCaps
 * @desc 用于确定幸运值上限的公式。
 * 如果不希望该参数有上限，请使用0。
 * @default 999
 *
 * @param XParameters
 * @text X参数
 *
 * @param XParameterFormula:func
 * @text JS：参数公式
 * @parent XParameters
 * @type note
 * @desc 用于计算所有10个X参数总值的公式：命中、回避、暴击率、暴击回避率、魔法回避率、魔法反射率、反击率、HP回复率、MP回复率、TP回复率。
 * @default "// 确定在此计算中使用的变量。\nlet xparamId = arguments[0];\nlet base = this.traitsSum(Game_BattlerBase.TRAIT_XPARAM, xparamId);\nlet plus = this.xparamPlus(xparamId);\nlet paramRate = this.xparamRate(xparamId);\nlet flatBonus = this.xparamFlatBonus(xparamId);\n\n// 计算总参数值的公式。\nlet value = (base + plus) * paramRate + flatBonus;\n\n// 最终值\nreturn value;"
 *
 * @param XParamVocab
 * @text 词汇
 * @parent XParameters
 *
 * @param XParamVocab0:str
 * @text 命中
 * @parent XParamVocab
 * @desc 游戏中用于此X参数的词汇。
 * @default 命中
 *
 * @param XParamVocab1:str
 * @text 回避
 * @parent XParamVocab
 * @desc 游戏中用于此X参数的词汇。
 * @default 回避
 *
 * @param XParamVocab2:str
 * @text 暴击率
 * @parent XParamVocab
 * @desc 游戏中用于此X参数的词汇。
 * @default 暴击率
 *
 * @param XParamVocab3:str
 * @text 暴击回避率
 * @parent XParamVocab
 * @desc 游戏中用于此X参数的词汇。
 * @default 暴击回避率
 *
 * @param XParamVocab4:str
 * @text 魔法回避率
 * @parent XParamVocab
 * @desc 游戏中用于此X参数的词汇。
 * @default 魔法回避率
 *
 * @param XParamVocab5:str
 * @text 魔法反射率
 * @parent XParamVocab
 * @desc 游戏中用于此X参数的词汇。
 * @default 魔法反射率
 *
 * @param XParamVocab6:str
 * @text 反击率
 * @parent XParamVocab
 * @desc 游戏中用于此X参数的词汇。
 * @default 反击率
 *
 * @param XParamVocab7:str
 * @text HP回复率
 * @parent XParamVocab
 * @desc 游戏中用于此X参数的词汇。
 * @default HP回复率
 *
 * @param XParamVocab8:str
 * @text MP回复率
 * @parent XParamVocab
 * @desc 游戏中用于此X参数的词汇。
 * @default MP回复率
 *
 * @param XParamVocab9:str
 * @text TP回复率
 * @parent XParamVocab
 * @desc 游戏中用于此X参数的词汇。
 * @default TP回复率
 *
 * @param SParameters
 * @text S参数
 *
 * @param SParameterFormula:func
 * @text JS：参数公式
 * @parent SParameters
 * @type note
 * @desc 用于计算所有10个S参数总值的公式：仇恨、防御、恢复、物品效果、MP消耗率、TP获取率、物理伤害减少率、魔法伤害减少率、地面伤害减少率、经验获取率。
 * @default "// 确定在此计算中使用的变量。\nlet sparamId = arguments[0];\nlet base = this.traitsPi(Game_BattlerBase.TRAIT_SPARAM, sparamId);\nlet plus = this.sparamPlus(sparamId);\nlet paramRate = this.sparamRate(sparamId);\nlet flatBonus = this.sparamFlatBonus(sparamId);\n\n// 计算总参数值的公式。\nlet value = (base + plus) * paramRate + flatBonus;\n\n// 最终值\nreturn value;"
 *
 * @param SParamVocab
 * @text 词汇
 * @parent SParameters
 *
 * @param SParamVocab0:str
 * @text 仇恨
 * @parent SParamVocab
 * @desc 游戏中用于此S参数的词汇。
 * @default 仇恨
 *
 * @param SParamVocab1:str
 * @text 防御
 * @parent SParamVocab
 * @desc 游戏中用于此S参数的词汇。
 * @default 防御
 *
 * @param SParamVocab2:str
 * @text 恢复
 * @parent SParamVocab
 * @desc 游戏中用于此S参数的词汇。
 * @default 恢复
 *
 * @param SParamVocab3:str
 * @text 物品效果
 * @parent SParamVocab
 * @desc 游戏中用于此S参数的词汇。
 * @default 物品效果
 *
 * @param SParamVocab4:str
 * @text MP消耗率
 * @parent SParamVocab
 * @desc 游戏中用于此S参数的词汇。
 * @default MP消耗率
 *
 * @param SParamVocab5:str
 * @text TP获取率
 * @parent SParamVocab
 * @desc 游戏中用于此S参数的词汇。
 * @default TP获取率
 *
 * @param SParamVocab6:str
 * @text 物理伤害减少率
 * @parent SParamVocab
 * @desc 游戏中用于此S参数的词汇。
 * @default 物理伤害减少率
 *
 * @param SParamVocab7:str
 * @text 魔法伤害减少率
 * @parent SParamVocab
 * @desc 游戏中用于此S参数的词汇。
 * @default 魔法伤害减少率
 *
 * @param SParamVocab8:str
 * @text 地面伤害减少率
 * @parent SParamVocab
 * @desc 游戏中用于此S参数的词汇。
 * @default 地面伤害减少率
 *
 * @param SParamVocab9:str
 * @text 经验获取率
 * @parent SParamVocab
 * @desc 游戏中用于此S参数的词汇。
 * @default 经验获取率
 *
 * @param Icons
 * @text 图标
 *
 * @param DrawIcons:eval
 * @text 绘制图标？
 * @parent Icons
 * @type boolean
 * @on 绘制
 * @off 不绘制
 * @desc 在参数名称旁边绘制图标？
 * @default true
 *
 * @param IconParam0:str
 * @text 最大HP
 * @parent Icons
 * @desc 用于此参数的图标。
 * @default 84
 *
 * @param IconParam1:str
 * @text 最大MP
 * @parent Icons
 * @desc 用于此参数的图标。
 * @default 165
 *
 * @param IconParam2:str
 * @text 攻击力
 * @parent Icons
 * @desc 用于此参数的图标。
 * @default 76
 *
 * @param IconParam3:str
 * @text 防御力
 * @parent Icons
 * @desc 用于此参数的图标。
 * @default 81
 *
 * @param IconParam4:str
 * @text 魔法攻击
 * @parent Icons
 * @desc 用于此参数的图标。
 * @default 101
 *
 * @param IconParam5:str
 * @text 魔法防御
 * @parent Icons
 * @desc 用于此参数的图标。
 * @default 133
 *
 * @param IconParam6:str
 * @text 敏捷度
 * @parent Icons
 * @desc 用于此参数的图标。
 * @default 140
 *
 * @param IconParam7:str
 * @text 幸运值
 * @parent Icons
 * @desc 用于此参数的图标。
 * @default 87
 *
 * @param IconXParam0:str
 * @text 命中
 * @parent Icons
 * @desc 用于此参数的图标。
 * @default 102
 *
 * @param IconXParam1:str
 * @text 回避
 * @parent Icons
 * @desc 用于此参数的图标。
 * @default 82
 *
 * @param IconXParam2:str
 * @text 暴击率
 * @parent Icons
 * @desc 用于此参数的图标。
 * @default 78
 *
 * @param IconXParam3:str
 * @text 暴击回避率
 * @parent Icons
 * @desc 用于此参数的图标。
 * @default 82
 *
 * @param IconXParam4:str
 * @text 魔法回避率
 * @parent Icons
 * @desc 用于此参数的图标。
 * @default 171
 *
 * @param IconXParam5:str
 * @text 魔法反射率
 * @parent Icons
 * @desc 用于此参数的图标。
 * @default 222
 *
 * @param IconXParam6:str
 * @text 反击率
 * @parent Icons
 * @desc 用于此参数的图标。
 * @default 77
 *
 * @param IconXParam7:str
 * @text HP回复率
 * @parent Icons
 * @desc 用于此参数的图标。
 * @default 72
 *
 * @param IconXParam8:str
 * @text MP回复率
 * @parent Icons
 * @desc 用于此参数的图标。
 * @default 72
 *
 * @param IconXParam9:str
 * @text TP回复率
 * @parent Icons
 * @desc 用于此参数的图标。
 * @default 72
 *
 * @param IconSParam0:str
 * @text 仇恨
 * @parent Icons
 * @desc 用于此参数的图标。
 * @default 5
 *
 * @param IconSParam1:str
 * @text 防御
 * @parent Icons
 * @desc 用于此参数的图标。
 * @default 128
 *
 * @param IconSParam2:str
 * @text 恢复
 * @parent Icons
 * @desc 用于此参数的图标。
 * @default 72
 *
 * @param IconSParam3:str
 * @text 物品效果
 * @parent Icons
 * @desc 用于此参数的图标。
 * @default 176
 *
 * @param IconSParam4:str
 * @text MP消耗率
 * @parent Icons
 * @desc 用于此参数的图标。
 * @default 165
 *
 * @param IconSParam5:str
 * @text TP获取率
 * @parent Icons
 * @desc 用于此参数的图标。
 * @default 164
 *
 * @param IconSParam6:str
 * @text 物理伤害减少率
 * @parent Icons
 * @desc 用于此参数的图标。
 * @default 76
 *
 * @param IconSParam7:str
 * @text 魔法伤害减少率
 * @parent Icons
 * @desc 用于此参数的图标。
 * @default 79
 *
 * @param IconSParam8:str
 * @text 地面伤害减少率
 * @parent Icons
 * @desc 用于此参数的图标。
 * @default 141
 *
 * @param IconSParam9:str
 * @text 经验获取率
 * @parent Icons
 * @desc 用于此参数的图标。
 * @default 73

 *
 */
/* ----------------------------------------------------------------------------
 * 命令结构体
 * ----------------------------------------------------------------------------
 */
/*~struct~Command:
 *
 * @param Symbol:str
 * @text 符号
 * @desc 此命令使用的符号。
 * @default Symbol
 *
 * @param TextStr:str
 * @text 字符串：文本
 * @desc 此标题命令使用的显示文本。
 * 如果有值，忽略 JS：文本 版本。
 * @default 未命名
 *
 * @param TextJS:func
 * @text JS：文本
 * @type note
 * @desc 用于确定显示名称的字符串的 JavaScript 代码。
 * @default "return '文本';"
 *
 * @param ShowJS:func
 * @text JS：显示
 * @type note
 * @desc 用于确定项目是否显示的 JavaScript 代码。
 * @default "return true;"
 *
 * @param EnableJS:func
 * @text JS：启用
 * @type note
 * @desc 用于确定项目是否启用的 JavaScript 代码。
 * @default "return true;"
 *
 * @param ExtJS:func
 * @text JS：扩展
 * @type note
 * @desc 用于确定应添加的任何扩展数据的 JavaScript 代码。
 * @default "return null;"
 *
 * @param CallHandlerJS:func
 * @text JS：运行代码
 * @type note
 * @desc 选中此命令后运行的 JavaScript 代码。
 * @default ""
 *
 */
/* ----------------------------------------------------------------------------
 * 标题图片按钮
 * ----------------------------------------------------------------------------
 */
/*~struct~TitlePictureButton:
 *
 * @param PictureFilename:str
 * @text 图片文件名
 * @type file
 * @dir img/pictures/
 * @desc 用于图片的文件名。
 * @default 
 *
 * @param ButtonURL:str
 * @text 按钮 URL
 * @desc 点击后跳转到的按钮的 URL。
 * @default https://www.google.com/
 *
 * @param PositionJS:func
 * @text JS：位置
 * @type note
 * @desc 帮助确定按钮位置的 JavaScript 代码。
 * @default "this.x = Graphics.width - this.bitmap.width - 20;\nthis.y = Graphics.height - this.bitmap.height - 20;"
 *
 * @param OnLoadJS:func
 * @text JS：加载时
 * @type note
 * @desc 按钮位图加载后运行的 JavaScript 代码。
 * @default "this.opacity = 0;\nthis.visible = true;"
 *
 * @param CallHandlerJS:func
 * @text JS：运行代码
 * @type note
 * @desc 按下按钮后运行的 JavaScript 代码。
 * @default "const url = this._data.ButtonURL;\nVisuMZ.openURL(url);"
 *
 */
/* ----------------------------------------------------------------------------
 * UI 设置
 * ----------------------------------------------------------------------------
 */
/*~struct~UI:
 *
 * @param UIArea
 * @text UI 区域
 *
 * @param FadeSpeed:num
 * @text 渐变速度
 * @parent UIArea
 * @desc 过渡效果的默认渐变速度。
 * @default 24
 *
 * @param BoxMargin:num
 * @text 盒子边距
 * @parent UIArea
 * @type number
 * @min 0
 * @desc 设置屏幕边界的像素边距。
 * 默认值：4
 * @default 4
 *
 * @param CommandWidth:num
 * @text 命令窗口宽度
 * @parent UIArea
 * @type number
 * @min 1
 * @desc 标准命令窗口的宽度设置。
 * 默认值：240
 * @default 240
 *
 * @param BottomHelp:eval
 * @text 底部帮助窗口
 * @parent UIArea
 * @type boolean
 * @on 底部
 * @off 顶部
 * @desc 将帮助窗口放在屏幕底部？
 * @default false
 *
 * @param RightMenus:eval
 * @text 右对齐菜单
 * @parent UIArea
 * @type boolean
 * @on 右侧
 * @off 左侧
 * @desc 将大多数命令窗口放在屏幕右侧。
 * @default true
 *
 * @param ShowButtons:eval
 * @text 显示按钮
 * @parent UIArea
 * @type boolean
 * @on 显示
 * @off 隐藏
 * @desc 在游戏中显示可点击按钮？
 * 这将影响所有按钮。
 * @default true
 *
 * @param cancelShowButton:eval
 * @text 显示取消按钮
 * @parent ShowButtons:eval
 * @type boolean
 * @on 显示
 * @off 隐藏
 * @desc 显示取消按钮？
 * 如果“显示按钮”为 false，则将隐藏。
 * @default true
 *
 * @param menuShowButton:eval
 * @text 显示菜单按钮
 * @parent ShowButtons:eval
 * @type boolean
 * @on 显示
 * @off 隐藏
 * @desc 在地图场景中显示主菜单按钮？
 * 如果“显示按钮”为 false，则将隐藏。
 * @default true
 *
 * @param pagedownShowButton:eval
 * @text 显示翻页按钮
 * @parent ShowButtons:eval
 * @type boolean
 * @on 显示
 * @off 隐藏
 * @desc 显示翻页按钮？
 * 如果“显示按钮”为 false，则将隐藏。
 * @default true
 *
 * @param numberShowButton:eval
 * @text 显示数字按钮
 * @parent ShowButtons:eval
 * @type boolean
 * @on 显示
 * @off 隐藏
 * @desc 显示数字调整按钮？
 * 如果“显示按钮”为 false，则将隐藏。
 * @default true
 *
 * @param ButtonHeight:num
 * @text 按钮区域高度
 * @parent UIArea
 * @type number
 * @min 1
 * @desc 设置按钮区域的高度。
 * 默认值：52
 * @default 52
 *
 * @param BottomButtons:eval
 * @text 底部按钮
 * @parent UIArea
 * @type boolean
 * @on 底部
 * @off 顶部
 * @desc 将按钮放在屏幕底部？
 * @default false
 *
 * @param SideButtons:eval
 * @text 侧边按钮
 * @parent UIArea
 * @type boolean
 * @on 侧边
 * @off 正常
 * @desc 如果有空间，将按钮推到 UI 的侧边。
 * @default true
 *
 * @param StateIconsNonFrame:eval
 * @text 状态图标非框架
 * @parent UIArea
 * @type boolean
 * @on 非框架
 * @off 正常
 * @desc 用非框架系统替换精灵框架系统。
 * 更适合图标被放大的情况。
 * @default true
 *
 * @param MenuObjects
 * @text 菜单对象
 *
 * @param LvExpGauge:eval
 * @text 等级 -> EXP 游标
 * @parent MenuObjects
 * @type boolean
 * @on 绘制游标
 * @off 保持原样
 * @desc 在绘制级别下绘制一个 EXP 游标。
 * @default true
 *
 * @param ParamArrow:str
 * @text 参数箭头
 * @parent MenuObjects
 * @desc 用于显示参数值变化的箭头。
 * @default →
 *
 * @param TextCodeSupport
 * @text 文本代码支持
 *
 * @param TextCodeClassNames:eval
 * @text 类名
 * @parent TextCodeSupport
 * @type boolean
 * @on 支持文本代码
 * @off 普通文本
 * @desc 使类名支持文本代码？
 * @default true
 *
 * @param TextCodeNicknames:eval
 * @text 昵称
 * @parent TextCodeSupport
 * @type boolean
 * @on 支持文本代码
 * @off 普通文本
 * @desc 使昵称支持文本代码？
 * @default true
 *
 */

/* ----------------------------------------------------------------------------
 * 窗口设置
 * ----------------------------------------------------------------------------
 */
/*~struct~Window:
 *
 * @param WindowDefaults
 * @text 默认设置
 *
 * @param EnableMasking:eval
 * @text 启用遮罩
 * @parent WindowDefaults
 * @type boolean
 * @on 启用
 * @off 禁用
 * @desc 是否启用窗口遮罩（窗口隐藏其他窗口）？警告：启用后可能会遮挡数据。
 * @default false
 *
 * @param CorrectSkinBleeding:eval
 * @text 修正皮肤渗色
 * @parent WindowDefaults
 * @type boolean
 * @on 修正
 * @off 不修正
 * @desc 是否修正高分辨率下的窗口皮肤渗色问题？
 * @default true
 *
 * @param LineHeight:num
 * @text 行高
 * @parent WindowDefaults
 * @desc 标准窗口的默认行高。默认：36。避免使用奇数。
 * @default 36
 *
 * @param ItemPadding:num
 * @text 项目间距
 * @parent WindowDefaults
 * @desc 标准窗口的默认项目间距。默认：8。避免使用奇数。
 * @default 8
 *
 * @param BackOpacity:num
 * @text 背景不透明度
 * @parent WindowDefaults
 * @desc 标准窗口的默认背景不透明度。默认：192
 * @default 192
 *
 * @param TranslucentOpacity:num
 * @text 半透明度
 * @parent WindowDefaults
 * @desc 标准窗口的默认半透明度。默认：160
 * @default 160
 *
 * @param OpenSpeed:num
 * @text 窗口打开速度
 * @parent WindowDefaults
 * @desc 标准窗口的默认打开速度。默认：32（使用0-255之间的数字）
 * @default 32
 *
 * @param ColSpacing:num
 * @text 列间距
 * @parent WindowDefaults
 * @desc 可选择窗口的默认列间距。默认：8
 * @default 8
 *
 * @param RowSpacing:num
 * @text 行间距
 * @parent WindowDefaults
 * @desc 可选择窗口的默认行间距。默认：4
 * @default 4
 * 
 * @param ScrollBar
 * @text 滚动条
 *
 * @param ShowScrollBar:eval
 * @text 显示滚动条？
 * @parent ScrollBar
 * @type boolean
 * @on 显示
 * @off 隐藏
 * @desc 是否显示可滚动窗口的滚动条？
 * @default true
 *
 * @param BarThickness:num
 * @text 滚动条厚度
 * @parent ScrollBar
 * @type number
 * @min 1
 * @desc 滚动条的厚度。默认：2
 * @default 2
 *
 * @param BarOffset:num
 * @text 滚动条偏移
 * @parent ScrollBar
 * @desc 滚动条的偏移量。默认：+2
 * @default +2
 *
 * @param BarBodyColor:str
 * @text 滚动条主体颜色
 * @parent ScrollBar
 * @desc 使用#rrggbb表示自定义颜色，或使用窗口皮肤中的普通数字表示文本颜色。默认：0
 * @default 0
 *
 * @param OffBarColor:str
 * @text 滚动条背景颜色
 * @parent ScrollBar
 * @desc 使用#rrggbb表示自定义颜色，或使用窗口皮肤中的普通数字表示文本颜色。默认：7
 * @default 7
 *
 * @param OffBarOpacity:num
 * @text 滚动条背景不透明度
 * @parent ScrollBar
 * @type number
 * @min 1
 * @max 255
 * @desc 滚动条背景的不透明度（0-255之间）。默认：128
 * @default 128
 * 
 * @param SelectableItems
 * @text 可选项目
 *
 * @param ShowItemBackground:eval
 * @text 显示背景？
 * @parent SelectableItems
 * @type boolean
 * @on 显示
 * @off 不显示
 * @desc 可选菜单项是否有暗色背景？默认：显示
 * @default true
 *
 * @param ItemHeight:num
 * @text 项目高度间距
 * @parent SelectableItems
 * @desc 可选项目的默认高度间距。默认：8。避免使用奇数。
 * @default 8
 *
 * @param DrawItemBackgroundJS:func
 * @text JS：绘制背景
 * @parent SelectableItems
 * @type note
 * @desc 用于在可点击菜单对象后面绘制背景矩形的代码。
 * @default "const rect = arguments[0];\nconst c1 = ColorManager.itemBackColor1();\nconst c2 = ColorManager.itemBackColor2();\nconst x = rect.x;\nconst y = rect.y;\nconst w = rect.width;\nconst h = rect.height;\nthis.contentsBack.gradientFillRect(x, y, w, h, c1, c2, true);\nthis.contentsBack.strokeRect(x, y, w, h, c1);"
 *
 * @param TextPopup
 * @text 文本弹出窗口
 *
 * @param DurationPerChat:num
 * @text 每字符持续时间
 * @parent TextPopup
 * @desc 每个文本字符的持续时间增加。默认：1.5
 * @default 1.5
 *
 * @param MinDuration:num
 * @text 最小持续时间
 * @parent TextPopup
 * @type number
 * @min 1
 * @desc 窗口保持在屏幕上的最短时间。默认：90
 * @default 90
 *
 * @param MaxDuration:num
 * @text 最大持续时间
 * @parent TextPopup
 * @type number
 * @min 1
 * @desc 窗口保持在屏幕上的最长时间。默认：300
 * @default 300
 * 
 */

/* ----------------------------------------------------------------------------
 * 屏幕分辨率设置
 * ----------------------------------------------------------------------------
 */
/*~struct~ScreenResolution:
 *
 * @param 地图设置
 * 
 * @param AutoScrollLockX:eval
 * @text 锁定小地图X滚动？
 * @parent 地图设置
 * @type boolean
 * @on 自动锁定
 * @off 保持不变
 * @desc 如果地图太小，是否自动锁定X轴滚动？
 * @default true
 * 
 * @param AutoScrollLockY:eval
 * @text 锁定小地图Y滚动？
 * @parent 地图设置
 * @type boolean
 * @on 自动锁定
 * @off 保持不变
 * @desc 如果地图太小，是否自动锁定Y轴滚动？
 * @default true
 * 
 * @param DisplayLockX:num
 * @text 锁定显示X？
 * @parent 地图设置
 * @desc 对于自动滚动锁定的地图，您希望的显示X值是多少？最好使用0到1之间的数字。
 * @default 0.15625
 * 
 * @param DisplayLockY:num
 * @text 锁定显示Y？
 * @parent 地图设置
 * @desc 对于自动滚动锁定的地图，您希望的显示Y值是多少？最好使用0到1之间的数字。
 * @default 0.00000
 * 
 * @param 战斗队伍设置
 *
 * @param RepositionActors:eval
 * @text 重新定位角色
 * @parent 战斗队伍设置
 * @type boolean
 * @on 重新定位
 * @off 保持不变
 * @desc 如果屏幕分辨率发生变化，是否更新战斗中的角色位置。如果使用战斗核心插件，请忽略此选项。
 * @default true
 *
 * @param RepositionEnemies:eval
 * @text 重新定位敌人
 * @parent 战斗队伍设置
 * @type boolean
 * @on 重新定位
 * @off 保持不变
 * @desc 如果屏幕分辨率发生变化，是否更新战斗中的敌人位置。
 * @default true
 *
 * @param RepositionEnemies130:eval
 * @text 适用于MZ 1.3.0+？
 * @parent RepositionEnemies:eval
 * @type boolean
 * @on 重新定位
 * @off 保持不变
 * @desc 使用RPG Maker MZ 1.3.0+时，需要同时启用此参数和其父参数。
 * @default false
 *
 */

/* ----------------------------------------------------------------------------
 * 屏幕震动设置
 * ----------------------------------------------------------------------------
 */
/*~struct~ScreenShake:
 *
 * @param DefaultStyle:str
 * @text 默认样式
 * @type select
 * @option 原始
 * @value original
 * @option 随机
 * @value random
 * @option 水平
 * @value horizontal
 * @option 垂直
 * @value vertical
 * @desc 屏幕震动的默认样式。
 * @default random
 *
 * @param originalJS:func
 * @text JS: 原始样式
 * @type note
 * @desc 此代码控制屏幕震动的原始样式。
 * @default "// Calculation\nthis.x += Math.round($gameScreen.shake());"
 *
 * @param randomJS:func
 * @text JS: 随机样式
 * @type note
 * @desc 此代码控制屏幕震动的随机样式。
 * @default "// Calculation\n// Original Formula by Aries of Sheratan\nconst power = $gameScreen._shakePower * 0.75;\nconst speed = $gameScreen._shakeSpeed * 0.60;\nconst duration = $gameScreen._shakeDuration;\nthis.x += Math.round(Math.randomInt(power) - Math.randomInt(speed)) * (Math.min(duration, 30) * 0.5);\nthis.y += Math.round(Math.randomInt(power) - Math.randomInt(speed)) * (Math.min(duration, 30) * 0.5);"
 *
 * @param horzJS:func
 * @text JS: 水平样式
 * @type note
 * @desc 此代码控制屏幕震动的水平样式。
 * @default "// Calculation\n// Original Formula by Aries of Sheratan\nconst power = $gameScreen._shakePower * 0.75;\nconst speed = $gameScreen._shakeSpeed * 0.60;\nconst duration = $gameScreen._shakeDuration;\nthis.x += Math.round(Math.randomInt(power) - Math.randomInt(speed)) * (Math.min(duration, 30) * 0.5);"
 *
 * @param vertJS:func
 * @text JS: 垂直样式
 * @type note
 * @desc 此代码控制屏幕震动的垂直样式。
 * @default "// Calculation\n// Original Formula by Aries of Sheratan\nconst power = $gameScreen._shakePower * 0.75;\nconst speed = $gameScreen._shakeSpeed * 0.60;\nconst duration = $gameScreen._shakeDuration;\nthis.y += Math.round(Math.randomInt(power) - Math.randomInt(speed)) * (Math.min(duration, 30) * 0.5);"
 *
 */

/* ----------------------------------------------------------------------------
 * 自定义参数设置
 * ----------------------------------------------------------------------------
 */
/*~struct~CustomParam:
 *
 * @param ParamName:str
 * @text 参数名称
 * @desc 参数的名称是什么？
 * 用于VisuStella MZ菜单。
 * @default 未命名
 *
 * @param Abbreviation:str
 * @text 缩写
 * @parent ParamName:str
 * @desc 此参数使用的缩写是什么？
 * 请勿使用特殊字符。尽量避免使用数字。
 * @default unt
 *
 * @param Icon:num
 * @text 图标
 * @parent ParamName:str
 * @desc 您希望使用哪个图标来表示此参数？
 * 用于VisuStella MZ菜单。
 * @default 160
 *
 * @param Type:str
 * @text 类型
 * @parent ParamName:str
 * @type select
 * @option 整数（仅允许整数）
 * @value integer
 * @option 浮点数（允许小数）
 * @value float
 * @desc 此参数返回的数字类型是什么？
 * @default integer
 *
 * @param ValueJS:json
 * @text JS: 值
 * @type note
 * @desc 当此参数需要返回值时运行此代码。
 * @default "// Declare Constants\nconst user = this;\n\n// Calculations\nreturn 1;"
 *
 */

/* ----------------------------------------------------------------------------
 * 显示图片设置
 * ----------------------------------------------------------------------------
 */
/*~struct~ShowPicture:
 * 
 * @param 位置设置
 *
 * @param Origin:num
 * @text 原点
 * @parent 位置设置
 * @type select
 * @option 0 - 左上角
 * @value 0
 * @option 1 - 中心
 * @value 1
 * @desc 这个图片图标的原点是什么？
 * @default 0
 *
 * @param PositionX:eval
 * @text 位置 X
 * @parent 位置设置
 * @desc 图片的 X 坐标。
 * 可以使用 JavaScript 代码。
 * @default 0
 *
 * @param PositionY:eval
 * @text 位置 Y
 * @parent 位置设置
 * @desc 图片的 Y 坐标。
 * 可以使用 JavaScript 代码。
 * @default 0
 * 
 * @param 缩放设置
 *
 * @param ScaleX:eval
 * @text 宽度 %
 * @parent 缩放设置
 * @desc 图片的水平缩放比例。
 * 可以使用 JavaScript 代码。
 * @default 100
 *
 * @param ScaleY:eval
 * @text 高度 %
 * @parent 缩放设置
 * @desc 图片的垂直缩放比例。
 * 可以使用 JavaScript 代码。
 * @default 100
 * 
 * @param 混合设置
 *
 * @param Opacity:eval
 * @text 不透明度
 * @parent 混合设置
 * @desc 插入一个数值来确定不透明度级别。使用 0 到 255 之间的数值。可以使用 JavaScript 代码。
 * @default 255
 *
 * @param BlendMode:num
 * @text 混合模式
 * @parent 混合设置
 * @type select
 * @option 0 - 正常
 * @value 0
 * @option 1 - 叠加
 * @value 1
 * @option 2 - 乘法
 * @value 2
 * @option 3 - 滤色
 * @value 3
 * @desc 您希望对图片应用哪种混合模式？
 * @default 0
 *
 */
/* ----------------------------------------------------------------------------
 * JS 快捷功能设置
 * ----------------------------------------------------------------------------
 */
/*~struct~jsQuickFunc:
 *
 * @param FunctionName:str
 * @text 功能名称
 * @desc 全局命名空间中的函数名称。
 * 不会覆盖同名的函数/变量。
 * @default 未命名
 *
 * @param CodeJS:json
 * @text JS: 代码
 * @type note
 * @desc 使用函数时运行此代码。
 * @default "// 可以将其作为函数插入到任何可以输入代码的地方\n// 例如脚本调用或条件分支脚本。\n\n// 处理代码\n"
 *
 */

//=============================================================================

const _0x3a6da1 = _0xe91a; (function (_0x3b5d8e, _0x4473d4) { const _0x474156 = _0xe91a, _0x48216e = _0x3b5d8e(); while (!![]) { try { const _0x5c646d = -parseInt(_0x474156(0xbe7)) / (-0x1065 * 0x1 + 0x35 * -0x1f + 0x16d1) * (parseInt(_0x474156(0x34e)) / (-0xef1 + -0x13cf * -0x1 + -0x1 * 0x4dc)) + parseInt(_0x474156(0xf66)) / (0x1 * -0x9ad + -0x3 * 0x719 + 0x1efb) + -parseInt(_0x474156(0xbd5)) / (-0x1 * -0xeef + -0x2284 + 0xad * 0x1d) + parseInt(_0x474156(0x100d)) / (0x1 * -0x18d7 + 0x1149 + -0x115 * -0x7) * (-parseInt(_0x474156(0xd74)) / (-0x2 * 0x153 + -0x3 * 0xa17 + -0xafb * -0x3)) + parseInt(_0x474156(0xe59)) / (0x4 * 0x6cc + 0x1a50 + -0x11d3 * 0x3) * (parseInt(_0x474156(0x457)) / (-0x5f * -0x4d + 0x737 + -0x23c2)) + parseInt(_0x474156(0x3bf)) / (-0x1494 + -0x7 * -0xe8 + -0xe45 * -0x1) * (parseInt(_0x474156(0x319)) / (-0x72 * -0x4f + 0x63a * 0x1 + -0x295e)) + -parseInt(_0x474156(0xd3a)) / (-0xf83 + 0x1611 + 0x1 * -0x683) * (-parseInt(_0x474156(0xdc3)) / (-0x171d * -0x1 + -0x1f * 0xa2 + 0x373 * -0x1)); if (_0x5c646d === _0x4473d4) break; else _0x48216e['push'](_0x48216e['shift']()); } catch (_0x57fa0a) { _0x48216e['push'](_0x48216e['shift']()); } } }(_0x1e0c, -0x1f97d * 0x1 + 0x45b9d + 0x890)); var label = _0x3a6da1(0xc9f), tier = tier || 0x9f * -0x11 + 0xdae + 0x2f * -0x11, dependencies = [], pluginData = $plugins[_0x3a6da1(0x3e7)](function (_0x1ff15c) { const _0x1114ea = _0x3a6da1, _0x358b1f = { 'QuedE': function (_0x40c77f, _0x22fe71) { return _0x40c77f + _0x22fe71; } }; return _0x1ff15c[_0x1114ea(0x67c)] && _0x1ff15c[_0x1114ea(0xeea) + 'n'][_0x1114ea(0xa43)](_0x358b1f['QuedE'](_0x358b1f[_0x1114ea(0xfe4)]('[', label), ']')); })[0x1 * 0x9ac + 0x46b + -0xe17]; VisuMZ[label]['Settings'] = VisuMZ[label][_0x3a6da1(0x316)] || {}, VisuMZ[_0x3a6da1(0x2ce) + _0x3a6da1(0x887)] = function (_0x3059d1, _0x3cf46c) { const _0x39189e = _0x3a6da1, _0x2635fc = { 'CUbfp': function (_0x163ac8, _0x340894) { return _0x163ac8(_0x340894); }, 'CeVrs': _0x39189e(0xe3e), 'iQUrq': function (_0x4aea25, _0x3ec95f) { return _0x4aea25 !== _0x3ec95f; }, 'BEqXJ': function (_0x2401e3, _0x486aad) { return _0x2401e3(_0x486aad); }, 'xviYw': 'ARRAYNUM', 'krqFJ': function (_0x3bcf40, _0x60f5d2) { return _0x3bcf40 !== _0x60f5d2; }, 'MKtZJ': _0x39189e(0xd09), 'mVAxo': function (_0x51f64a, _0x29fbd3) { return _0x51f64a !== _0x29fbd3; }, 'VDsrw': 'ARRAYEVAL', 'rVPXY': function (_0x109537, _0xf2a7f2) { return _0x109537 !== _0xf2a7f2; }, 'XzHUW': _0x39189e(0xd5c), 'XNojc': function (_0x5282ab, _0x251151) { return _0x5282ab !== _0x251151; }, 'QMNXa': _0x39189e(0xe4a), 'jCZVR': function (_0x2d18b0, _0x5ed8cf) { return _0x2d18b0 !== _0x5ed8cf; }, 'UBAJN': _0x39189e(0x632), 'jTPcR': function (_0x228b60, _0x2abded) { return _0x228b60 !== _0x2abded; }, 'ckXwX': _0x39189e(0x79d), 'oEsCQ': _0x39189e(0x1010), 'nVDjQ': _0x39189e(0xe77), 'AyasW': function (_0x2bd920, _0x29ffe8) { return _0x2bd920 !== _0x29ffe8; }, 'yFrdx': _0x39189e(0xda6), 'EfqQS': function (_0x4e73c3, _0xbf5d32) { return _0x4e73c3 !== _0xbf5d32; }, 'gJriV': _0x39189e(0x24b), 'CVRvd': function (_0x102900, _0x5920d8) { return _0x102900 !== _0x5920d8; }, 'diLqg': _0x39189e(0x343) + 'T', 'hsSVE': function (_0x29162b, _0x44a2bb) { return _0x29162b !== _0x44a2bb; } }; for (const _0x23e5c1 in _0x3cf46c) { if (_0x23e5c1[_0x39189e(0x7a8)](/(.*):(.*)/i)) { const _0x4e3d5d = _0x2635fc['CUbfp'](String, RegExp['$1']), _0x2c988d = _0x2635fc[_0x39189e(0xf73)](String, RegExp['$2'])['toUpperCas' + 'e']()[_0x39189e(0x2d6)](); let _0x118e30, _0x587c45, _0x1a4499; switch (_0x2c988d) { case _0x2635fc[_0x39189e(0x966)]: _0x118e30 = _0x2635fc[_0x39189e(0xa03)](_0x3cf46c[_0x23e5c1], '') ? _0x2635fc[_0x39189e(0x607)](Number, _0x3cf46c[_0x23e5c1]) : -0x1e5a + 0x1708 + 0x2 * 0x3a9; break; case _0x2635fc[_0x39189e(0x3a9)]: _0x587c45 = _0x2635fc[_0x39189e(0x55a)](_0x3cf46c[_0x23e5c1], '') ? JSON[_0x39189e(0x35d)](_0x3cf46c[_0x23e5c1]) : [], _0x118e30 = _0x587c45['map'](_0x435306 => Number(_0x435306)); break; case _0x2635fc[_0x39189e(0xa32)]: _0x118e30 = _0x2635fc[_0x39189e(0xe8a)](_0x3cf46c[_0x23e5c1], '') ? _0x2635fc[_0x39189e(0x607)](eval, _0x3cf46c[_0x23e5c1]) : null; break; case _0x2635fc[_0x39189e(0x3d7)]: _0x587c45 = _0x2635fc[_0x39189e(0xe47)](_0x3cf46c[_0x23e5c1], '') ? JSON[_0x39189e(0x35d)](_0x3cf46c[_0x23e5c1]) : [], _0x118e30 = _0x587c45[_0x39189e(0x267)](_0x5df81f => eval(_0x5df81f)); break; case _0x2635fc[_0x39189e(0x846)]: _0x118e30 = _0x2635fc['XNojc'](_0x3cf46c[_0x23e5c1], '') ? JSON[_0x39189e(0x35d)](_0x3cf46c[_0x23e5c1]) : ''; break; case _0x2635fc[_0x39189e(0xb70)]: _0x587c45 = _0x2635fc['jCZVR'](_0x3cf46c[_0x23e5c1], '') ? JSON[_0x39189e(0x35d)](_0x3cf46c[_0x23e5c1]) : [], _0x118e30 = _0x587c45[_0x39189e(0x267)](_0x3910f0 => JSON[_0x39189e(0x35d)](_0x3910f0)); break; case _0x2635fc[_0x39189e(0xae8)]: _0x118e30 = _0x2635fc[_0x39189e(0x1f0)](_0x3cf46c[_0x23e5c1], '') ? new Function(JSON[_0x39189e(0x35d)](_0x3cf46c[_0x23e5c1])) : new Function(_0x2635fc[_0x39189e(0x850)]); break; case _0x2635fc[_0x39189e(0x2bc)]: _0x587c45 = _0x2635fc[_0x39189e(0xe47)](_0x3cf46c[_0x23e5c1], '') ? JSON[_0x39189e(0x35d)](_0x3cf46c[_0x23e5c1]) : [], _0x118e30 = _0x587c45[_0x39189e(0x267)](_0x59443a => new Function(JSON[_0x39189e(0x35d)](_0x59443a))); break; case _0x2635fc['nVDjQ']: _0x118e30 = _0x2635fc[_0x39189e(0xf94)](_0x3cf46c[_0x23e5c1], '') ? _0x2635fc[_0x39189e(0x607)](String, _0x3cf46c[_0x23e5c1]) : ''; break; case _0x2635fc[_0x39189e(0xea5)]: _0x587c45 = _0x2635fc['EfqQS'](_0x3cf46c[_0x23e5c1], '') ? JSON[_0x39189e(0x35d)](_0x3cf46c[_0x23e5c1]) : [], _0x118e30 = _0x587c45[_0x39189e(0x267)](_0x4086d8 => String(_0x4086d8)); break; case _0x2635fc[_0x39189e(0x424)]: _0x1a4499 = _0x2635fc[_0x39189e(0x793)](_0x3cf46c[_0x23e5c1], '') ? JSON['parse'](_0x3cf46c[_0x23e5c1]) : {}, _0x3059d1[_0x4e3d5d] = {}, VisuMZ['ConvertPar' + _0x39189e(0x887)](_0x3059d1[_0x4e3d5d], _0x1a4499); continue; case _0x2635fc[_0x39189e(0x755)]: _0x587c45 = _0x2635fc['hsSVE'](_0x3cf46c[_0x23e5c1], '') ? JSON[_0x39189e(0x35d)](_0x3cf46c[_0x23e5c1]) : [], _0x118e30 = _0x587c45['map'](_0x403398 => VisuMZ[_0x39189e(0x2ce) + 'ams']({}, JSON[_0x39189e(0x35d)](_0x403398))); break; default: continue; }_0x3059d1[_0x4e3d5d] = _0x118e30; } } return _0x3059d1; }, VisuMZ['CoreEngine'][_0x3a6da1(0x9d2) + 'er_exit'] = SceneManager[_0x3a6da1(0xd80)], SceneManager[_0x3a6da1(0xd80)] = function () { const _0x18de94 = _0x3a6da1, _0x5daa9f = { 'rBbMO': function (_0x3bd097, _0x34acc7) { return _0x3bd097 >= _0x34acc7; }, 'bZNnJ': _0x18de94(0xb89), 'QuRwY': function (_0x4eba02, _0x19f9e9) { return _0x4eba02 === _0x19f9e9; }, 'jnBEe': _0x18de94(0x639) }; VisuMZ[_0x18de94(0xc9f)][_0x18de94(0x9d2) + _0x18de94(0x306)][_0x18de94(0xedc)](this); if (_0x5daa9f[_0x18de94(0xa20)](Utils[_0x18de94(0x900) + _0x18de94(0x5a3)], _0x5daa9f[_0x18de94(0x98f)])) { if (_0x5daa9f[_0x18de94(0x49a)](typeof nw, _0x5daa9f[_0x18de94(0x6bb)])) nw[_0x18de94(0x7f0)][_0x18de94(0xc43)](); } }, (_0xcca982 => { const _0x1b87eb = _0x3a6da1, _0x94f583 = { 'zkTVC': function (_0x52d2d0, _0x513e38) { return _0x52d2d0(_0x513e38); }, 'zaasc': '%1\x20is\x20miss' + 'ing\x20a\x20requ' + 'ired\x20plugi' + _0x1b87eb(0xd70) + 'install\x20%2' + _0x1b87eb(0x1097) + _0x1b87eb(0xa51) + 'ager.', 'uKPKi': function (_0x4c3bd9, _0x24b6ac) { return _0x4c3bd9 !== _0x24b6ac; }, 'apXaY': _0x1b87eb(0x8d9) + _0x1b87eb(0x2d7) + 't\x20match\x20pl' + 'ugin\x27s.\x20Pl' + _0x1b87eb(0xc10) + 'e\x20it\x20in\x20th' + _0x1b87eb(0x630) + 'anager.', 'JsiHz': function (_0x22e982, _0x31c75d) { return _0x22e982(_0x31c75d); }, 'IpIJr': function (_0xe98597, _0x1505c) { return _0xe98597 < _0x1505c; }, 'kxTYs': function (_0x1af682, _0x236d9d) { return _0x1af682(_0x236d9d); }, 'wIdyz': _0x1b87eb(0x4cf) + 'rrectly\x20pl' + _0x1b87eb(0xb15) + _0x1b87eb(0xcd2) + _0x1b87eb(0x64a) + '\x20a\x20Tier\x20%2' + _0x1b87eb(0xa60) + _0x1b87eb(0x1083) + 'other\x20Tier' + _0x1b87eb(0x96a) + 's.\x0aPlease\x20' + _0x1b87eb(0x78f) + _0x1b87eb(0xcd2) + 'ist\x20from\x20s' + _0x1b87eb(0x2fa) + _0x1b87eb(0xcfa) + _0x1b87eb(0x1038) + 's.' }, _0x45be3e = _0xcca982[_0x1b87eb(0x796)]; for (const _0x713fe4 of dependencies) { if (!Imported[_0x713fe4]) { _0x94f583[_0x1b87eb(0x332)](alert, _0x94f583[_0x1b87eb(0x7d0)][_0x1b87eb(0xfc8)](_0x45be3e, _0x713fe4)), SceneManager[_0x1b87eb(0xd80)](); break; } } const _0xf5ab55 = _0xcca982[_0x1b87eb(0xeea) + 'n']; if (_0xf5ab55[_0x1b87eb(0x7a8)](/\[Version[ ](.*?)\]/i)) { const _0x3b2152 = _0x94f583[_0x1b87eb(0x332)](Number, RegExp['$1']); _0x94f583[_0x1b87eb(0xe9c)](_0x3b2152, VisuMZ[label][_0x1b87eb(0x4f5)]) && (_0x94f583[_0x1b87eb(0x332)](alert, _0x94f583[_0x1b87eb(0x9c4)][_0x1b87eb(0xfc8)](_0x45be3e, _0x3b2152)), SceneManager[_0x1b87eb(0xd80)]()); } if (_0xf5ab55[_0x1b87eb(0x7a8)](/\[Tier[ ](\d+)\]/i)) { const _0x3fe9af = _0x94f583[_0x1b87eb(0x401)](Number, RegExp['$1']); _0x94f583['IpIJr'](_0x3fe9af, tier) ? (_0x94f583[_0x1b87eb(0xf1c)](alert, _0x94f583[_0x1b87eb(0xa57)]['format'](_0x45be3e, _0x3fe9af, tier)), SceneManager['exit']()) : tier = Math[_0x1b87eb(0xeb6)](_0x3fe9af, tier); } VisuMZ[_0x1b87eb(0x2ce) + _0x1b87eb(0x887)](VisuMZ[label][_0x1b87eb(0x316)], _0xcca982[_0x1b87eb(0x69d)]); })(pluginData), ((() => { const _0x3135f0 = _0x3a6da1, _0x3ecf6c = { 'dOxPV': function (_0x2d1555, _0x8e6a62) { return _0x2d1555(_0x8e6a62); } }; if (VisuMZ['CoreEngine']['Settings']['QoL']['SubfolderP' + _0x3135f0(0x6a1)] ?? !![]) for (const _0x1f1d75 in $plugins) { const _0x17b054 = $plugins[_0x1f1d75]; _0x17b054[_0x3135f0(0x796)][_0x3135f0(0x7a8)](/(.*)\/(.*)/i) && (_0x17b054[_0x3135f0(0x796)] = _0x3ecf6c['dOxPV'](String, RegExp['$2'][_0x3135f0(0x2d6)]())); } })()), PluginManager[_0x3a6da1(0x714) + _0x3a6da1(0x9b5)](pluginData[_0x3a6da1(0x796)], 'AnimationP' + _0x3a6da1(0x1041), _0x127f28 => { const _0x2afbce = _0x3a6da1; if (!SceneManager[_0x2afbce(0xda5)]) return; if (!SceneManager[_0x2afbce(0xda5)][_0x2afbce(0xcaf)]) return; VisuMZ['ConvertPar' + _0x2afbce(0x887)](_0x127f28, _0x127f28); const _0x47cc5d = Math[_0x2afbce(0x48a)](_0x127f28[_0x2afbce(0xc84)]), _0xf380c9 = Math['round'](_0x127f28['pointY']); $gameTemp[_0x2afbce(0xa19) + _0x2afbce(0x75b) + 'n'](_0x47cc5d, _0xf380c9, _0x127f28[_0x2afbce(0xbb3) + 'D'], _0x127f28[_0x2afbce(0xcae)], _0x127f28[_0x2afbce(0x580)]); }), PluginManager[_0x3a6da1(0x714) + 'mmand'](pluginData['name'], 'AudioChang' + _0x3a6da1(0x21a), _0x4230c8 => { const _0x5890e2 = _0x3a6da1, _0x5048f5 = { 'TAjzj': '0|2|1|3|4' }; VisuMZ['ConvertPar' + 'ams'](_0x4230c8, _0x4230c8); const _0xfe1f0a = Math['round'](_0x4230c8[_0x5890e2(0x527)])['clamp'](0x1f * -0x116 + 0x3d * 0x98 + -0x28e * 0x1, -0x47 * -0x80 + -0x191 * 0xa + -0x2 * 0x9b9), _0x1b7fa8 = AudioManager['_currentBg' + 'm']; if (_0x1b7fa8) { const _0x1ac3a7 = _0x5048f5[_0x5890e2(0x7c9)][_0x5890e2(0x80d)]('|'); let _0xecdb32 = 0xfb * -0x7 + -0x11a9 + 0x1886; while (!![]) { switch (_0x1ac3a7[_0xecdb32++]) { case '0': _0x1b7fa8['volume'] = _0xfe1f0a; continue; case '1': AudioManager[_0x5890e2(0xec3) + _0x5890e2(0x737)](_0x1b7fa8); continue; case '2': _0x1b7fa8[_0x5890e2(0x9c0)] = AudioManager[_0x5890e2(0x967)][_0x5890e2(0xb5d)](); continue; case '3': AudioManager[_0x5890e2(0xc90)](_0x1b7fa8, _0x1b7fa8['pos']); continue; case '4': AudioManager[_0x5890e2(0x967)][_0x5890e2(0xcb4) + _0x5890e2(0x4d4)](_0x1b7fa8[_0x5890e2(0x9c0)]); continue; }break; } } }), PluginManager[_0x3a6da1(0x714) + _0x3a6da1(0x9b5)](pluginData[_0x3a6da1(0x796)], _0x3a6da1(0x2cb) + 'eBgmPitch', _0x1336fa => { const _0x10eebe = _0x3a6da1, _0x2164c1 = { 'mUvFO': _0x10eebe(0x209) }; VisuMZ[_0x10eebe(0x2ce) + _0x10eebe(0x887)](_0x1336fa, _0x1336fa); const _0x4cfa4c = Math[_0x10eebe(0x48a)](_0x1336fa[_0x10eebe(0x103d)])[_0x10eebe(0x759)](-0xc40 + 0x2 * 0x135b + -0x1a44, 0x1564 + -0x1267 + 0xf * -0x29), _0xc784d0 = AudioManager['_currentBg' + 'm']; if (_0xc784d0) { const _0x2b321b = _0x2164c1[_0x10eebe(0x682)]['split']('|'); let _0x4ab72d = -0x182e + -0x1 * -0x13ea + 0x444; while (!![]) { switch (_0x2b321b[_0x4ab72d++]) { case '0': _0xc784d0[_0x10eebe(0x103d)] = _0x4cfa4c; continue; case '1': _0xc784d0[_0x10eebe(0x9c0)] = AudioManager[_0x10eebe(0x967)]['seek'](); continue; case '2': AudioManager['updateBgmP' + _0x10eebe(0x737)](_0xc784d0); continue; case '3': AudioManager['playBgm'](_0xc784d0, _0xc784d0[_0x10eebe(0x9c0)]); continue; case '4': AudioManager['_bgmBuffer'][_0x10eebe(0xcb4) + _0x10eebe(0x4d4)](_0xc784d0[_0x10eebe(0x9c0)]); continue; }break; } } }), PluginManager[_0x3a6da1(0x714) + _0x3a6da1(0x9b5)](pluginData['name'], 'AudioChang' + _0x3a6da1(0xaf1), _0x3eaf76 => { const _0x57d2cf = _0x3a6da1, _0x1ad45a = { 'uRegR': _0x57d2cf(0x6e3) }; VisuMZ[_0x57d2cf(0x2ce) + _0x57d2cf(0x887)](_0x3eaf76, _0x3eaf76); const _0x55ba6c = Math[_0x57d2cf(0x48a)](_0x3eaf76['pan'])['clamp'](-(-0x1a84 + 0x33 * -0xa7 + -0x5 * -0xc09), -0x1 * -0x737 + -0x525 * 0x6 + 0x180b), _0x34e81d = AudioManager[_0x57d2cf(0x38f) + 'm']; if (_0x34e81d) { const _0x2e45b8 = _0x1ad45a[_0x57d2cf(0x279)][_0x57d2cf(0x80d)]('|'); let _0x4ca346 = 0x1fd * 0x3 + -0x191b + 0x1ea * 0xa; while (!![]) { switch (_0x2e45b8[_0x4ca346++]) { case '0': AudioManager[_0x57d2cf(0xec3) + _0x57d2cf(0x737)](_0x34e81d); continue; case '1': AudioManager[_0x57d2cf(0x967)]['_startPlay' + _0x57d2cf(0x4d4)](_0x34e81d['pos']); continue; case '2': _0x34e81d[_0x57d2cf(0xf00)] = _0x55ba6c; continue; case '3': AudioManager[_0x57d2cf(0xc90)](_0x34e81d, _0x34e81d[_0x57d2cf(0x9c0)]); continue; case '4': _0x34e81d[_0x57d2cf(0x9c0)] = AudioManager[_0x57d2cf(0x967)][_0x57d2cf(0xb5d)](); continue; }break; } } }), PluginManager[_0x3a6da1(0x714) + _0x3a6da1(0x9b5)](pluginData[_0x3a6da1(0x796)], _0x3a6da1(0x2cb) + 'eBgsVolume', _0x4473c5 => { const _0x12e4c0 = _0x3a6da1, _0x2019b3 = { 'lOXdN': _0x12e4c0(0xc12) }; VisuMZ['ConvertPar' + _0x12e4c0(0x887)](_0x4473c5, _0x4473c5); const _0x5e4e75 = Math[_0x12e4c0(0x48a)](_0x4473c5[_0x12e4c0(0x527)])[_0x12e4c0(0x759)](0x1572 + 0x152e + -0x2aa * 0x10, -0x100e + 0x1960 + -0x8ee), _0xdce5c0 = AudioManager[_0x12e4c0(0x38f) + 's']; if (_0xdce5c0) { const _0x4c4c0a = _0x2019b3[_0x12e4c0(0x67b)][_0x12e4c0(0x80d)]('|'); let _0x32493d = -0x23e6 + -0x2 * -0xb5f + 0xd28; while (!![]) { switch (_0x4c4c0a[_0x32493d++]) { case '0': AudioManager['_bgsBuffer'][_0x12e4c0(0xcb4) + _0x12e4c0(0x4d4)](_0xdce5c0[_0x12e4c0(0x9c0)]); continue; case '1': _0xdce5c0[_0x12e4c0(0x9c0)] = AudioManager[_0x12e4c0(0x828)][_0x12e4c0(0xb5d)](); continue; case '2': AudioManager[_0x12e4c0(0xd46) + _0x12e4c0(0x737)](_0xdce5c0); continue; case '3': _0xdce5c0['volume'] = _0x5e4e75; continue; case '4': AudioManager[_0x12e4c0(0x4a9)](_0xdce5c0, _0xdce5c0[_0x12e4c0(0x9c0)]); continue; }break; } } }), PluginManager[_0x3a6da1(0x714) + _0x3a6da1(0x9b5)](pluginData[_0x3a6da1(0x796)], _0x3a6da1(0x2cb) + _0x3a6da1(0xb93), _0x454d66 => { const _0x3da4ab = _0x3a6da1, _0x1c3796 = { 'Lhdlt': _0x3da4ab(0x6bd) }; VisuMZ['ConvertPar' + 'ams'](_0x454d66, _0x454d66); const _0x363916 = Math[_0x3da4ab(0x48a)](_0x454d66[_0x3da4ab(0x103d)])[_0x3da4ab(0x759)](-0xc * -0x30 + 0x8a2 + -0xab0, 0x1094 + 0x2 * 0x100 + -0x11fe), _0x54f513 = AudioManager['_currentBg' + 's']; if (_0x54f513) { const _0xf0ca27 = _0x1c3796['Lhdlt'][_0x3da4ab(0x80d)]('|'); let _0x144413 = -0x1acb + -0x141f + 0x2eea; while (!![]) { switch (_0xf0ca27[_0x144413++]) { case '0': AudioManager[_0x3da4ab(0xd46) + _0x3da4ab(0x737)](_0x54f513); continue; case '1': AudioManager[_0x3da4ab(0x828)][_0x3da4ab(0xcb4) + _0x3da4ab(0x4d4)](_0x54f513['pos']); continue; case '2': _0x54f513[_0x3da4ab(0x9c0)] = AudioManager[_0x3da4ab(0x828)][_0x3da4ab(0xb5d)](); continue; case '3': AudioManager[_0x3da4ab(0x4a9)](_0x54f513, _0x54f513[_0x3da4ab(0x9c0)]); continue; case '4': _0x54f513[_0x3da4ab(0x103d)] = _0x363916; continue; }break; } } }), PluginManager[_0x3a6da1(0x714) + _0x3a6da1(0x9b5)](pluginData['name'], _0x3a6da1(0x2cb) + 'eBgsPan', _0x1201b1 => { const _0xb4d124 = _0x3a6da1, _0x59c871 = { 'ltJEv': _0xb4d124(0x95e) }; VisuMZ[_0xb4d124(0x2ce) + _0xb4d124(0x887)](_0x1201b1, _0x1201b1); const _0x4f78d7 = Math['round'](_0x1201b1['pan'])[_0xb4d124(0x759)](-(0x8e5 * -0x3 + -0x534 + 0x2047), -0x1c28 + 0x83e + 0x144e), _0x3e0649 = AudioManager[_0xb4d124(0x38f) + 's']; if (_0x3e0649) { const _0x319554 = _0x59c871[_0xb4d124(0x9b4)][_0xb4d124(0x80d)]('|'); let _0x5d7c00 = 0x414 * -0x7 + -0x311 * -0x8 + 0x404; while (!![]) { switch (_0x319554[_0x5d7c00++]) { case '0': AudioManager[_0xb4d124(0xd46) + _0xb4d124(0x737)](_0x3e0649); continue; case '1': _0x3e0649[_0xb4d124(0xf00)] = _0x4f78d7; continue; case '2': AudioManager[_0xb4d124(0x828)][_0xb4d124(0xcb4) + _0xb4d124(0x4d4)](_0x3e0649[_0xb4d124(0x9c0)]); continue; case '3': AudioManager[_0xb4d124(0x4a9)](_0x3e0649, _0x3e0649[_0xb4d124(0x9c0)]); continue; case '4': _0x3e0649['pos'] = AudioManager[_0xb4d124(0x828)][_0xb4d124(0xb5d)](); continue; }break; } } }), PluginManager[_0x3a6da1(0x714) + _0x3a6da1(0x9b5)](pluginData[_0x3a6da1(0x796)], _0x3a6da1(0xf0c) + _0x3a6da1(0x9d9) + _0x3a6da1(0x2ed), _0x37ec64 => { const _0x11fe62 = _0x3a6da1; if (!$gameTemp[_0x11fe62(0x386)]()) return; const _0x504c75 = Input['getLastUse' + _0x11fe62(0xc79) + 'pe'](); navigator['clipboard'] && navigator['clipboard'][_0x11fe62(0x58e)](_0x504c75); }), PluginManager[_0x3a6da1(0x714) + _0x3a6da1(0x9b5)](pluginData[_0x3a6da1(0x796)], _0x3a6da1(0x461) + _0x3a6da1(0x2c1), _0x3591a1 => { const _0x495e27 = _0x3a6da1; if (!$gameTemp[_0x495e27(0x386)]()) return; if (!Utils[_0x495e27(0x304)]()) return; SceneManager['_scene'][_0x495e27(0x21c)] = ![], VisuMZ['CoreEngine'][_0x495e27(0x82d) + _0x495e27(0x76a)](); }), PluginManager[_0x3a6da1(0x714) + _0x3a6da1(0x9b5)](pluginData[_0x3a6da1(0x796)], _0x3a6da1(0x794) + _0x3a6da1(0x8e7), _0x18194e => { const _0x3560c1 = _0x3a6da1; if (!$gameTemp[_0x3560c1(0x386)]()) return; if (!Utils['isNwjs']()) return; SceneManager[_0x3560c1(0xda5)][_0x3560c1(0x21c)] = ![], VisuMZ[_0x3560c1(0xc9f)][_0x3560c1(0x82d) + 'romAllTroo' + 'ps'](); }), PluginManager[_0x3a6da1(0x714) + _0x3a6da1(0x9b5)](pluginData[_0x3a6da1(0x796)], _0x3a6da1(0x248) + _0x3a6da1(0x2c1), _0x391329 => { const _0x4a4184 = _0x3a6da1, _0x36863b = { 'ihVQJ': function (_0x4f2ed0, _0x300b8) { return _0x4f2ed0 <= _0x300b8; }, 'LxSQH': _0x4a4184(0xded) }; if (!$gameTemp[_0x4a4184(0x386)]()) return; if (!Utils[_0x4a4184(0x304)]()) return; if (!$gameMap) return; if (_0x36863b['ihVQJ']($gameMap[_0x4a4184(0x890)](), 0xf9f + 0x2591 * -0x1 + -0xaf9 * -0x2)) return; VisuMZ[_0x4a4184(0x2ce) + _0x4a4184(0x887)](_0x391329, _0x391329); const _0xcc5377 = _0x36863b[_0x4a4184(0x1073)][_0x4a4184(0xfc8)]($gameMap[_0x4a4184(0x890)]()[_0x4a4184(0xb07)](-0x3db * 0x9 + -0x1f25 + 0x1 * 0x41db)), _0x2c2163 = VisuMZ[_0x4a4184(0xc9f)][_0x4a4184(0x40d) + 'FromMap']($gameMap[_0x4a4184(0x890)]()); VisuMZ[_0x4a4184(0xc9f)][_0x4a4184(0xbcf) + 'ng'](_0x2c2163, _0xcc5377, !![]); }), PluginManager['registerCo' + _0x3a6da1(0x9b5)](pluginData[_0x3a6da1(0x796)], 'ExportCurT' + _0x3a6da1(0x8e7), _0x1d9266 => { const _0x7b7e86 = _0x3a6da1, _0x2b4278 = { 'GFrAW': _0x7b7e86(0x9a2) }; if (!$gameTemp[_0x7b7e86(0x386)]()) return; if (!Utils[_0x7b7e86(0x304)]()) return; if (!$gameParty[_0x7b7e86(0x5e1)]()) return; VisuMZ[_0x7b7e86(0x2ce) + _0x7b7e86(0x887)](_0x1d9266, _0x1d9266); const _0x15d9fd = _0x2b4278['GFrAW']['format']($gameTroop[_0x7b7e86(0x286)][_0x7b7e86(0xb07)](0x103c * -0x1 + 0xe96 + 0x1aa)), _0x14fca4 = VisuMZ[_0x7b7e86(0xc9f)][_0x7b7e86(0x40d) + _0x7b7e86(0xc49)]($gameTroop[_0x7b7e86(0x286)]); VisuMZ[_0x7b7e86(0xc9f)][_0x7b7e86(0xbcf) + 'ng'](_0x14fca4, _0x15d9fd, !![]); }), VisuMZ['CoreEngine'][_0x3a6da1(0xbcf) + 'ng'] = function (_0x1e14dd, _0x2b67f, _0x39fc64) { const _0x5aca71 = _0x3a6da1, _0xb05a28 = { 'cmmGc': function (_0x1fdf46, _0x1442d2) { return _0x1fdf46(_0x1442d2); }, 'zFEXW': _0x5aca71(0xa11) + _0x5aca71(0xb09) + _0x5aca71(0xfa1) + _0x5aca71(0x9c3), 'zmijM': _0x5aca71(0xb50) + _0x5aca71(0x972) + 'xt', 'ripfR': function (_0x7c6060, _0x44d65f) { return _0x7c6060 || _0x44d65f; } }, _0x3ae880 = _0xb05a28[_0x5aca71(0x7bd)](require, 'fs'); let _0x24002a = _0xb05a28[_0x5aca71(0xe5f)][_0x5aca71(0xfc8)](_0xb05a28[_0x5aca71(0x3dd)](_0x2b67f, '0')); _0x3ae880['writeFile'](_0x24002a, _0x1e14dd, _0x35d944 => { const _0x3eceb1 = _0x5aca71; if (_0x35d944) throw err; else _0x39fc64 && _0xb05a28[_0x3eceb1(0x7bd)](alert, _0xb05a28[_0x3eceb1(0x1086)]['format'](_0x24002a)); }); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x82d) + 'romAllMaps'] = function () { const _0x537557 = _0x3a6da1, _0x592599 = { 'Nghyf': function (_0x6518ec, _0x43ad34) { return _0x6518ec + _0x43ad34; }, 'AIlDj': function (_0x18ccfa, _0x49ccc5) { return _0x18ccfa * _0x49ccc5; }, 'pEUtX': function (_0x1afb40, _0x230a32) { return _0x1afb40(_0x230a32); }, 'RTfRk': _0x537557(0xaac) + _0x537557(0x462) + _0x537557(0xc61) + _0x537557(0x44b) + _0x537557(0xf85), 'uqcaW': function (_0x51e1ac, _0x30414c, _0x21a9ea) { return _0x51e1ac(_0x30414c, _0x21a9ea); } }, _0x2229b2 = []; for (const _0x4cce33 of $dataMapInfos) { if (!_0x4cce33) continue; _0x2229b2['push'](_0x4cce33['id']); } const _0x2d977b = _0x592599[_0x537557(0x49e)](_0x592599['AIlDj'](_0x2229b2[_0x537557(0x786)], -0x225b + 0xaf2 + 0x17cd), Math[_0x537557(0xb91)](0x113d + -0x13c4 + 0x2eb)); _0x592599[_0x537557(0x6ab)](alert, _0x592599[_0x537557(0x871)][_0x537557(0xfc8)](_0x2d977b)), this['_storedMap' + 'Text'] = [], this['_currentMa' + 'p'] = $dataMap; for (const _0x3c76ff of _0x2229b2) { VisuMZ['CoreEngine'][_0x537557(0x645) + 'a'](_0x3c76ff); } _0x592599['uqcaW'](setTimeout, VisuMZ[_0x537557(0xc9f)][_0x537557(0xfad) + _0x537557(0x709)]['bind'](this), _0x2d977b); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x645) + 'a'] = function (_0x2014b1) { const _0x51de80 = _0x3a6da1, _0x4e6998 = { 'rxtlv': _0x51de80(0x5b9), 'FPwsQ': function (_0x158554, _0x10d2e4) { return _0x158554 + _0x10d2e4; }, 'HENgS': _0x51de80(0x59e), 'zOKhH': _0x51de80(0xb84), 'jtmWr': _0x51de80(0xf0e) + _0x51de80(0x70c) }, _0x2e3472 = _0x4e6998[_0x51de80(0x8c2)][_0x51de80(0xfc8)](_0x2014b1[_0x51de80(0xb07)](-0x2a * -0x59 + -0x2151 + -0x8d * -0x22)), _0x4e286b = new XMLHttpRequest(), _0xe800a4 = _0x4e6998[_0x51de80(0x504)](_0x4e6998[_0x51de80(0x55e)], _0x2e3472); _0x4e286b['open'](_0x4e6998[_0x51de80(0xf8a)], _0xe800a4), _0x4e286b[_0x51de80(0x68c) + _0x51de80(0x8d6)](_0x4e6998[_0x51de80(0x8e3)]), _0x4e286b[_0x51de80(0x4a8)] = () => this[_0x51de80(0xc4d) + 'ta'](_0x4e286b, _0x2014b1, _0x2e3472, _0xe800a4), _0x4e286b[_0x51de80(0x968)] = () => DataManager['onXhrError'](_0x51de80(0x67f), _0x2e3472, _0xe800a4), _0x4e286b[_0x51de80(0x572)](); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xc4d) + 'ta'] = function (_0x4bc333, _0xfb0c4, _0x14c8c6, _0xe9c824) { const _0x7f0091 = _0x3a6da1; $dataMap = JSON[_0x7f0091(0x35d)](_0x4bc333[_0x7f0091(0xebf) + 'xt']), DataManager[_0x7f0091(0xa9a)]($dataMap), this[_0x7f0091(0x292) + 'Text'][_0xfb0c4] = VisuMZ[_0x7f0091(0xc9f)][_0x7f0091(0x40d) + _0x7f0091(0xd89)](_0xfb0c4), $dataMap = this['_currentMa' + 'p']; }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xfad) + _0x3a6da1(0x709)] = function () { const _0x3727ee = _0x3a6da1, _0x439cdb = { 'ldqxz': _0x3727ee(0xbd1), 'MKmMi': '\x0a\x0a\x0a\x0a\x0a' }, _0x4c83d2 = _0x439cdb[_0x3727ee(0xb83)]; this[_0x3727ee(0x292) + 'Text']['remove'](undefined)[_0x3727ee(0x7e7)]('')['remove'](null); const _0x3ee7ec = this[_0x3727ee(0x292) + 'Text'][_0x3727ee(0x810)](_0x439cdb[_0x3727ee(0x93b)])[_0x3727ee(0x2d6)](); VisuMZ['CoreEngine'][_0x3727ee(0xbcf) + 'ng'](_0x3ee7ec, _0x4c83d2, !![]), SceneManager[_0x3727ee(0xda5)][_0x3727ee(0x21c)] = !![]; }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x40d) + _0x3a6da1(0xd89)] = function (_0x1d13e3) { const _0x188b87 = _0x3a6da1, _0x19f18b = { 'RjEpn': function (_0x29cbdc, _0x3c40b8) { return _0x29cbdc + _0x3c40b8; }, 'bVDmz': function (_0x4b0f50, _0x35ed59) { return _0x4b0f50 + _0x35ed59; }, 'askQC': function (_0x2b05a2, _0x4c9e32) { return _0x2b05a2 + _0x4c9e32; }, 'WAqiT': _0x188b87(0x5df) + _0x188b87(0x2dc) + 'ge\x20%3\x20》》》\x0a' + '%4\x0a', 'SjLsa': function (_0x5def1c, _0x54e611) { return _0x5def1c > _0x54e611; }, 'zTInN': function (_0x12f6d7, _0x1583dd) { return _0x12f6d7 + _0x1583dd; }, 'rOusA': _0x188b87(0x55d), 'ZhwRg': function (_0x4f040b, _0x40692c) { return _0x4f040b + _0x40692c; }, 'JohkC': function (_0x575e28, _0x153de0) { return _0x575e28 + _0x153de0; }, 'uvnZm': _0x188b87(0x21b) + ':\x20%2\x20Scrip' + _0x188b87(0xb5f), 'VVIBR': function (_0x499526, _0x407f11) { return _0x499526 || _0x407f11; }, 'XLwxn': 'Unnamed', 'puVwI': function (_0x47d901, _0x3a187c) { return _0x47d901 > _0x3a187c; } }; if (!$dataMap) return ''; let _0x32a5b0 = _0x19f18b[_0x188b87(0x62e)]('█'['repeat'](-0x940 + -0x3 * -0xb67 + -0x47 * 0x59), '\x0a\x0a'), _0x5d8557 = _0x19f18b[_0x188b87(0x62e)]('═'['repeat'](-0x1 * -0x1acf + -0x704 + -0x1385), '\x0a\x0a'), _0x4bc9d8 = ''; this[_0x188b87(0x76d) + _0x188b87(0xe46)] = 0x1 * -0xb15 + 0x210f + 0xc2 * -0x1d; for (const _0x486b79 of $dataMap[_0x188b87(0x3ac)]) { if (!_0x486b79) continue; let _0x1bcf46 = _0x486b79['id'], _0x3f53e0 = _0x486b79['name'], _0x44f3a7 = _0x486b79['pages']; for (const _0x19b309 of _0x44f3a7) { const _0x109861 = _0x19f18b['bVDmz'](_0x44f3a7['indexOf'](_0x19b309), 0xb25 + -0x1c8 + -0x1 * 0x95c); let _0x2f9df5 = _0x19f18b[_0x188b87(0xcb0)](_0x5d8557, _0x19f18b[_0x188b87(0xfd2)]), _0x28c1bb = VisuMZ[_0x188b87(0xc9f)][_0x188b87(0x40d) + 'FromList'](_0x19b309['list']); if (_0x19f18b[_0x188b87(0xdc5)](_0x28c1bb['length'], -0x605 * 0x3 + 0x1 * 0x83f + 0x9d0)) { if (_0x19f18b[_0x188b87(0xdc5)](_0x4bc9d8['length'], 0x106 * 0x25 + 0xd * 0x63 + -0x2ae5)) _0x4bc9d8 += _0x19f18b[_0x188b87(0xb11)](_0x5d8557, _0x19f18b[_0x188b87(0x385)]); else { const _0x26178a = $dataMapInfos[_0x1d13e3][_0x188b87(0x796)]; _0x4bc9d8 += _0x19f18b[_0x188b87(0x52c)](_0x19f18b[_0x188b87(0x1ee)](_0x32a5b0, _0x19f18b[_0x188b87(0xc01)]['format'](_0x1d13e3, _0x19f18b['VVIBR'](_0x26178a, _0x19f18b[_0x188b87(0x9f0)]))), _0x32a5b0); } _0x4bc9d8 += _0x2f9df5[_0x188b87(0xfc8)](_0x1bcf46, _0x3f53e0, _0x109861, _0x28c1bb); } } } return _0x19f18b['puVwI'](_0x4bc9d8['length'], 0x187a + 0xb * -0x2b6 + 0x558) && (_0x4bc9d8 += _0x5d8557), _0x4bc9d8; }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x82d) + _0x3a6da1(0x50d) + 'ps'] = function () { const _0x4545d5 = _0x3a6da1, _0x23a0d0 = { 'eoNRD': function (_0x4fcb08, _0x22cc6e) { return _0x4fcb08 + _0x22cc6e; }, 'RtNHU': function (_0x4401f8, _0x520b35) { return _0x4401f8 * _0x520b35; }, 'SOocJ': function (_0x2ef8fc, _0x37962c) { return _0x2ef8fc(_0x37962c); }, 'Pfmvu': _0x4545d5(0xfb4) + _0x4545d5(0x81d) + _0x4545d5(0x5fb) + _0x4545d5(0xee1) + _0x4545d5(0x251) + ')', 'lbvhK': function (_0x382bfc, _0x33e0e4, _0x55c775) { return _0x382bfc(_0x33e0e4, _0x55c775); } }, _0x27223b = _0x23a0d0['eoNRD'](_0x23a0d0[_0x4545d5(0x571)]($dataTroops[_0x4545d5(0x786)], 0x1 * 0xcb5 + -0x2 * 0x40f + -0x5 * 0xe9), Math['randomInt'](-0x1f1 * -0xc + -0x2351 + 0xc0f)); _0x23a0d0[_0x4545d5(0xdea)](alert, _0x23a0d0['Pfmvu'][_0x4545d5(0xfc8)](_0x27223b)); const _0x1aef7e = []; for (const _0x331e0b of $dataTroops) { if (!_0x331e0b) continue; const _0x3e4381 = _0x331e0b['id']; _0x1aef7e[_0x3e4381] = VisuMZ[_0x4545d5(0xc9f)][_0x4545d5(0x40d) + _0x4545d5(0xc49)](_0x3e4381); } _0x23a0d0[_0x4545d5(0xa4f)](setTimeout, VisuMZ['CoreEngine'][_0x4545d5(0x5f7) + _0x4545d5(0x574) + 's'][_0x4545d5(0xdeb)](this, _0x1aef7e), _0x27223b); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x40d) + 'FromTroop'] = function (_0x1b6eea) { const _0x546989 = _0x3a6da1, _0x433627 = { 'ojHnH': function (_0x2fd1d7, _0x115724) { return _0x2fd1d7 + _0x115724; }, 'ybrOf': function (_0x218b09, _0x13a552) { return _0x218b09 + _0x13a552; }, 'JSOcs': function (_0x473e30, _0xf953b0) { return _0x473e30 + _0xf953b0; }, 'pCaIe': function (_0x571894, _0x2a0450) { return _0x571894 + _0x2a0450; }, 'Yqwkt': _0x546989(0x2e9) + '1\x20》》》\x0a%2\x0a', 'fQAap': function (_0x53409b, _0x746209) { return _0x53409b > _0x746209; }, 'Hygnf': function (_0x5de87f, _0x320b95) { return _0x5de87f > _0x320b95; }, 'fasOH': '\x0a\x0a\x0a\x0a\x0a', 'oXUfL': function (_0xaf9183, _0x42dcb4) { return _0xaf9183 + _0x42dcb4; }, 'xJZWl': _0x546989(0xc0f) + _0x546989(0x9f9) + _0x546989(0x564), 'bJcxH': _0x546989(0xc62), 'mKlWX': function (_0xfeecdc, _0x2708b8) { return _0xfeecdc > _0x2708b8; } }; if (!$dataTroops[_0x1b6eea]) return ''; let _0x4236aa = _0x433627[_0x546989(0x325)]('█'[_0x546989(0x692)](-0x34d * -0x1 + 0xa1 * -0x11 + -0xda * -0x9), '\x0a\x0a'), _0x4bc4eb = _0x433627[_0x546989(0x859)]('═'[_0x546989(0x692)](-0x1ca8 + -0x2dd * 0x9 + 0xb * 0x4f9), '\x0a\x0a'), _0x399ce9 = ''; this[_0x546989(0x76d) + 'ntLayers'] = -0x2007 * 0x1 + 0x7b5 * 0x2 + 0x109d * 0x1; const _0x1c6162 = $dataTroops[_0x1b6eea]; let _0x2066a8 = _0x1c6162['pages']; for (const _0xd70cd9 of _0x2066a8) { const _0x5e52e4 = _0x433627['JSOcs'](_0x2066a8['indexOf'](_0xd70cd9), -0xe53 * -0x1 + 0x1 * 0x18a3 + -0x1 * 0x26f5); let _0x5bf616 = _0x433627[_0x546989(0x728)](_0x4bc4eb, _0x433627[_0x546989(0x348)]), _0x3b54ab = VisuMZ[_0x546989(0xc9f)]['ExtractStr' + 'FromList'](_0xd70cd9[_0x546989(0x63d)]); _0x433627[_0x546989(0x820)](_0x3b54ab[_0x546989(0x786)], -0x270b + -0x49 * 0x22 + 0x3 * 0x103f) && (_0x433627[_0x546989(0xb23)](_0x399ce9[_0x546989(0x786)], -0x1 * -0x5fb + -0x9fd + 0x3 * 0x156) ? _0x399ce9 += _0x433627[_0x546989(0x325)](_0x4bc4eb, _0x433627[_0x546989(0x20e)]) : _0x399ce9 += _0x433627[_0x546989(0x728)](_0x433627[_0x546989(0x3cc)](_0x4236aa, _0x433627[_0x546989(0x77d)][_0x546989(0xfc8)](_0x1b6eea, _0x1c6162[_0x546989(0x796)] || _0x433627[_0x546989(0xca2)])), _0x4236aa), _0x399ce9 += _0x5bf616['format'](_0x5e52e4, _0x3b54ab)); } return _0x433627[_0x546989(0x667)](_0x399ce9[_0x546989(0x786)], -0xde8 + -0x1f75 + 0x3 * 0xf1f) && (_0x399ce9 += _0x4bc4eb), _0x399ce9; }, VisuMZ[_0x3a6da1(0xc9f)]['exportAllT' + 'roopString' + 's'] = function (_0x3fe26e) { const _0x1113e4 = _0x3a6da1, _0x26663b = { 'nkKby': _0x1113e4(0x600), 'DtrRT': _0x1113e4(0x55d) }, _0x3529ed = _0x26663b[_0x1113e4(0xabf)]; _0x3fe26e['remove'](undefined)[_0x1113e4(0x7e7)]('')['remove'](null); const _0x585cb9 = _0x3fe26e[_0x1113e4(0x810)](_0x26663b[_0x1113e4(0x361)])[_0x1113e4(0x2d6)](); VisuMZ['CoreEngine']['ExportStri' + 'ng'](_0x585cb9, _0x3529ed, !![]), SceneManager[_0x1113e4(0xda5)][_0x1113e4(0x21c)] = !![]; }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x40d) + 'FromList'] = function (_0x3fc7ef) { const _0x574fff = _0x3a6da1, _0x20e534 = { 'JnDaN': function (_0x51aa16, _0x4e200c) { return _0x51aa16 + _0x4e200c; }, 'CbZWu': function (_0x5a6907, _0x14903c) { return _0x5a6907 === _0x14903c; }, 'APpJn': _0x574fff(0x229) + '〙\x0a', 'MVtht': function (_0x10a938, _0x20fef8) { return _0x10a938 !== _0x20fef8; }, 'JYUGp': _0x574fff(0x792), 'fqsLM': _0x574fff(0xfaa), 'KMEuc': function (_0x46be9e, _0xd3902a) { return _0x46be9e === _0xd3902a; }, 'LxZgf': '%1〘Choice\x20' + _0x574fff(0xaec), 'vqgRK': function (_0x1b1fbb, _0x35a6b9) { return _0x1b1fbb + _0x35a6b9; }, 'INeIa': function (_0x41d639, _0x2b193b) { return _0x41d639 === _0x2b193b; }, 'mESzY': '%1〘Choice\x20' + 'Cancel〙%1', 'IESqm': function (_0x4ef656, _0x17662d) { return _0x4ef656 === _0x17662d; }, 'NAmWD': '%1〘End\x20Cho' + _0x574fff(0xda9) + _0x574fff(0xd02), 'LkSyn': _0x574fff(0x953) + _0x574fff(0x102e), 'ygnkQ': function (_0x4962af, _0x57949e) { return _0x4962af + _0x57949e; }, 'lumtT': _0x574fff(0x66c) + _0x574fff(0xfaa), 'BSDAb': function (_0x12ee00, _0x50f493) { return _0x12ee00 === _0x50f493; }, 'pqrzd': function (_0x279c9a, _0x300b5d) { return _0x279c9a <= _0x300b5d; }, 'lVfxM': function (_0x879e74, _0x222051) { return _0x879e74 > _0x222051; }, 'xjrdy': _0x574fff(0xdbd) + '7|0|6', 'fsFXv': _0x574fff(0x37a) + _0x574fff(0x7e6) + '〙\x20End', 'cIUzG': _0x574fff(0x37a) + _0x574fff(0x7e6) + _0x574fff(0xcba) }; let _0x52b8aa = _0x20e534['JnDaN'](_0x20e534[_0x574fff(0xe2f)]('\x0a', '─'['repeat'](-0x23e1 * -0x1 + 0x1cf * -0x3 + 0x1 * -0x1e2e)), '\x0a'), _0x11a560 = _0x20e534[_0x574fff(0xe2f)](_0x20e534[_0x574fff(0xe2f)]('\x0a', '┄'[_0x574fff(0x692)](-0x9f * 0x20 + 0x664 + 0xdc2)), '\x0a'), _0x131813 = ''; for (const _0x519261 of _0x3fc7ef) { if (!_0x519261) continue; if (_0x20e534['CbZWu'](_0x519261['code'], 0x1 * -0x174b + -0x13b7 * -0x1 + 0x153 * 0x3)) _0x131813 += _0x20e534[_0x574fff(0xe2f)](_0x52b8aa, '\x0a'), _0x131813 += _0x20e534[_0x574fff(0xa24)], _0x20e534[_0x574fff(0xe7c)](_0x519261[_0x574fff(0x69d)][-0x62f * -0x1 + -0xcae + 0x683 * 0x1], '') && _0x20e534[_0x574fff(0xe7c)](_0x519261[_0x574fff(0x69d)][0x1 * 0x1f6d + -0x132 * 0x5 + -0x1 * 0x196f], undefined) && (_0x131813 += _0x20e534[_0x574fff(0xa1d)]['format'](_0x519261['parameters'][0x5ad * -0x1 + 0xbfb + -0x64a])); else { if (_0x20e534[_0x574fff(0xca1)](_0x519261['code'], 0xaaa + 0x1aef + -0x2408)) _0x131813 += _0x20e534[_0x574fff(0xcca)][_0x574fff(0xfc8)](_0x519261['parameters'][-0x1 * 0x1525 + 0x196 + 0x138f]); else { if (_0x20e534[_0x574fff(0x75d)](_0x519261[_0x574fff(0x6f8)], 0x1625 * 0x1 + 0x17 * -0x194 + 0xfb9)) _0x131813 += _0x52b8aa, _0x131813 += _0x20e534['LxZgf'][_0x574fff(0xfc8)](_0x11a560, _0x20e534[_0x574fff(0xaf6)](_0x519261[_0x574fff(0x69d)][0xe * -0xa5 + -0x1070 + 0x2 * 0xcbb], 0xc70 + 0xf94 * 0x1 + 0x47 * -0x65), _0x519261[_0x574fff(0x69d)][0x3 * 0xc4f + -0xfcd * 0x1 + 0x1 * -0x151f]); else { if (_0x20e534[_0x574fff(0x5f1)](_0x519261['code'], 0x2 * -0x40 + 0x17b * 0x13 + -0x536 * 0x5)) _0x131813 += _0x52b8aa, _0x131813 += _0x20e534[_0x574fff(0x1019)][_0x574fff(0xfc8)](_0x11a560); else { if (_0x20e534['IESqm'](_0x519261[_0x574fff(0x6f8)], 0xc * -0xca + 0x1 * -0x11f9 + 0x1d05)) _0x131813 += _0x52b8aa, _0x131813 += _0x20e534[_0x574fff(0xbab)][_0x574fff(0xfc8)](_0x11a560); else { if (_0x20e534[_0x574fff(0x75d)](_0x519261[_0x574fff(0x6f8)], -0x8 * 0x61 + 0x4 * 0x6b2 + -0x1757)) _0x131813 += _0x20e534[_0x574fff(0xaf6)](_0x52b8aa, '\x0a'), _0x131813 += _0x20e534[_0x574fff(0x5b8)]; else { if (_0x20e534[_0x574fff(0x75d)](_0x519261['code'], -0x108c + -0x1ed7 * -0x1 + -0xddf)) _0x131813 += _0x20e534[_0x574fff(0x9dc)](_0x52b8aa, '\x0a'), _0x131813 += _0x20e534['lumtT']['format'](_0x519261['parameters'][0x1 * 0x1e41 + -0x308 * 0x8 + 0x35 * -0x1d]); else { if (_0x20e534[_0x574fff(0xe50)](_0x519261['code'], -0x3c7 * 0x3 + -0x367 * 0x9 + 0x2b8c)) _0x131813 += _0x20e534[_0x574fff(0xcca)][_0x574fff(0xfc8)](_0x519261[_0x574fff(0x69d)][-0x1 * 0x19c + 0x1787 + -0x15eb * 0x1]); else { if (_0x20e534[_0x574fff(0xe50)](_0x519261[_0x574fff(0x6f8)], 0x1d8e + 0x254a + -0x37 * 0x135)) { const _0x10488c = $dataCommonEvents[_0x519261[_0x574fff(0x69d)][0xc7f + 0x412 * 0x7 + -0x5db * 0x7]]; if (_0x10488c && _0x20e534['pqrzd'](this[_0x574fff(0x76d) + 'ntLayers'], -0x16 * 0x152 + -0x1 * -0x119c + 0xb7a)) { this['_commonEve' + _0x574fff(0xe46)]++; let _0x3dbc80 = VisuMZ[_0x574fff(0xc9f)]['ExtractStr' + 'FromList'](_0x10488c['list']); if (_0x20e534[_0x574fff(0x616)](_0x3dbc80[_0x574fff(0x786)], 0x1530 + 0x1a49 * 0x1 + 0xfd3 * -0x3)) { const _0x1afe19 = _0x20e534[_0x574fff(0x315)][_0x574fff(0x80d)]('|'); let _0x23b5fe = 0x16cc + 0x1 * 0x2231 + 0x1 * -0x38fd; while (!![]) { switch (_0x1afe19[_0x23b5fe++]) { case '0': _0x131813 += _0x20e534[_0x574fff(0xd4d)]['format'](_0x10488c['id'], _0x10488c['name']); continue; case '1': _0x131813 += _0x3dbc80; continue; case '2': _0x131813 += _0x52b8aa; continue; case '3': _0x131813 += _0x20e534[_0x574fff(0x1032)][_0x574fff(0xfc8)](_0x10488c['id'], _0x10488c[_0x574fff(0x796)]); continue; case '4': _0x131813 += _0x11a560; continue; case '5': _0x131813 += _0x11a560; continue; case '6': _0x131813 += _0x11a560; continue; case '7': _0x131813 += _0x11a560; continue; }break; } } this[_0x574fff(0x76d) + _0x574fff(0xe46)]--; } } } } } } } } } } } return _0x20e534[_0x574fff(0x616)](_0x131813[_0x574fff(0x786)], 0x1e58 + 0x4 * 0x457 + -0x2fb4) && (_0x131813 += _0x52b8aa), _0x131813; }, PluginManager[_0x3a6da1(0x714) + _0x3a6da1(0x9b5)](pluginData[_0x3a6da1(0x796)], _0x3a6da1(0x105f), _0x28b170 => { const _0x139de3 = _0x3a6da1; VisuMZ[_0x139de3(0x2ce) + 'ams'](_0x28b170, _0x28b170); const _0x6ffbc2 = _0x28b170[_0x139de3(0x228)]; VisuMZ['openURL'](_0x6ffbc2); }), PluginManager['registerCo' + _0x3a6da1(0x9b5)](pluginData[_0x3a6da1(0x796)], _0x3a6da1(0x760), _0x24963d => { const _0x20b961 = _0x3a6da1; VisuMZ[_0x20b961(0x2ce) + 'ams'](_0x24963d, _0x24963d); const _0x3980aa = _0x24963d[_0x20b961(0x395)] || -0x1f1c + -0x1a78 + -0x86 * -0x6e; $gameParty[_0x20b961(0x622)](_0x3980aa); }), PluginManager['registerCo' + _0x3a6da1(0x9b5)](pluginData[_0x3a6da1(0x796)], _0x3a6da1(0xb74) + _0x3a6da1(0x358), _0x48b57f => { const _0x56ea53 = _0x3a6da1; if (!SceneManager[_0x56ea53(0x8b6)]()) return; VisuMZ[_0x56ea53(0x2ce) + _0x56ea53(0x887)](_0x48b57f, _0x48b57f); const _0x2dab4b = _0x48b57f[_0x56ea53(0x80b) + _0x56ea53(0xdf1)]; SceneManager[_0x56ea53(0xda5)][_0x56ea53(0xa68) + _0x56ea53(0x3af) + 'rpreter'](_0x2dab4b); }), PluginManager[_0x3a6da1(0x714) + _0x3a6da1(0x9b5)](pluginData[_0x3a6da1(0x796)], _0x3a6da1(0x980) + _0x3a6da1(0xe36) + 'de', _0x30ab56 => { const _0x3e7158 = _0x3a6da1; if (!$gameTemp['isPlaytest']()) return; if (!Utils[_0x3e7158(0x304)]()) return; VisuMZ[_0x3e7158(0x2ce) + 'ams'](_0x30ab56, _0x30ab56); const _0x506af9 = _0x30ab56['PictureID'] || -0x24f4 + 0x3 * 0xbca + 0x197; $gameTemp[_0x3e7158(0xa77) + 'ordinatesM' + 'ode'] = _0x506af9; }), PluginManager[_0x3a6da1(0x714) + _0x3a6da1(0x9b5)](pluginData[_0x3a6da1(0x796)], _0x3a6da1(0x99b) + _0x3a6da1(0xf4c), _0x275108 => { const _0x39da12 = _0x3a6da1, _0x589e41 = { 'oUAON': _0x39da12(0x90d) }; VisuMZ[_0x39da12(0x2ce) + _0x39da12(0x887)](_0x275108, _0x275108); const _0x302375 = _0x275108[_0x39da12(0x1044)] || 0x3 * -0xa10 + -0x1 * 0x1d54 + 0x3b85, _0x9c5692 = _0x275108[_0x39da12(0xcf8)] || _0x589e41[_0x39da12(0x5dc)], _0x1c824f = $gameScreen[_0x39da12(0x825)](_0x302375); _0x1c824f && _0x1c824f[_0x39da12(0xdf9) + _0x39da12(0xa6e)](_0x9c5692); }), PluginManager[_0x3a6da1(0x714) + _0x3a6da1(0x9b5)](pluginData[_0x3a6da1(0x796)], _0x3a6da1(0x9bc) + _0x3a6da1(0x2c8), _0xdf4c3c => { const _0x33a215 = _0x3a6da1, _0x21536c = { 'bNzlN': function (_0x3d1c92, _0x1d648f) { return _0x3d1c92 <= _0x1d648f; } }; for (let _0xd98a1e = -0x1e79 + -0x1 * 0x1b0f + 0x8f * 0x67; _0x21536c[_0x33a215(0xcbb)](_0xd98a1e, 0x25fe + -0x8a * -0x21 + -0x3764); _0xd98a1e++) { $gameScreen['erasePictu' + 're'](_0xd98a1e); } }), PluginManager[_0x3a6da1(0x714) + _0x3a6da1(0x9b5)](pluginData['name'], _0x3a6da1(0x9bc) + _0x3a6da1(0x80c), _0x56ef16 => { const _0xc43df4 = _0x3a6da1, _0x5de166 = { 'PICvA': function (_0x5a109a, _0x173ff6) { return _0x5a109a <= _0x173ff6; } }; VisuMZ[_0xc43df4(0x2ce) + _0xc43df4(0x887)](_0x56ef16, _0x56ef16); const _0x14abb2 = Math['min'](_0x56ef16['StartID'], _0x56ef16[_0xc43df4(0x10a6)]), _0x41bb0a = Math[_0xc43df4(0xeb6)](_0x56ef16[_0xc43df4(0xe54)], _0x56ef16[_0xc43df4(0x10a6)]); for (let _0x472923 = _0x14abb2; _0x5de166[_0xc43df4(0x51f)](_0x472923, _0x41bb0a); _0x472923++) { $gameScreen[_0xc43df4(0x1072) + 're'](_0x472923); } }), PluginManager[_0x3a6da1(0x714) + _0x3a6da1(0x9b5)](pluginData[_0x3a6da1(0x796)], _0x3a6da1(0xa76) + _0x3a6da1(0x771), _0x4a83f2 => { const _0xac8f0c = _0x3a6da1, _0x343104 = { 'NKGiF': function (_0x16d66d, _0x1cf3ca) { return _0x16d66d(_0x1cf3ca); }, 'sAxaY': 'Linear' }; VisuMZ[_0xac8f0c(0x2ce) + 'ams'](_0x4a83f2, _0x4a83f2); const _0x24a4f1 = Math[_0xac8f0c(0x48a)](_0x4a83f2[_0xac8f0c(0x6c1)])[_0xac8f0c(0x759)](-0x343 + 0x5 * 0x664 + -0x90 * 0x33, 0xc7e + 0x14cd + 0x1 * -0x20e7), _0x38ff6b = -_0x343104[_0xac8f0c(0xd44)](Number, _0x4a83f2[_0xac8f0c(0x335) + 'e'] || 0xd21 * -0x2 + 0x1d9e + -0x35c), _0x34baa8 = Math[_0xac8f0c(0xeb6)](_0x4a83f2[_0xac8f0c(0xdb1)] || 0x2d * 0xa3 + -0x18ac + -0x1 * 0x3fb, -0x5 * -0x3d3 + 0x23ec + -0x15 * 0x29f), _0x235b19 = _0x4a83f2[_0xac8f0c(0xcf8)] || _0x343104['sAxaY'], _0x5d1e94 = _0x4a83f2[_0xac8f0c(0x47d)], _0x599676 = $gameScreen[_0xac8f0c(0x825)](_0x24a4f1); if (!_0x599676) return; _0x599676['changeAngl' + _0xac8f0c(0x976)](_0x38ff6b, _0x34baa8, _0x235b19); if (_0x5d1e94) { const _0x19c22f = $gameTemp[_0xac8f0c(0xf78) + _0xac8f0c(0x7ea) + 'Interprete' + 'r'](); if (_0x19c22f) _0x19c22f[_0xac8f0c(0x5d3)](_0x34baa8); } }), PluginManager[_0x3a6da1(0x714) + _0x3a6da1(0x9b5)](pluginData[_0x3a6da1(0x796)], _0x3a6da1(0xa76) + _0x3a6da1(0x702), _0x12befc => { const _0x1cc9be = _0x3a6da1, _0x454a98 = { 'WLeyS': function (_0x5e48b5, _0xe5859f) { return _0x5e48b5(_0xe5859f); }, 'GXDvL': 'Linear' }; VisuMZ[_0x1cc9be(0x2ce) + _0x1cc9be(0x887)](_0x12befc, _0x12befc); const _0x3a20d4 = Math[_0x1cc9be(0x48a)](_0x12befc[_0x1cc9be(0x6c1)])['clamp'](-0x26a8 * 0x1 + 0xbfe * 0x1 + 0x1aab * 0x1, 0x667 * -0x4 + -0x1253 * -0x2 + -0xaa6), _0x5d3aa6 = -_0x454a98[_0x1cc9be(0x860)](Number, _0x12befc[_0x1cc9be(0x50a) + 'e'] || -0x21 * -0x5b + -0x9b6 * 0x4 + 0x1b1d), _0x2f7627 = Math['max'](_0x12befc[_0x1cc9be(0xdb1)] || 0x7 * 0x41b + 0x1 * -0xe2c + -0xb * 0x153, -0x1 * 0x5ce + 0x526 * -0x7 + 0x29d8), _0x4ed111 = _0x12befc[_0x1cc9be(0xcf8)] || _0x454a98[_0x1cc9be(0xb43)], _0x2e7a99 = _0x12befc['Wait'], _0x75694a = $gameScreen['picture'](_0x3a20d4); if (!_0x75694a) return; _0x75694a[_0x1cc9be(0xd04) + _0x1cc9be(0x2e5)](_0x5d3aa6, _0x2f7627, _0x4ed111); if (_0x2e7a99) { const _0x2d318a = $gameTemp[_0x1cc9be(0xf78) + 'ginCommand' + _0x1cc9be(0x1018) + 'r'](); if (_0x2d318a) _0x2d318a['wait'](_0x2f7627); } }), PluginManager[_0x3a6da1(0x714) + _0x3a6da1(0x9b5)](pluginData[_0x3a6da1(0x796)], _0x3a6da1(0x2f0) + 'wIcon', _0x54d524 => { const _0x23ffc3 = _0x3a6da1, _0x47ba7c = { 'GAokP': _0x23ffc3(0x294) + _0x23ffc3(0x623) + _0x23ffc3(0xbc6) + _0x23ffc3(0xd6d), 'OZNXc': _0x23ffc3(0x576), 'atSVE': _0x23ffc3(0xb02) }; VisuMZ[_0x23ffc3(0x2ce) + 'ams'](_0x54d524, _0x54d524); const _0x353db0 = Math['round'](_0x54d524['PictureID'])[_0x23ffc3(0x759)](-0x732 + 0x2 * -0xf93 + 0x2659, -0x11bb + -0x1 * 0x726 + 0x1945), _0x139146 = _0x54d524[_0x23ffc3(0x316)], _0x2c7a19 = _0x139146[_0x23ffc3(0x3fa)][_0x23ffc3(0x759)](0x2144 + -0x5b * -0x35 + -0x341b, 0x933 * 0x3 + -0x222b + 0x693), _0x511301 = Math['round'](_0x139146[_0x23ffc3(0x795)] || 0x7ae + -0x8ac + 0xfe * 0x1), _0x3bde3c = Math[_0x23ffc3(0x48a)](_0x139146['PositionY'] || 0x2c3 * -0x3 + -0x157 * -0x8 + -0x26f), _0x224299 = Math[_0x23ffc3(0x48a)](_0x139146['ScaleX'] || 0x1de4 + -0x24c5 + 0x6e1), _0x35c68a = Math[_0x23ffc3(0x48a)](_0x139146['ScaleY'] || 0x19e9 + -0x1eb9 * -0x1 + 0x293 * -0x16), _0x1095be = Math[_0x23ffc3(0x48a)](_0x139146[_0x23ffc3(0x100c)])[_0x23ffc3(0x759)](0xc4d * 0x2 + -0x2 * 0x27c + -0x13a2, 0x1f01 * -0x1 + -0x26a9 + 0x46a9), _0x180d01 = _0x139146[_0x23ffc3(0xedd)], _0x27b295 = _0x47ba7c[_0x23ffc3(0x8be)], _0x18e87a = _0x54d524[_0x23ffc3(0x576)] ? _0x47ba7c[_0x23ffc3(0xe1d)] : _0x47ba7c[_0x23ffc3(0xb53)], _0x3dfebe = _0x27b295['format'](_0x54d524[_0x23ffc3(0x9c7)], _0x18e87a); $gameScreen['showPictur' + 'e'](_0x353db0, _0x3dfebe, _0x2c7a19, _0x511301, _0x3bde3c, _0x224299, _0x35c68a, _0x1095be, _0x180d01); }), PluginManager[_0x3a6da1(0x714) + _0x3a6da1(0x9b5)](pluginData['name'], _0x3a6da1(0x9f7) + 'e', _0x4d7812 => { const _0x4708ad = _0x3a6da1, _0x1cba85 = { 'ezpKr': 'random' }; VisuMZ[_0x4708ad(0x2ce) + _0x4708ad(0x887)](_0x4d7812, _0x4d7812); const _0x34ba7b = _0x4d7812['Type'] || _0x1cba85[_0x4708ad(0xbc7)], _0x215efa = _0x4d7812[_0x4708ad(0xd9d)][_0x4708ad(0x759)](0x27 * -0x2e + 0xf29 * 0x1 + -0x826, 0x27a * -0x4 + -0x1054 + -0x1 * -0x1a45), _0x1d0948 = _0x4d7812['Speed'][_0x4708ad(0x759)](-0x1d6b + 0x2 * 0xfd3 + -0x23a, 0x4c4 + 0xd19 + -0x2 * 0x8ea), _0x266124 = _0x4d7812[_0x4708ad(0xdb1)] || -0x386 * -0x2 + -0x9 * -0xfe + -0xff9, _0x126723 = _0x4d7812[_0x4708ad(0x47d)]; $gameScreen[_0x4708ad(0xa3e) + _0x4708ad(0xb21) + 'hakeStyle'](_0x34ba7b), $gameScreen[_0x4708ad(0x610)](_0x215efa, _0x1d0948, _0x266124); if (_0x126723) { const _0x42a2ac = $gameTemp['getLastPlu' + _0x4708ad(0x7ea) + _0x4708ad(0x1018) + 'r'](); if (_0x42a2ac) _0x42a2ac[_0x4708ad(0x5d3)](_0x266124); } }), PluginManager[_0x3a6da1(0x714) + 'mmand'](pluginData[_0x3a6da1(0x796)], _0x3a6da1(0xb0c) + _0x3a6da1(0xa7a), _0x2a80de => { const _0x5b7805 = _0x3a6da1, _0x4f1c30 = { 'dXdpW': function (_0x4ccd04, _0x1ca474) { return _0x4ccd04 / _0x1ca474; }, 'MtpCQ': function (_0x37173e, _0x5a0bb5) { return _0x37173e <= _0x5a0bb5; } }; if ($gameParty[_0x5b7805(0x5e1)]()) return; VisuMZ[_0x5b7805(0x2ce) + _0x5b7805(0x887)](_0x2a80de, _0x2a80de); const _0x179c1a = _0x2a80de[_0x5b7805(0xf89)], _0x13fe23 = _0x4f1c30[_0x5b7805(0x1090)](_0x2a80de[_0x5b7805(0x232)] || -0x17b5 + 0x30d + -0x4 * -0x52a, -0x1 * 0x119b + -0x162b + 0x282a); for (const _0x66cba1 of _0x179c1a) { const _0x53c5b1 = _0x4f1c30['MtpCQ'](Math[_0x5b7805(0x106f)](), _0x13fe23); $gameSwitches[_0x5b7805(0x4e4)](_0x66cba1, _0x53c5b1); } }), PluginManager[_0x3a6da1(0x714) + 'mmand'](pluginData[_0x3a6da1(0x796)], _0x3a6da1(0xb0c) + _0x3a6da1(0xf36), _0x3f951c => { const _0xbd1eed = _0x3a6da1, _0x1bb18d = { 'ABqYe': function (_0x3a93f1, _0x24368c) { return _0x3a93f1 / _0x24368c; }, 'ePqqY': function (_0xc33e34, _0x1f8406) { return _0xc33e34 <= _0x1f8406; }, 'KmPno': function (_0xc86240, _0x32f555) { return _0xc86240 <= _0x32f555; } }; if ($gameParty['inBattle']()) return; VisuMZ[_0xbd1eed(0x2ce) + _0xbd1eed(0x887)](_0x3f951c, _0x3f951c); const _0x539ed9 = Math['min'](_0x3f951c['StartID'], _0x3f951c[_0xbd1eed(0x10a6)]), _0x499905 = Math[_0xbd1eed(0xeb6)](_0x3f951c[_0xbd1eed(0xe54)], _0x3f951c['EndingID']), _0x1bb4a6 = _0x1bb18d['ABqYe'](_0x3f951c[_0xbd1eed(0x232)] || 0xa7 * 0x2f + -0x18f5 * 0x1 + -0x2 * 0x2da, -0x1a * -0xf1 + -0x39 * 0x2f + -0xd9f); for (let _0x3f86a3 = _0x539ed9; _0x1bb18d['ePqqY'](_0x3f86a3, _0x499905); _0x3f86a3++) { const _0x438ddd = _0x1bb18d[_0xbd1eed(0xe73)](Math[_0xbd1eed(0x106f)](), _0x1bb4a6); $gameSwitches['setValue'](_0x3f86a3, _0x438ddd); } }), PluginManager[_0x3a6da1(0x714) + _0x3a6da1(0x9b5)](pluginData['name'], _0x3a6da1(0x59b) + _0x3a6da1(0x1080), _0x2d1e33 => { const _0x41a9ee = _0x3a6da1; if ($gameParty[_0x41a9ee(0x5e1)]()) return; VisuMZ[_0x41a9ee(0x2ce) + _0x41a9ee(0x887)](_0x2d1e33, _0x2d1e33); const _0x2eff27 = _0x2d1e33['IDs']; for (const _0x24f870 of _0x2eff27) { const _0xefde47 = $gameSwitches[_0x41a9ee(0x395)](_0x24f870); $gameSwitches[_0x41a9ee(0x4e4)](_0x24f870, !_0xefde47); } }), PluginManager[_0x3a6da1(0x714) + _0x3a6da1(0x9b5)](pluginData[_0x3a6da1(0x796)], _0x3a6da1(0x59b) + _0x3a6da1(0x3e5), _0x3ba406 => { const _0x310c58 = _0x3a6da1, _0x16d0ff = { 'ZEPNz': function (_0x12557d, _0x502851) { return _0x12557d <= _0x502851; } }; if ($gameParty[_0x310c58(0x5e1)]()) return; VisuMZ['ConvertPar' + _0x310c58(0x887)](_0x3ba406, _0x3ba406); const _0x50aaa6 = Math[_0x310c58(0xb36)](_0x3ba406[_0x310c58(0xe54)], _0x3ba406[_0x310c58(0x10a6)]), _0x215c80 = Math[_0x310c58(0xeb6)](_0x3ba406[_0x310c58(0xe54)], _0x3ba406[_0x310c58(0x10a6)]); for (let _0x29b517 = _0x50aaa6; _0x16d0ff[_0x310c58(0x9db)](_0x29b517, _0x215c80); _0x29b517++) { const _0x1cfd49 = $gameSwitches[_0x310c58(0x395)](_0x29b517); $gameSwitches[_0x310c58(0x4e4)](_0x29b517, !_0x1cfd49); } }), PluginManager[_0x3a6da1(0x714) + _0x3a6da1(0x9b5)](pluginData['name'], _0x3a6da1(0xb96) + _0x3a6da1(0xf15), _0x333f54 => { const _0x37ccf7 = _0x3a6da1; VisuMZ[_0x37ccf7(0x2ce) + _0x37ccf7(0x887)](_0x333f54, _0x333f54); const _0x2930a3 = _0x333f54[_0x37ccf7(0xe19)] || 0x2 * 0x12d1 + -0x250b + -0x96; $gameSystem[_0x37ccf7(0xd24) + _0x37ccf7(0xc85)](_0x2930a3); }), PluginManager['registerCo' + _0x3a6da1(0x9b5)](pluginData['name'], _0x3a6da1(0x1088) + _0x3a6da1(0xc6b), _0x5baaf3 => { const _0x501325 = _0x3a6da1; if ($gameParty[_0x501325(0x5e1)]()) return; VisuMZ[_0x501325(0x2ce) + _0x501325(0x887)](_0x5baaf3, _0x5baaf3); const _0x54cd73 = _0x5baaf3[_0x501325(0xe19)]; if (_0x54cd73['match'](/Front/i)) $gameSystem['setSideVie' + 'w'](![]); else _0x54cd73[_0x501325(0x7a8)](/Side/i) ? $gameSystem['setSideVie' + 'w'](!![]) : $gameSystem['setSideVie' + 'w'](!$gameSystem[_0x501325(0xf23)]()); }), PluginManager[_0x3a6da1(0x714) + _0x3a6da1(0x9b5)](pluginData[_0x3a6da1(0x796)], _0x3a6da1(0x9e7) + 'Audio', _0x49d654 => { const _0x24f70d = _0x3a6da1, _0x2d4b46 = { 'beyXc': _0x24f70d(0xfde), 'uHSRQ': _0x24f70d(0x832), 'MxWQB': '%1/' }; if ($gameParty[_0x24f70d(0x5e1)]()) return; VisuMZ[_0x24f70d(0x2ce) + 'ams'](_0x49d654, _0x49d654); const _0x3c79e8 = [_0x2d4b46[_0x24f70d(0x9ec)], _0x2d4b46[_0x24f70d(0x40f)], 'me', 'se']; for (const _0x1adbad of _0x3c79e8) { const _0x3f4053 = _0x49d654[_0x1adbad], _0x4327f4 = _0x2d4b46[_0x24f70d(0xd35)][_0x24f70d(0xfc8)](_0x1adbad); for (const _0x5da8d5 of _0x3f4053) { AudioManager[_0x24f70d(0x9fe) + 'er'](_0x4327f4, _0x5da8d5); } } }), PluginManager[_0x3a6da1(0x714) + _0x3a6da1(0x9b5)](pluginData[_0x3a6da1(0x796)], _0x3a6da1(0x9e7) + _0x3a6da1(0x927), _0xe9a599 => { const _0x308475 = _0x3a6da1, _0x14bc7f = { 'RnRMJ': _0x308475(0x45a), 'hKwiL': 'battleback' + 's1', 'bxGrN': _0x308475(0x391) + 's2', 'hUKWU': 'characters', 'smQrb': _0x308475(0x4ba), 'VZfBZ': _0x308475(0x104f), 'vElHJ': _0x308475(0xffd), 'TVPIz': 'pictures', 'GiMyd': 'sv_actors', 'oJUle': _0x308475(0x7bc), 'raslJ': _0x308475(0xf03), 'WYjAx': _0x308475(0x82a), 'tsbal': _0x308475(0x484), 'bNKlS': _0x308475(0x57b), 'HPEmZ': _0x308475(0xe69) }; if ($gameParty[_0x308475(0x5e1)]()) return; VisuMZ[_0x308475(0x2ce) + _0x308475(0x887)](_0xe9a599, _0xe9a599); const _0x41a40f = [_0x14bc7f[_0x308475(0x350)], _0x14bc7f[_0x308475(0xecd)], _0x14bc7f[_0x308475(0x46d)], _0x14bc7f['hUKWU'], _0x14bc7f[_0x308475(0x454)], _0x14bc7f['VZfBZ'], _0x14bc7f[_0x308475(0xbdb)], _0x14bc7f['TVPIz'], _0x14bc7f[_0x308475(0x7e2)], _0x14bc7f[_0x308475(0x730)], _0x14bc7f[_0x308475(0x2b7)], _0x14bc7f['WYjAx'], _0x14bc7f[_0x308475(0x412)], _0x14bc7f[_0x308475(0xd2c)]]; for (const _0x136a69 of _0x41a40f) { const _0x10150e = _0xe9a599[_0x136a69], _0x4f780d = _0x14bc7f[_0x308475(0x891)][_0x308475(0xfc8)](_0x136a69); for (const _0xb52501 of _0x10150e) { ImageManager[_0x308475(0x4b5)](_0x4f780d, _0xb52501); } } }), PluginManager['registerCo' + _0x3a6da1(0x9b5)](pluginData[_0x3a6da1(0x796)], _0x3a6da1(0x6d1) + _0x3a6da1(0x4d3) + 'm', _0x19f6e6 => { const _0x4d1053 = _0x3a6da1; if ($gameParty[_0x4d1053(0x5e1)]()) return; VisuMZ['ConvertPar' + _0x4d1053(0x887)](_0x19f6e6, _0x19f6e6); const _0x1a6637 = _0x19f6e6['option']['toUpperCas' + 'e']()[_0x4d1053(0x2d6)](), _0x4a59fb = VisuMZ['CoreEngine'][_0x4d1053(0xefe) + _0x4d1053(0xce7)](_0x1a6637); $gameSystem[_0x4d1053(0x867) + _0x4d1053(0x5d4)](_0x4a59fb); }), VisuMZ['CoreEngine']['CreateBatt' + 'leSystemID'] = function (_0x49c65a) { const _0x26d5ba = _0x3a6da1, _0x20cacd = { 'IOwwB': function (_0x298e76, _0x1b92f1) { return _0x298e76 || _0x1b92f1; }, 'tyVuL': _0x26d5ba(0x869), 'cmckp': function (_0x55399a, _0x32a659) { return _0x55399a(_0x32a659); }, 'nLNOk': _0x26d5ba(0x505), 'XJmCR': _0x26d5ba(0x8dd), 'urPxf': _0x26d5ba(0x8ea), 'yBtOS': _0x26d5ba(0xafd), 'duvpl': _0x26d5ba(0xf17), 'LpCOD': _0x26d5ba(0x1034), 'jKKXT': _0x26d5ba(0x870), 'pmNdA': 'OTB', 'FfwHo': 'ETB', 'Nedsa': _0x26d5ba(0x3ec) }; _0x49c65a = _0x20cacd[_0x26d5ba(0x4e5)](_0x49c65a, _0x20cacd[_0x26d5ba(0x605)]), _0x49c65a = _0x20cacd[_0x26d5ba(0x2d1)](String, _0x49c65a)['toUpperCas' + 'e']()['trim'](); switch (_0x49c65a) { case _0x20cacd[_0x26d5ba(0x1f2)]: return -0x6a6 * 0x3 + 0x1d5a + -0x968; case _0x20cacd[_0x26d5ba(0x1056)]: Imported[_0x26d5ba(0xc5c) + 'ptionsCore'] && (ConfigManager[_0x26d5ba(0xa31)] = !![]); return -0x1 * -0xd63 + -0x1261 + 0x4ff; case _0x20cacd[_0x26d5ba(0x8f7)]: Imported['VisuMZ_1_O' + _0x26d5ba(0x63e)] && (ConfigManager['atbActive'] = ![]); return 0x13 * 0x119 + -0x21c5 + 0x676 * 0x2; case _0x20cacd[_0x26d5ba(0x3a3)]: if (Imported[_0x26d5ba(0x61d) + _0x26d5ba(0x4d3) + 'mCTB']) return _0x20cacd[_0x26d5ba(0x3a3)]; break; case _0x20cacd['duvpl']: if (Imported[_0x26d5ba(0x61d) + 'attleSyste' + 'mSTB']) return _0x20cacd['duvpl']; break; case _0x20cacd[_0x26d5ba(0xbfc)]: if (Imported[_0x26d5ba(0x61d) + 'attleSyste' + _0x26d5ba(0x107b)]) return _0x20cacd['LpCOD']; break; case _0x20cacd[_0x26d5ba(0x336)]: if (Imported[_0x26d5ba(0x61d) + _0x26d5ba(0x4d3) + 'mFTB']) return _0x20cacd[_0x26d5ba(0x336)]; break; case _0x20cacd['pmNdA']: if (Imported[_0x26d5ba(0x61d) + _0x26d5ba(0x4d3) + _0x26d5ba(0x741)]) return _0x20cacd[_0x26d5ba(0xb55)]; break; case _0x20cacd[_0x26d5ba(0x82f)]: if (Imported[_0x26d5ba(0x61d) + _0x26d5ba(0x4d3) + 'mETB']) return _0x20cacd['FfwHo']; break; case _0x20cacd[_0x26d5ba(0x888)]: if (Imported[_0x26d5ba(0x61d) + _0x26d5ba(0x4d3) + _0x26d5ba(0x73d)]) return _0x20cacd['Nedsa']; break; }return $dataSystem[_0x26d5ba(0x956) + 'em']; }, PluginManager[_0x3a6da1(0x714) + _0x3a6da1(0x9b5)](pluginData['name'], _0x3a6da1(0x106c) + _0x3a6da1(0x1024) + 'ng', _0xe3c623 => { const _0x3ca140 = _0x3a6da1; VisuMZ[_0x3ca140(0x2ce) + _0x3ca140(0x887)](_0xe3c623, _0xe3c623); const _0x229840 = _0xe3c623[_0x3ca140(0xe19)] || 0x19ac + 0x11ce + -0x2b79; $gameSystem[_0x3ca140(0xd12) + _0x3ca140(0x4d2)](_0x229840); }), PluginManager[_0x3a6da1(0x714) + _0x3a6da1(0x9b5)](pluginData['name'], _0x3a6da1(0x307) + _0x3a6da1(0xe53), _0x36c1ff => { const _0x1c553e = _0x3a6da1, _0x53affb = { 'aZXju': function (_0x40662c, _0x178634) { return _0x40662c(_0x178634); } }; VisuMZ[_0x1c553e(0x2ce) + 'ams'](_0x36c1ff, _0x36c1ff); const _0x1b526f = _0x36c1ff['text'] || ''; _0x53affb[_0x1c553e(0xdca)]($textPopup, _0x1b526f); }), PluginManager['registerCo' + 'mmand'](pluginData[_0x3a6da1(0x796)], _0x3a6da1(0xe44) + _0x3a6da1(0x876) + 'e', _0x16d5c7 => { const _0x5a1e29 = _0x3a6da1, _0x47a39c = { 'zrIkN': function (_0xc37384, _0x3aa9cd) { return _0xc37384 || _0x3aa9cd; } }; VisuMZ['ConvertPar' + _0x5a1e29(0x887)](_0x16d5c7, _0x16d5c7); const _0x4d1cc3 = _0x16d5c7['id'] || 0xce4 + 0x7 * -0x142 + -0x415, _0x92b6b8 = _0x16d5c7[_0x5a1e29(0x442)], _0x4b46d2 = _0x16d5c7['operand'] || 0x15d2 + -0x1ed2 + 0x900; let _0x3d54d8 = $gameVariables[_0x5a1e29(0x395)](_0x4d1cc3) || 0x23b * 0xc + -0x2 * 0x3a1 + -0x16 * 0xe3; switch (_0x92b6b8) { case '=': _0x3d54d8 = _0x4b46d2; break; case '+': _0x3d54d8 += _0x4b46d2; break; case '-': _0x3d54d8 -= _0x4b46d2; break; case '*': _0x3d54d8 *= _0x4b46d2; break; case '/': _0x3d54d8 /= _0x4b46d2; break; case '%': _0x3d54d8 %= _0x4b46d2; break; }_0x3d54d8 = _0x47a39c[_0x5a1e29(0x2cd)](_0x3d54d8, 0x13 * 0x15c + 0x1 * -0x2017 + -0xe5 * -0x7), $gameVariables[_0x5a1e29(0x4e4)](_0x4d1cc3, _0x3d54d8); }), PluginManager[_0x3a6da1(0x714) + _0x3a6da1(0x9b5)](pluginData[_0x3a6da1(0x796)], 'VariableJs' + _0x3a6da1(0x3ad), _0x4b2aea => { const _0x139755 = _0x3a6da1, _0x1cd54c = { 'JPokc': function (_0x1a7c63, _0xdeb077) { return _0x1a7c63 || _0xdeb077; } }; VisuMZ['ConvertPar' + _0x139755(0x887)](_0x4b2aea, _0x4b2aea); const _0x5506fa = _0x4b2aea['id']() || -0x16f7 + -0x626 * -0x4 + -0x1a0, _0x1c7d3f = _0x4b2aea['operation'], _0x530bf3 = _0x4b2aea[_0x139755(0xc1a)]() || 0x1692 + 0xb * -0x8c + -0x108e; let _0x36783b = $gameVariables[_0x139755(0x395)](_0x5506fa) || 0x1 * -0x569 + -0x20e6 * -0x1 + -0x1b7d; switch (_0x1c7d3f) { case '=': _0x36783b = _0x530bf3; break; case '+': _0x36783b += _0x530bf3; break; case '-': _0x36783b -= _0x530bf3; break; case '*': _0x36783b *= _0x530bf3; break; case '/': _0x36783b /= _0x530bf3; break; case '%': _0x36783b %= _0x530bf3; break; }_0x36783b = _0x1cd54c[_0x139755(0x594)](_0x36783b, 0x1f44 + 0x10 * 0x24b + -0x4 * 0x10fd), $gameVariables[_0x139755(0x4e4)](_0x5506fa, _0x36783b); }), VisuMZ[_0x3a6da1(0xc9f)]['Scene_Boot' + _0x3a6da1(0x4c2) + _0x3a6da1(0xee6)] = Scene_Boot[_0x3a6da1(0x49b)][_0x3a6da1(0x285) + _0x3a6da1(0x8ab)], Scene_Boot[_0x3a6da1(0x49b)][_0x3a6da1(0x285) + _0x3a6da1(0x8ab)] = function () { const _0x20e883 = _0x3a6da1, _0x57d746 = { 'uGoKK': '0|5|2|7|6|' + _0x20e883(0x84c) }, _0x1ddb5e = _0x57d746[_0x20e883(0x1077)][_0x20e883(0x80d)]('|'); let _0x4843bf = 0x911 * -0x1 + -0x1a1d + 0x232e; while (!![]) { switch (_0x1ddb5e[_0x4843bf++]) { case '0': VisuMZ['CoreEngine'][_0x20e883(0xd43) + _0x20e883(0x4c2) + _0x20e883(0xee6)][_0x20e883(0xedc)](this); continue; case '1': this[_0x20e883(0x29c) + _0x20e883(0xfa5) + _0x20e883(0x9b3) + _0x20e883(0x3ae) + _0x20e883(0xeb3)](); continue; case '2': this[_0x20e883(0x29c) + _0x20e883(0xfa5) + _0x20e883(0x618) + 'tags'](); continue; case '3': VisuMZ[_0x20e883(0x364) + _0x20e883(0x234)](); continue; case '4': this[_0x20e883(0x29c) + _0x20e883(0xfa5) + 'ngine_Cust' + _0x20e883(0x826) + 'rs'](); continue; case '5': this[_0x20e883(0x29c) + _0x20e883(0xfa5) + 'ngine_RegE' + 'xp'](); continue; case '6': this['process_Vi' + _0x20e883(0xfa5) + _0x20e883(0xa8d) + _0x20e883(0xe1c)](); continue; case '7': this[_0x20e883(0x29c) + _0x20e883(0xfa5) + _0x20e883(0xe64) + _0x20e883(0xcd3)](); continue; }break; } }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xab9)] = {}, Scene_Boot['prototype']['process_Vi' + _0x3a6da1(0xfa5) + 'ngine_RegE' + 'xp'] = function () { const _0x55f3cd = _0x3a6da1, _0x5ae08e = { 'bxqpA': _0x55f3cd(0x6b9), 'jzsQY': 'MAXMP', 'XycWl': _0x55f3cd(0x84e), 'foquJ': _0x55f3cd(0x7e1), 'NoZbE': _0x55f3cd(0x20b), 'zQmpu': _0x55f3cd(0x28b), 'SOsUD': _0x55f3cd(0x514), 'sShAt': _0x55f3cd(0xffe), 'PSsWA': _0x55f3cd(0xa27), 'NXBsb': 'EVA', 'iZZQm': _0x55f3cd(0x27f), 'ftGjs': 'CEV', 'wrJWZ': _0x55f3cd(0x7f2), 'EwTPY': _0x55f3cd(0x1040), 'BgBwe': 'CNT', 'uxazT': _0x55f3cd(0x830), 'QZRMe': _0x55f3cd(0xa4b), 'hlyBB': _0x55f3cd(0xf6e), 'MnwiG': _0x55f3cd(0xf7b), 'ncAKq': _0x55f3cd(0x766), 'wTYLR': _0x55f3cd(0x4f4), 'aSlfj': _0x55f3cd(0x1054), 'oYHyV': _0x55f3cd(0xe08), 'Nhwef': 'TCR', 'oOtHe': _0x55f3cd(0x763), 'tFHSn': 'MDR', 'jqCdS': _0x55f3cd(0x93e), 'yhemA': _0x55f3cd(0xf63), 'sfkek': _0x55f3cd(0x69e), 'qLaQw': _0x55f3cd(0x443), 'HWOWU': _0x55f3cd(0x1005), 'fetzI': 'Max', 'tYQxB': _0x55f3cd(0xa72), 'xDNLU': _0x55f3cd(0x2a8), 'CMsnq': _0x55f3cd(0xfea), 'KTcOZ': 'Flat', 'auSoa': _0x55f3cd(0x525), 'kHGLn': _0x55f3cd(0x743), 'THCLi': function (_0x3f8855, _0x2ebc47) { return _0x3f8855 === _0x2ebc47; }, 'swqAQ': _0x55f3cd(0xa58), 'SsEPK': function (_0x304fb3, _0x4a2605) { return _0x304fb3 === _0x4a2605; }, 'yfzSd': _0x55f3cd(0x241), 'YUXmI': 'sparam', 'xiBqV': _0x55f3cd(0x463), 'WjGwL': function (_0x9eb233, _0x36d42c) { return _0x9eb233 + _0x36d42c; }, 'BUdUh': _0x55f3cd(0x338), 'nsSDF': _0x55f3cd(0x5e5) + ')>', 'AMqKP': _0x55f3cd(0x5e5) + _0x55f3cd(0x683), 'uaTOd': _0x55f3cd(0x5e5) + _0x55f3cd(0xc39), 'IEKPo': _0x55f3cd(0x7f1), 'VAhoM': '(\x5cd+)([%％]' + ')>', 'ZXyNW': '(\x5cd+\x5c.?\x5cd+' + ')>', 'VgObW': '<JS\x20%1\x20%2:' + '[\x20](.*)>' }, _0x45a8c3 = [_0x5ae08e['bxqpA'], _0x5ae08e[_0x55f3cd(0x88e)], _0x5ae08e[_0x55f3cd(0xd0f)], _0x5ae08e[_0x55f3cd(0x33a)], _0x5ae08e['NoZbE'], _0x5ae08e[_0x55f3cd(0x899)], _0x5ae08e[_0x55f3cd(0xc29)], _0x5ae08e[_0x55f3cd(0xd0d)]], _0x5ece4a = [_0x5ae08e['PSsWA'], _0x5ae08e['NXBsb'], _0x5ae08e[_0x55f3cd(0x4d9)], _0x5ae08e['ftGjs'], _0x5ae08e[_0x55f3cd(0xff3)], _0x5ae08e['EwTPY'], _0x5ae08e[_0x55f3cd(0x3bb)], _0x5ae08e[_0x55f3cd(0xa89)], _0x5ae08e[_0x55f3cd(0x223)], _0x5ae08e[_0x55f3cd(0xccd)]], _0xff195e = [_0x5ae08e['MnwiG'], _0x5ae08e[_0x55f3cd(0xda7)], _0x5ae08e['wTYLR'], _0x5ae08e[_0x55f3cd(0x2a5)], _0x5ae08e[_0x55f3cd(0x745)], _0x5ae08e[_0x55f3cd(0x669)], _0x5ae08e[_0x55f3cd(0xf9f)], _0x5ae08e[_0x55f3cd(0x585)], _0x5ae08e[_0x55f3cd(0xdcb)], _0x5ae08e['yhemA']], _0xde1206 = [_0x45a8c3, _0x5ece4a, _0xff195e], _0x15d339 = [_0x5ae08e[_0x55f3cd(0x96e)], _0x5ae08e[_0x55f3cd(0x4bb)], _0x5ae08e[_0x55f3cd(0xe78)], _0x5ae08e[_0x55f3cd(0x9ff)], _0x5ae08e[_0x55f3cd(0x651)], _0x5ae08e['xDNLU'], _0x5ae08e['CMsnq'], _0x5ae08e[_0x55f3cd(0x52b)], _0x5ae08e['auSoa'], _0x5ae08e[_0x55f3cd(0x6e8)]]; for (const _0x4be29e of _0xde1206) { let _0x4c9931 = ''; if (_0x5ae08e[_0x55f3cd(0x471)](_0x4be29e, _0x45a8c3)) _0x4c9931 = _0x5ae08e[_0x55f3cd(0x4f7)]; if (_0x5ae08e[_0x55f3cd(0x6fa)](_0x4be29e, _0x5ece4a)) _0x4c9931 = _0x5ae08e[_0x55f3cd(0xe96)]; if (_0x5ae08e[_0x55f3cd(0x471)](_0x4be29e, _0xff195e)) _0x4c9931 = _0x5ae08e[_0x55f3cd(0xcc5)]; for (const _0x10b740 of _0x15d339) { let _0x565f14 = _0x5ae08e['xiBqV'][_0x55f3cd(0xfc8)](_0x4c9931, _0x10b740); VisuMZ[_0x55f3cd(0xc9f)][_0x55f3cd(0xab9)][_0x565f14] = [], VisuMZ['CoreEngine'][_0x55f3cd(0xab9)][_0x5ae08e['WjGwL'](_0x565f14, 'JS')] = []; let _0x50a8ad = _0x5ae08e[_0x55f3cd(0x2f9)]; if ([_0x5ae08e['sfkek'], _0x5ae08e['KTcOZ']][_0x55f3cd(0xa43)](_0x10b740)) _0x50a8ad += _0x5ae08e['nsSDF']; else { if ([_0x5ae08e[_0x55f3cd(0x4bb)], _0x5ae08e[_0x55f3cd(0xa64)]][_0x55f3cd(0xa43)](_0x10b740)) _0x50a8ad += _0x5ae08e[_0x55f3cd(0xb63)]; else { if ([_0x5ae08e[_0x55f3cd(0xe78)], _0x5ae08e['kHGLn']][_0x55f3cd(0xa43)](_0x10b740)) _0x50a8ad += _0x5ae08e[_0x55f3cd(0x985)]; else { if (_0x5ae08e[_0x55f3cd(0x471)](_0x10b740, _0x5ae08e['fetzI'])) _0x50a8ad += _0x5ae08e[_0x55f3cd(0xf9d)]; else { if (_0x5ae08e[_0x55f3cd(0x471)](_0x10b740, _0x5ae08e[_0x55f3cd(0x7b6)])) _0x50a8ad += _0x5ae08e[_0x55f3cd(0x26b)]; else _0x5ae08e[_0x55f3cd(0x6fa)](_0x10b740, _0x5ae08e[_0x55f3cd(0x933)]) && (_0x50a8ad += _0x5ae08e[_0x55f3cd(0x8aa)]); } } } } for (const _0x379adb of _0x4be29e) { let _0x5c3c5b = _0x10b740[_0x55f3cd(0xdac)](/[\d+]/g, '')[_0x55f3cd(0xac2) + 'e'](); const _0x5298cf = _0x50a8ad[_0x55f3cd(0xfc8)](_0x379adb, _0x5c3c5b); VisuMZ[_0x55f3cd(0xc9f)][_0x55f3cd(0xab9)][_0x565f14][_0x55f3cd(0x92f)](new RegExp(_0x5298cf, 'i')); const _0x32d7db = _0x5ae08e[_0x55f3cd(0xab5)]['format'](_0x379adb, _0x5c3c5b); VisuMZ[_0x55f3cd(0xc9f)][_0x55f3cd(0xab9)][_0x5ae08e['WjGwL'](_0x565f14, 'JS')][_0x55f3cd(0x92f)](new RegExp(_0x32d7db, 'i')); } } } }, Scene_Boot['prototype'][_0x3a6da1(0x29c) + _0x3a6da1(0xfa5) + _0x3a6da1(0x618) + 'tags'] = function () { const _0x23ae66 = _0x3a6da1; if (VisuMZ[_0x23ae66(0x364) + _0x23ae66(0x234)]) return; }, Scene_Boot[_0x3a6da1(0x49b)]['process_Vi' + _0x3a6da1(0xfa5) + 'ngine_Sett' + _0x3a6da1(0xcd3)] = function () { const _0x559b31 = _0x3a6da1, _0x47f5bf = { 'WlfUT': 'end', 'JkmUm': 'home', 'PfJOt': '\x5c}❪SHIFT❫\x5c' + '{', 'qnFOG': '\x5c}❪TAB❫\x5c{', 'ObizP': _0x559b31(0xece), 'bGJCt': _0x559b31(0x950), 'NnmcO': _0x559b31(0x10a7), 'NSLeD': _0x559b31(0xd34), 'FJWKc': 'down', 'mVrRc': 'dashToggle' }, _0x4f755e = VisuMZ[_0x559b31(0xc9f)]['Settings']; _0x4f755e[_0x559b31(0xfee)][_0x559b31(0xa82) + 'e'] && VisuMZ[_0x559b31(0x658) + 'ls'](!![]); _0x4f755e[_0x559b31(0xfee)][_0x559b31(0xe49) + _0x559b31(0x465)] && (Input[_0x559b31(0xf32)][-0x2565 + 0x245d + 0x12b * 0x1] = _0x47f5bf[_0x559b31(0xd78)], Input['keyMapper'][-0xbe6 + 0x16b1 + 0x1b * -0x65] = _0x47f5bf[_0x559b31(0xed0)]); if (_0x4f755e[_0x559b31(0xb8a) + 'st']) { const _0x391a1f = _0x4f755e[_0x559b31(0xb8a) + 'st']; _0x391a1f[_0x559b31(0x104e)] = _0x391a1f[_0x559b31(0x104e)] || _0x47f5bf[_0x559b31(0x1007)], _0x391a1f[_0x559b31(0xe63)] = _0x391a1f[_0x559b31(0xe63)] || _0x47f5bf[_0x559b31(0xd2a)]; } if (_0x4f755e[_0x559b31(0x988) + 'put'][_0x559b31(0xbe0)]) { const _0x1afffd = _0x47f5bf[_0x559b31(0xc13)]['split']('|'); let _0x163342 = 0x2541 + 0x1406 + -0x3947; while (!![]) { switch (_0x1afffd[_0x163342++]) { case '0': Input[_0x559b31(0xf32)][0x20 * -0xfb + 0x8 * -0x264 + 0x32d7] = 'up'; continue; case '1': Input[_0x559b31(0xf32)][0xc * 0x141 + 0x119b + -0x2063] = _0x47f5bf[_0x559b31(0x948)]; continue; case '2': Input[_0x559b31(0xf32)][-0x26f9 * -0x1 + -0x1 * -0x25ab + -0x4c63] = _0x47f5bf[_0x559b31(0x31c)]; continue; case '3': Input[_0x559b31(0xf32)][0xb35 + -0x20f5 + 0x3 * 0x757] = _0x47f5bf[_0x559b31(0x911)]; continue; case '4': Input[_0x559b31(0xf32)][0x2093 + -0xb03 * -0x2 + -0x3646] = _0x47f5bf['FJWKc']; continue; }break; } } _0x4f755e[_0x559b31(0x988) + _0x559b31(0xd57)][_0x559b31(0x8d3) + 'R'] && (Input[_0x559b31(0xf32)][0xf9 + -0x1f99 + 0x1ef2] = _0x47f5bf[_0x559b31(0x322)]), _0x4f755e['Param'][_0x559b31(0x74f) + 'arams'] = _0x4f755e[_0x559b31(0x6ad)][_0x559b31(0x74f) + 'arams'][_0x559b31(0x267)](_0x48ecab => _0x48ecab['toUpperCas' + 'e']()['trim']()), _0x4f755e[_0x559b31(0x6ad)][_0x559b31(0xc27) + 'edParams'] = _0x4f755e[_0x559b31(0x6ad)][_0x559b31(0xc27) + _0x559b31(0xa5b)][_0x559b31(0x267)](_0x233b31 => _0x233b31['toUpperCas' + 'e']()[_0x559b31(0x2d6)]()), _0x4f755e[_0x559b31(0xfee)][_0x559b31(0x6c3) + 'gle'] = _0x4f755e['QoL']['ShiftR_Tog' + _0x559b31(0xdc2)] ?? !![], _0x4f755e['QoL'][_0x559b31(0x55f) + _0x559b31(0xdc2)] = _0x4f755e[_0x559b31(0xfee)]['ShiftT_Tog' + _0x559b31(0xdc2)] ?? !![]; }, Scene_Boot[_0x3a6da1(0x49b)][_0x3a6da1(0x29c) + _0x3a6da1(0xfa5) + _0x3a6da1(0xa8d) + _0x3a6da1(0xe1c)] = function () { const _0x49bc44 = _0x3a6da1; this[_0x49bc44(0x29c) + _0x49bc44(0xfa5) + _0x49bc44(0x81e) + 'ickFunctio' + 'ns'](); }, Scene_Boot[_0x3a6da1(0x49b)][_0x3a6da1(0x29c) + _0x3a6da1(0xfa5) + _0x3a6da1(0x81e) + _0x3a6da1(0xc1e) + 'ns'] = function () { const _0x333840 = _0x3a6da1, _0x56505b = VisuMZ[_0x333840(0xc9f)]['Settings'][_0x333840(0xbbc) + 'c']; for (const _0x42d649 of _0x56505b) { const _0x564c30 = _0x42d649[_0x333840(0x4c4) + 'me'][_0x333840(0xdac)](/[ ]/g, ''), _0x13c8fc = _0x42d649[_0x333840(0xdec)]; VisuMZ[_0x333840(0xc9f)][_0x333840(0xfa7) + _0x333840(0xc1e) + 'n'](_0x564c30, _0x13c8fc); } }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xfa7) + _0x3a6da1(0xc1e) + 'n'] = function (_0x4e1cdb, _0x4871d4) { const _0x2c9adf = _0x3a6da1, _0x2c23c5 = { 'wJKnT': _0x2c9adf(0xbbb) + _0x2c9adf(0x5e2) + 'ady\x20been\x20d' + _0x2c9adf(0xf8b) + _0x2c9adf(0xd4e) + 'e\x20used\x20as\x20' + _0x2c9adf(0xd22) + _0x2c9adf(0xea4) }; if (!!window[_0x4e1cdb]) { if ($gameTemp['isPlaytest']()) console[_0x2c9adf(0xaee)](_0x2c23c5[_0x2c9adf(0x3aa)][_0x2c9adf(0xfc8)](_0x4e1cdb)); } const _0x409d71 = ('\x0a\x20\x20\x20\x20\x20\x20\x20\x20t' + 'ry\x20{\x0a\x20\x20\x20\x20\x20' + _0x2c9adf(0xc83) + '\x20\x20\x20\x20\x20\x20\x20\x20}\x20' + _0x2c9adf(0x517) + _0x2c9adf(0x42b) + _0x2c9adf(0xd87) + 'ameTemp.is' + _0x2c9adf(0x1000) + _0x2c9adf(0xc6a) + _0x2c9adf(0x93f) + _0x2c9adf(0xebc) + 'g(\x27JS\x20Quic' + _0x2c9adf(0xf5c) + _0x2c9adf(0xd42) + 'r!\x27);\x0a\x20\x20\x20\x20' + '\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20' + _0x2c9adf(0xf9a) + _0x2c9adf(0x5bd) + _0x2c9adf(0x93f) + _0x2c9adf(0x10a5) + '\x20\x20\x20\x20return' + '\x200;\x0a\x20\x20\x20\x20\x20\x20' + _0x2c9adf(0x5f6))[_0x2c9adf(0xfc8)](_0x4e1cdb, _0x4871d4); window[_0x4e1cdb] = new Function(_0x409d71); }, Scene_Boot[_0x3a6da1(0x49b)][_0x3a6da1(0x29c) + 'suMZ_CoreE' + _0x3a6da1(0xea1) + _0x3a6da1(0x826) + 'rs'] = function () { const _0x274583 = _0x3a6da1, _0x3dbacf = VisuMZ[_0x274583(0xc9f)][_0x274583(0x316)][_0x274583(0xf93) + 'm']; if (!_0x3dbacf) return; for (const _0x2bd237 of _0x3dbacf) { if (!_0x2bd237) continue; VisuMZ[_0x274583(0xc9f)]['createCust' + _0x274583(0x826) + 'r'](_0x2bd237); } }, VisuMZ[_0x3a6da1(0xc9f)]['CustomPara' + _0x3a6da1(0x921)] = {}, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xf93) + 'mIcons'] = {}, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xf93) + _0x3a6da1(0x46f)] = {}, VisuMZ['CoreEngine'][_0x3a6da1(0xf93) + _0x3a6da1(0x3bd)] = {}, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x309) + _0x3a6da1(0x826) + 'r'] = function (_0x2a6b58) { const _0x2ab069 = _0x3a6da1, _0x4113fc = { 'NycOH': function (_0x9c2315, _0x37926b) { return _0x9c2315 === _0x37926b; }, 'tHtDe': _0x2ab069(0x4c7) }, _0x5b558d = _0x2a6b58[_0x2ab069(0x710) + 'on'], _0x425956 = _0x2a6b58[_0x2ab069(0x97b)], _0x2a1390 = _0x2a6b58[_0x2ab069(0x733)], _0x5d3adf = _0x2a6b58[_0x2ab069(0xfac)], _0x43aa96 = new Function(_0x2a6b58[_0x2ab069(0x1036)]); VisuMZ[_0x2ab069(0xc9f)]['CustomPara' + _0x2ab069(0x921)][_0x5b558d[_0x2ab069(0xac2) + 'e']()['trim']()] = _0x425956, VisuMZ[_0x2ab069(0xc9f)][_0x2ab069(0xf93) + _0x2ab069(0xb1a)][_0x5b558d[_0x2ab069(0xac2) + 'e']()[_0x2ab069(0x2d6)]()] = _0x2a1390, VisuMZ[_0x2ab069(0xc9f)][_0x2ab069(0xf93) + 'mType'][_0x5b558d['toUpperCas' + 'e']()['trim']()] = _0x5d3adf, VisuMZ[_0x2ab069(0xc9f)][_0x2ab069(0xf93) + _0x2ab069(0x3bd)][_0x5b558d[_0x2ab069(0xac2) + 'e']()[_0x2ab069(0x2d6)]()] = _0x5b558d, Object[_0x2ab069(0xb5b) + _0x2ab069(0x29e)](Game_BattlerBase[_0x2ab069(0x49b)], _0x5b558d, { 'get'() { const _0x1eb49b = _0x2ab069, _0x12b040 = _0x43aa96[_0x1eb49b(0xedc)](this); return _0x4113fc[_0x1eb49b(0x1f7)](_0x5d3adf, _0x4113fc[_0x1eb49b(0x1065)]) ? Math[_0x1eb49b(0x48a)](_0x12b040) : _0x12b040; } }); }, VisuMZ['CoreEngine'][_0x3a6da1(0xaef) + _0x3a6da1(0xfd7)] = {}, VisuMZ[_0x3a6da1(0xc9f)]['Controller' + _0x3a6da1(0x60b)] = {}, Scene_Boot[_0x3a6da1(0x49b)][_0x3a6da1(0x29c) + _0x3a6da1(0xfa5) + _0x3a6da1(0x9b3) + _0x3a6da1(0x3ae) + _0x3a6da1(0xeb3)] = function () { const _0x4699bf = _0x3a6da1, _0x4fb170 = VisuMZ[_0x4699bf(0xc9f)][_0x4699bf(0x316)][_0x4699bf(0xaef) + _0x4699bf(0xfd7)]; for (const _0x54d724 of _0x4fb170) { const _0x5222a7 = (_0x54d724[_0x4699bf(0x2bf)] || '')[_0x4699bf(0xb6a) + 'e']()[_0x4699bf(0x2d6)](), _0x481c9c = (_0x54d724['Match'] || '')[_0x4699bf(0xb6a) + 'e']()[_0x4699bf(0x2d6)](); VisuMZ[_0x4699bf(0xc9f)]['Controller' + _0x4699bf(0xfd7)][_0x5222a7] = _0x54d724, VisuMZ[_0x4699bf(0xc9f)]['Controller' + _0x4699bf(0x60b)][_0x481c9c] = _0x5222a7; } }, VisuMZ[_0x3a6da1(0x364) + _0x3a6da1(0x234)] = function () { const _0x3a9688 = _0x3a6da1; for (const _0x3c471a of $dataActors) { if (_0x3c471a) VisuMZ['ParseActor' + _0x3a9688(0xbaa)](_0x3c471a); } for (const _0xfdc649 of $dataClasses) { if (_0xfdc649) VisuMZ[_0x3a9688(0x995) + 'Notetags'](_0xfdc649); } for (const _0x11811c of $dataSkills) { if (_0x11811c) VisuMZ[_0x3a9688(0x30e) + _0x3a9688(0xbaa)](_0x11811c); } for (const _0x523c4b of $dataItems) { if (_0x523c4b) VisuMZ[_0x3a9688(0x62c) + _0x3a9688(0x297)](_0x523c4b); } for (const _0xcbb40b of $dataWeapons) { if (_0xcbb40b) VisuMZ[_0x3a9688(0x27b) + _0x3a9688(0x397)](_0xcbb40b); } for (const _0x23f69c of $dataArmors) { if (_0x23f69c) VisuMZ[_0x3a9688(0x699) + 'Notetags'](_0x23f69c); } for (const _0x428947 of $dataEnemies) { if (_0x428947) VisuMZ[_0x3a9688(0x6d4) + _0x3a9688(0xbaa)](_0x428947); } for (const _0x587cea of $dataStates) { if (_0x587cea) VisuMZ[_0x3a9688(0x478) + _0x3a9688(0xbaa)](_0x587cea); } for (const _0x530822 of $dataTilesets) { if (_0x530822) VisuMZ[_0x3a9688(0xb97) + _0x3a9688(0x76c)](_0x530822); } }, VisuMZ['ParseActor' + _0x3a6da1(0xbaa)] = function (_0xdf245b) { }, VisuMZ['ParseClass' + _0x3a6da1(0xbaa)] = function (_0x4dfebe) { }, VisuMZ['ParseSkill' + _0x3a6da1(0xbaa)] = function (_0x1c3cf1) { }, VisuMZ[_0x3a6da1(0x62c) + _0x3a6da1(0x297)] = function (_0x4572e5) { }, VisuMZ[_0x3a6da1(0x27b) + _0x3a6da1(0x397)] = function (_0x1e4273) { }, VisuMZ['ParseArmor' + _0x3a6da1(0xbaa)] = function (_0x229f4d) { }, VisuMZ[_0x3a6da1(0x6d4) + _0x3a6da1(0xbaa)] = function (_0x45792b) { }, VisuMZ['ParseState' + _0x3a6da1(0xbaa)] = function (_0x2859e2) { }, VisuMZ[_0x3a6da1(0xb97) + _0x3a6da1(0x76c)] = function (_0x450c96) { }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x873) + _0x3a6da1(0xbaa)] = VisuMZ['ParseActor' + _0x3a6da1(0xbaa)], VisuMZ[_0x3a6da1(0x873) + _0x3a6da1(0xbaa)] = function (_0x3bb013) { const _0x4ff205 = _0x3a6da1, _0x5d02b2 = { 'xhABB': function (_0x26a84a, _0x30c6ce) { return _0x26a84a(_0x30c6ce); }, 'fItDW': function (_0x4d8375, _0x2c706b) { return _0x4d8375 === _0x2c706b; }, 'oEHpw': function (_0x37616f, _0x2b4041) { return _0x37616f(_0x2b4041); } }; VisuMZ['CoreEngine'][_0x4ff205(0x873) + _0x4ff205(0xbaa)][_0x4ff205(0xedc)](this, _0x3bb013); const _0x1416aa = _0x3bb013[_0x4ff205(0xba6)]; if (_0x1416aa[_0x4ff205(0x7a8)](/<MAX LEVEL:[ ](\d+)>/i)) { _0x3bb013[_0x4ff205(0x1055)] = _0x5d02b2[_0x4ff205(0x86f)](Number, RegExp['$1']); if (_0x5d02b2[_0x4ff205(0x289)](_0x3bb013[_0x4ff205(0x1055)], 0x4e4 * -0x2 + -0x1a13 * -0x1 + -0x104b)) _0x3bb013[_0x4ff205(0x1055)] = Number[_0x4ff205(0xd17) + 'NTEGER']; } _0x1416aa[_0x4ff205(0x7a8)](/<INITIAL LEVEL:[ ](\d+)>/i) && (_0x3bb013[_0x4ff205(0xca3) + 'el'] = Math[_0x4ff205(0xb36)](_0x5d02b2[_0x4ff205(0xc1f)](Number, RegExp['$1']), _0x3bb013[_0x4ff205(0x1055)])); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x995) + 'Notetags'] = VisuMZ['ParseClass' + _0x3a6da1(0xbaa)], VisuMZ['ParseClass' + _0x3a6da1(0xbaa)] = function (_0x4c5474) { const _0x4b559f = _0x3a6da1, _0x56d19a = { 'IRRUx': function (_0x388a17, _0x5e6844) { return _0x388a17(_0x5e6844); } }; VisuMZ[_0x4b559f(0xc9f)][_0x4b559f(0x995) + 'Notetags'][_0x4b559f(0xedc)](this, _0x4c5474); if (_0x4c5474[_0x4b559f(0x4ce)]) for (const _0x5e0b8b of _0x4c5474['learnings']) { _0x5e0b8b[_0x4b559f(0xba6)]['match'](/<LEARN AT LEVEL:[ ](\d+)>/i) && (_0x5e0b8b[_0x4b559f(0x512)] = Math[_0x4b559f(0xeb6)](_0x56d19a[_0x4b559f(0x1f9)](Number, RegExp['$1']), -0xb * 0x101 + 0x1 * 0x19c1 + -0xf * 0xfb)); } }, VisuMZ['CoreEngine']['ParseEnemy' + _0x3a6da1(0xbaa)] = VisuMZ[_0x3a6da1(0x6d4) + 'Notetags'], VisuMZ['ParseEnemy' + _0x3a6da1(0xbaa)] = function (_0x450fd1) { const _0x38ccd6 = _0x3a6da1, _0x4db90c = { 'bAqoE': function (_0x22cbf7, _0x72cdb3) { return _0x22cbf7(_0x72cdb3); }, 'GgEGd': function (_0x33c897, _0x3fc4bd) { return _0x33c897(_0x3fc4bd); }, 'giaWg': function (_0xd4ede8, _0x370298) { return _0xd4ede8(_0x370298); }, 'dNlBn': function (_0x13cd31, _0x2ca537) { return _0x13cd31(_0x2ca537); }, 'okHfp': function (_0x124e8f, _0x3fb9aa) { return _0x124e8f(_0x3fb9aa); } }; VisuMZ[_0x38ccd6(0xc9f)][_0x38ccd6(0x6d4) + _0x38ccd6(0xbaa)][_0x38ccd6(0xedc)](this, _0x450fd1), _0x450fd1[_0x38ccd6(0x512)] = 0x2160 + 0xfb5 * -0x2 + -0x1f5; const _0x3d18d6 = _0x450fd1[_0x38ccd6(0xba6)]; if (_0x3d18d6['match'](/<LEVEL:[ ](\d+)>/i)) _0x450fd1['level'] = _0x4db90c[_0x38ccd6(0x663)](Number, RegExp['$1']); if (_0x3d18d6[_0x38ccd6(0x7a8)](/<MAXHP:[ ](\d+)>/i)) _0x450fd1[_0x38ccd6(0xdd6)][-0x1247 * 0x1 + 0x1 * 0xf11 + -0x6 * -0x89] = _0x4db90c['GgEGd'](Number, RegExp['$1']); if (_0x3d18d6[_0x38ccd6(0x7a8)](/<MAXMP:[ ](\d+)>/i)) _0x450fd1[_0x38ccd6(0xdd6)][-0x17d9 + 0xc41 + 0xb99] = _0x4db90c[_0x38ccd6(0xd39)](Number, RegExp['$1']); if (_0x3d18d6[_0x38ccd6(0x7a8)](/<ATK:[ ](\d+)>/i)) _0x450fd1['params'][-0x2 * -0x9ea + 0x1 * -0x1a56 + 0x684] = _0x4db90c[_0x38ccd6(0x663)](Number, RegExp['$1']); if (_0x3d18d6[_0x38ccd6(0x7a8)](/<DEF:[ ](\d+)>/i)) _0x450fd1[_0x38ccd6(0xdd6)][0x2 * -0xa9b + -0xe11 + 0x234a] = _0x4db90c['dNlBn'](Number, RegExp['$1']); if (_0x3d18d6[_0x38ccd6(0x7a8)](/<MAT:[ ](\d+)>/i)) _0x450fd1['params'][0x3 * 0xb48 + 0x2047 + 0x421b * -0x1] = _0x4db90c['giaWg'](Number, RegExp['$1']); if (_0x3d18d6[_0x38ccd6(0x7a8)](/<MDF:[ ](\d+)>/i)) _0x450fd1['params'][-0x25c6 + 0x1ad7 + -0x57a * -0x2] = _0x4db90c[_0x38ccd6(0x663)](Number, RegExp['$1']); if (_0x3d18d6[_0x38ccd6(0x7a8)](/<AGI:[ ](\d+)>/i)) _0x450fd1[_0x38ccd6(0xdd6)][-0x331 + -0x24d4 + 0x280b] = _0x4db90c[_0x38ccd6(0x3ea)](Number, RegExp['$1']); if (_0x3d18d6[_0x38ccd6(0x7a8)](/<LUK:[ ](\d+)>/i)) _0x450fd1[_0x38ccd6(0xdd6)][0xf * -0x1bd + 0x1511 + 0x509] = _0x4db90c[_0x38ccd6(0x838)](Number, RegExp['$1']); if (_0x3d18d6[_0x38ccd6(0x7a8)](/<EXP:[ ](\d+)>/i)) _0x450fd1[_0x38ccd6(0x58c)] = _0x4db90c[_0x38ccd6(0xc4e)](Number, RegExp['$1']); if (_0x3d18d6[_0x38ccd6(0x7a8)](/<GOLD:[ ](\d+)>/i)) _0x450fd1[_0x38ccd6(0x9a5)] = _0x4db90c[_0x38ccd6(0xd39)](Number, RegExp['$1']); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xa1a) + 'efaultStre' + _0x3a6da1(0x300)] = Graphics['_defaultSt' + _0x3a6da1(0x3a0)], Graphics[_0x3a6da1(0xf1e) + _0x3a6da1(0x3a0)] = function () { const _0xaaf92f = _0x3a6da1, _0x2e84d2 = { 'zojJC': _0xaaf92f(0x85a), 'JLHmi': _0xaaf92f(0x58d) }; switch (VisuMZ['CoreEngine'][_0xaaf92f(0x316)][_0xaaf92f(0xfee)][_0xaaf92f(0xfdf) + 'h']) { case _0x2e84d2[_0xaaf92f(0xc14)]: return !![]; case _0x2e84d2[_0xaaf92f(0xde1)]: return ![]; default: return VisuMZ[_0xaaf92f(0xc9f)][_0xaaf92f(0xa1a) + _0xaaf92f(0x5be) + _0xaaf92f(0x300)][_0xaaf92f(0xedc)](this); } }, VisuMZ['CoreEngine'][_0x3a6da1(0xbfe) + 'rintError'] = Graphics['printError'], Graphics[_0x3a6da1(0x735)] = function (_0x522f70, _0x1dc1b6, _0x2284cb = null) { const _0x285156 = _0x3a6da1; VisuMZ['CoreEngine'][_0x285156(0xbfe) + _0x285156(0xddf)][_0x285156(0xedc)](this, _0x522f70, _0x1dc1b6, _0x2284cb), VisuMZ[_0x285156(0x658) + 'ls'](![]); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x5ef) + 'enterEleme' + 'nt'] = Graphics[_0x3a6da1(0x640) + _0x3a6da1(0x677)], Graphics['_centerEle' + _0x3a6da1(0x677)] = function (_0x2c8803) { const _0x266620 = _0x3a6da1; VisuMZ[_0x266620(0xc9f)]['Graphics_c' + _0x266620(0x92c) + 'nt'][_0x266620(0xedc)](this, _0x2c8803), this[_0x266620(0x640) + _0x266620(0x7dc) + 'gine'](_0x2c8803); }, Graphics[_0x3a6da1(0x640) + _0x3a6da1(0x7dc) + _0x3a6da1(0xd2e)] = function (_0x30f104) { const _0x335dc9 = _0x3a6da1, _0x41ab47 = { 'kkand': 'font-smoot' + 'h', 'ApxiN': _0x335dc9(0x1da), 'AOKSI': _0x335dc9(0x250) + 'ering', 'oiIbX': _0x335dc9(0xdd2), 'EKrdn': function (_0x3d226c, _0x22261f) { return _0x3d226c * _0x22261f; }, 'dKRAb': function (_0xe4bccd, _0x1b14ef) { return _0xe4bccd + _0x1b14ef; }, 'wEqPS': function (_0x2a316d, _0xc81d45) { return _0x2a316d + _0xc81d45; } }; VisuMZ[_0x335dc9(0xc9f)][_0x335dc9(0x316)][_0x335dc9(0xfee)]['FontSmooth' + 'ing'] && (_0x30f104['style'][_0x41ab47['kkand']] = _0x41ab47[_0x335dc9(0xc2b)]); VisuMZ[_0x335dc9(0xc9f)]['Settings'][_0x335dc9(0xfee)][_0x335dc9(0xb9d) + _0x335dc9(0x8f8) + 'ng'] && (_0x30f104[_0x335dc9(0x2b5)][_0x41ab47[_0x335dc9(0x835)]] = _0x41ab47[_0x335dc9(0xffa)]); const _0x15ba57 = Math[_0x335dc9(0xeb6)](-0x1 * 0x89b + -0x1 * -0xd4b + 0x190 * -0x3, Math['floor'](_0x41ab47['EKrdn'](_0x30f104[_0x335dc9(0x4c0)], this[_0x335dc9(0x672)]))), _0x234290 = Math[_0x335dc9(0xeb6)](-0x2072 + 0x59 * 0x53 + 0x397, Math[_0x335dc9(0x719)](_0x41ab47[_0x335dc9(0x3c7)](_0x30f104[_0x335dc9(0x944)], this[_0x335dc9(0x672)]))); _0x30f104[_0x335dc9(0x2b5)]['width'] = _0x41ab47[_0x335dc9(0x530)](_0x15ba57, 'px'), _0x30f104['style']['height'] = _0x41ab47[_0x335dc9(0x6fe)](_0x234290, 'px'); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x6a5) + _0x3a6da1(0xb0e)] = Bitmap[_0x3a6da1(0x49b)][_0x3a6da1(0xa40)], Bitmap['prototype'][_0x3a6da1(0xa40)] = function (_0xda916d, _0xf6af84) { const _0x4ad271 = _0x3a6da1; VisuMZ[_0x4ad271(0xc9f)][_0x4ad271(0x6a5) + 'tialize'][_0x4ad271(0xedc)](this, _0xda916d, _0xf6af84), this['_smooth'] = !(VisuMZ[_0x4ad271(0xc9f)]['Settings'][_0x4ad271(0xfee)][_0x4ad271(0xb9d) + _0x4ad271(0x8f8) + 'ng'] ?? !![]); }, Bitmap[_0x3a6da1(0x49b)][_0x3a6da1(0x7ac) + _0x3a6da1(0x974) + 'ed'] = function () { this['_customMod' + 'ified'] = !![]; }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xc6d) + _0x3a6da1(0xb05)] = Sprite[_0x3a6da1(0x49b)][_0x3a6da1(0xf25)], Sprite[_0x3a6da1(0x49b)][_0x3a6da1(0xf25)] = function () { const _0x1839d1 = _0x3a6da1; if (this[_0x1839d1(0xe75)]) VisuMZ[_0x1839d1(0xc9f)][_0x1839d1(0xc6d) + _0x1839d1(0xb05)][_0x1839d1(0xedc)](this); this[_0x1839d1(0x4f1) + _0x1839d1(0x7e5) + 'kedBitmaps'](); }, Sprite[_0x3a6da1(0x49b)][_0x3a6da1(0x4f1) + 'eEngineMar' + _0x3a6da1(0xe80)] = function () { const _0x58e2f1 = _0x3a6da1; if (!this[_0x58e2f1(0xa7c)]) return; if (!this['bitmap']['_customMod' + _0x58e2f1(0x236)]) return; this['bitmap']['_baseTextu' + 're'] && !this[_0x58e2f1(0xcd9)][_0x58e2f1(0xa7d) + 're'][_0x58e2f1(0xc9e)] && this['bitmap'][_0x58e2f1(0xf25)](); }, VisuMZ[_0x3a6da1(0xc9f)]['Bitmap_res' + 'ize'] = Bitmap['prototype'][_0x3a6da1(0x33c)], Bitmap[_0x3a6da1(0x49b)]['resize'] = function (_0x1898c7, _0x4e65a0) { const _0x3fbb15 = _0x3a6da1; VisuMZ[_0x3fbb15(0xc9f)][_0x3fbb15(0x856) + 'ize'][_0x3fbb15(0xedc)](this, _0x1898c7, _0x4e65a0), this[_0x3fbb15(0x7ac) + _0x3fbb15(0x974) + 'ed'](); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x29d)] = Bitmap[_0x3a6da1(0x49b)]['blt'], Bitmap[_0x3a6da1(0x49b)][_0x3a6da1(0x53b)] = function (_0x40b401, _0x3dbc27, _0x1a58ee, _0x38fae8, _0x5c361f, _0x15f9f1, _0x3277de, _0x2daaa5, _0x3a62bd) { const _0x538d23 = _0x3a6da1, _0x4fedc5 = { 'SdvLu': '0|6|4|2|5|' + _0x538d23(0x3b1) }, _0x23a9ea = _0x4fedc5[_0x538d23(0x819)][_0x538d23(0x80d)]('|'); let _0x427e16 = 0x25d8 + 0x5 * -0x777 + 0x85 * -0x1; while (!![]) { switch (_0x23a9ea[_0x427e16++]) { case '0': _0x3dbc27 = Math[_0x538d23(0x48a)](_0x3dbc27); continue; case '1': _0x3277de = Math[_0x538d23(0x48a)](_0x3277de); continue; case '2': _0x5c361f = Math[_0x538d23(0x48a)](_0x5c361f); continue; case '3': VisuMZ[_0x538d23(0xc9f)]['Bitmap_blt'][_0x538d23(0xedc)](this, _0x40b401, _0x3dbc27, _0x1a58ee, _0x38fae8, _0x5c361f, _0x15f9f1, _0x3277de, _0x2daaa5, _0x3a62bd); continue; case '4': _0x38fae8 = Math[_0x538d23(0x48a)](_0x38fae8); continue; case '5': _0x15f9f1 = Math[_0x538d23(0x48a)](_0x15f9f1); continue; case '6': _0x1a58ee = Math[_0x538d23(0x48a)](_0x1a58ee); continue; case '7': this[_0x538d23(0x7ac) + 'gineModifi' + 'ed'](); continue; }break; } }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x3c1) + _0x3a6da1(0x277)] = Bitmap[_0x3a6da1(0x49b)][_0x3a6da1(0x854)], Bitmap[_0x3a6da1(0x49b)][_0x3a6da1(0x854)] = function (_0x234259, _0x9780c5, _0x2642cd, _0x565c06) { const _0x458db1 = _0x3a6da1; VisuMZ[_0x458db1(0xc9f)][_0x458db1(0x3c1) + _0x458db1(0x277)][_0x458db1(0xedc)](this, _0x234259, _0x9780c5, _0x2642cd, _0x565c06), this[_0x458db1(0x7ac) + _0x458db1(0x974) + 'ed'](); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xbfa) + 'lRect'] = Bitmap[_0x3a6da1(0x49b)][_0x3a6da1(0x9c2)], Bitmap[_0x3a6da1(0x49b)][_0x3a6da1(0x9c2)] = function (_0x2f18e3, _0x2c34eb, _0x5d52e4, _0x3f46d0, _0x104f2a) { const _0x339daa = _0x3a6da1; VisuMZ[_0x339daa(0xc9f)]['Bitmap_fil' + _0x339daa(0xfca)][_0x339daa(0xedc)](this, _0x2f18e3, _0x2c34eb, _0x5d52e4, _0x3f46d0, _0x104f2a), this[_0x339daa(0x7ac) + _0x339daa(0x974) + 'ed'](); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xaeb) + _0x3a6da1(0x63f)] = Bitmap[_0x3a6da1(0x49b)][_0x3a6da1(0x656)], Bitmap[_0x3a6da1(0x49b)][_0x3a6da1(0x656)] = function (_0x1e27c0, _0x4589e7, _0x220831, _0x2dd35e, _0x38d85b) { const _0x2ac365 = _0x3a6da1; VisuMZ[_0x2ac365(0xc9f)][_0x2ac365(0xaeb) + _0x2ac365(0x63f)][_0x2ac365(0xedc)](this, _0x1e27c0, _0x4589e7, _0x220831, _0x2dd35e, _0x38d85b), this[_0x2ac365(0x7ac) + _0x2ac365(0x974) + 'ed'](); }, VisuMZ[_0x3a6da1(0xc9f)]['Bitmap_gra' + _0x3a6da1(0x6d9) + _0x3a6da1(0xd93)] = Bitmap[_0x3a6da1(0x49b)]['gradientFi' + _0x3a6da1(0xe61)], Bitmap[_0x3a6da1(0x49b)][_0x3a6da1(0x7e4) + 'llRect'] = function (_0x361739, _0x16e5ba, _0x46925e, _0x8ca97c, _0x38f3dd, _0x51a162, _0x5f43dd) { const _0x187b06 = _0x3a6da1; VisuMZ[_0x187b06(0xc9f)][_0x187b06(0xb33) + _0x187b06(0x6d9) + _0x187b06(0xd93)]['call'](this, _0x361739, _0x16e5ba, _0x46925e, _0x8ca97c, _0x38f3dd, _0x51a162, _0x5f43dd), this[_0x187b06(0x7ac) + 'gineModifi' + 'ed'](); }, VisuMZ[_0x3a6da1(0xc9f)]['Bitmap_dra' + 'wCircle'] = Bitmap[_0x3a6da1(0x49b)][_0x3a6da1(0xa39)], Bitmap[_0x3a6da1(0x49b)][_0x3a6da1(0xa39)] = function (_0x20f139, _0x5e660d, _0x288b9f, _0x2e78bb) { const _0x166539 = _0x3a6da1, _0x39749c = { 'whvYV': _0x166539(0x5b1) }, _0x387c18 = _0x39749c['whvYV']['split']('|'); let _0x31f4c8 = 0x8c5 + -0x2f * -0x55 + 0x1 * -0x1860; while (!![]) { switch (_0x387c18[_0x31f4c8++]) { case '0': _0x20f139 = Math[_0x166539(0x48a)](_0x20f139); continue; case '1': _0x5e660d = Math[_0x166539(0x48a)](_0x5e660d); continue; case '2': _0x288b9f = Math[_0x166539(0x48a)](_0x288b9f); continue; case '3': this[_0x166539(0x7ac) + _0x166539(0x974) + 'ed'](); continue; case '4': VisuMZ[_0x166539(0xc9f)][_0x166539(0x961) + _0x166539(0xa6d)][_0x166539(0xedc)](this, _0x20f139, _0x5e660d, _0x288b9f, _0x2e78bb); continue; }break; } }, VisuMZ['CoreEngine']['Bitmap_mea' + 'sureTextWi' + 'dth'] = Bitmap[_0x3a6da1(0x49b)]['measureTex' + 'tWidth'], Bitmap[_0x3a6da1(0x49b)]['measureTex' + _0x3a6da1(0xbb6)] = function (_0x5d83ba) { const _0x2346f9 = _0x3a6da1; return Math[_0x2346f9(0xa25)](VisuMZ[_0x2346f9(0xc9f)][_0x2346f9(0xb98) + _0x2346f9(0x744) + 'dth'][_0x2346f9(0xedc)](this, _0x5d83ba)); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x961) + _0x3a6da1(0x475)] = Bitmap[_0x3a6da1(0x49b)]['drawText'], Bitmap[_0x3a6da1(0x49b)][_0x3a6da1(0x46a)] = function (_0x46b472, _0x3df64b, _0x1d03f8, _0x966a35, _0xa00a41, _0x50b121) { const _0x1ee4bc = _0x3a6da1, _0x36a762 = { 'wIZbt': _0x1ee4bc(0x90e) + '4' }, _0x3cd4af = _0x36a762[_0x1ee4bc(0x20c)][_0x1ee4bc(0x80d)]('|'); let _0x592a72 = 0x5 * 0x5d1 + -0x127b + -0xa9a * 0x1; while (!![]) { switch (_0x3cd4af[_0x592a72++]) { case '0': _0x1d03f8 = Math[_0x1ee4bc(0x48a)](_0x1d03f8); continue; case '1': VisuMZ[_0x1ee4bc(0xc9f)][_0x1ee4bc(0x961) + 'wText'][_0x1ee4bc(0xedc)](this, _0x46b472, _0x3df64b, _0x1d03f8, _0x966a35, _0xa00a41, _0x50b121); continue; case '2': _0xa00a41 = Math[_0x1ee4bc(0xa25)](_0xa00a41); continue; case '3': _0x966a35 = Math[_0x1ee4bc(0xa25)](_0x966a35); continue; case '4': this[_0x1ee4bc(0x7ac) + _0x1ee4bc(0x974) + 'ed'](); continue; case '5': _0x3df64b = Math[_0x1ee4bc(0x48a)](_0x3df64b); continue; }break; } }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x961) + _0x3a6da1(0xac9) + 'ne'] = Bitmap[_0x3a6da1(0x49b)][_0x3a6da1(0x3c3) + 'utline'], Bitmap['prototype'][_0x3a6da1(0x3c3) + _0x3a6da1(0x6a3)] = function (_0x59be3c, _0x54164f, _0x25fe89, _0x32aeb3) { const _0xdaefd8 = _0x3a6da1; VisuMZ[_0xdaefd8(0xc9f)]['Settings'][_0xdaefd8(0xfee)]['FontShadow' + 's'] ? this[_0xdaefd8(0x3d4) + 'hadow'](_0x59be3c, _0x54164f, _0x25fe89, _0x32aeb3) : VisuMZ[_0xdaefd8(0xc9f)][_0xdaefd8(0x961) + 'wTextOutli' + 'ne']['call'](this, _0x59be3c, _0x54164f, _0x25fe89, _0x32aeb3); }, Bitmap['prototype'][_0x3a6da1(0x3d4) + _0x3a6da1(0x9df)] = function (_0x47c290, _0x2fec26, _0x5f5845, _0x296768) { const _0x106665 = _0x3a6da1, _0x3de7c0 = { 'JgdqN': function (_0x27dc60, _0x39c0c8) { return _0x27dc60 + _0x39c0c8; } }, _0x1f55e4 = this['context']; _0x1f55e4[_0x106665(0x954)] = this['outlineCol' + 'or'], _0x1f55e4[_0x106665(0x7a1)](_0x47c290, _0x3de7c0[_0x106665(0x858)](_0x2fec26, 0x83 * -0x17 + -0x7e + 0xc45), _0x3de7c0[_0x106665(0x858)](_0x5f5845, 0xa0a + -0x21ff + -0x7fd * -0x3), _0x296768); }, VisuMZ['CoreEngine'][_0x3a6da1(0x762) + 'r'] = Input[_0x3a6da1(0x7ee)], Input[_0x3a6da1(0x7ee)] = function () { const _0x240ffd = _0x3a6da1; VisuMZ['CoreEngine'][_0x240ffd(0x762) + 'r']['call'](this), this[_0x240ffd(0xb39) + 'ng'] = undefined, this[_0x240ffd(0x78a) + 'ialKeyCode'] = undefined, this[_0x240ffd(0xd1d) + 'it'] = Input[_0x240ffd(0x7be) + _0x240ffd(0x9f1)]; }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x704) + 'te'] = Input[_0x3a6da1(0xc16)], Input[_0x3a6da1(0xc16)] = function () { const _0x389e9d = _0x3a6da1; VisuMZ[_0x389e9d(0xc9f)][_0x389e9d(0x704) + 'te'][_0x389e9d(0xedc)](this); if (this[_0x389e9d(0xd1d) + 'it']) this[_0x389e9d(0xd1d) + 'it']--; }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x6ff) + 'Gamepads'] = Input['_pollGamep' + 'ads'], Input[_0x3a6da1(0x637) + _0x3a6da1(0xf43)] = function () { const _0x48dba6 = _0x3a6da1; if (this['_gamepadWa' + 'it']) return; VisuMZ[_0x48dba6(0xc9f)][_0x48dba6(0x6ff) + _0x48dba6(0x458)][_0x48dba6(0xedc)](this); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x2c7) + _0x3a6da1(0xddc) + 'lers'] = Input[_0x3a6da1(0x108f) + _0x3a6da1(0x6b8)], Input[_0x3a6da1(0x108f) + _0x3a6da1(0x6b8)] = function () { const _0x13b606 = _0x3a6da1, _0x2f0183 = { 'SHTJx': _0x13b606(0x88b) }; VisuMZ[_0x13b606(0xc9f)][_0x13b606(0x2c7) + 'pEventHand' + _0x13b606(0x643)]['call'](this), document[_0x13b606(0x8d4) + _0x13b606(0x924)](_0x2f0183[_0x13b606(0xf60)], this[_0x13b606(0xa81) + 's'][_0x13b606(0xdeb)](this)); }, VisuMZ['CoreEngine']['Input_onKe' + _0x3a6da1(0xf4a)] = Input[_0x3a6da1(0x8f5)], Input['_onKeyDown'] = function (_0x134341) { const _0x5d1580 = _0x3a6da1; this['_inputSpec' + 'ialKeyCode'] = _0x134341[_0x5d1580(0xf50)], VisuMZ[_0x5d1580(0xc9f)]['Input_onKe' + _0x5d1580(0xf4a)][_0x5d1580(0xedc)](this, _0x134341), this['setLastGam' + _0x5d1580(0xe56)](null); }, Input[_0x3a6da1(0xa81) + 's'] = function (_0x5d4cc4) { const _0x501b97 = _0x3a6da1; this['_registerK' + _0x501b97(0x21d)](_0x5d4cc4); }, Input[_0x3a6da1(0x910) + _0x3a6da1(0x21d)] = function (_0x2cfb78) { const _0x5df0f6 = _0x3a6da1, _0x1e6c44 = { 'BzrXj': function (_0x2f90a9, _0xe9085c) { return _0x2f90a9 === _0xe9085c; } }; this[_0x5df0f6(0x78a) + _0x5df0f6(0xaea)] = _0x2cfb78[_0x5df0f6(0xf50)]; let _0x18abbf = String[_0x5df0f6(0x545) + 'de'](_0x2cfb78[_0x5df0f6(0x59c)]); _0x1e6c44[_0x5df0f6(0xe71)](this[_0x5df0f6(0xb39) + 'ng'], undefined) ? this[_0x5df0f6(0xb39) + 'ng'] = _0x18abbf : this['_inputStri' + 'ng'] += _0x18abbf; }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xb24) + _0x3a6da1(0xbf9) + _0x3a6da1(0xd11)] = Input[_0x3a6da1(0x9d3) + 'ventDefaul' + 't'], Input[_0x3a6da1(0x9d3) + 'ventDefaul' + 't'] = function (_0xc753ba) { const _0xc275fb = _0x3a6da1, _0x15b4dd = { 'CZNtA': function (_0x5a8657, _0x11b421) { return _0x5a8657 === _0x11b421; } }; if (_0x15b4dd[_0xc275fb(0xc60)](_0xc753ba, -0xa73 + 0x1bb * 0x7 + -0x1a2 * 0x1)) return ![]; return VisuMZ[_0xc275fb(0xc9f)][_0xc275fb(0xb24) + _0xc275fb(0xbf9) + _0xc275fb(0xd11)]['call'](this, _0xc753ba); }, Input[_0x3a6da1(0xc44) + _0x3a6da1(0xe37)] = function (_0x2db4ab) { const _0x717f51 = _0x3a6da1, _0x374b9b = { 'xHbgT': function (_0x113693, _0x5aacee) { return _0x113693 === _0x5aacee; }, 'rkWkc': function (_0x5c4925, _0x433432) { return _0x5c4925 === _0x433432; }, 'fTyKX': function (_0xc66ebe, _0x102ad3) { return _0xc66ebe === _0x102ad3; } }; if (_0x2db4ab[_0x717f51(0x7a8)](/backspace/i)) return _0x374b9b[_0x717f51(0xe6a)](this[_0x717f51(0x78a) + 'ialKeyCode'], 0x3 * -0x86b + -0x1 * -0x5f2 + 0x1357); if (_0x2db4ab[_0x717f51(0x7a8)](/enter/i)) return _0x374b9b['rkWkc'](this[_0x717f51(0x78a) + _0x717f51(0xaea)], 0x113d + -0x1fad * 0x1 + -0x1 * -0xe7d); if (_0x2db4ab[_0x717f51(0x7a8)](/escape/i)) return _0x374b9b[_0x717f51(0xe9f)](this['_inputSpec' + _0x717f51(0xaea)], -0x3 * -0x41b + -0x9ad + -0x289); }, Input['isNumpadPr' + _0x3a6da1(0xb44)] = function () { const _0x220948 = _0x3a6da1; return [0x15fa * -0x1 + -0x41 * -0x47 + 0x423, -0x1a3a + 0x1 * 0x1fe3 + 0x14 * -0x46, 0x309 + 0x265 * 0xb + -0x1d2e, -0x1 * 0x39b + -0x1f2d + 0x3e3 * 0x9, 0x17f * -0x6 + -0x3d7 + 0xd05, -0x14e + -0x9d * -0x5 + 0xc7 * -0x2, -0xddb + -0x1de * -0x9 + 0x2bd * -0x1, 0xb1d + -0x1026 + 0x540, 0x1 * 0x269b + 0x3 * -0x33c + -0x1caf, -0x1283 + -0x2 * 0xd11 + 0x1 * 0x2cde][_0x220948(0xd59)](this[_0x220948(0x78a) + _0x220948(0xaea)]); }, Input[_0x3a6da1(0xd77) + 'ssed'] = function () { const _0x463a9a = _0x3a6da1; return [0x5e * -0x4d + 0xb * 0x259 + 0x298, 0x1a15 + 0x3 * 0x67b + -0x4 * 0xb58, -0xbc * -0x9 + -0x1 * -0xa29 + 0x3 * -0x58a, -0xf89 + 0x102e + -0x7d][_0x463a9a(0xd59)](this[_0x463a9a(0x78a) + _0x463a9a(0xaea)]); }, Input['isGamepadC' + _0x3a6da1(0xd52)] = function () { const _0xa9a42e = _0x3a6da1; if (navigator[_0xa9a42e(0x3f3) + 's']) { const _0x42527e = navigator[_0xa9a42e(0x3f3) + 's'](); if (_0x42527e) for (const _0x26c127 of _0x42527e) { if (_0x26c127 && _0x26c127[_0xa9a42e(0x912)]) return !![]; } } return ![]; }, Input['isGamepadT' + 'riggered'] = function () { const _0x5beb43 = _0x3a6da1; if (navigator['getGamepad' + 's']) { const _0x333be6 = navigator['getGamepad' + 's'](); if (_0x333be6) for (const _0x3061dd of _0x333be6) { if (_0x3061dd && _0x3061dd[_0x5beb43(0x912)]) { if (this['isGamepadB' + _0x5beb43(0x94f) + 'ed'](_0x3061dd)) return !![]; if (this['isGamepadA' + 'xisMoved'](_0x3061dd)) return !![]; } } } return ![]; }, Input[_0x3a6da1(0x9fa) + _0x3a6da1(0x94f) + 'ed'] = function (_0x4eb395) { const _0x2a7111 = _0x3a6da1, _0x321db = { 'itfdV': function (_0x4c2a77, _0x53b8b8) { return _0x4c2a77 < _0x53b8b8; } }, _0x57983c = _0x4eb395[_0x2a7111(0x952)]; for (let _0x3b2757 = 0x2277 + -0x2b * -0xa3 + -0x3dd8; _0x321db['itfdV'](_0x3b2757, _0x57983c['length']); _0x3b2757++) { if (_0x57983c[_0x3b2757][_0x2a7111(0x65a)]) return !![]; } return ![]; }, Input[_0x3a6da1(0x488) + _0x3a6da1(0xa52)] = function (_0x38723a) { const _0x3ce263 = _0x3a6da1, _0x2027f0 = { 'nJdbd': function (_0x585d14, _0x229b6a) { return _0x585d14 < _0x229b6a; }, 'DLpwv': function (_0x48b790, _0x4c2b95) { return _0x48b790 > _0x4c2b95; }, 'GbKmP': function (_0x4f6262, _0x120252) { return _0x4f6262 < _0x120252; } }, _0x1c5d8a = _0x38723a[_0x3ce263(0x235)], _0x24ec0f = 0x18e6 + 0x1b94 + -0x347a + 0.5; if (_0x2027f0[_0x3ce263(0x68d)](_0x1c5d8a[0x13bf * 0x1 + -0x26e7 * 0x1 + 0x4ca * 0x4], -_0x24ec0f)) return !![]; if (_0x2027f0[_0x3ce263(0xe60)](_0x1c5d8a[-0xb10 + 0x4a6 * 0x8 + -0x2 * 0xd10], _0x24ec0f)) return !![]; if (_0x2027f0[_0x3ce263(0x34a)](_0x1c5d8a[-0x9 * -0xf1 + 0x1 * 0x1aed + -0x2365], -_0x24ec0f)) return !![]; if (_0x2027f0[_0x3ce263(0xe60)](_0x1c5d8a[0x3 * 0x531 + 0xf5e + -0x48 * 0x6e], _0x24ec0f)) return !![]; return ![]; }, Input[_0x3a6da1(0x89e) + _0x3a6da1(0xe56)] = function () { return this['_lastGamep' + 'ad'] || null; }, Input['setLastGam' + _0x3a6da1(0xe56)] = function (_0x174504) { const _0x19aee0 = _0x3a6da1; this[_0x19aee0(0xbd2) + 'ad'] = _0x174504; }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x704) + _0x3a6da1(0xc5b) + 'tate'] = Input[_0x3a6da1(0x7c8) + _0x3a6da1(0x1dc)], Input[_0x3a6da1(0x7c8) + _0x3a6da1(0x1dc)] = function (_0x44fac2) { const _0x15c587 = _0x3a6da1; VisuMZ['CoreEngine'][_0x15c587(0x704) + _0x15c587(0xc5b) + _0x15c587(0x56b)][_0x15c587(0xedc)](this, _0x44fac2), (this[_0x15c587(0x9fa) + _0x15c587(0x94f) + 'ed'](_0x44fac2) || this[_0x15c587(0x488) + _0x15c587(0xa52)](_0x44fac2)) && this[_0x15c587(0x6c4) + _0x15c587(0xe56)](_0x44fac2); }, Input[_0x3a6da1(0xc2a) + _0x3a6da1(0xc79) + 'pe'] = function () { const _0x51d9d8 = _0x3a6da1, _0x2c7d26 = { 'TlLut': 'Keyboard' }; return this[_0x51d9d8(0xbd2) + 'ad'] ? this[_0x51d9d8(0xbd2) + 'ad']['id'] : _0x2c7d26[_0x51d9d8(0x5fe)]; }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x272) + _0x3a6da1(0xaed)] = Tilemap[_0x3a6da1(0x49b)][_0x3a6da1(0xdfa)], Tilemap[_0x3a6da1(0x49b)]['_addShadow'] = function (_0x527dc7, _0x185257, _0x29556f, _0x103169) { const _0x170a6c = _0x3a6da1; if ($gameMap && $gameMap[_0x170a6c(0xced) + 'dowsHidden']()) return; VisuMZ['CoreEngine']['Tilemap_ad' + 'dShadow'][_0x170a6c(0xedc)](this, _0x527dc7, _0x185257, _0x29556f, _0x103169); }, Tilemap['Renderer'][_0x3a6da1(0x49b)][_0x3a6da1(0xfba) + _0x3a6da1(0x252) + _0x3a6da1(0xd5a)] = function () { const _0x25264f = _0x3a6da1, _0x5aed07 = { 'jNDKI': function (_0x38913e, _0x56c392) { return _0x38913e < _0x56c392; } }; this['_destroyIn' + _0x25264f(0x4b2) + 'ures'](); for (let _0xb8947e = 0x1 * 0xd36 + 0x1c82 + -0x29b8; _0x5aed07[_0x25264f(0x48e)](_0xb8947e, Tilemap[_0x25264f(0xe3a)][_0x25264f(0x1021) + 'TURES']); _0xb8947e++) { const _0x266834 = new PIXI[(_0x25264f(0x840)) + 'e'](); _0x266834[_0x25264f(0x2f4)](0xe74 + -0x1c9c + 0x58a * 0x4, 0xe6d + -0xecd + 0x860), VisuMZ[_0x25264f(0xc9f)][_0x25264f(0x316)]['QoL'][_0x25264f(0xb9d) + _0x25264f(0x8f8) + 'ng'] && (_0x266834[_0x25264f(0xf83)] = PIXI[_0x25264f(0x84f) + 'S'][_0x25264f(0x46b)]), this['_internalT' + 'extures'][_0x25264f(0x92f)](_0x266834); } }, WindowLayer[_0x3a6da1(0x49b)][_0x3a6da1(0x40e) + 'nabled'] = function () { const _0x156598 = _0x3a6da1; return SceneManager && SceneManager[_0x156598(0xda5)] ? SceneManager[_0x156598(0xda5)][_0x156598(0xcb6) + _0x156598(0x2c9) + 'ed']() : !![]; }, VisuMZ[_0x3a6da1(0xc9f)]['WindowLaye' + _0x3a6da1(0x3f1)] = WindowLayer[_0x3a6da1(0x49b)][_0x3a6da1(0xc3a)], WindowLayer[_0x3a6da1(0x49b)][_0x3a6da1(0xc3a)] = function render(_0x4efad9) { const _0x478a8a = _0x3a6da1; this[_0x478a8a(0x40e) + _0x478a8a(0xa83)]() ? VisuMZ[_0x478a8a(0xc9f)][_0x478a8a(0xf77) + 'r_render'][_0x478a8a(0xedc)](this, _0x4efad9) : this[_0x478a8a(0xc06) + 'sk'](_0x4efad9); }, WindowLayer[_0x3a6da1(0x49b)][_0x3a6da1(0xc06) + 'sk'] = function render(_0x1fe9d1) { const _0x281552 = _0x3a6da1, _0x12ced3 = { 'MSMMB': function (_0x25d8dd, _0x3cc7cf) { return _0x25d8dd > _0x3cc7cf; }, 'PRQEI': function (_0x46669f, _0x258d1a) { return _0x46669f > _0x258d1a; }, 'odJJh': _0x281552(0xb2a) + '0|8|10|4|6' + '|2' }; if (!this['visible']) return; const _0x558469 = new PIXI['Graphics'](), _0x3a78cd = _0x1fe9d1['gl'], _0x57570f = this[_0x281552(0xdb9)][_0x281552(0xa71)](); _0x1fe9d1[_0x281552(0x8a9) + 'r']['forceStenc' + 'il'](), _0x558469[_0x281552(0x52a)] = this[_0x281552(0x52a)], _0x1fe9d1['batch'][_0x281552(0x2fe)](), _0x3a78cd[_0x281552(0x7f5)](_0x3a78cd[_0x281552(0x78d) + 'ST']); while (_0x12ced3[_0x281552(0x5bf)](_0x57570f['length'], -0xfbc * 0x2 + 0x1862 + 0x716)) { const _0xfb95ff = _0x57570f[_0x281552(0xdab)](); if (_0xfb95ff['_isWindow'] && _0xfb95ff[_0x281552(0xe15)] && _0x12ced3[_0x281552(0x4f0)](_0xfb95ff[_0x281552(0x103f)], -0x175e + 0x1204 * -0x1 + 0x2962)) { const _0x14afa8 = _0x12ced3[_0x281552(0x824)][_0x281552(0x80d)]('|'); let _0x391374 = -0x1c * -0x6f + -0x17 * -0x9b + 0x1a11 * -0x1; while (!![]) { switch (_0x14afa8[_0x391374++]) { case '0': _0x3a78cd[_0x281552(0xce6) + 'c'](_0x3a78cd['ALWAYS'], -0x1 * 0x1d5d + -0x5e * 0x2f + 0x175 * 0x20, ~(0x1b52 * 0x1 + 0x8a5 * 0x1 + -0x23f7)); continue; case '1': _0x558469[_0x281552(0x7ee)](); continue; case '2': _0x3a78cd['blendFunc'](_0x3a78cd[_0x281552(0x67e)], _0x3a78cd[_0x281552(0x833) + _0x281552(0x3d1)]); continue; case '3': _0x3a78cd['stencilOp'](_0x3a78cd[_0x281552(0x75e)], _0x3a78cd[_0x281552(0x75e)], _0x3a78cd[_0x281552(0x75e)]); continue; case '4': _0x558469[_0x281552(0xc3a)](_0x1fe9d1); continue; case '5': _0xfb95ff['render'](_0x1fe9d1); continue; case '6': _0x1fe9d1[_0x281552(0xada)]['flush'](); continue; case '7': _0x1fe9d1[_0x281552(0xada)][_0x281552(0x2fe)](); continue; case '8': _0x3a78cd['stencilOp'](_0x3a78cd['REPLACE'], _0x3a78cd['REPLACE'], _0x3a78cd[_0x281552(0x8b1)]); continue; case '9': _0x3a78cd[_0x281552(0xce6) + 'c'](_0x3a78cd[_0x281552(0xbdf)], 0x19b9 + -0xb5e + 0xaf * -0x15, ~(-0x2b6 + 0x1ed3 + -0x3 * 0x95f)); continue; case '10': _0x3a78cd['blendFunc'](_0x3a78cd['ZERO'], _0x3a78cd[_0x281552(0x67e)]); continue; }break; } } } _0x3a78cd[_0x281552(0x588)](_0x3a78cd[_0x281552(0x78d) + 'ST']), _0x3a78cd[_0x281552(0x7ee)](_0x3a78cd[_0x281552(0x2af) + _0x281552(0x531)]), _0x3a78cd[_0x281552(0xb77) + 'il'](-0xdb8 + -0x16b2 + 0x246a), _0x1fe9d1[_0x281552(0xada)][_0x281552(0x2fe)](); for (const _0x45f306 of this[_0x281552(0xdb9)]) { !_0x45f306[_0x281552(0xe95)] && _0x45f306[_0x281552(0xe15)] && _0x45f306[_0x281552(0xc3a)](_0x1fe9d1); } _0x1fe9d1[_0x281552(0xada)]['flush'](); }, DataManager['isKeyItem'] = function (_0x3d15da) { const _0x4c48ec = _0x3a6da1, _0x2097db = { 'mNzsa': function (_0x58835d, _0x3754f2) { return _0x58835d === _0x3754f2; } }; return this['isItem'](_0x3d15da) && _0x2097db[_0x4c48ec(0x77f)](_0x3d15da[_0x4c48ec(0x4bc)], -0x83 * -0x1d + 0xc9b * 0x3 + 0x1 * -0x34a6); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x56d) + _0x3a6da1(0xea2) + _0x3a6da1(0xf7c)] = DataManager[_0x3a6da1(0x9f3) + 'me'], DataManager[_0x3a6da1(0x9f3) + 'me'] = function () { const _0x393407 = _0x3a6da1; VisuMZ[_0x393407(0xc9f)]['DataManage' + _0x393407(0xea2) + _0x393407(0xf7c)][_0x393407(0xedc)](this), this[_0x393407(0x439) + 'yTestNewGa' + _0x393407(0xc40) + _0x393407(0xc8f)](), this['reserveNew' + _0x393407(0xec8) + _0x393407(0x8c5)](); }, DataManager[_0x3a6da1(0x439) + _0x3a6da1(0x420) + _0x3a6da1(0xc40) + 'ent'] = function () { const _0x1ee847 = _0x3a6da1, _0x3284e9 = { 'SUush': function (_0x240a43, _0x5aebd0) { return _0x240a43 > _0x5aebd0; } }; if ($gameTemp[_0x1ee847(0x386)]()) { const _0x138a10 = VisuMZ[_0x1ee847(0xc9f)][_0x1ee847(0x316)]['QoL'][_0x1ee847(0x4d8) + _0x1ee847(0xf67)]; if (_0x3284e9[_0x1ee847(0xc65)](_0x138a10, 0x41f + -0x966 + -0x7 * -0xc1)) $gameTemp[_0x1ee847(0x4dd) + _0x1ee847(0xf67)](_0x138a10); } }, DataManager[_0x3a6da1(0x213) + _0x3a6da1(0xec8) + 'Event'] = function () { const _0x44bac1 = _0x3a6da1, _0x118d6b = { 'GCKHG': function (_0x32a071, _0x9e5d85) { return _0x32a071 > _0x9e5d85; } }, _0x5e3cd3 = VisuMZ['CoreEngine'][_0x44bac1(0x316)][_0x44bac1(0xfee)]['NewGameCom' + _0x44bac1(0xa17) + 'l'] || 0x26e2 + -0x1fb * -0x5 + 0x1 * -0x30c9; if (_0x118d6b['GCKHG'](_0x5e3cd3, 0x2e * 0x3d + -0x5e + -0x3 * 0x388)) $gameTemp[_0x44bac1(0x4dd) + 'monEvent'](_0x5e3cd3); }, DataManager[_0x3a6da1(0x6ae) + _0x3a6da1(0xba7)] = function (_0x1deee9) { const _0x2400e9 = _0x3a6da1, _0x209788 = $dataTroops[_0x1deee9]; if (!_0x209788) return ''; let _0x13a4bf = ''; _0x13a4bf += _0x209788[_0x2400e9(0x796)]; for (const _0x1b057a of _0x209788[_0x2400e9(0x417)]) { for (const _0x3ed0e8 of _0x1b057a['list']) { [0x32f * -0x5 + 0x172 + 0x29 * 0x5d, -0x5fd * 0x3 + 0x193d * -0x1 + 0xb33 * 0x4][_0x2400e9(0xa43)](_0x3ed0e8['code']) && (_0x13a4bf += '\x0a', _0x13a4bf += _0x3ed0e8['parameters'][-0xa52 + 0xa * -0x12e + -0x161e * -0x1]); } } return _0x13a4bf; }; (VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x316)][_0x3a6da1(0xfee)]['ShortcutSc' + _0x3a6da1(0xc53)] ?? !![]) && ($scene = null, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x6ea) + _0x3a6da1(0xc52)] = Scene_Base[_0x3a6da1(0x49b)][_0x3a6da1(0xc26)], Scene_Base['prototype']['create'] = function () { const _0x208ebc = _0x3a6da1; VisuMZ[_0x208ebc(0xc9f)]['Scene_Base' + _0x208ebc(0xc52)]['call'](this), $scene = this; }, $spriteset = null, VisuMZ['CoreEngine'][_0x3a6da1(0x1d9) + 'createSpri' + _0x3a6da1(0xe45)] = Scene_Map['prototype'][_0x3a6da1(0xdd0) + 'teset'], Scene_Map[_0x3a6da1(0x49b)][_0x3a6da1(0xdd0) + _0x3a6da1(0xe45)] = function () { const _0xf668fb = _0x3a6da1; VisuMZ[_0xf668fb(0xc9f)][_0xf668fb(0x1d9) + _0xf668fb(0xdd0) + _0xf668fb(0xe45)]['call'](this), $spriteset = this[_0xf668fb(0xcaf)]; }, VisuMZ[_0x3a6da1(0xc9f)]['Scene_Batt' + _0x3a6da1(0xadc) + 'priteset'] = Scene_Battle[_0x3a6da1(0x49b)][_0x3a6da1(0xdd0) + _0x3a6da1(0xe45)], Scene_Battle['prototype']['createSpri' + 'teset'] = function () { const _0x17c4c6 = _0x3a6da1; VisuMZ[_0x17c4c6(0xc9f)][_0x17c4c6(0x6cd) + _0x17c4c6(0xadc) + _0x17c4c6(0x240)][_0x17c4c6(0xedc)](this), $spriteset = this[_0x17c4c6(0xcaf)]; }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x6ea) + '_terminate'] = Scene_Base['prototype'][_0x3a6da1(0x266)], Scene_Base[_0x3a6da1(0x49b)][_0x3a6da1(0x266)] = function () { const _0x15266a = _0x3a6da1, _0x3a82a1 = { 'dUDMq': '0|3|1|2|4' }, _0x3fed46 = _0x3a82a1[_0x15266a(0xde4)][_0x15266a(0x80d)]('|'); let _0x401de3 = 0x1419 + 0x7 * 0x4c1 + 0xf4 * -0x38; while (!![]) { switch (_0x3fed46[_0x401de3++]) { case '0': VisuMZ['CoreEngine']['Scene_Base' + _0x15266a(0x22e)][_0x15266a(0xedc)](this); continue; case '1': $subject = null; continue; case '2': $targets = null; continue; case '3': $spriteset = null; continue; case '4': $target = null; continue; }break; } }, $subject = null, $targets = null, $target = null, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x8b8) + _0x3a6da1(0xe86)] = BattleManager[_0x3a6da1(0xc16)], BattleManager[_0x3a6da1(0xc16)] = function (_0x342547) { const _0x4ff65b = _0x3a6da1; VisuMZ['CoreEngine']['BattleMana' + _0x4ff65b(0xe86)][_0x4ff65b(0xedc)](this, _0x342547), $subject = this[_0x4ff65b(0x7ed)], $targets = this[_0x4ff65b(0xb3d)], $target = this[_0x4ff65b(0xbf7)] || this[_0x4ff65b(0xb3d)][-0x2283 + 0x1d99 * -0x1 + 0x1 * 0x401c]; }, $event = null, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x257) + _0x3a6da1(0xd84)] = Game_Event[_0x3a6da1(0x49b)]['start'], Game_Event['prototype']['start'] = function () { const _0xf76803 = _0x3a6da1; VisuMZ[_0xf76803(0xc9f)]['Game_Event' + _0xf76803(0xd84)][_0xf76803(0xedc)](this), $event = this; }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x1d9) + 'update'] = Scene_Map[_0x3a6da1(0x49b)][_0x3a6da1(0xc16)], Scene_Map['prototype'][_0x3a6da1(0xc16)] = function () { const _0x596e97 = _0x3a6da1; VisuMZ[_0x596e97(0xc9f)][_0x596e97(0x1d9) + _0x596e97(0xc16)][_0x596e97(0xedc)](this), $gameMap[_0x596e97(0xd15) + 'entEvent'](); }, Game_Map[_0x3a6da1(0x49b)][_0x3a6da1(0xd15) + _0x3a6da1(0xf04)] = function () { const _0x948bef = _0x3a6da1, _0x136900 = { 'DjvlI': function (_0x2a310e, _0x4c4c0e) { return _0x2a310e !== _0x4c4c0e; } }; !this['isEventRun' + _0x948bef(0xbaf)]() && _0x136900[_0x948bef(0xfe2)]($event, null) && ($event = null); }, $commonEvent = function (_0x5bd149) { const _0x3be33b = _0x3a6da1; if ($gameTemp) $gameTemp[_0x3be33b(0x4dd) + 'monEvent'](_0x5bd149); }, $onceParallel = function (_0x2548e1, _0x8c38d3) { const _0x799391 = _0x3a6da1, _0x1673e6 = { 'eofzk': function (_0x4602ca, _0x457028) { return _0x4602ca(_0x457028); }, 'JJVKV': 'Once\x20Paral' + 'lel\x20for\x20Ba' + 'ttle\x20requi' + 'res\x20VisuMZ' + '_1_BattleC' + _0x799391(0x712), 'XbErz': function (_0x294673, _0x4fc8e8) { return _0x294673(_0x4fc8e8); }, 'Crerw': _0x799391(0x8eb) + '\x20cannot\x20ut' + _0x799391(0x102c) + _0x799391(0xe9d) + 'l!' }; if (SceneManager['isSceneMap']()) $scene[_0x799391(0xa68) + _0x799391(0x3af) + 'rpreter'](_0x2548e1, _0x8c38d3); else { if (SceneManager[_0x799391(0xf95) + _0x799391(0x633)]()) { if (Imported['VisuMZ_1_B' + 'attleCore']) $scene[_0x799391(0xa68) + _0x799391(0x3af) + _0x799391(0xd1c)](_0x2548e1); else $gameTemp && $gameTemp[_0x799391(0x386)]() && _0x1673e6[_0x799391(0x1058)](alert, _0x1673e6[_0x799391(0xf1a)]); } else $gameTemp && $gameTemp[_0x799391(0x386)]() && _0x1673e6[_0x799391(0x101d)](alert, _0x1673e6[_0x799391(0xfcf)]); } });; StorageManager[_0x3a6da1(0xa0c)] = function (_0x32f3ff) { const _0x449468 = _0x3a6da1, _0x586550 = { 'nFwdr': _0x449468(0xa7e), 'hgJdl': function (_0x4c7a2d, _0x597f91) { return _0x4c7a2d >= _0x597f91; }, 'RyzJQ': function (_0x6f9c11, _0x258cb0) { return _0x6f9c11(_0x258cb0); }, 'eRYHe': function (_0x9c5e6d, _0x22e256) { return _0x9c5e6d(_0x22e256); } }; return new Promise((_0x3069ec, _0xd6e178) => { const _0x874122 = _0x449468; try { const _0x4d5d98 = pako[_0x874122(0xa9c)](_0x32f3ff, { 'to': _0x586550[_0x874122(0x9e6)], 'level': 0x1 }); if (_0x586550[_0x874122(0x24e)](_0x4d5d98[_0x874122(0x786)], -0xb457 + -0x1 * -0xbd1a + -0x1 * -0xba8d)) { } _0x586550[_0x874122(0x80e)](_0x3069ec, _0x4d5d98); } catch (_0x133931) { _0x586550[_0x874122(0x9de)](_0xd6e178, _0x133931); } }); }, TextManager[_0x3a6da1(0x901) + 'ap'] = ['', '', '', 'CANCEL', '', '', _0x3a6da1(0x6d6), '', _0x3a6da1(0xa46), 'TAB', '', '', _0x3a6da1(0x39a), _0x3a6da1(0x800), _0x3a6da1(0xf45) + _0x3a6da1(0x2d8), '', _0x3a6da1(0xcfb), _0x3a6da1(0x76e), _0x3a6da1(0x798), 'PAUSE', _0x3a6da1(0x82e), 'KANA', 'EISU', _0x3a6da1(0x773), _0x3a6da1(0x4ab), _0x3a6da1(0x8a5), '', _0x3a6da1(0x947), _0x3a6da1(0xe35), _0x3a6da1(0xbb9), _0x3a6da1(0xde5), _0x3a6da1(0x1062), _0x3a6da1(0xce0), 'PGUP', 'PGDN', 'END', _0x3a6da1(0xcaa), _0x3a6da1(0xd4a), 'UP', _0x3a6da1(0xa87), _0x3a6da1(0x5d2), _0x3a6da1(0x225), _0x3a6da1(0x7c2), 'EXECUTE', _0x3a6da1(0x3c6) + 'N', _0x3a6da1(0xa1f), _0x3a6da1(0xb22), '', '0', '1', '2', '3', '4', '5', '6', '7', '8', '9', 'COLON', 'SEMICOLON', _0x3a6da1(0x778), _0x3a6da1(0xb1b), _0x3a6da1(0xfc0) + 'AN', _0x3a6da1(0xc37) + _0x3a6da1(0x76b), 'AT', 'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z', _0x3a6da1(0x9ae), '', _0x3a6da1(0xfaf) + 'NU', '', _0x3a6da1(0x568), _0x3a6da1(0xe9e), _0x3a6da1(0xf26), _0x3a6da1(0x5cf), _0x3a6da1(0xb9c), _0x3a6da1(0xc7f), _0x3a6da1(0xa5c), _0x3a6da1(0x4b7), 'NUMPAD7', _0x3a6da1(0x101c), 'NUMPAD9', _0x3a6da1(0x4f9), _0x3a6da1(0x67d), _0x3a6da1(0xd23), _0x3a6da1(0x95f), 'DECIMAL', _0x3a6da1(0xe51), 'F1', 'F2', 'F3', 'F4', 'F5', 'F6', 'F7', 'F8', 'F9', _0x3a6da1(0x898), 'F11', _0x3a6da1(0xc74), _0x3a6da1(0x224), _0x3a6da1(0xd8c), 'F15', _0x3a6da1(0xb4a), _0x3a6da1(0xf97), _0x3a6da1(0x57c), _0x3a6da1(0xc23), _0x3a6da1(0xacf), _0x3a6da1(0xc04), _0x3a6da1(0xefa), _0x3a6da1(0x87f), _0x3a6da1(0xe58), '', '', '', '', '', '', '', '', _0x3a6da1(0xd83), _0x3a6da1(0xcdc) + 'K', _0x3a6da1(0xa67) + '_JISHO', _0x3a6da1(0xa67) + _0x3a6da1(0xf82), _0x3a6da1(0xa67) + _0x3a6da1(0xdb2), 'WIN_OEM_FJ' + '_LOYA', 'WIN_OEM_FJ' + '_ROYA', '', '', '', '', '', '', '', '', '', _0x3a6da1(0xcb8), _0x3a6da1(0xaa8) + 'N', 'DOUBLE_QUO' + 'TE', _0x3a6da1(0x369), _0x3a6da1(0xe32), _0x3a6da1(0xfdd), _0x3a6da1(0xf9b), _0x3a6da1(0x822), _0x3a6da1(0xfed), 'CLOSE_PARE' + 'N', 'ASTERISK', _0x3a6da1(0x269), _0x3a6da1(0xd60), _0x3a6da1(0xb62) + 'US', _0x3a6da1(0x818) + '_BRACKET', _0x3a6da1(0x3bc) + 'Y_BRACKET', _0x3a6da1(0xa16), '', '', '', '', 'VOLUME_MUT' + 'E', _0x3a6da1(0x925) + 'N', _0x3a6da1(0x1030), '', '', _0x3a6da1(0xaa0), _0x3a6da1(0xb1b), _0x3a6da1(0x9e5), _0x3a6da1(0x247), 'PERIOD', _0x3a6da1(0x6b2), _0x3a6da1(0xbe9), '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', _0x3a6da1(0xd7d) + 'ET', 'BACK_SLASH', _0x3a6da1(0xdce) + 'KET', _0x3a6da1(0xed9), '', _0x3a6da1(0x97c), _0x3a6da1(0x9a1), '', _0x3a6da1(0x736) + 'LP', _0x3a6da1(0xa00), '', _0x3a6da1(0xaa5) + _0x3a6da1(0x799), '', '', _0x3a6da1(0x298) + _0x3a6da1(0x942), _0x3a6da1(0x2a4) + 'MP', _0x3a6da1(0xa6f) + '1', _0x3a6da1(0xa6f) + '2', _0x3a6da1(0xa6f) + '3', _0x3a6da1(0x60c) + _0x3a6da1(0x76e), _0x3a6da1(0x60a) + _0x3a6da1(0xafc), 'WIN_OEM_AT' + 'TN', 'WIN_OEM_FI' + 'NISH', _0x3a6da1(0xb06) + 'PY', _0x3a6da1(0x31a) + 'TO', _0x3a6da1(0xda8) + 'LW', _0x3a6da1(0xc56) + _0x3a6da1(0xf2c), _0x3a6da1(0x917), _0x3a6da1(0x47f), _0x3a6da1(0xd49), _0x3a6da1(0x595), _0x3a6da1(0xe0b), _0x3a6da1(0x77b), '', _0x3a6da1(0x98a), _0x3a6da1(0x2b6) + _0x3a6da1(0x799), ''], TextManager[_0x3a6da1(0x647) + _0x3a6da1(0x4f8)] = VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x316)][_0x3a6da1(0xb8a) + 'st'][_0x3a6da1(0x482)], TextManager[_0x3a6da1(0x647) + 'stCancel'] = VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x316)]['ButtonAssi' + 'st'][_0x3a6da1(0x807)], TextManager[_0x3a6da1(0x647) + _0x3a6da1(0xcee)] = VisuMZ['CoreEngine'][_0x3a6da1(0x316)][_0x3a6da1(0xb8a) + 'st'][_0x3a6da1(0xcb2) + 'rText'], VisuMZ['CoreEngine']['TextManage' + _0x3a6da1(0x6ef)] = TextManager[_0x3a6da1(0xa58)], TextManager[_0x3a6da1(0xa58)] = function (_0x60609f) { const _0x2c4908 = _0x3a6da1, _0x4c840a = { 'MAAna': function (_0x43dec5, _0x195d19) { return _0x43dec5 === _0x195d19; }, 'QXMdj': _0x2c4908(0x8f9) }; return _0x4c840a[_0x2c4908(0xf5a)](typeof _0x60609f, _0x4c840a[_0x2c4908(0xf33)]) ? VisuMZ['CoreEngine']['TextManage' + _0x2c4908(0x6ef)]['call'](this, _0x60609f) : this[_0x2c4908(0x631)](_0x60609f); }, TextManager['paramName'] = function (_0x39035c) { const _0x9f6790 = _0x3a6da1, _0x59cb49 = { 'eJsdO': function (_0x592b8a, _0x2b1c50) { return _0x592b8a(_0x2b1c50); }, 'gNUcR': function (_0x5f9650, _0x51dbd9) { return _0x5f9650 || _0x51dbd9; }, 'rxYny': function (_0x25a86e, _0x402ef2) { return _0x25a86e === _0x402ef2; }, 'weXmr': _0x9f6790(0x6b9), 'hhGhv': function (_0x39cb9c, _0x56ba62) { return _0x39cb9c === _0x56ba62; }, 'WmCxB': _0x9f6790(0x4a4), 'NPZBi': function (_0x47aa9c, _0x29253e) { return _0x47aa9c === _0x29253e; }, 'ictaX': 'ATK', 'RNEeh': function (_0x2853bc, _0x943df0) { return _0x2853bc === _0x943df0; }, 'RIeGe': _0x9f6790(0x7e1), 'RMJRR': 'MAT', 'CkgxF': _0x9f6790(0x28b), 'nqULH': _0x9f6790(0x514), 'tWGvW': _0x9f6790(0xffe), 'ydoNM': _0x9f6790(0xa27), 'JgOrr': function (_0x4f305d, _0x172ee7) { return _0x4f305d === _0x172ee7; }, 'goRSE': _0x9f6790(0x932), 'owRRE': _0x9f6790(0x27f), 'wZZln': function (_0x47b93a, _0x5ec835) { return _0x47b93a === _0x5ec835; }, 'HJIoh': _0x9f6790(0xe97), 'LBuQX': function (_0x1bbca1, _0x15e030) { return _0x1bbca1 === _0x15e030; }, 'eHMnw': _0x9f6790(0x7f2), 'RTgVP': function (_0x3e91a1, _0x393c8b) { return _0x3e91a1 === _0x393c8b; }, 'eAVaM': _0x9f6790(0x1040), 'jLvao': _0x9f6790(0xf81), 'PNcFS': function (_0x4bcdd2, _0x32c939) { return _0x4bcdd2 === _0x32c939; }, 'KboTc': 'HRG', 'jPvkK': function (_0xa5f891, _0x255c12) { return _0xa5f891 === _0x255c12; }, 'zEBDC': _0x9f6790(0xa4b), 'UGRGx': function (_0x11ccb2, _0x43ad48) { return _0x11ccb2 === _0x43ad48; }, 'ElaKi': 'TRG', 'OaeOX': _0x9f6790(0xf7b), 'CrEUd': function (_0x51c220, _0x4e623a) { return _0x51c220 === _0x4e623a; }, 'LafoV': _0x9f6790(0x766), 'nmysW': 'REC', 'JObrk': _0x9f6790(0x1054), 'YfYtP': function (_0x30f7c6, _0x44fefc) { return _0x30f7c6 === _0x44fefc; }, 'BJCWJ': 'MCR', 'YlgEp': _0x9f6790(0x9dd), 'lGcjR': function (_0x59b311, _0x1a6a31) { return _0x59b311 === _0x1a6a31; }, 'hfaJP': 'PDR', 'JSfcW': _0x9f6790(0x371), 'TLvTt': 'FDR', 'qEfja': function (_0x4beb0b, _0x5a7e82) { return _0x4beb0b === _0x5a7e82; }, 'pbuhB': _0x9f6790(0xf63) }; _0x39035c = _0x59cb49[_0x9f6790(0x393)](String, _0x59cb49[_0x9f6790(0x4fb)](_0x39035c, ''))['toUpperCas' + 'e'](); const _0x2111ef = VisuMZ[_0x9f6790(0xc9f)][_0x9f6790(0x316)][_0x9f6790(0x6ad)]; if (_0x59cb49[_0x9f6790(0x35a)](_0x39035c, _0x59cb49[_0x9f6790(0x5ab)])) return $dataSystem[_0x9f6790(0x76f)][_0x9f6790(0xdd6)][0x1596 * -0x1 + 0x1e * 0xa3 + 0x27c]; if (_0x59cb49['hhGhv'](_0x39035c, _0x59cb49[_0x9f6790(0x774)])) return $dataSystem[_0x9f6790(0x76f)][_0x9f6790(0xdd6)][-0x2316 + -0x23a4 * -0x1 + -0x8d]; if (_0x59cb49[_0x9f6790(0x6a6)](_0x39035c, _0x59cb49['ictaX'])) return $dataSystem[_0x9f6790(0x76f)][_0x9f6790(0xdd6)][0x4 * 0x5c0 + -0x216e + 0xa70]; if (_0x59cb49[_0x9f6790(0xa5e)](_0x39035c, _0x59cb49[_0x9f6790(0x99a)])) return $dataSystem[_0x9f6790(0x76f)]['params'][-0x1613 * -0x1 + 0x19b1 + -0x2fc1]; if (_0x59cb49[_0x9f6790(0x6a6)](_0x39035c, _0x59cb49[_0x9f6790(0x3e9)])) return $dataSystem['terms'][_0x9f6790(0xdd6)][0x1 * -0x26fd + 0xce5 + 0x1a1c]; if (_0x59cb49[_0x9f6790(0x6a6)](_0x39035c, _0x59cb49[_0x9f6790(0x42d)])) return $dataSystem[_0x9f6790(0x76f)][_0x9f6790(0xdd6)][0x1513 + -0x1 * -0x168d + -0x2b9b]; if (_0x59cb49[_0x9f6790(0xa5e)](_0x39035c, _0x59cb49[_0x9f6790(0x884)])) return $dataSystem['terms'][_0x9f6790(0xdd6)][-0x2 * 0xed2 + 0x29 * 0x62 + -0x95 * -0x18]; if (_0x59cb49[_0x9f6790(0x847)](_0x39035c, _0x59cb49['tWGvW'])) return $dataSystem[_0x9f6790(0x76f)]['params'][-0x17c8 + -0x969 + 0x2138]; if (_0x59cb49[_0x9f6790(0x35a)](_0x39035c, _0x59cb49[_0x9f6790(0xc19)])) return _0x2111ef[_0x9f6790(0xea8) + 'b0']; if (_0x59cb49[_0x9f6790(0x2f3)](_0x39035c, _0x59cb49[_0x9f6790(0xaa2)])) return _0x2111ef[_0x9f6790(0xea8) + 'b1']; if (_0x59cb49['RNEeh'](_0x39035c, _0x59cb49[_0x9f6790(0xcf7)])) return _0x2111ef[_0x9f6790(0xea8) + 'b2']; if (_0x59cb49[_0x9f6790(0x1026)](_0x39035c, _0x59cb49['HJIoh'])) return _0x2111ef[_0x9f6790(0xea8) + 'b3']; if (_0x59cb49[_0x9f6790(0x971)](_0x39035c, _0x59cb49[_0x9f6790(0x785)])) return _0x2111ef[_0x9f6790(0xea8) + 'b4']; if (_0x59cb49[_0x9f6790(0x26f)](_0x39035c, _0x59cb49[_0x9f6790(0x50e)])) return _0x2111ef['XParamVoca' + 'b5']; if (_0x59cb49['RNEeh'](_0x39035c, _0x59cb49['jLvao'])) return _0x2111ef[_0x9f6790(0xea8) + 'b6']; if (_0x59cb49[_0x9f6790(0x8e1)](_0x39035c, _0x59cb49[_0x9f6790(0x865)])) return _0x2111ef[_0x9f6790(0xea8) + 'b7']; if (_0x59cb49[_0x9f6790(0xe8d)](_0x39035c, _0x59cb49['zEBDC'])) return _0x2111ef[_0x9f6790(0xea8) + 'b8']; if (_0x59cb49[_0x9f6790(0x8bb)](_0x39035c, _0x59cb49[_0x9f6790(0x2e1)])) return _0x2111ef[_0x9f6790(0xea8) + 'b9']; if (_0x59cb49[_0x9f6790(0x847)](_0x39035c, _0x59cb49[_0x9f6790(0xa3b)])) return _0x2111ef[_0x9f6790(0x8ba) + 'b0']; if (_0x59cb49['CrEUd'](_0x39035c, _0x59cb49[_0x9f6790(0x36a)])) return _0x2111ef[_0x9f6790(0x8ba) + 'b1']; if (_0x59cb49[_0x9f6790(0x8e1)](_0x39035c, _0x59cb49[_0x9f6790(0x8a1)])) return _0x2111ef[_0x9f6790(0x8ba) + 'b2']; if (_0x59cb49[_0x9f6790(0x847)](_0x39035c, _0x59cb49['JObrk'])) return _0x2111ef[_0x9f6790(0x8ba) + 'b3']; if (_0x59cb49[_0x9f6790(0xa0f)](_0x39035c, _0x59cb49[_0x9f6790(0x489)])) return _0x2111ef['SParamVoca' + 'b4']; if (_0x59cb49['rxYny'](_0x39035c, _0x59cb49[_0x9f6790(0x1076)])) return _0x2111ef[_0x9f6790(0x8ba) + 'b5']; if (_0x59cb49[_0x9f6790(0xae3)](_0x39035c, _0x59cb49[_0x9f6790(0xc5a)])) return _0x2111ef[_0x9f6790(0x8ba) + 'b6']; if (_0x59cb49[_0x9f6790(0x26f)](_0x39035c, _0x59cb49[_0x9f6790(0x844)])) return _0x2111ef[_0x9f6790(0x8ba) + 'b7']; if (_0x59cb49['RNEeh'](_0x39035c, _0x59cb49['TLvTt'])) return _0x2111ef[_0x9f6790(0x8ba) + 'b8']; if (_0x59cb49[_0x9f6790(0xb9f)](_0x39035c, _0x59cb49[_0x9f6790(0xe41)])) return _0x2111ef['SParamVoca' + 'b9']; if (VisuMZ[_0x9f6790(0xc9f)]['CustomPara' + 'mNames'][_0x39035c]) return VisuMZ['CoreEngine']['CustomPara' + _0x9f6790(0x921)][_0x39035c]; return ''; }, TextManager[_0x3a6da1(0xc94) + _0x3a6da1(0x816)] = function (_0x1eb6fe) { const _0x51f5f8 = _0x3a6da1, _0x463dc1 = { 'ijuQT': function (_0x1101a6, _0x1d100e) { return _0x1101a6 === _0x1d100e; }, 'GFkkl': _0x51f5f8(0x82c) }, _0x4eb442 = Input[_0x51f5f8(0xc2a) + _0x51f5f8(0xc79) + 'pe'](); return _0x463dc1['ijuQT'](_0x4eb442, _0x463dc1['GFkkl']) ? this[_0x51f5f8(0x44e) + _0x51f5f8(0x5ae) + 'onString'](_0x1eb6fe) : this[_0x51f5f8(0x100a) + 'lerInputBu' + _0x51f5f8(0x816)](_0x4eb442, _0x1eb6fe); }, TextManager[_0x3a6da1(0x44e) + _0x3a6da1(0x5ae) + _0x3a6da1(0x7a5)] = function (_0x100902) { const _0x430b85 = _0x3a6da1, _0x443301 = { 'JJrvH': function (_0x5dba26, _0x377183) { return _0x5dba26 === _0x377183; }, 'sKbai': _0x430b85(0x558), 'xcAyR': 'escape', 'MPkVr': function (_0x39fe1d, _0x18ccf8) { return _0x39fe1d === _0x18ccf8; }, 'jwXJr': _0x430b85(0x103a), 'UTHsq': function (_0x1a1527, _0x4b8903) { return _0x1a1527(_0x4b8903); }, 'juxyR': function (_0x43fb85, _0x3699b1) { return _0x43fb85 >= _0x3699b1; }, 'zjoKu': function (_0x1472f2, _0x21780b) { return _0x1472f2 <= _0x21780b; }, 'JPKZY': function (_0x35a269, _0x44606f) { return _0x35a269 === _0x44606f; }, 'CcCwo': function (_0x1bf9a8, _0x3ee684) { return _0x1bf9a8 < _0x3ee684; } }, _0x3c3e5b = VisuMZ['CoreEngine']['Settings']['ButtonAssi' + 'st']['SplitEscap' + 'e']; if (!_0x3c3e5b) { if (_0x443301[_0x430b85(0x981)](_0x100902, _0x443301[_0x430b85(0x903)])) _0x100902 = _0x443301[_0x430b85(0xbc3)]; if (_0x443301[_0x430b85(0xc2e)](_0x100902, _0x443301[_0x430b85(0x7f4)])) _0x100902 = _0x443301['xcAyR']; } let _0x120690 = []; for (let _0x4fffbb in Input[_0x430b85(0xf32)]) { _0x4fffbb = _0x443301['UTHsq'](Number, _0x4fffbb); if (_0x443301[_0x430b85(0xc7b)](_0x4fffbb, -0x1 * -0x1571 + 0x16c + -0x167d) && _0x443301[_0x430b85(0x4f6)](_0x4fffbb, 0x275 * -0x3 + 0x1 * 0x13fd + -0x19 * 0x7d)) continue; if ([0x215 * 0x5 + 0x19fe + -0x2455, 0xe40 + -0x4 * 0xa7 + -0x2 * 0x5c2][_0x430b85(0xa43)](_0x4fffbb)) continue; _0x443301[_0x430b85(0x877)](_0x100902, Input['keyMapper'][_0x4fffbb]) && _0x120690[_0x430b85(0x92f)](_0x4fffbb); } for (let _0x4d0f7f = 0x22bd + -0x20ce + -0x1ef; _0x443301[_0x430b85(0x805)](_0x4d0f7f, _0x120690['length']); _0x4d0f7f++) { _0x120690[_0x4d0f7f] = TextManager[_0x430b85(0x901) + 'ap'][_0x120690[_0x4d0f7f]]; } return this['makeInputB' + _0x430b85(0xabd) + 'g'](_0x120690); }, TextManager[_0x3a6da1(0xc64) + _0x3a6da1(0xabd) + 'g'] = function (_0x271f1e) { const _0x1158fc = _0x3a6da1, _0x4a1965 = { 'RPNeS': _0x1158fc(0x775) }, _0x436273 = VisuMZ['CoreEngine'][_0x1158fc(0x316)][_0x1158fc(0xb8a) + 'st'], _0x3e6125 = _0x436273[_0x1158fc(0xfe9) + 'd'], _0x9a1ee4 = _0x271f1e[_0x1158fc(0xeab)](), _0x122dc3 = _0x4a1965[_0x1158fc(0xee9)][_0x1158fc(0xfc8)](_0x9a1ee4); return _0x436273[_0x122dc3] ? _0x436273[_0x122dc3] : _0x3e6125['format'](_0x9a1ee4); }, TextManager[_0x3a6da1(0x203) + _0x3a6da1(0x6b3) + _0x3a6da1(0xaa7)] = function (_0x4963ae, _0x5b39d0) { const _0x210ac1 = _0x3a6da1, _0x5b0bd9 = VisuMZ[_0x210ac1(0xc9f)][_0x210ac1(0x316)][_0x210ac1(0xb8a) + 'st'], _0x6c52f0 = _0x5b0bd9[_0x210ac1(0x7af) + 't'], _0x4865aa = this[_0x210ac1(0xc94) + 'ttonString'](_0x4963ae), _0x65aa2b = this['getInputBu' + _0x210ac1(0x816)](_0x5b39d0); return _0x6c52f0['format'](_0x4865aa, _0x65aa2b); }, TextManager[_0x3a6da1(0x100a) + 'lerInputBu' + _0x3a6da1(0x816)] = function (_0x1b5c1e, _0xefd662) { const _0x22aad4 = _0x3a6da1, _0x451f68 = _0x1b5c1e[_0x22aad4(0xb6a) + 'e']()[_0x22aad4(0x2d6)](), _0x4b28df = VisuMZ[_0x22aad4(0xc9f)][_0x22aad4(0xaef) + _0x22aad4(0xfd7)][_0x451f68]; if (!_0x4b28df) return this[_0x22aad4(0x100a) + _0x22aad4(0xbe2) + _0x22aad4(0x7cd)](_0x1b5c1e, _0xefd662); return _0x4b28df[_0xefd662] || this['getKeyboar' + _0x22aad4(0x5ae) + _0x22aad4(0x7a5)](_0x1b5c1e, _0xefd662); }, TextManager[_0x3a6da1(0x100a) + _0x3a6da1(0xbe2) + _0x3a6da1(0x7cd)] = function (_0x28346b, _0x4f8fb6) { const _0x582368 = _0x3a6da1, _0xc72f7e = _0x28346b[_0x582368(0xb6a) + 'e']()['trim'](); for (const _0x56ed07 in VisuMZ[_0x582368(0xc9f)][_0x582368(0xaef) + _0x582368(0x60b)]) { if (_0xc72f7e[_0x582368(0xa43)](_0x56ed07)) { const _0x157bb6 = VisuMZ[_0x582368(0xc9f)][_0x582368(0xaef) + _0x582368(0x60b)][_0x56ed07], _0x1f0a8a = VisuMZ[_0x582368(0xc9f)][_0x582368(0xaef) + _0x582368(0xfd7)][_0x157bb6]; return _0x1f0a8a[_0x4f8fb6] || this['getKeyboar' + 'dInputButt' + 'onString'](_0x4f8fb6); } } return this[_0x582368(0x44e) + _0x582368(0x5ae) + 'onString'](_0x4f8fb6); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x983) + _0x3a6da1(0x37b) + _0x3a6da1(0x31d)] = ColorManager[_0x3a6da1(0xd6a) + _0x3a6da1(0xbae)], ColorManager[_0x3a6da1(0xd6a) + _0x3a6da1(0xbae)] = function () { const _0x47ba3d = _0x3a6da1; VisuMZ[_0x47ba3d(0xc9f)][_0x47ba3d(0x983) + _0x47ba3d(0x37b) + 'dowskin'][_0x47ba3d(0xedc)](this), this['_colorCach' + 'e'] = this[_0x47ba3d(0x61e) + 'e'] || {}; }, ColorManager['getColorDa' + _0x3a6da1(0x2a2) + _0x3a6da1(0xcb5) + 'rs'] = function (_0x270994, _0x4eeb33) { const _0xdba38c = _0x3a6da1, _0x40aee1 = { 'QhGqU': function (_0x25d2cc, _0x33c22c) { return _0x25d2cc(_0x33c22c); }, 'hfDhI': '#%1' }; return _0x4eeb33 = _0x40aee1[_0xdba38c(0xbf2)](String, _0x4eeb33), this[_0xdba38c(0x61e) + 'e'] = this[_0xdba38c(0x61e) + 'e'] || {}, _0x4eeb33['match'](/#(.*)/i) ? this[_0xdba38c(0x61e) + 'e'][_0x270994] = _0x40aee1[_0xdba38c(0x480)][_0xdba38c(0xfc8)](_0x40aee1[_0xdba38c(0xbf2)](String, RegExp['$1'])) : this[_0xdba38c(0x61e) + 'e'][_0x270994] = this[_0xdba38c(0xbd3)](_0x40aee1[_0xdba38c(0xbf2)](Number, _0x4eeb33)), this[_0xdba38c(0x61e) + 'e'][_0x270994]; }, ColorManager[_0x3a6da1(0xf07)] = function (_0x296744) { const _0x14ce26 = _0x3a6da1, _0x48b070 = { 'ADUIe': function (_0x336767, _0x5ab30e) { return _0x336767(_0x5ab30e); }, 'FhImg': '#%1' }; return _0x296744 = _0x48b070[_0x14ce26(0xbca)](String, _0x296744), _0x296744[_0x14ce26(0x7a8)](/#(.*)/i) ? _0x48b070[_0x14ce26(0x2f1)][_0x14ce26(0xfc8)](_0x48b070['ADUIe'](String, RegExp['$1'])) : this[_0x14ce26(0xbd3)](_0x48b070[_0x14ce26(0xbca)](Number, _0x296744)); }, ColorManager[_0x3a6da1(0x80a) + 'dKeys'] = function () { const _0x4d353c = _0x3a6da1; this[_0x4d353c(0x61e) + 'e'] = {}; }, ColorManager[_0x3a6da1(0x91a) + 'r'] = function () { const _0x1c76a8 = _0x3a6da1, _0x14f2be = { 'UoKnq': _0x1c76a8(0xf76) + _0x1c76a8(0x9ee) }, _0x434478 = _0x14f2be['UoKnq']; this[_0x1c76a8(0x61e) + 'e'] = this['_colorCach' + 'e'] || {}; if (this[_0x1c76a8(0x61e) + 'e'][_0x434478]) return this['_colorCach' + 'e'][_0x434478]; const _0x347cd0 = VisuMZ[_0x1c76a8(0xc9f)][_0x1c76a8(0x316)][_0x1c76a8(0x2ca)][_0x1c76a8(0xd58) + 'l']; return this[_0x1c76a8(0xdb7) + _0x1c76a8(0x2a2) + 'inParamete' + 'rs'](_0x434478, _0x347cd0); }, ColorManager['systemColo' + 'r'] = function () { const _0x461dc1 = _0x3a6da1, _0x5cd41b = { 'NcwOE': _0x461dc1(0x72b) + _0x461dc1(0x746) }, _0x3c8d83 = _0x5cd41b[_0x461dc1(0xc00)]; this[_0x461dc1(0x61e) + 'e'] = this[_0x461dc1(0x61e) + 'e'] || {}; if (this[_0x461dc1(0x61e) + 'e'][_0x3c8d83]) return this[_0x461dc1(0x61e) + 'e'][_0x3c8d83]; const _0x1f81ac = VisuMZ[_0x461dc1(0xc9f)][_0x461dc1(0x316)][_0x461dc1(0x2ca)][_0x461dc1(0x1059) + 'm']; return this[_0x461dc1(0xdb7) + 'taFromPlug' + _0x461dc1(0xcb5) + 'rs'](_0x3c8d83, _0x1f81ac); }, ColorManager[_0x3a6da1(0xb52) + 'r'] = function () { const _0xdf6c2b = _0x3a6da1, _0x17f697 = { 'fDCfD': _0xdf6c2b(0x1031) + _0xdf6c2b(0x106b) }, _0x270f6e = _0x17f697[_0xdf6c2b(0x506)]; this[_0xdf6c2b(0x61e) + 'e'] = this[_0xdf6c2b(0x61e) + 'e'] || {}; if (this[_0xdf6c2b(0x61e) + 'e'][_0x270f6e]) return this['_colorCach' + 'e'][_0x270f6e]; const _0x1a58ba = VisuMZ[_0xdf6c2b(0xc9f)][_0xdf6c2b(0x316)][_0xdf6c2b(0x2ca)][_0xdf6c2b(0x216) + 's']; return this[_0xdf6c2b(0xdb7) + _0xdf6c2b(0x2a2) + _0xdf6c2b(0xcb5) + 'rs'](_0x270f6e, _0x1a58ba); }, ColorManager[_0x3a6da1(0xcf6)] = function () { const _0x376e02 = _0x3a6da1, _0x1bab76 = { 'PmzAY': _0x376e02(0xfe1) + _0x376e02(0x7a0) }, _0xf6ab7 = _0x1bab76[_0x376e02(0xbb5)]; this[_0x376e02(0x61e) + 'e'] = this['_colorCach' + 'e'] || {}; if (this['_colorCach' + 'e'][_0xf6ab7]) return this[_0x376e02(0x61e) + 'e'][_0xf6ab7]; const _0x3909d4 = VisuMZ[_0x376e02(0xc9f)][_0x376e02(0x316)][_0x376e02(0x2ca)][_0x376e02(0x614)]; return this[_0x376e02(0xdb7) + _0x376e02(0x2a2) + _0x376e02(0xcb5) + 'rs'](_0xf6ab7, _0x3909d4); }, ColorManager['gaugeBackC' + _0x3a6da1(0x81b)] = function () { const _0x5799fc = _0x3a6da1, _0x1a0725 = { 'PdIve': _0x5799fc(0x389) + _0x5799fc(0x591) + 'or' }, _0x1e20cc = _0x1a0725['PdIve']; this[_0x5799fc(0x61e) + 'e'] = this[_0x5799fc(0x61e) + 'e'] || {}; if (this['_colorCach' + 'e'][_0x1e20cc]) return this[_0x5799fc(0x61e) + 'e'][_0x1e20cc]; const _0x29153b = VisuMZ[_0x5799fc(0xc9f)][_0x5799fc(0x316)][_0x5799fc(0x2ca)][_0x5799fc(0xc0a) + _0x5799fc(0x2bd)]; return this[_0x5799fc(0xdb7) + _0x5799fc(0x2a2) + _0x5799fc(0xcb5) + 'rs'](_0x1e20cc, _0x29153b); }, ColorManager[_0x3a6da1(0xb49) + _0x3a6da1(0x302)] = function () { const _0x2219f0 = _0x3a6da1, _0xab843f = { 'QQRju': '_stored_hp' + _0x2219f0(0x908) + '1' }, _0xb6c24b = _0xab843f[_0x2219f0(0x36e)]; this[_0x2219f0(0x61e) + 'e'] = this[_0x2219f0(0x61e) + 'e'] || {}; if (this[_0x2219f0(0x61e) + 'e'][_0xb6c24b]) return this[_0x2219f0(0x61e) + 'e'][_0xb6c24b]; const _0x4f0847 = VisuMZ['CoreEngine'][_0x2219f0(0x316)][_0x2219f0(0x2ca)][_0x2219f0(0x7c3) + _0x2219f0(0x2e7)]; return this['getColorDa' + _0x2219f0(0x2a2) + _0x2219f0(0xcb5) + 'rs'](_0xb6c24b, _0x4f0847); }, ColorManager['hpGaugeCol' + _0x3a6da1(0x4b3)] = function () { const _0x360efa = _0x3a6da1, _0x1a3dd3 = { 'pkFVL': _0x360efa(0x4c6) + _0x360efa(0x908) + '2' }, _0x4b772b = _0x1a3dd3[_0x360efa(0x1e2)]; this[_0x360efa(0x61e) + 'e'] = this[_0x360efa(0x61e) + 'e'] || {}; if (this[_0x360efa(0x61e) + 'e'][_0x4b772b]) return this['_colorCach' + 'e'][_0x4b772b]; const _0x429de2 = VisuMZ['CoreEngine'][_0x360efa(0x316)][_0x360efa(0x2ca)][_0x360efa(0x7c3) + _0x360efa(0x973)]; return this['getColorDa' + _0x360efa(0x2a2) + _0x360efa(0xcb5) + 'rs'](_0x4b772b, _0x429de2); }, ColorManager['mpGaugeCol' + _0x3a6da1(0x302)] = function () { const _0x1fd9e6 = _0x3a6da1, _0x4f1a57 = { 'XhvvD': _0x1fd9e6(0x2a7) + _0x1fd9e6(0x908) + '1' }, _0x3de6e2 = _0x4f1a57['XhvvD']; this['_colorCach' + 'e'] = this[_0x1fd9e6(0x61e) + 'e'] || {}; if (this['_colorCach' + 'e'][_0x3de6e2]) return this[_0x1fd9e6(0x61e) + 'e'][_0x3de6e2]; const _0x198500 = VisuMZ['CoreEngine'][_0x1fd9e6(0x316)][_0x1fd9e6(0x2ca)]['ColorMPGau' + _0x1fd9e6(0x2e7)]; return this['getColorDa' + _0x1fd9e6(0x2a2) + 'inParamete' + 'rs'](_0x3de6e2, _0x198500); }, ColorManager[_0x3a6da1(0xf5f) + _0x3a6da1(0x4b3)] = function () { const _0x5b9790 = _0x3a6da1, _0x2daa3b = { 'wWzTw': _0x5b9790(0x2a7) + _0x5b9790(0x908) + '2' }, _0x6e2405 = _0x2daa3b[_0x5b9790(0x9aa)]; this['_colorCach' + 'e'] = this[_0x5b9790(0x61e) + 'e'] || {}; if (this[_0x5b9790(0x61e) + 'e'][_0x6e2405]) return this[_0x5b9790(0x61e) + 'e'][_0x6e2405]; const _0x1b0cb7 = VisuMZ[_0x5b9790(0xc9f)][_0x5b9790(0x316)][_0x5b9790(0x2ca)][_0x5b9790(0xde6) + _0x5b9790(0x973)]; return this[_0x5b9790(0xdb7) + _0x5b9790(0x2a2) + _0x5b9790(0xcb5) + 'rs'](_0x6e2405, _0x1b0cb7); }, ColorManager['mpCostColo' + 'r'] = function () { const _0x42284f = _0x3a6da1, _0x1f5c60 = { 'PTsdJ': _0x42284f(0x2a7) + _0x42284f(0xaa4) }, _0x2a0aea = _0x1f5c60['PTsdJ']; this['_colorCach' + 'e'] = this[_0x42284f(0x61e) + 'e'] || {}; if (this[_0x42284f(0x61e) + 'e'][_0x2a0aea]) return this[_0x42284f(0x61e) + 'e'][_0x2a0aea]; const _0xee1ddf = VisuMZ[_0x42284f(0xc9f)][_0x42284f(0x316)][_0x42284f(0x2ca)][_0x42284f(0xf6b) + 't']; return this[_0x42284f(0xdb7) + _0x42284f(0x2a2) + _0x42284f(0xcb5) + 'rs'](_0x2a0aea, _0xee1ddf); }, ColorManager[_0x3a6da1(0x4cd) + 'or'] = function () { const _0x13f692 = _0x3a6da1, _0x4d8dd2 = { 'RCwsr': _0x13f692(0x62f) + _0x13f692(0xf44) }, _0x35c0a7 = _0x4d8dd2[_0x13f692(0x88f)]; this[_0x13f692(0x61e) + 'e'] = this[_0x13f692(0x61e) + 'e'] || {}; if (this[_0x13f692(0x61e) + 'e'][_0x35c0a7]) return this[_0x13f692(0x61e) + 'e'][_0x35c0a7]; const _0x14114d = VisuMZ[_0x13f692(0xc9f)][_0x13f692(0x316)][_0x13f692(0x2ca)][_0x13f692(0xfc5) + 'Up']; return this['getColorDa' + _0x13f692(0x2a2) + _0x13f692(0xcb5) + 'rs'](_0x35c0a7, _0x14114d); }, ColorManager[_0x3a6da1(0x2a3) + _0x3a6da1(0x81b)] = function () { const _0x40c944 = _0x3a6da1, _0x179866 = { 'DzZsV': _0x40c944(0x62f) + _0x40c944(0xdc9) + 'or' }, _0x5cbd0c = _0x179866['DzZsV']; this['_colorCach' + 'e'] = this[_0x40c944(0x61e) + 'e'] || {}; if (this['_colorCach' + 'e'][_0x5cbd0c]) return this[_0x40c944(0x61e) + 'e'][_0x5cbd0c]; const _0x355343 = VisuMZ[_0x40c944(0xc9f)][_0x40c944(0x316)][_0x40c944(0x2ca)][_0x40c944(0xfc5) + _0x40c944(0x1075)]; return this['getColorDa' + _0x40c944(0x2a2) + _0x40c944(0xcb5) + 'rs'](_0x5cbd0c, _0x355343); }, ColorManager[_0x3a6da1(0xfb5) + 'or1'] = function () { const _0xc76f6b = _0x3a6da1, _0x1e25eb = { 'FErHr': _0xc76f6b(0xfbd) + _0xc76f6b(0x908) + '1' }, _0x3cfaf0 = _0x1e25eb[_0xc76f6b(0xac8)]; this[_0xc76f6b(0x61e) + 'e'] = this[_0xc76f6b(0x61e) + 'e'] || {}; if (this['_colorCach' + 'e'][_0x3cfaf0]) return this[_0xc76f6b(0x61e) + 'e'][_0x3cfaf0]; const _0x4d6b67 = VisuMZ[_0xc76f6b(0xc9f)][_0xc76f6b(0x316)][_0xc76f6b(0x2ca)][_0xc76f6b(0xc05) + _0xc76f6b(0x2e7)]; return this[_0xc76f6b(0xdb7) + 'taFromPlug' + 'inParamete' + 'rs'](_0x3cfaf0, _0x4d6b67); }, ColorManager[_0x3a6da1(0xfb5) + 'or2'] = function () { const _0x8059d5 = _0x3a6da1, _0xf00d93 = { 'cQUGu': '_stored_ct' + _0x8059d5(0x908) + '2' }, _0x1c3007 = _0xf00d93[_0x8059d5(0x82b)]; this[_0x8059d5(0x61e) + 'e'] = this[_0x8059d5(0x61e) + 'e'] || {}; if (this[_0x8059d5(0x61e) + 'e'][_0x1c3007]) return this[_0x8059d5(0x61e) + 'e'][_0x1c3007]; const _0x262d94 = VisuMZ['CoreEngine'][_0x8059d5(0x316)][_0x8059d5(0x2ca)]['ColorCTGau' + 'ge2']; return this[_0x8059d5(0xdb7) + _0x8059d5(0x2a2) + _0x8059d5(0xcb5) + 'rs'](_0x1c3007, _0x262d94); }, ColorManager['tpGaugeCol' + _0x3a6da1(0x302)] = function () { const _0x30e3a5 = _0x3a6da1, _0x64b15d = { 'HsSHn': _0x30e3a5(0xc28) + _0x30e3a5(0x908) + '1' }, _0x55fcf7 = _0x64b15d['HsSHn']; this[_0x30e3a5(0x61e) + 'e'] = this[_0x30e3a5(0x61e) + 'e'] || {}; if (this[_0x30e3a5(0x61e) + 'e'][_0x55fcf7]) return this[_0x30e3a5(0x61e) + 'e'][_0x55fcf7]; const _0x4fc9ea = VisuMZ['CoreEngine'][_0x30e3a5(0x316)][_0x30e3a5(0x2ca)][_0x30e3a5(0x63a) + _0x30e3a5(0x2e7)]; return this[_0x30e3a5(0xdb7) + _0x30e3a5(0x2a2) + _0x30e3a5(0xcb5) + 'rs'](_0x55fcf7, _0x4fc9ea); }, ColorManager[_0x3a6da1(0x519) + _0x3a6da1(0x4b3)] = function () { const _0x3a1d02 = _0x3a6da1, _0x35dfec = { 'cZewb': '_stored_tp' + _0x3a1d02(0x908) + '2' }, _0x22bbe6 = _0x35dfec['cZewb']; this['_colorCach' + 'e'] = this[_0x3a1d02(0x61e) + 'e'] || {}; if (this[_0x3a1d02(0x61e) + 'e'][_0x22bbe6]) return this[_0x3a1d02(0x61e) + 'e'][_0x22bbe6]; const _0x479fef = VisuMZ[_0x3a1d02(0xc9f)][_0x3a1d02(0x316)]['Color'][_0x3a1d02(0x63a) + _0x3a1d02(0x973)]; return this[_0x3a1d02(0xdb7) + _0x3a1d02(0x2a2) + _0x3a1d02(0xcb5) + 'rs'](_0x22bbe6, _0x479fef); }, ColorManager['tpCostColo' + 'r'] = function () { const _0x48b34e = _0x3a6da1, _0x2b17ff = { 'rFqSy': '_stored_tp' + _0x48b34e(0xaa4) }, _0x5bc0e6 = _0x2b17ff[_0x48b34e(0x9cf)]; this['_colorCach' + 'e'] = this['_colorCach' + 'e'] || {}; if (this['_colorCach' + 'e'][_0x5bc0e6]) return this[_0x48b34e(0x61e) + 'e'][_0x5bc0e6]; const _0xc30adf = VisuMZ[_0x48b34e(0xc9f)][_0x48b34e(0x316)][_0x48b34e(0x2ca)][_0x48b34e(0xd69) + 't']; return this[_0x48b34e(0xdb7) + _0x48b34e(0x2a2) + _0x48b34e(0xcb5) + 'rs'](_0x5bc0e6, _0xc30adf); }, ColorManager[_0x3a6da1(0x945) + 'or'] = function () { const _0xc272c9 = _0x3a6da1, _0x327e43 = { 'hwjzy': _0xc272c9(0xb04) + 'ndingColor' }, _0x3fd04e = _0x327e43['hwjzy']; this[_0xc272c9(0x61e) + 'e'] = this[_0xc272c9(0x61e) + 'e'] || {}; if (this[_0xc272c9(0x61e) + 'e'][_0x3fd04e]) return this[_0xc272c9(0x61e) + 'e'][_0x3fd04e]; const _0x6a841 = VisuMZ['CoreEngine'][_0xc272c9(0x316)][_0xc272c9(0x2ca)][_0xc272c9(0xd69) + 't']; return this[_0xc272c9(0xdb7) + 'taFromPlug' + _0xc272c9(0xcb5) + 'rs'](_0x3fd04e, _0x6a841); }, ColorManager[_0x3a6da1(0xbd9) + _0x3a6da1(0x54c)] = function () { const _0x1a916a = _0x3a6da1, _0x5992c2 = { 'JxDqN': '_stored_ex' + _0x1a916a(0x87a) + 'r1' }, _0xdfd913 = _0x5992c2[_0x1a916a(0x254)]; this[_0x1a916a(0x61e) + 'e'] = this[_0x1a916a(0x61e) + 'e'] || {}; if (this[_0x1a916a(0x61e) + 'e'][_0xdfd913]) return this[_0x1a916a(0x61e) + 'e'][_0xdfd913]; const _0x2e7bd4 = VisuMZ[_0x1a916a(0xc9f)]['Settings'][_0x1a916a(0x2ca)][_0x1a916a(0x3be) + _0x1a916a(0x958)]; return this[_0x1a916a(0xdb7) + 'taFromPlug' + _0x1a916a(0xcb5) + 'rs'](_0xdfd913, _0x2e7bd4); }, ColorManager[_0x3a6da1(0xbd9) + _0x3a6da1(0xcd5)] = function () { const _0x468775 = _0x3a6da1, _0x149f41 = { 'rXZTs': '_stored_ex' + 'pGaugeColo' + 'r2' }, _0x3ec45a = _0x149f41['rXZTs']; this[_0x468775(0x61e) + 'e'] = this['_colorCach' + 'e'] || {}; if (this[_0x468775(0x61e) + 'e'][_0x3ec45a]) return this[_0x468775(0x61e) + 'e'][_0x3ec45a]; const _0x51b5d6 = VisuMZ[_0x468775(0xc9f)][_0x468775(0x316)][_0x468775(0x2ca)]['ColorExpGa' + _0x468775(0x8c9)]; return this[_0x468775(0xdb7) + 'taFromPlug' + 'inParamete' + 'rs'](_0x3ec45a, _0x51b5d6); }, ColorManager[_0x3a6da1(0xa88) + _0x3a6da1(0xb7b)] = function () { const _0x257de0 = _0x3a6da1, _0x3e648c = { 'sJUZr': _0x257de0(0x753) + _0x257de0(0x58a) + _0x257de0(0x54c) }, _0x314dc5 = _0x3e648c[_0x257de0(0x679)]; this[_0x257de0(0x61e) + 'e'] = this[_0x257de0(0x61e) + 'e'] || {}; if (this[_0x257de0(0x61e) + 'e'][_0x314dc5]) return this['_colorCach' + 'e'][_0x314dc5]; const _0x6c4a59 = VisuMZ['CoreEngine']['Settings'][_0x257de0(0x2ca)][_0x257de0(0xc38) + 'Gauge1']; return this['getColorDa' + _0x257de0(0x2a2) + 'inParamete' + 'rs'](_0x314dc5, _0x6c4a59); }, ColorManager[_0x3a6da1(0xa88) + _0x3a6da1(0x1089)] = function () { const _0x387070 = _0x3a6da1, _0xb901d1 = { 'ExkeZ': '_stored_ma' + _0x387070(0x58a) + _0x387070(0xcd5) }, _0x20da39 = _0xb901d1[_0x387070(0xad4)]; this[_0x387070(0x61e) + 'e'] = this[_0x387070(0x61e) + 'e'] || {}; if (this[_0x387070(0x61e) + 'e'][_0x20da39]) return this['_colorCach' + 'e'][_0x20da39]; const _0x505fe6 = VisuMZ['CoreEngine'][_0x387070(0x316)]['Color'][_0x387070(0xc38) + _0x387070(0x28a)]; return this[_0x387070(0xdb7) + _0x387070(0x2a2) + _0x387070(0xcb5) + 'rs'](_0x20da39, _0x505fe6); }, ColorManager[_0x3a6da1(0xc3c)] = function (_0x3be6d8) { const _0xe6dc36 = _0x3a6da1; return VisuMZ['CoreEngine'][_0xe6dc36(0x316)][_0xe6dc36(0x2ca)][_0xe6dc36(0x7fe) + 'or']['call'](this, _0x3be6d8); }, ColorManager['mpColor'] = function (_0x3c7f90) { const _0x2d3cba = _0x3a6da1; return VisuMZ[_0x2d3cba(0xc9f)][_0x2d3cba(0x316)][_0x2d3cba(0x2ca)][_0x2d3cba(0xe10) + 'or']['call'](this, _0x3c7f90); }, ColorManager[_0x3a6da1(0x4c8)] = function (_0x1962e4) { const _0x54d5d0 = _0x3a6da1; return VisuMZ['CoreEngine'][_0x54d5d0(0x316)][_0x54d5d0(0x2ca)][_0x54d5d0(0xe7a) + 'or'][_0x54d5d0(0xedc)](this, _0x1962e4); }, ColorManager['paramchang' + _0x3a6da1(0x3e3)] = function (_0x25b7bf) { const _0x1827ee = _0x3a6da1; return VisuMZ[_0x1827ee(0xc9f)][_0x1827ee(0x316)]['Color'][_0x1827ee(0xa8a) + 'e']['call'](this, _0x25b7bf); }, ColorManager[_0x3a6da1(0xe88) + 'r'] = function (_0x4fb66b) { const _0x5d2ab9 = _0x3a6da1; return VisuMZ['CoreEngine']['Settings'][_0x5d2ab9(0x2ca)]['DamageColo' + 'r'][_0x5d2ab9(0xedc)](this, _0x4fb66b); }, ColorManager[_0x3a6da1(0xcf0) + 'or'] = function () { const _0x2a0472 = _0x3a6da1; return VisuMZ['CoreEngine'][_0x2a0472(0x316)]['Color'][_0x2a0472(0x7ff) + 'or']; }, ColorManager[_0x3a6da1(0xcf0) + 'orDmg'] = function () { const _0x46a99f = _0x3a6da1, _0x3b8f19 = { 'zJeLf': _0x46a99f(0xee3) + '\x200,\x200.7)' }; return VisuMZ[_0x46a99f(0xc9f)][_0x46a99f(0x316)][_0x46a99f(0x2ca)][_0x46a99f(0x7ff) + _0x46a99f(0xec2)] || _0x3b8f19['zJeLf']; }, ColorManager[_0x3a6da1(0xcf0) + 'orGauge'] = function () { const _0x4ceb2c = _0x3a6da1, _0x57f0d3 = { 'bUxDI': _0x4ceb2c(0xee3) + '\x200,\x201.0)' }; return VisuMZ[_0x4ceb2c(0xc9f)][_0x4ceb2c(0x316)]['Color']['OutlineCol' + 'orGauge'] || _0x57f0d3[_0x4ceb2c(0x50c)]; }, ColorManager['dimColor1'] = function () { const _0x45b5dc = _0x3a6da1; return VisuMZ[_0x45b5dc(0xc9f)][_0x45b5dc(0x316)][_0x45b5dc(0x2ca)][_0x45b5dc(0xa21)]; }, ColorManager[_0x3a6da1(0x74a)] = function () { const _0xfc4291 = _0x3a6da1; return VisuMZ[_0xfc4291(0xc9f)][_0xfc4291(0x316)]['Color'][_0xfc4291(0x2d9)]; }, ColorManager[_0x3a6da1(0xde9) + _0x3a6da1(0x54c)] = function () { const _0x1939cf = _0x3a6da1; return VisuMZ[_0x1939cf(0xc9f)]['Settings']['Color']['ItemBackCo' + _0x1939cf(0x54c)]; }, ColorManager[_0x3a6da1(0xde9) + _0x3a6da1(0xcd5)] = function () { const _0x3ff294 = _0x3a6da1; return VisuMZ['CoreEngine'][_0x3ff294(0x316)][_0x3ff294(0x2ca)]['ItemBackCo' + _0x3ff294(0xcd5)]; }, SceneManager[_0x3a6da1(0xcad) + 'ck'] = [], SceneManager['isSceneBat' + _0x3a6da1(0x633)] = function () { const _0x5a9d83 = _0x3a6da1, _0x207ec = { 'UakBD': function (_0x11d5da, _0x515760) { return _0x11d5da === _0x515760; } }; return this[_0x5a9d83(0xda5)] && _0x207ec[_0x5a9d83(0x23f)](this[_0x5a9d83(0xda5)][_0x5a9d83(0x3b0) + 'r'], Scene_Battle); }, SceneManager['isSceneMap'] = function () { const _0x245c4d = _0x3a6da1, _0xf61fde = { 'zOxVb': function (_0x3ba53f, _0x53fe1f) { return _0x3ba53f === _0x53fe1f; } }; return this[_0x245c4d(0xda5)] && _0xf61fde['zOxVb'](this[_0x245c4d(0xda5)][_0x245c4d(0x3b0) + 'r'], Scene_Map); }, SceneManager[_0x3a6da1(0x963) + _0x3a6da1(0x2ac)] = function () { const _0x2c6637 = _0x3a6da1, _0x3ff891 = { 'iXeGj': function (_0x1bb4dd, _0x15edfd) { return _0x1bb4dd instanceof _0x15edfd; } }; return this[_0x2c6637(0xda5)] && _0x3ff891['iXeGj'](this[_0x2c6637(0xda5)], Scene_Map); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x9d2) + 'er_initial' + 'ize'] = SceneManager[_0x3a6da1(0xa40)], SceneManager[_0x3a6da1(0xa40)] = function () { const _0x1af0e2 = _0x3a6da1; VisuMZ['CoreEngine'][_0x1af0e2(0x9d2) + _0x1af0e2(0x8c7) + _0x1af0e2(0x105d)][_0x1af0e2(0xedc)](this), this['initVisuMZ' + _0x1af0e2(0xc9f)](); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x9d2) + 'er_onKeyDo' + 'wn'] = SceneManager['onKeyDown'], SceneManager[_0x3a6da1(0xcf2)] = function (_0x3c2b06) { const _0x48a59d = _0x3a6da1; if ($gameTemp) this[_0x48a59d(0x54d) + _0x48a59d(0x946)](_0x3c2b06); VisuMZ[_0x48a59d(0xc9f)][_0x48a59d(0x9d2) + _0x48a59d(0x63c) + 'wn'][_0x48a59d(0xedc)](this, _0x3c2b06); }, SceneManager[_0x3a6da1(0x54d) + 'eysF6F7'] = function (_0x32e3ac) { const _0x79e6dc = _0x3a6da1, _0x490392 = { 'bQFqD': _0x79e6dc(0xdab), 'owHLK': _0x79e6dc(0xafa), 'yLxvI': function (_0x4f9898, _0x8549ac) { return _0x4f9898 >= _0x8549ac; }, 'QmhSn': function (_0x48e14f, _0xfb648c) { return _0x48e14f <= _0xfb648c; }, 'pCbQb': function (_0x25a752, _0x3d473c) { return _0x25a752 - _0x3d473c; }, 'ZlMse': function (_0x45bc31, _0x2a918d) { return _0x45bc31 >= _0x2a918d; } }; if (!_0x32e3ac[_0x79e6dc(0xcec)] && !_0x32e3ac[_0x79e6dc(0xae5)]) switch (_0x32e3ac[_0x79e6dc(0xf50)]) { case -0x1ef5 + 0x1630 + -0xd * -0xb3: this[_0x79e6dc(0xb3e) + _0x79e6dc(0x2df)](); break; case -0x3 * -0x3d7 + -0x303 * 0xb + -0x8 * -0x2be: this[_0x79e6dc(0xb3e) + _0x79e6dc(0xb19)](); break; case 0x3 * 0x23b + 0x49 * -0x45 + 0xd71: this[_0x79e6dc(0x615)](); break; case -0xda4 + -0x9 * -0x27b + 0x5 * -0x1a5: if (Input[_0x79e6dc(0x347)](_0x490392[_0x79e6dc(0xf7d)]) || Input[_0x79e6dc(0x347)](_0x490392[_0x79e6dc(0x33b)])) return; this['playTestF7'](); break; } else { if (_0x32e3ac[_0x79e6dc(0xcec)]) { let _0x34fc75 = _0x32e3ac[_0x79e6dc(0xf50)]; if (_0x490392[_0x79e6dc(0xe01)](_0x34fc75, 0x20f * 0x12 + -0x203c + -0x4a1) && _0x490392[_0x79e6dc(0x1fb)](_0x34fc75, 0xbaa + 0x94b + -0x14bc)) { const _0x449def = _0x490392['pCbQb'](_0x34fc75, 0x83f * 0x1 + -0x1574 + 0xd65); return SceneManager[_0x79e6dc(0x2cf) + _0x79e6dc(0xe92)](_0x449def); } else { if (_0x490392['ZlMse'](_0x34fc75, 0x1735 + -0x1 * -0x6e7 + -0x1dbb) && _0x490392[_0x79e6dc(0x1fb)](_0x34fc75, -0x152d + 0xfa0 + -0xda * -0x7)) { const _0x5d48c5 = _0x490392[_0x79e6dc(0x340)](_0x34fc75, 0xc4c * 0x1 + 0xf * -0x12c + 0x2d4 * 0x2); return SceneManager[_0x79e6dc(0x2cf) + 'ickLoad'](_0x5d48c5); } } } } }, SceneManager[_0x3a6da1(0x615)] = function () { const _0x72f350 = _0x3a6da1, _0x557395 = { 'yVsiw': function (_0x23f22e, _0x422e08) { return _0x23f22e !== _0x422e08; }, 'LaifJ': function (_0x351ba2, _0x206334) { return _0x351ba2 === _0x206334; } }; if ($gameTemp[_0x72f350(0x386)]() && VisuMZ[_0x72f350(0xc9f)][_0x72f350(0x316)][_0x72f350(0xfee)][_0x72f350(0xe02)]) { _0x557395['yVsiw'](ConfigManager[_0x72f350(0xeeb)], -0x1438 + -0x457 + -0x188f * -0x1) ? (ConfigManager['bgmVolume'] = -0x23c0 + 0x202c + 0x394, ConfigManager['bgsVolume'] = 0x1eab + 0x1b12 + 0x1 * -0x39bd, ConfigManager[_0x72f350(0x4df)] = -0x7 * -0x39f + 0xe08 + -0x1 * 0x2761, ConfigManager[_0x72f350(0xeeb)] = -0x5ea * 0x1 + 0x173e + -0x1154) : (ConfigManager[_0x72f350(0x392)] = -0x2 * -0x1330 + -0x1 * -0x23bd + -0x49b9, ConfigManager[_0x72f350(0x501)] = -0x8c4 + -0x3bd + -0xce5 * -0x1, ConfigManager[_0x72f350(0x4df)] = 0x2098 + -0x2116 * -0x1 + -0x414a, ConfigManager[_0x72f350(0xeeb)] = 0x6 * 0x236 + -0x2586 + 0x18a6); ConfigManager[_0x72f350(0xde3)](); if (_0x557395[_0x72f350(0xe55)](this[_0x72f350(0xda5)][_0x72f350(0x3b0) + 'r'], Scene_Options)) { if (this[_0x72f350(0xda5)][_0x72f350(0x926) + _0x72f350(0x41f)]) this[_0x72f350(0xda5)][_0x72f350(0x926) + _0x72f350(0x41f)][_0x72f350(0x6d0)](); if (this[_0x72f350(0xda5)]['_listWindo' + 'w']) this['_scene']['_listWindo' + 'w'][_0x72f350(0x6d0)](); } } }, SceneManager['playTestF7'] = function () { const _0x51e8a1 = _0x3a6da1; $gameTemp[_0x51e8a1(0x386)]() && VisuMZ[_0x51e8a1(0xc9f)][_0x51e8a1(0x316)][_0x51e8a1(0xfee)][_0x51e8a1(0x4a3)] && ($gameTemp[_0x51e8a1(0xc45) + _0x51e8a1(0x39b)] = !$gameTemp[_0x51e8a1(0xc45) + _0x51e8a1(0x39b)]); }, SceneManager[_0x3a6da1(0xb3e) + _0x3a6da1(0x2df)] = function () { const _0xbaea55 = _0x3a6da1, _0x346166 = { 'XeVSC': _0xbaea55(0xdab) }; if (!VisuMZ[_0xbaea55(0xc9f)]['Settings'][_0xbaea55(0xfee)][_0xbaea55(0x6c3) + _0xbaea55(0xdc2)]) return; if (!$gameTemp[_0xbaea55(0x386)]()) return; if (!SceneManager[_0xbaea55(0xf95) + _0xbaea55(0x633)]()) return; if (!Input[_0xbaea55(0x347)](_0x346166[_0xbaea55(0x5c6)])) return; for (const _0x14470f of $gameParty[_0xbaea55(0x200)]()) { if (!_0x14470f) continue; _0x14470f[_0xbaea55(0x5b4)](); } }, SceneManager[_0x3a6da1(0xb3e) + _0x3a6da1(0xb19)] = function () { const _0x590563 = _0x3a6da1, _0x3278c0 = { 'dLFjk': _0x590563(0xdab) }; if (!VisuMZ[_0x590563(0xc9f)][_0x590563(0x316)][_0x590563(0xfee)][_0x590563(0x55f) + _0x590563(0xdc2)]) return; if (!$gameTemp['isPlaytest']()) return; if (!SceneManager['isSceneBat' + _0x590563(0x633)]()) return; if (!Input[_0x590563(0x347)](_0x3278c0[_0x590563(0xf54)])) return; for (const _0x728d77 of $gameParty['members']()) { if (!_0x728d77) continue; _0x728d77[_0x590563(0x207) + 'Tp'](_0x728d77[_0x590563(0x6bc)]()); } }, SceneManager[_0x3a6da1(0x2cf) + 'ickLoad'] = function (_0x3c1e30) { const _0x1141f1 = _0x3a6da1, _0x4c3df1 = { 'SsrEX': _0x1141f1(0x282) }, _0x38c7d0 = _0x4c3df1[_0x1141f1(0xdfc)][_0x1141f1(0x80d)]('|'); let _0xf86c6b = -0x255e + 0x2b * -0x5b + -0x3 * -0x118d; while (!![]) { switch (_0x38c7d0[_0xf86c6b++]) { case '0': if (!$gameTemp[_0x1141f1(0x386)]()) return; continue; case '1': if (!DataManager[_0x1141f1(0xb32) + 'fo'](_0x3c1e30)) return; continue; case '2': this[_0x1141f1(0x92f)](Scene_QuickLoad); continue; case '3': if (!(VisuMZ[_0x1141f1(0xc9f)][_0x1141f1(0x316)]['QoL']['CtrlQuickL' + _0x1141f1(0xef5)] ?? !![])) return; continue; case '4': this['prepareNex' + _0x1141f1(0x64b)](_0x3c1e30); continue; }break; } }, SceneManager[_0x3a6da1(0xa42) + _0x3a6da1(0xc9f)] = function () { const _0x5a8602 = _0x3a6da1; this[_0x5a8602(0xe7e) + _0x5a8602(0x5c5)] = ![], this[_0x5a8602(0xe84) + 'ns'] = !VisuMZ['CoreEngine'][_0x5a8602(0x316)]['UI'][_0x5a8602(0x2e8) + 's']; }, SceneManager[_0x3a6da1(0xbfd) + _0x3a6da1(0x102d)] = function (_0x4c9315) { const _0x29d85b = _0x3a6da1; VisuMZ['CoreEngine'][_0x29d85b(0x316)]['UI'][_0x29d85b(0x8fb) + 's'] && (this[_0x29d85b(0xe7e) + 'nLayout'] = _0x4c9315); }, SceneManager[_0x3a6da1(0xef7) + _0x3a6da1(0x427)] = function () { const _0x56d93b = _0x3a6da1; return this[_0x56d93b(0xe7e) + _0x56d93b(0x5c5)]; }, SceneManager[_0x3a6da1(0xa18) + _0x3a6da1(0x73c)] = function () { const _0x18d34d = _0x3a6da1; return this[_0x18d34d(0xe84) + 'ns']; }, SceneManager['areButtons' + _0x3a6da1(0x6aa) + _0x3a6da1(0x1e8)] = function () { const _0x45abcf = _0x3a6da1; return this[_0x45abcf(0xa18) + _0x45abcf(0x73c)]() || this[_0x45abcf(0xef7) + 'onLayout'](); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x9d2) + 'er_isGameA' + _0x3a6da1(0x3f2)] = SceneManager['isGameActi' + 've'], SceneManager['isGameActi' + 've'] = function () { const _0x2c103e = _0x3a6da1; return VisuMZ[_0x2c103e(0xc9f)]['Settings'][_0x2c103e(0xfee)][_0x2c103e(0x801) + 'us'] ? VisuMZ[_0x2c103e(0xc9f)][_0x2c103e(0x9d2) + _0x2c103e(0x69f) + _0x2c103e(0x3f2)][_0x2c103e(0xedc)](this) : !![]; }, SceneManager[_0x3a6da1(0x1ef) + _0x3a6da1(0x56c)] = function (_0x9c37d5) { const _0x4b26d0 = _0x3a6da1, _0x37f2e2 = { 'BaUfY': function (_0x32dba4, _0x4c642) { return _0x32dba4 instanceof _0x4c642; }, 'mrrLr': function (_0x3a7ce0, _0x329ea4) { return _0x3a7ce0 === _0x329ea4; }, 'OxJmw': _0x4b26d0(0xb9e) }; if (_0x37f2e2[_0x4b26d0(0x674)](_0x9c37d5, Error)) this[_0x4b26d0(0xf51) + _0x4b26d0(0xcb9)](_0x9c37d5); else _0x37f2e2[_0x4b26d0(0x674)](_0x9c37d5, Array) && _0x37f2e2[_0x4b26d0(0xdcd)](_0x9c37d5[-0x138b * 0x1 + 0x2137 + -0xdac], _0x37f2e2[_0x4b26d0(0xe5e)]) ? this['catchLoadE' + 'rror'](_0x9c37d5) : this[_0x4b26d0(0xf19) + _0x4b26d0(0x7ab)](_0x9c37d5); this[_0x4b26d0(0xdc4)](); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x8b8) + _0x3a6da1(0x101e) + _0x3a6da1(0x26e)] = BattleManager['processEsc' + 'ape'], BattleManager[_0x3a6da1(0xac5) + _0x3a6da1(0x4fc)] = function () { const _0x29397d = _0x3a6da1; return VisuMZ['CoreEngine'][_0x29397d(0x316)]['QoL'][_0x29397d(0xeac) + 'ys'] ? this['processAlw' + _0x29397d(0x513)]() : VisuMZ['CoreEngine']['BattleMana' + _0x29397d(0x101e) + _0x29397d(0x26e)][_0x29397d(0xedc)](this); }, BattleManager['processAlw' + _0x3a6da1(0x513)] = function () { const _0x300680 = _0x3a6da1; return $gameParty['performEsc' + 'ape'](), SoundManager[_0x300680(0x650)](), this[_0x300680(0x41b) + 'ccess'](), !![]; }, BattleManager[_0x3a6da1(0x377)] = function () { const _0x2443db = _0x3a6da1, _0x423476 = { 'fuzyD': function (_0x19a3fd, _0x56112d) { return _0x19a3fd >= _0x56112d; } }; return _0x423476['fuzyD']($gameSystem[_0x2443db(0x8f4) + _0x2443db(0x5d4)](), 0x1fff + -0x26a * 0x1 + 0x1d94 * -0x1); }, BattleManager['isActiveTp' + 'b'] = function () { const _0x2569a8 = _0x3a6da1, _0x101400 = { 'JxJqL': function (_0x344da5, _0xdb1c0d) { return _0x344da5 === _0xdb1c0d; } }; return _0x101400['JxJqL']($gameSystem[_0x2569a8(0x8f4) + _0x2569a8(0x5d4)](), 0x2 * -0x245 + 0x1147 + -0xcbc); }, VisuMZ[_0x3a6da1(0xc9f)]['Game_Temp_' + _0x3a6da1(0xa40)] = Game_Temp[_0x3a6da1(0x49b)][_0x3a6da1(0xa40)], Game_Temp[_0x3a6da1(0x49b)][_0x3a6da1(0xa40)] = function () { const _0x3d312e = _0x3a6da1; VisuMZ[_0x3d312e(0xc9f)][_0x3d312e(0xb8e) + _0x3d312e(0xa40)][_0x3d312e(0xedc)](this), this[_0x3d312e(0x359) + _0x3d312e(0x89d)](), this[_0x3d312e(0x716) + _0x3d312e(0xd7c) + 'ueue'](), this[_0x3d312e(0x1096) + _0x3d312e(0xb9b) + _0x3d312e(0xe26)](); }, Game_Temp[_0x3a6da1(0x49b)][_0x3a6da1(0x359) + 'Playtest'] = function () { const _0x36719c = _0x3a6da1; VisuMZ[_0x36719c(0xc9f)][_0x36719c(0x316)][_0x36719c(0xfee)][_0x36719c(0x703) + _0x36719c(0x39c)] && (this[_0x36719c(0xc6c) + 't'] = ![]); }, Game_Temp[_0x3a6da1(0x49b)]['setLastPlu' + _0x3a6da1(0x7ea) + _0x3a6da1(0x1018) + 'r'] = function (_0x57609a) { const _0x49f1dd = _0x3a6da1; this[_0x49f1dd(0xc22) + _0x49f1dd(0xb85) + 'terpreter'] = _0x57609a; }, Game_Temp[_0x3a6da1(0x49b)][_0x3a6da1(0xf78) + _0x3a6da1(0x7ea) + _0x3a6da1(0x1018) + 'r'] = function () { const _0x2bec5f = _0x3a6da1; return this['_lastPlugi' + _0x2bec5f(0xb85) + 'terpreter']; }, Game_Temp[_0x3a6da1(0x49b)][_0x3a6da1(0x72c) + _0x3a6da1(0xba1) + _0x3a6da1(0x37f) + _0x3a6da1(0xfe7)] = function () { const _0x389d8b = _0x3a6da1; this[_0x389d8b(0xede) + _0x389d8b(0x253)] = undefined, this['_forcedBat' + _0x389d8b(0xb8f)] = undefined, this['_forcedBat' + _0x389d8b(0xa80) + 'tem'] = undefined; }, Game_Temp[_0x3a6da1(0x49b)]['applyForce' + _0x3a6da1(0xba1) + _0x3a6da1(0x37f) + 'reEngine'] = function (_0x604a2e) { const _0x3fa352 = _0x3a6da1, _0xdf437 = { 'rXiuX': function (_0x44a344, _0x37d801) { return _0x44a344 && _0x37d801; } }; _0xdf437['rXiuX']($gameMap, $dataMap) && $dataMap[_0x3fa352(0xba6)] && this[_0x3fa352(0x79b) + _0x3fa352(0xba1) + _0x3fa352(0x37f) + _0x3fa352(0xfe7)]($dataMap[_0x3fa352(0xba6)]); const _0x388596 = $dataTroops[_0x604a2e]; if (_0x388596) { let _0x4cde34 = DataManager['createTroo' + _0x3fa352(0xba7)](_0x388596['id']); this['parseForce' + 'dGameTroop' + _0x3fa352(0x37f) + _0x3fa352(0xfe7)](_0x4cde34); } }, Game_Temp[_0x3a6da1(0x49b)][_0x3a6da1(0x79b) + _0x3a6da1(0xba1) + 'SettingsCo' + 'reEngine'] = function (_0x5654ff) { const _0x28b970 = _0x3a6da1, _0xd0df52 = { 'RzORw': function (_0x1f069b, _0x2a436a) { return _0x1f069b(_0x2a436a); }, 'cBpCU': _0x28b970(0xafd), 'HiRNI': 'STB', 'FzViL': _0x28b970(0x1034), 'OONvR': 'FTB', 'brrRM': _0x28b970(0xdfd), 'GmpYG': 'ETB', 'bVXOz': 'PTB' }; if (!_0x5654ff) return; if (_0x5654ff[_0x28b970(0x7a8)](/<(?:FRONTVIEW|FRONT VIEW|FV)>/i)) this[_0x28b970(0xede) + _0x28b970(0x253)] = 'FV'; else { if (_0x5654ff['match'](/<(?:SIDEVIEW|SIDE VIEW|SV)>/i)) this[_0x28b970(0xede) + 'opView'] = 'SV'; else { if (_0x5654ff[_0x28b970(0x7a8)](/<(?:BATTLEVIEW|BATTLE VIEW):[ ](.*)>/i)) { const _0x65ec96 = _0xd0df52[_0x28b970(0xc82)](String, RegExp['$1']); if (_0x65ec96[_0x28b970(0x7a8)](/(?:FRONTVIEW|FRONT VIEW|FV)/i)) this[_0x28b970(0xede) + _0x28b970(0x253)] = 'FV'; else _0x65ec96[_0x28b970(0x7a8)](/(?:SIDEVIEW|SIDE VIEW|SV)/i) && (this[_0x28b970(0xede) + _0x28b970(0x253)] = 'SV'); } } } if (_0x5654ff[_0x28b970(0x7a8)](/<(?:DTB)>/i)) this[_0x28b970(0x649) + _0x28b970(0xb8f)] = 0xc7f * -0x1 + 0x1 * -0x1307 + 0x1f86; else { if (_0x5654ff[_0x28b970(0x7a8)](/<(?:TPB|ATB)[ ]ACTIVE>/i)) this[_0x28b970(0x649) + _0x28b970(0xb8f)] = -0xe66 + 0x337 * -0x1 + -0x6e * -0x29; else { if (_0x5654ff[_0x28b970(0x7a8)](/<(?:TPB|ATB)[ ]WAIT>/i)) this[_0x28b970(0x649) + 'tleSys'] = 0x1 * 0x476 + 0x1be9 + -0x205d * 0x1; else { if (_0x5654ff[_0x28b970(0x7a8)](/<(?:TPB|ATB)>/i)) this['_forcedBat' + _0x28b970(0xb8f)] = 0xd5 + -0x1051 + 0xf7e; else { if (_0x5654ff['match'](/<(?:CTB)>/i)) Imported['VisuMZ_2_B' + 'attleSyste' + _0x28b970(0x219)] && (this[_0x28b970(0x649) + 'tleSys'] = _0xd0df52[_0x28b970(0xbe1)]); else { if (_0x5654ff[_0x28b970(0x7a8)](/<(?:STB)>/i)) Imported[_0x28b970(0x61d) + _0x28b970(0x4d3) + 'mSTB'] && (this[_0x28b970(0x649) + _0x28b970(0xb8f)] = _0xd0df52[_0x28b970(0x6b6)]); else { if (_0x5654ff[_0x28b970(0x7a8)](/<(?:BTB)>/i)) Imported[_0x28b970(0x61d) + 'attleSyste' + _0x28b970(0x107b)] && (this[_0x28b970(0x649) + _0x28b970(0xb8f)] = _0xd0df52[_0x28b970(0x1084)]); else { if (_0x5654ff['match'](/<(?:FTB)>/i)) Imported[_0x28b970(0x61d) + _0x28b970(0x4d3) + 'mFTB'] && (this[_0x28b970(0x649) + 'tleSys'] = _0xd0df52[_0x28b970(0xcc0)]); else { if (_0x5654ff[_0x28b970(0x7a8)](/<(?:OTB)>/i)) Imported[_0x28b970(0x61d) + _0x28b970(0x4d3) + 'mOTB'] && (this[_0x28b970(0x649) + _0x28b970(0xb8f)] = _0xd0df52[_0x28b970(0x492)]); else { if (_0x5654ff[_0x28b970(0x7a8)](/<(?:ETB)>/i)) Imported['VisuMZ_2_B' + _0x28b970(0x4d3) + _0x28b970(0xc78)] && (this[_0x28b970(0x649) + _0x28b970(0xb8f)] = _0xd0df52['GmpYG']); else { if (_0x5654ff[_0x28b970(0x7a8)](/<(?:PTB)>/i)) Imported[_0x28b970(0x61d) + _0x28b970(0x4d3) + _0x28b970(0x73d)] && (this[_0x28b970(0x649) + _0x28b970(0xb8f)] = _0xd0df52[_0x28b970(0x557)]); else { if (_0x5654ff[_0x28b970(0x7a8)](/<(?:BATTLEVIEW|BATTLE VIEW):[ ](.*)>/i)) { const _0x54140f = _0xd0df52['RzORw'](String, RegExp['$1']); if (_0x54140f[_0x28b970(0x7a8)](/DTB/i)) this[_0x28b970(0x649) + _0x28b970(0xb8f)] = 0x99b * -0x1 + 0x2 * 0xf93 + -0x158b * 0x1; else { if (_0x54140f['match'](/(?:TPB|ATB)[ ]ACTIVE/i)) this['_forcedBat' + 'tleSys'] = -0xbf9 + -0x2397 + 0xb * 0x453; else { if (_0x54140f['match'](/(?:TPB|ATB)[ ]WAIT/i)) this[_0x28b970(0x649) + _0x28b970(0xb8f)] = 0xee * 0x10 + 0x8 * 0x374 + -0x2a7e; else { if (_0x54140f[_0x28b970(0x7a8)](/CTB/i)) Imported[_0x28b970(0x61d) + _0x28b970(0x4d3) + 'mCTB'] && (this[_0x28b970(0x649) + _0x28b970(0xb8f)] = _0xd0df52[_0x28b970(0xbe1)]); else { if (_0x54140f[_0x28b970(0x7a8)](/STB/i)) Imported[_0x28b970(0x61d) + _0x28b970(0x4d3) + _0x28b970(0x81c)] && (this[_0x28b970(0x649) + 'tleSys'] = _0xd0df52['HiRNI']); else { if (_0x54140f[_0x28b970(0x7a8)](/BTB/i)) Imported[_0x28b970(0x61d) + _0x28b970(0x4d3) + _0x28b970(0x107b)] && (this[_0x28b970(0x649) + 'tleSys'] = _0xd0df52['FzViL']); else { if (_0x54140f['match'](/FTB/i)) Imported[_0x28b970(0x61d) + _0x28b970(0x4d3) + _0x28b970(0x73a)] && (this[_0x28b970(0x649) + _0x28b970(0xb8f)] = _0xd0df52[_0x28b970(0xcc0)]); else { if (_0x54140f[_0x28b970(0x7a8)](/OTB/i)) Imported[_0x28b970(0x61d) + _0x28b970(0x4d3) + 'mOTB'] && (this[_0x28b970(0x649) + _0x28b970(0xb8f)] = _0xd0df52[_0x28b970(0x492)]); else { if (_0x54140f[_0x28b970(0x7a8)](/ETB/i)) Imported[_0x28b970(0x61d) + _0x28b970(0x4d3) + 'mETB'] && (this[_0x28b970(0x649) + _0x28b970(0xb8f)] = _0xd0df52[_0x28b970(0x56a)]); else _0x54140f['match'](/PTB/i) && (Imported['VisuMZ_2_B' + _0x28b970(0x4d3) + 'mPTB'] && (this[_0x28b970(0x649) + _0x28b970(0xb8f)] = _0xd0df52[_0x28b970(0x557)])); } } } } } } } } } } } } } } } } } } } } if (_0x5654ff[_0x28b970(0x7a8)](/<(?:|BATTLE )GRID>/i)) this[_0x28b970(0x649) + _0x28b970(0xa80) + _0x28b970(0xee2)] = !![]; else _0x5654ff[_0x28b970(0x7a8)](/<NO (?:|BATTLE )GRID>/i) && (this['_forcedBat' + 'tleGridSys' + 'tem'] = ![]); }, Game_Temp[_0x3a6da1(0x49b)]['createFaux' + 'AnimationQ' + 'ueue'] = function () { const _0x1c5d74 = _0x3a6da1; this[_0x1c5d74(0x9fb) + _0x1c5d74(0xa1e)] = []; }, Game_Temp[_0x3a6da1(0x49b)][_0x3a6da1(0x295) + 'xAnimation'] = function (_0x73000c, _0x3cfe05, _0x2d9287, _0x2bd77b) { const _0x53800b = _0x3a6da1, _0x2963e0 = { 'siwZp': function (_0xa3d508, _0x348bb6) { return _0xa3d508 || _0x348bb6; } }; if (!this[_0x53800b(0x31e) + _0x53800b(0xf86)]()) return; _0x2d9287 = _0x2963e0[_0x53800b(0x249)](_0x2d9287, ![]), _0x2bd77b = _0x2963e0[_0x53800b(0x249)](_0x2bd77b, ![]); if ($dataAnimations[_0x3cfe05]) { const _0x2900da = { 'targets': _0x73000c, 'animationId': _0x3cfe05, 'mirror': _0x2d9287, 'mute': _0x2bd77b }; this[_0x53800b(0x9fb) + _0x53800b(0xa1e)][_0x53800b(0x92f)](_0x2900da); for (const _0x13cccf of _0x73000c) { _0x13cccf[_0x53800b(0x4ad) + 'tion'] && _0x13cccf[_0x53800b(0x4ad) + _0x53800b(0x56c)](); } } }, Game_Temp[_0x3a6da1(0x49b)][_0x3a6da1(0x31e) + _0x3a6da1(0xf86)] = function () { return !![]; }, Game_Temp[_0x3a6da1(0x49b)][_0x3a6da1(0x546) + _0x3a6da1(0xc8c) + 'n'] = function () { const _0x30cf7c = _0x3a6da1; return this['_fauxAnima' + _0x30cf7c(0xa1e)][_0x30cf7c(0xdab)](); }, Game_Temp[_0x3a6da1(0x49b)][_0x3a6da1(0x1096) + _0x3a6da1(0xb9b) + _0x3a6da1(0xe26)] = function () { const _0x471af0 = _0x3a6da1; this[_0x471af0(0x563) + _0x471af0(0xa9f)] = []; }, Game_Temp[_0x3a6da1(0x49b)][_0x3a6da1(0xa19) + _0x3a6da1(0x75b) + 'n'] = function (_0x1796bb, _0xaee5a5, _0x5abae3, _0x19a7c5, _0x281e55) { const _0x5389a6 = _0x3a6da1, _0x42756c = { 'gIMDl': function (_0x4e0384, _0x25029c) { return _0x4e0384 || _0x25029c; } }; if (!this[_0x5389a6(0x2c2) + _0x5389a6(0xbef)]()) return; _0x19a7c5 = _0x42756c[_0x5389a6(0xd37)](_0x19a7c5, ![]), _0x281e55 = _0x42756c[_0x5389a6(0xd37)](_0x281e55, ![]); if ($dataAnimations[_0x5abae3]) { const _0x50e84d = { 'x': _0x1796bb, 'y': _0xaee5a5, 'animationId': _0x5abae3, 'mirror': _0x19a7c5, 'mute': _0x281e55 }; this[_0x5389a6(0x563) + _0x5389a6(0xa9f)][_0x5389a6(0x92f)](_0x50e84d); } }, Game_Temp[_0x3a6da1(0x49b)][_0x3a6da1(0x2c2) + _0x3a6da1(0xbef)] = function () { return !![]; }, Game_Temp[_0x3a6da1(0x49b)][_0x3a6da1(0xd9c) + _0x3a6da1(0xc8a) + 'on'] = function () { const _0x2e0cf6 = _0x3a6da1; return this[_0x2e0cf6(0x563) + _0x2e0cf6(0xa9f)][_0x2e0cf6(0xdab)](); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x7e3) + _0x3a6da1(0x957) + 'ze'] = Game_System[_0x3a6da1(0x49b)][_0x3a6da1(0xa40)], Game_System[_0x3a6da1(0x49b)]['initialize'] = function () { const _0xa29059 = _0x3a6da1; VisuMZ[_0xa29059(0xc9f)]['Game_Syste' + 'm_initiali' + 'ze'][_0xa29059(0xedc)](this), this[_0xa29059(0xb9a) + 'gine'](); }, Game_System[_0x3a6da1(0x49b)][_0x3a6da1(0xb9a) + _0x3a6da1(0xd2e)] = function () { const _0x40fac9 = _0x3a6da1; this['_CoreEngin' + _0x40fac9(0xb72)] = { 'SideView': $dataSystem['optSideVie' + 'w'], 'BattleSystem': this[_0x40fac9(0x654) + _0x40fac9(0x243)](), 'FontSize': $dataSystem[_0x40fac9(0x4d5)][_0x40fac9(0x541)], 'Padding': 0xc }; }, Game_System[_0x3a6da1(0x49b)][_0x3a6da1(0xf23)] = function () { const _0x400c4a = _0x3a6da1, _0x1c7062 = { 'DcGLp': function (_0x2b0094, _0x193d22) { return _0x2b0094 === _0x193d22; }, 'jallZ': function (_0x2e62d8, _0x26d75a) { return _0x2e62d8 === _0x26d75a; } }; if (_0x1c7062[_0x400c4a(0xb10)]($gameTemp[_0x400c4a(0xede) + 'opView'], 'SV')) return !![]; else { if (_0x1c7062[_0x400c4a(0xb10)]($gameTemp[_0x400c4a(0xede) + _0x400c4a(0x253)], 'FV')) return ![]; } if (_0x1c7062['jallZ'](this[_0x400c4a(0xa55) + 'eSettings'], undefined)) this[_0x400c4a(0xb9a) + _0x400c4a(0xd2e)](); if (_0x1c7062[_0x400c4a(0xb10)](this[_0x400c4a(0xa55) + 'eSettings'][_0x400c4a(0x9ea)], undefined)) this[_0x400c4a(0xb9a) + _0x400c4a(0xd2e)](); return this['_CoreEngin' + _0x400c4a(0xb72)][_0x400c4a(0x9ea)]; }, Game_System[_0x3a6da1(0x49b)][_0x3a6da1(0x626) + 'w'] = function (_0x339dd0) { const _0xc38502 = _0x3a6da1, _0xf0108c = { 'jNMej': function (_0x501008, _0x47e765) { return _0x501008 === _0x47e765; } }; if (_0xf0108c[_0xc38502(0x486)](this['_CoreEngin' + _0xc38502(0xb72)], undefined)) this['initCoreEn' + 'gine'](); if (_0xf0108c[_0xc38502(0x486)](this[_0xc38502(0xa55) + _0xc38502(0xb72)]['SideView'], undefined)) this[_0xc38502(0xb9a) + _0xc38502(0xd2e)](); this[_0xc38502(0xa55) + _0xc38502(0xb72)][_0xc38502(0x9ea)] = _0x339dd0; }, Game_System[_0x3a6da1(0x49b)]['resetBattl' + 'eSystem'] = function () { const _0x4b39dc = _0x3a6da1, _0x24ac3f = { 'JhNeZ': function (_0x450c06, _0x16eba4) { return _0x450c06 === _0x16eba4; } }; if (_0x24ac3f[_0x4b39dc(0x598)](this[_0x4b39dc(0xa55) + _0x4b39dc(0xb72)], undefined)) this['initCoreEn' + 'gine'](); this[_0x4b39dc(0xa55) + 'eSettings']['BattleSyst' + 'em'] = this[_0x4b39dc(0x654) + 'tleSystem'](); }, Game_System['prototype'][_0x3a6da1(0x654) + _0x3a6da1(0x243)] = function () { const _0x2ad182 = _0x3a6da1, _0x2a716b = { 'oOHXW': _0x2ad182(0x869) }, _0x1312bb = (VisuMZ[_0x2ad182(0xc9f)]['Settings']['BattleSyst' + 'em'] || _0x2a716b[_0x2ad182(0xd1f)])[_0x2ad182(0xac2) + 'e']()[_0x2ad182(0x2d6)](); return VisuMZ[_0x2ad182(0xc9f)]['CreateBatt' + _0x2ad182(0xce7)](_0x1312bb); }, Game_System[_0x3a6da1(0x49b)][_0x3a6da1(0x8f4) + _0x3a6da1(0x5d4)] = function () { const _0x5ee11c = _0x3a6da1, _0x4a045e = { 'aBEaO': function (_0x521772, _0x27e23d) { return _0x521772 !== _0x27e23d; }, 'ujePf': function (_0x952d1c, _0x40a02e) { return _0x952d1c === _0x40a02e; } }; if (_0x4a045e[_0x5ee11c(0x8f6)]($gameTemp[_0x5ee11c(0x649) + _0x5ee11c(0xb8f)], undefined)) return $gameTemp[_0x5ee11c(0x649) + _0x5ee11c(0xb8f)]; if (_0x4a045e[_0x5ee11c(0x804)](this[_0x5ee11c(0xa55) + 'eSettings'], undefined)) this['initCoreEn' + _0x5ee11c(0xd2e)](); if (_0x4a045e['ujePf'](this[_0x5ee11c(0xa55) + _0x5ee11c(0xb72)][_0x5ee11c(0xeb8) + 'em'], undefined)) this[_0x5ee11c(0x281) + _0x5ee11c(0xadb)](); return this[_0x5ee11c(0xa55) + _0x5ee11c(0xb72)]['BattleSyst' + 'em']; }, Game_System['prototype'][_0x3a6da1(0x867) + 'ystem'] = function (_0xdaff72) { const _0x34d254 = _0x3a6da1, _0x2606e7 = { 'MWEXS': function (_0x57cbbb, _0x166a0b) { return _0x57cbbb === _0x166a0b; }, 'nUTRk': function (_0xe0d0c0, _0x401ced) { return _0xe0d0c0 === _0x401ced; } }; if (_0x2606e7[_0x34d254(0xbba)](this[_0x34d254(0xa55) + _0x34d254(0xb72)], undefined)) this[_0x34d254(0xb9a) + _0x34d254(0xd2e)](); if (_0x2606e7[_0x34d254(0x1f3)](this['_CoreEngin' + _0x34d254(0xb72)]['BattleSyst' + 'em'], undefined)) this[_0x34d254(0x281) + _0x34d254(0xadb)](); this['_CoreEngin' + 'eSettings'][_0x34d254(0xeb8) + 'em'] = _0xdaff72; }, Game_System[_0x3a6da1(0x49b)]['mainFontSi' + 'ze'] = function () { const _0x335f66 = _0x3a6da1, _0x1e2619 = { 'laQXJ': function (_0x1baebc, _0x17cacb) { return _0x1baebc === _0x17cacb; }, 'rxCol': function (_0x72f27a, _0x491308) { return _0x72f27a === _0x491308; } }; if (_0x1e2619[_0x335f66(0x9ac)](this[_0x335f66(0xa55) + _0x335f66(0xb72)], undefined)) this[_0x335f66(0xb9a) + _0x335f66(0xd2e)](); if (_0x1e2619['rxCol'](this[_0x335f66(0xa55) + _0x335f66(0xb72)][_0x335f66(0x3b5)], undefined)) this[_0x335f66(0xb9a) + _0x335f66(0xd2e)](); return this[_0x335f66(0xa55) + 'eSettings'][_0x335f66(0x3b5)]; }, Game_System[_0x3a6da1(0x49b)][_0x3a6da1(0xd24) + _0x3a6da1(0xc85)] = function (_0x11a7da) { const _0x22d832 = _0x3a6da1, _0x27ec0d = { 'aTKiD': function (_0x2cdf4e, _0xd0d512) { return _0x2cdf4e === _0xd0d512; }, 'IhWFF': function (_0x49e2fb, _0x2c651c) { return _0x49e2fb === _0x2c651c; } }; if (_0x27ec0d[_0x22d832(0x597)](this[_0x22d832(0xa55) + 'eSettings'], undefined)) this[_0x22d832(0xb9a) + _0x22d832(0xd2e)](); if (_0x27ec0d[_0x22d832(0xd21)](this[_0x22d832(0xa55) + _0x22d832(0xb72)]['TimeProgre' + 'ss'], undefined)) this['initCoreEn' + _0x22d832(0xd2e)](); this['_CoreEngin' + _0x22d832(0xb72)][_0x22d832(0x3b5)] = _0x11a7da; }, Game_System[_0x3a6da1(0x49b)][_0x3a6da1(0xc32) + _0x3a6da1(0x4d4)] = function () { const _0x1f2ce9 = _0x3a6da1, _0x151a96 = { 'BEAKR': function (_0x13ee2e, _0x1cd2dc) { return _0x13ee2e === _0x1cd2dc; }, 'MOuSu': function (_0x497e9e, _0x2e4e48) { return _0x497e9e === _0x2e4e48; } }; if (_0x151a96[_0x1f2ce9(0x2b3)](this[_0x1f2ce9(0xa55) + _0x1f2ce9(0xb72)], undefined)) this['initCoreEn' + 'gine'](); if (_0x151a96[_0x1f2ce9(0xf4b)](this[_0x1f2ce9(0xa55) + _0x1f2ce9(0xb72)]['Padding'], undefined)) this['initCoreEn' + 'gine'](); return this['_CoreEngin' + _0x1f2ce9(0xb72)][_0x1f2ce9(0xc9b)]; }, Game_System['prototype']['setWindowP' + _0x3a6da1(0x4d2)] = function (_0x3112d2) { const _0x2eba2a = _0x3a6da1, _0x4281c9 = { 'vkRgO': function (_0x4b6860, _0x12ce60) { return _0x4b6860 === _0x12ce60; } }; if (_0x4281c9[_0x2eba2a(0xfb8)](this['_CoreEngin' + _0x2eba2a(0xb72)], undefined)) this['initCoreEn' + _0x2eba2a(0xd2e)](); if (_0x4281c9[_0x2eba2a(0xfb8)](this[_0x2eba2a(0xa55) + 'eSettings'][_0x2eba2a(0xc7d) + 'ss'], undefined)) this['initCoreEn' + _0x2eba2a(0xd2e)](); this['_CoreEngin' + _0x2eba2a(0xb72)][_0x2eba2a(0xc9b)] = _0x3112d2; }, VisuMZ['CoreEngine'][_0x3a6da1(0xb0f) + _0x3a6da1(0x49d) + 'ze'] = Game_Screen['prototype'][_0x3a6da1(0xa40)], Game_Screen[_0x3a6da1(0x49b)]['initialize'] = function () { const _0x539523 = _0x3a6da1; VisuMZ[_0x539523(0xc9f)][_0x539523(0xb0f) + _0x539523(0x49d) + 'ze']['call'](this), this[_0x539523(0xb9a) + _0x539523(0x370) + _0x539523(0x30f)](); }, Game_Screen[_0x3a6da1(0x49b)]['initCoreEn' + _0x3a6da1(0x370) + 'Shake'] = function () { const _0x24b67 = _0x3a6da1, _0xb25526 = { 'Acize': _0x24b67(0x106f) }, _0x2598ea = VisuMZ[_0x24b67(0xc9f)]['Settings'][_0x24b67(0x9f7) + 'e']; this['_coreEngin' + _0x24b67(0x644) + 'e'] = _0x2598ea?.[_0x24b67(0xb14) + 'le'] || _0xb25526[_0x24b67(0xe2b)]; }, Game_Screen['prototype'][_0x3a6da1(0xc08) + _0x3a6da1(0xb21) + _0x3a6da1(0x101f)] = function () { const _0x27ceff = _0x3a6da1, _0x3a79bd = { 'pDUWS': function (_0x264232, _0xbdd126) { return _0x264232 === _0xbdd126; } }; if (_0x3a79bd[_0x27ceff(0xdb8)](this[_0x27ceff(0x290) + _0x27ceff(0x644) + 'e'], undefined)) this['initCoreEn' + _0x27ceff(0x370) + 'Shake'](); return this[_0x27ceff(0x290) + _0x27ceff(0x644) + 'e']; }, Game_Screen[_0x3a6da1(0x49b)]['setCoreEng' + _0x3a6da1(0xb21) + 'hakeStyle'] = function (_0x3fd3fe) { const _0x5d87e4 = _0x3a6da1, _0x53e61b = { 'MBoVN': function (_0x1ce4b2, _0x1786c5) { return _0x1ce4b2 === _0x1786c5; } }; if (_0x53e61b[_0x5d87e4(0x59f)](this[_0x5d87e4(0x290) + _0x5d87e4(0x644) + 'e'], undefined)) this['initCoreEn' + _0x5d87e4(0x370) + _0x5d87e4(0x30f)](); this[_0x5d87e4(0x290) + 'eShakeStyl' + 'e'] = _0x3fd3fe[_0x5d87e4(0xb6a) + 'e']()['trim'](); }, Game_Picture[_0x3a6da1(0x49b)][_0x3a6da1(0x606) + _0x3a6da1(0x72a)] = function () { const _0x806c8c = _0x3a6da1, _0x3fcc15 = { 'cfczQ': function (_0x801fa3, _0x2fa5b9) { return _0x801fa3 === _0x2fa5b9; } }; if ($gameParty['inBattle']()) return ![]; return this[_0x806c8c(0xbb4) + 'me']() && _0x3fcc15[_0x806c8c(0xfd5)](this[_0x806c8c(0xbb4) + 'me']()[_0x806c8c(0xbbe)](-0x11ea + 0x210b + -0xf21), '!'); }, Game_Picture[_0x3a6da1(0x49b)][_0x3a6da1(0xbb4) + 'me'] = function () { const _0x319f68 = _0x3a6da1; return this[_0x319f68(0xd92)][_0x319f68(0x80d)]('/')[_0x319f68(0xeab)](); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xf22) + _0x3a6da1(0x904)] = Game_Picture['prototype']['x'], Game_Picture[_0x3a6da1(0x49b)]['x'] = function () { const _0x26c720 = _0x3a6da1; return this[_0x26c720(0x606) + _0x26c720(0x72a)]() ? this['xScrollLin' + _0x26c720(0x8a0)]() : VisuMZ[_0x26c720(0xc9f)][_0x26c720(0xf22) + _0x26c720(0x904)][_0x26c720(0xedc)](this); }, Game_Picture[_0x3a6da1(0x49b)]['xScrollLin' + 'kedOffset'] = function () { const _0x92ef4a = _0x3a6da1, _0x187947 = { 'iDMLk': function (_0x49eff8, _0x1d6419) { return _0x49eff8 * _0x1d6419; }, 'ZYCEo': function (_0x245636, _0x27eae4) { return _0x245636 * _0x27eae4; }, 'phpHs': function (_0x29ff83, _0x2a5dd3) { return _0x29ff83 - _0x2a5dd3; } }, _0x573440 = _0x187947[_0x92ef4a(0x472)]($gameMap[_0x92ef4a(0xc91)](), $gameMap[_0x92ef4a(0x78c)]()); return _0x187947[_0x92ef4a(0xad2)](_0x187947[_0x92ef4a(0xa26)](this['_x'], _0x573440), $gameScreen['zoomScale']()); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xf22) + _0x3a6da1(0x83c)] = Game_Picture[_0x3a6da1(0x49b)]['y'], Game_Picture[_0x3a6da1(0x49b)]['y'] = function () { const _0x1f9da8 = _0x3a6da1; return this[_0x1f9da8(0x606) + _0x1f9da8(0x72a)]() ? this[_0x1f9da8(0x2e4) + _0x1f9da8(0x8a0)]() : VisuMZ[_0x1f9da8(0xc9f)][_0x1f9da8(0xf22) + _0x1f9da8(0x83c)][_0x1f9da8(0xedc)](this); }, Game_Picture[_0x3a6da1(0x49b)]['yScrollLin' + _0x3a6da1(0x8a0)] = function () { const _0x36a676 = _0x3a6da1, _0x4c8379 = { 'VQIIK': function (_0x445ad6, _0x5e238f) { return _0x445ad6 * _0x5e238f; }, 'SLysA': function (_0x534263, _0x3d9c17) { return _0x534263 * _0x3d9c17; }, 'exUBM': function (_0x29a1e6, _0x3ac1df) { return _0x29a1e6 - _0x3ac1df; } }, _0x9ce5b0 = _0x4c8379[_0x36a676(0x6f6)]($gameMap[_0x36a676(0xc3b)](), $gameMap[_0x36a676(0xb03)]()); return _0x4c8379['SLysA'](_0x4c8379[_0x36a676(0x324)](this['_y'], _0x9ce5b0), $gameScreen[_0x36a676(0xa4d)]()); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xf22) + _0x3a6da1(0x45d)] = Game_Picture[_0x3a6da1(0x49b)][_0x3a6da1(0x1ec)], Game_Picture[_0x3a6da1(0x49b)][_0x3a6da1(0x1ec)] = function () { const _0x2e1c76 = _0x3a6da1; let _0x372a1c = VisuMZ['CoreEngine'][_0x2e1c76(0xf22) + _0x2e1c76(0x45d)][_0x2e1c76(0xedc)](this); return this[_0x2e1c76(0x606) + 'lLinked']() && (_0x372a1c *= $gameScreen[_0x2e1c76(0xa4d)]()), _0x372a1c; }, VisuMZ['CoreEngine'][_0x3a6da1(0xf22) + _0x3a6da1(0x689)] = Game_Picture[_0x3a6da1(0x49b)][_0x3a6da1(0xa02)], Game_Picture['prototype']['scaleY'] = function () { const _0x5a9677 = _0x3a6da1; let _0x13a98c = VisuMZ[_0x5a9677(0xc9f)][_0x5a9677(0xf22) + _0x5a9677(0x689)][_0x5a9677(0xedc)](this); return this[_0x5a9677(0x606) + _0x5a9677(0x72a)]() && (_0x13a98c *= $gameScreen['zoomScale']()), _0x13a98c; }, Game_Picture[_0x3a6da1(0x49b)]['setEasingT' + _0x3a6da1(0xa6e)] = function (_0x3692ac) { const _0x1eda45 = _0x3a6da1; this[_0x1eda45(0x85e) + _0x1eda45(0xb6e)] = _0x3692ac; }, VisuMZ[_0x3a6da1(0xc9f)]['Game_Pictu' + _0x3a6da1(0x2c0) + 'ing'] = Game_Picture['prototype'][_0x3a6da1(0xe14)], Game_Picture['prototype'][_0x3a6da1(0xe14)] = function (_0x7cfe7) { const _0x5aee44 = _0x3a6da1; return this[_0x5aee44(0x85e) + _0x5aee44(0xb6e)] = this[_0x5aee44(0x85e) + _0x5aee44(0xb6e)] || 0x3 * 0x96b + 0xb00 * 0x2 + 0x19f * -0x1f, [0x634 * -0x1 + -0x583 + 0xbb7, -0x1eb8 + -0x18d0 + 0x3789, 0x2 * 0xf3a + 0x1760 + -0x35d2, -0xe1a + 0x16d7 + -0x8ba][_0x5aee44(0xa43)](this['_coreEasin' + _0x5aee44(0xb6e)]) ? VisuMZ['CoreEngine']['Game_Pictu' + 're_calcEas' + _0x5aee44(0x4d4)][_0x5aee44(0xedc)](this, _0x7cfe7) : VisuMZ['ApplyEasin' + 'g'](_0x7cfe7, this[_0x5aee44(0x85e) + _0x5aee44(0xb6e)]); }, VisuMZ['CoreEngine'][_0x3a6da1(0xf22) + _0x3a6da1(0x6c9) + _0x3a6da1(0xb37)] = Game_Picture[_0x3a6da1(0x49b)][_0x3a6da1(0xa38) + 'on'], Game_Picture['prototype'][_0x3a6da1(0xa38) + 'on'] = function () { const _0x45583a = _0x3a6da1; VisuMZ['CoreEngine'][_0x45583a(0xf22) + _0x45583a(0x6c9) + _0x45583a(0xb37)][_0x45583a(0xedc)](this), this[_0x45583a(0xa38) + 'onCoreEngi' + 'ne'](); }, Game_Picture[_0x3a6da1(0x49b)][_0x3a6da1(0xa38) + _0x3a6da1(0xbcd) + 'ne'] = function () { const _0x4ac282 = _0x3a6da1, _0x4da43b = { 'iiTcg': _0x4ac282(0x90d) }; this[_0x4ac282(0x32a)] = { 'current': 0x0, 'target': 0x0, 'duration': 0x0, 'wholeDuration': 0x0, 'easingType': _0x4da43b[_0x4ac282(0x101a)] }; }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xf22) + _0x3a6da1(0x843)] = Game_Picture[_0x3a6da1(0x49b)][_0x3a6da1(0x4e0)], Game_Picture[_0x3a6da1(0x49b)][_0x3a6da1(0x4e0)] = function () { const _0x3e4096 = _0x3a6da1; let _0x530556 = VisuMZ['CoreEngine'][_0x3e4096(0xf22) + _0x3e4096(0x843)]['call'](this); return _0x530556 += this[_0x3e4096(0x29a)](), _0x530556; }, Game_Picture[_0x3a6da1(0x49b)][_0x3a6da1(0x29a)] = function () { const _0x940cb5 = _0x3a6da1, _0x4f1589 = { 'ZWJlT': function (_0x58d846, _0x761db9) { return _0x58d846 === _0x761db9; } }; if (_0x4f1589[_0x940cb5(0x212)](this['_anglePlus'], undefined)) this[_0x940cb5(0xa38) + _0x940cb5(0xbcd) + 'ne'](); return this[_0x940cb5(0x32a)]['current'] || -0x39d * -0xa + 0xb4 + 0xcd * -0x2e; }, Game_Picture[_0x3a6da1(0x49b)][_0x3a6da1(0xd04) + _0x3a6da1(0x2e5)] = function (_0x2a53ff, _0x1ea2b0, _0x1a3199) { const _0x599d87 = _0x3a6da1, _0x55eddd = { 'fKiAE': _0x599d87(0xcf1) + '0', 'YJFlF': function (_0x13f566, _0x27524b) { return _0x13f566 <= _0x27524b; }, 'NjhCV': function (_0x43376d, _0x2ce26b) { return _0x43376d || _0x2ce26b; }, 'SWnqB': function (_0x1c43ad, _0x20d7ba) { return _0x1c43ad || _0x20d7ba; }, 'sgdAK': function (_0x58e1cd, _0x22f482) { return _0x58e1cd || _0x22f482; }, 'QnrSi': 'Linear', 'ENAUL': function (_0x269e4e, _0x57c88f) { return _0x269e4e === _0x57c88f; } }, _0x3addcf = _0x55eddd[_0x599d87(0x1027)]['split']('|'); let _0x50873d = -0x1a74 + -0x1369 + 0x2ddd; while (!![]) { switch (_0x3addcf[_0x50873d++]) { case '0': _0x55eddd[_0x599d87(0xe40)](_0x1ea2b0, 0x14cf + -0x2336 + -0x4cd * -0x3) && (this[_0x599d87(0x32a)][_0x599d87(0x9ca)] = this[_0x599d87(0x32a)][_0x599d87(0x91d)]); continue; case '1': this[_0x599d87(0x32a)][_0x599d87(0xbb7)] = _0x55eddd[_0x599d87(0x1008)](_0x1ea2b0, 0x2497 + 0x17 * -0x126 + 0x209 * -0x5); continue; case '2': this[_0x599d87(0x32a)][_0x599d87(0xac4) + _0x599d87(0x987)] = _0x55eddd[_0x599d87(0x498)](_0x1ea2b0, 0x243f + 0x5fe + -0xb * 0x3d7); continue; case '3': this['_anglePlus'][_0x599d87(0x91d)] = _0x55eddd[_0x599d87(0xf87)](_0x2a53ff, -0x1c0a * 0x1 + -0x1a2f + 0x3639); continue; case '4': this[_0x599d87(0x32a)][_0x599d87(0xcf8)] = _0x55eddd[_0x599d87(0xf87)](_0x1a3199, _0x55eddd[_0x599d87(0xfdc)]); continue; case '5': if (_0x55eddd[_0x599d87(0x521)](this[_0x599d87(0x32a)], undefined)) this['initRotati' + _0x599d87(0xbcd) + 'ne'](); continue; }break; } }, Game_Picture[_0x3a6da1(0x49b)][_0x3a6da1(0xea9) + 'ePlusData'] = function (_0x4575bf, _0x4f943d, _0x54525b) { const _0x3bd8a1 = _0x3a6da1, _0x59b4c2 = { 'deBxV': _0x3bd8a1(0xec5) + '4', 'lAJDT': function (_0x5d8798, _0x54c8b6) { return _0x5d8798 || _0x54c8b6; }, 'HzyWD': function (_0x2ad525, _0x4f81cd) { return _0x2ad525 === _0x4f81cd; }, 'avSmx': function (_0x4d4a77, _0x2bcf76) { return _0x4d4a77 || _0x2bcf76; }, 'buLFl': _0x3bd8a1(0x90d), 'mVTPK': function (_0x18dcba, _0x5320a0) { return _0x18dcba <= _0x5320a0; }, 'oXqyH': function (_0x1f4b3a, _0x1fe6db) { return _0x1f4b3a || _0x1fe6db; } }, _0x2e3670 = _0x59b4c2[_0x3bd8a1(0xf6a)][_0x3bd8a1(0x80d)]('|'); let _0x3f932d = 0x1 * 0xd73 + -0x444 + -0x92f; while (!![]) { switch (_0x2e3670[_0x3f932d++]) { case '0': this['_anglePlus'][_0x3bd8a1(0xbb7)] = _0x59b4c2['lAJDT'](_0x4f943d, -0xee3 + 0xb52 + -0x53 * -0xb); continue; case '1': this[_0x3bd8a1(0x32a)][_0x3bd8a1(0x91d)] += _0x59b4c2['lAJDT'](_0x4575bf, 0x177b + 0x768 + -0x1 * 0x1ee3); continue; case '2': if (_0x59b4c2[_0x3bd8a1(0x92d)](this[_0x3bd8a1(0x32a)], undefined)) this[_0x3bd8a1(0xa38) + _0x3bd8a1(0xbcd) + 'ne'](); continue; case '3': this['_anglePlus'][_0x3bd8a1(0xcf8)] = _0x59b4c2[_0x3bd8a1(0xc4f)](_0x54525b, _0x59b4c2[_0x3bd8a1(0x23b)]); continue; case '4': _0x59b4c2[_0x3bd8a1(0xe31)](_0x4f943d, -0x1b1f + -0x606 * 0x6 + 0x3f43) && (this[_0x3bd8a1(0x32a)]['current'] = this[_0x3bd8a1(0x32a)][_0x3bd8a1(0x91d)]); continue; case '5': this['_anglePlus'][_0x3bd8a1(0xac4) + 'ion'] = _0x59b4c2[_0x3bd8a1(0xee5)](_0x4f943d, 0x691 + -0x39 + -0x658); continue; }break; } }, VisuMZ['CoreEngine'][_0x3a6da1(0xf22) + _0x3a6da1(0x665) + _0x3a6da1(0xa10)] = Game_Picture[_0x3a6da1(0x49b)][_0x3a6da1(0xfc6) + _0x3a6da1(0x56c)], Game_Picture['prototype'][_0x3a6da1(0xfc6) + _0x3a6da1(0x56c)] = function () { const _0x45142f = _0x3a6da1; VisuMZ[_0x45142f(0xc9f)][_0x45142f(0xf22) + _0x45142f(0x665) + _0x45142f(0xa10)]['call'](this), this[_0x45142f(0x857) + _0x45142f(0xbf6)](); }, Game_Picture[_0x3a6da1(0x49b)]['updateAngl' + _0x3a6da1(0xbf6)] = function () { const _0xd08256 = _0x3a6da1, _0xdcdf0a = { 'Lnafz': function (_0x693ee6, _0x8792d9) { return _0x693ee6 === _0x8792d9; }, 'pPrDc': function (_0x3b4e38, _0x3cee4d) { return _0x3b4e38 <= _0x3cee4d; } }; if (_0xdcdf0a[_0xd08256(0x922)](this[_0xd08256(0x32a)], undefined)) this[_0xd08256(0xa38) + _0xd08256(0xbcd) + 'ne'](); const _0x372a4f = this[_0xd08256(0x32a)]; if (_0xdcdf0a[_0xd08256(0x708)](_0x372a4f[_0xd08256(0xbb7)], 0x50 + 0x1c89 * -0x1 + 0x5 * 0x5a5)) return; _0x372a4f['current'] = this[_0xd08256(0x4f3) + _0xd08256(0xc66)](_0x372a4f[_0xd08256(0x9ca)], _0x372a4f[_0xd08256(0x91d)]), _0x372a4f[_0xd08256(0xbb7)]--, _0xdcdf0a[_0xd08256(0x708)](_0x372a4f[_0xd08256(0xbb7)], 0x17d9 + -0x269 * 0x5 + -0x2f3 * 0x4) && (_0x372a4f['current'] = _0x372a4f['target']); }, Game_Picture[_0x3a6da1(0x49b)][_0x3a6da1(0x4f3) + _0x3a6da1(0xc66)] = function (_0x6c8780, _0x43edeb) { const _0x2c3116 = _0x3a6da1, _0x2964d9 = { 'GbXSG': function (_0x5a029a, _0x261029) { return _0x5a029a / _0x261029; }, 'Phzwv': function (_0x3839c9, _0x1459b5) { return _0x3839c9 - _0x1459b5; }, 'WAMbS': function (_0x1a4946, _0x493c91) { return _0x1a4946 / _0x493c91; }, 'GkGjC': function (_0x50f57c, _0x40ac6c) { return _0x50f57c + _0x40ac6c; }, 'lUapo': function (_0x38b792, _0xa2371e) { return _0x38b792 - _0xa2371e; }, 'ZGUho': function (_0x1f9cc1, _0x179eb3) { return _0x1f9cc1 / _0x179eb3; }, 'xxiKu': function (_0x1fe7b1, _0x3afbe6) { return _0x1fe7b1 - _0x3afbe6; }, 'QJZXT': function (_0x2ddf93, _0xe77b61) { return _0x2ddf93 * _0xe77b61; }, 'GnZTn': function (_0x381594, _0x37ce49) { return _0x381594 + _0x37ce49; }, 'wFHkP': function (_0x51eebe, _0x3bbfe6) { return _0x51eebe * _0x3bbfe6; }, 'abHfx': function (_0x357927, _0x60cd7c) { return _0x357927 - _0x60cd7c; } }, _0x8847c5 = this[_0x2c3116(0x32a)], _0x3e1922 = _0x8847c5[_0x2c3116(0xcf8)], _0x4b6abf = _0x8847c5[_0x2c3116(0xbb7)], _0x19d16d = _0x8847c5[_0x2c3116(0xac4) + _0x2c3116(0x987)], _0x5f6e19 = VisuMZ['ApplyEasin' + 'g'](_0x2964d9['GbXSG'](_0x2964d9[_0x2c3116(0x104a)](_0x19d16d, _0x4b6abf), _0x19d16d), _0x3e1922), _0x3f5203 = VisuMZ[_0x2c3116(0x77a) + 'g'](_0x2964d9[_0x2c3116(0x46e)](_0x2964d9[_0x2c3116(0x764)](_0x2964d9['lUapo'](_0x19d16d, _0x4b6abf), -0x1 * 0x3f7 + -0x51 * -0x31 + -0xb89), _0x19d16d), _0x3e1922), _0x58a31e = _0x2964d9['ZGUho'](_0x2964d9['xxiKu'](_0x6c8780, _0x2964d9[_0x2c3116(0x33e)](_0x43edeb, _0x5f6e19)), _0x2964d9['lUapo'](-0x1116 + 0x10fb + 0x7 * 0x4, _0x5f6e19)); return _0x2964d9[_0x2c3116(0xb3b)](_0x58a31e, _0x2964d9[_0x2c3116(0x32c)](_0x2964d9[_0x2c3116(0xb5e)](_0x43edeb, _0x58a31e), _0x3f5203)); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x437) + _0x3a6da1(0x6af)] = Game_Action[_0x3a6da1(0x49b)][_0x3a6da1(0x85f)], Game_Action[_0x3a6da1(0x49b)][_0x3a6da1(0x85f)] = function (_0x171af4) { const _0x2dc107 = _0x3a6da1; return VisuMZ[_0x2dc107(0xc9f)]['Settings']['QoL']['ImprovedAc' + _0x2dc107(0xdd4) + 'em'] ? this[_0x2dc107(0x312) + _0x2dc107(0x555) + 'acy'](_0x171af4) : VisuMZ[_0x2dc107(0xc9f)]['Game_Actio' + _0x2dc107(0x6af)][_0x2dc107(0xedc)](this, _0x171af4); }, Game_Action[_0x3a6da1(0x49b)][_0x3a6da1(0x312) + 'rovedAccur' + 'acy'] = function (_0x5304a2) { const _0x22a32b = _0x3a6da1, _0x49170d = { 'DDRnU': function (_0x399caa, _0x15aa65) { return _0x399caa * _0x15aa65; }, 'CccDn': function (_0x5f2ca6, _0x192983) { return _0x5f2ca6 - _0x192983; } }, _0x317c68 = this[_0x22a32b(0x246) + _0x22a32b(0x64e)](_0x5304a2), _0x55010d = this[_0x22a32b(0x9b6) + 'Rate'](_0x5304a2), _0x4998db = this['targetEvaR' + _0x22a32b(0x702)](_0x5304a2); return _0x49170d[_0x22a32b(0x244)](_0x317c68, _0x49170d[_0x22a32b(0x8a8)](_0x55010d, _0x4998db)); }, VisuMZ['CoreEngine'][_0x3a6da1(0x437) + _0x3a6da1(0xacc)] = Game_Action['prototype'][_0x3a6da1(0x9cd)], Game_Action[_0x3a6da1(0x49b)][_0x3a6da1(0x9cd)] = function (_0x497711) { const _0x106d24 = _0x3a6da1; return VisuMZ[_0x106d24(0xc9f)][_0x106d24(0x316)][_0x106d24(0xfee)][_0x106d24(0x8bf) + _0x106d24(0xdd4) + 'em'] ? -0x1054 + -0xfc2 + 0x2016 : VisuMZ[_0x106d24(0xc9f)][_0x106d24(0x437) + _0x106d24(0xacc)]['call'](this, _0x497711); }, Game_Action[_0x3a6da1(0x49b)][_0x3a6da1(0x246) + _0x3a6da1(0x64e)] = function (_0x2f6c49) { const _0x1782f6 = _0x3a6da1, _0x5b9015 = { 'cPqxl': function (_0x49a744, _0x577a4b) { return _0x49a744 * _0x577a4b; } }; return _0x5b9015['cPqxl'](this[_0x1782f6(0x440)]()[_0x1782f6(0xace) + 'e'], -0x1de4 + 0x63b + 0x1 * 0x17a9 + 0.01); }, Game_Action['prototype'][_0x3a6da1(0x9b6) + 'Rate'] = function (_0x39652f) { const _0x445bd7 = _0x3a6da1, _0x412e2e = { 'xFiAz': function (_0x46def7, _0x31b002) { return _0x46def7 + _0x31b002; } }; if (VisuMZ[_0x445bd7(0xc9f)][_0x445bd7(0x316)][_0x445bd7(0xfee)][_0x445bd7(0x435) + _0x445bd7(0x502)] && this['isItem']()) return -0xcb * -0x15 + -0x14f1 + 0x9d * 0x7; return this[_0x445bd7(0x105e)]() ? VisuMZ[_0x445bd7(0xc9f)][_0x445bd7(0x316)]['QoL'][_0x445bd7(0x435) + _0x445bd7(0x502)] && this[_0x445bd7(0xb79)]()[_0x445bd7(0xd40)]() ? _0x412e2e[_0x445bd7(0x5d1)](this[_0x445bd7(0xb79)]()[_0x445bd7(0xfd6)], 0x12ee + -0xdbd * 0x1 + 0x1 * -0x531 + 0.05) : this['subject']()[_0x445bd7(0xfd6)] : -0x1 * -0x1082 + -0x1a1d + -0x7b * -0x14; }, Game_Action[_0x3a6da1(0x49b)][_0x3a6da1(0x34b) + _0x3a6da1(0x702)] = function (_0x4d5ee9) { const _0x1e02f4 = _0x3a6da1, _0x3a52b1 = { 'yVjyP': function (_0x3a25a6, _0x321bb5) { return _0x3a25a6 === _0x321bb5; }, 'raHnh': function (_0x386e76, _0xaa9f10) { return _0x386e76 - _0xaa9f10; } }; if (_0x3a52b1[_0x1e02f4(0xf6d)](this['subject']()[_0x1e02f4(0xd40)](), _0x4d5ee9[_0x1e02f4(0xd40)]())) return 0x1 * -0x1607 + -0x484 + 0x1a8b; if (this['isPhysical']()) return VisuMZ['CoreEngine'][_0x1e02f4(0x316)][_0x1e02f4(0xfee)][_0x1e02f4(0x435) + _0x1e02f4(0x502)] && _0x4d5ee9['isEnemy']() ? _0x3a52b1[_0x1e02f4(0xf05)](_0x4d5ee9[_0x1e02f4(0x8b7)], -0x3 * -0x24c + -0x1 * 0x899 + 0x1b5 + 0.05) : _0x4d5ee9[_0x1e02f4(0x8b7)]; else return this['isMagical']() ? _0x4d5ee9[_0x1e02f4(0x931)] : -0xc8 * 0x25 + 0x1 * -0x428 + 0x2110; }, VisuMZ['CoreEngine'][_0x3a6da1(0x437) + _0x3a6da1(0x85d) + _0x3a6da1(0x5b2)] = Game_Action[_0x3a6da1(0x49b)][_0x3a6da1(0x566) + _0x3a6da1(0xf62)], Game_Action['prototype'][_0x3a6da1(0x566) + _0x3a6da1(0xf62)] = function (_0x565c3f) { const _0x2c95af = _0x3a6da1, _0xa063ec = { 'yokNn': function (_0x3ea4f8, _0x4aa5c6) { return _0x3ea4f8 > _0x4aa5c6; }, 'EOvuw': function (_0x58de43, _0x27f81c) { return _0x58de43 - _0x27f81c; } }; VisuMZ[_0x2c95af(0xc9f)][_0x2c95af(0x437) + 'n_updateLa' + _0x2c95af(0x5b2)][_0x2c95af(0xedc)](this, _0x565c3f); if (VisuMZ[_0x2c95af(0xc9f)][_0x2c95af(0x316)][_0x2c95af(0xfee)][_0x2c95af(0x8bf) + _0x2c95af(0xdd4) + 'em']) return; const _0x45a899 = _0x565c3f[_0x2c95af(0xa5f)](); _0x45a899[_0x2c95af(0xf10)] && (_0xa063ec['yokNn'](_0xa063ec['EOvuw'](0x1698 * -0x1 + 0x8e7 + 0xdb2, this[_0x2c95af(0x9cd)](_0x565c3f)), this[_0x2c95af(0x85f)](_0x565c3f)) && (_0x45a899[_0x2c95af(0xf10)] = ![], _0x45a899['evaded'] = !![])); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x5a0) + 'erBase_ini' + _0x3a6da1(0xe72)] = Game_BattlerBase[_0x3a6da1(0x49b)][_0x3a6da1(0xad1) + 's'], Game_BattlerBase['prototype'][_0x3a6da1(0xad1) + 's'] = function () { const _0x38e927 = _0x3a6da1; this[_0x38e927(0xe43)] = {}, VisuMZ['CoreEngine']['Game_Battl' + _0x38e927(0x43a) + _0x38e927(0xe72)][_0x38e927(0xedc)](this); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x5a0) + 'erBase_ref' + 'resh'] = Game_BattlerBase[_0x3a6da1(0x49b)]['refresh'], Game_BattlerBase['prototype'][_0x3a6da1(0x6d0)] = function () { const _0x3e9d64 = _0x3a6da1; this[_0x3e9d64(0xe43)] = {}, VisuMZ['CoreEngine']['Game_Battl' + 'erBase_ref' + _0x3e9d64(0xad9)][_0x3e9d64(0xedc)](this); }, Game_BattlerBase['prototype'][_0x3a6da1(0x6fd) + _0x3a6da1(0x834)] = function (_0x5763f3) { const _0x1eb0ca = _0x3a6da1, _0x118a1f = { 'pktEr': function (_0x4ca428, _0xc0c373) { return _0x4ca428 !== _0xc0c373; } }; return this['_cache'] = this[_0x1eb0ca(0xe43)] || {}, _0x118a1f[_0x1eb0ca(0xea7)](this[_0x1eb0ca(0xe43)][_0x5763f3], undefined); }, Game_BattlerBase[_0x3a6da1(0x49b)][_0x3a6da1(0xebd)] = function (_0x4a1ce3) { const _0x47142e = _0x3a6da1, _0x4a322f = { 'xjXwa': function (_0x2fbb52, _0x247828) { return _0x2fbb52(_0x247828); }, 'lEXjV': function (_0x445d0a, _0x5ce597) { return _0x445d0a(_0x5ce597); } }, _0x379b9d = (_0x5d80a7, _0x569c14) => { const _0x2f6ebe = _0xe91a; if (!_0x569c14) return _0x5d80a7; if (_0x569c14[_0x2f6ebe(0xba6)]['match'](VisuMZ['CoreEngine'][_0x2f6ebe(0xab9)][_0x2f6ebe(0xebd)][_0x4a1ce3])) { var _0x133ef7 = _0x4a322f[_0x2f6ebe(0xd66)](Number, RegExp['$1']); _0x5d80a7 += _0x133ef7; } if (_0x569c14[_0x2f6ebe(0xba6)][_0x2f6ebe(0x7a8)](VisuMZ[_0x2f6ebe(0xc9f)]['RegExp']['paramPlusJ' + 'S'][_0x4a1ce3])) { var _0x4a58b9 = _0x4a322f[_0x2f6ebe(0xb1d)](String, RegExp['$1']); try { _0x5d80a7 += _0x4a322f[_0x2f6ebe(0xd66)](eval, _0x4a58b9); } catch (_0x1984e0) { if ($gameTemp[_0x2f6ebe(0x386)]()) console[_0x2f6ebe(0xaee)](_0x1984e0); } } return _0x5d80a7; }; return this[_0x47142e(0x43b) + 'ts']()[_0x47142e(0x20d)](_0x379b9d, this[_0x47142e(0x68f)][_0x4a1ce3]); }, Game_BattlerBase[_0x3a6da1(0x49b)][_0x3a6da1(0xf7e)] = function (_0x406cb0) { const _0x785942 = _0x3a6da1, _0x58a760 = { 'GSyCU': function (_0x3f72ec, _0x3ab694) { return _0x3f72ec(_0x3ab694); }, 'OyheK': function (_0x24752b, _0x28a50b) { return _0x24752b === _0x28a50b; }, 'ANAtR': function (_0x26711f, _0x3e3177) { return _0x26711f(_0x3e3177); }, 'Yvnna': function (_0x28cbdb, _0x136ac7) { return _0x28cbdb + _0x136ac7; }, 'iasBW': _0x785942(0x2fc), 'DNLPz': _0x785942(0xfc3), 'UIdaX': _0x785942(0x4e9), 'OuXWS': _0x785942(0xffc), 'WdiMH': function (_0xfc2498, _0x3bf18c) { return _0xfc2498 === _0x3bf18c; } }; var _0x5534fb = _0x58a760[_0x785942(0xbe3)](_0x58a760[_0x785942(0xbe3)](_0x58a760[_0x785942(0xbe3)](_0x58a760[_0x785942(0x6ac)], this[_0x785942(0xd40)]() ? _0x58a760[_0x785942(0x2bb)] : _0x58a760[_0x785942(0x8e5)]), _0x58a760[_0x785942(0xc02)]), _0x406cb0); if (this[_0x785942(0x6fd) + _0x785942(0x834)](_0x5534fb)) return this[_0x785942(0xe43)][_0x5534fb]; this[_0x785942(0xe43)][_0x5534fb] = _0x58a760[_0x785942(0xbe5)](eval, VisuMZ[_0x785942(0xc9f)][_0x785942(0x316)][_0x785942(0x6ad)][_0x5534fb]); const _0x4761c9 = (_0x2b54ec, _0x4ef1a6) => { const _0x5ab8e4 = _0x785942; if (!_0x4ef1a6) return _0x2b54ec; if (_0x4ef1a6[_0x5ab8e4(0xba6)]['match'](VisuMZ[_0x5ab8e4(0xc9f)]['RegExp'][_0x5ab8e4(0xf7e)][_0x406cb0])) { var _0x197bb1 = _0x58a760[_0x5ab8e4(0x105c)](Number, RegExp['$1']); if (_0x58a760['OyheK'](_0x197bb1, -0xc43 + -0x1605 + 0x2248)) _0x197bb1 = Number[_0x5ab8e4(0xd17) + _0x5ab8e4(0x22c)]; _0x2b54ec = Math[_0x5ab8e4(0xeb6)](_0x2b54ec, _0x197bb1); } if (_0x4ef1a6[_0x5ab8e4(0xba6)]['match'](VisuMZ[_0x5ab8e4(0xc9f)][_0x5ab8e4(0xab9)][_0x5ab8e4(0x3a4)][_0x406cb0])) { var _0x86e844 = _0x58a760[_0x5ab8e4(0xbe5)](String, RegExp['$1']); try { _0x2b54ec = Math[_0x5ab8e4(0xeb6)](_0x2b54ec, _0x58a760[_0x5ab8e4(0x105c)](Number, _0x58a760['ANAtR'](eval, _0x86e844))); } catch (_0x583968) { if ($gameTemp['isPlaytest']()) console[_0x5ab8e4(0xaee)](_0x583968); } } return _0x2b54ec; }; if (_0x58a760[_0x785942(0xe6b)](this[_0x785942(0xe43)][_0x5534fb], 0x26fd + 0x51e + -0x2c1b * 0x1)) this[_0x785942(0xe43)][_0x5534fb] = Number[_0x785942(0xd17) + _0x785942(0x22c)]; return this[_0x785942(0xe43)][_0x5534fb] = this[_0x785942(0x43b) + 'ts']()[_0x785942(0x20d)](_0x4761c9, this[_0x785942(0xe43)][_0x5534fb]), this['_cache'][_0x5534fb]; }, Game_BattlerBase['prototype'][_0x3a6da1(0xc96)] = function (_0x312355) { const _0x305596 = _0x3a6da1, _0x238b78 = { 'ZxxnW': _0x305596(0xc7c), 'unXXF': function (_0x2204b6, _0x1366c3) { return _0x2204b6 / _0x1366c3; }, 'EacWE': function (_0x3ae7e7, _0x5654ab) { return _0x3ae7e7(_0x5654ab); }, 'HmOTe': function (_0x332e9e, _0x197637) { return _0x332e9e(_0x197637); }, 'xKQvC': function (_0x6d055e, _0x21e68f) { return _0x6d055e(_0x21e68f); } }, _0x2aa626 = this[_0x305596(0x3e1)](Game_BattlerBase['TRAIT_PARA' + 'M'], _0x312355), _0x3719a8 = (_0x577111, _0x153909) => { const _0x25813a = _0x305596, _0x40febf = _0x238b78[_0x25813a(0x9da)]['split']('|'); let _0x265880 = 0x3f1 + 0x15bf + 0x19b * -0x10; while (!![]) { switch (_0x40febf[_0x265880++]) { case '0': if (!_0x153909) return _0x577111; continue; case '1': return _0x577111; case '2': if (_0x153909[_0x25813a(0xba6)]['match'](VisuMZ[_0x25813a(0xc9f)][_0x25813a(0xab9)]['paramRate1'][_0x312355])) { var _0x1714f7 = _0x238b78['unXXF'](_0x238b78['EacWE'](Number, RegExp['$1']), 0x543 + -0xdf6 * 0x2 + 0x170d); _0x577111 *= _0x1714f7; } continue; case '3': if (_0x153909[_0x25813a(0xba6)][_0x25813a(0x7a8)](VisuMZ[_0x25813a(0xc9f)]['RegExp'][_0x25813a(0xa6c) + 'S'][_0x312355])) { var _0x384aaa = _0x238b78['HmOTe'](String, RegExp['$1']); try { _0x577111 *= _0x238b78['xKQvC'](eval, _0x384aaa); } catch (_0x5997ff) { if ($gameTemp['isPlaytest']()) console[_0x25813a(0xaee)](_0x5997ff); } } continue; case '4': if (_0x153909[_0x25813a(0xba6)][_0x25813a(0x7a8)](VisuMZ['CoreEngine'][_0x25813a(0xab9)][_0x25813a(0x1066)][_0x312355])) { var _0x1714f7 = _0x238b78['xKQvC'](Number, RegExp['$1']); _0x577111 *= _0x1714f7; } continue; }break; } }; return this[_0x305596(0x43b) + 'ts']()[_0x305596(0x20d)](_0x3719a8, _0x2aa626); }, Game_BattlerBase[_0x3a6da1(0x49b)]['paramFlatB' + _0x3a6da1(0xef0)] = function (_0x5743b3) { const _0x4c609d = _0x3a6da1, _0x51faca = { 'cmGuI': function (_0x2962b6, _0x17a30f) { return _0x2962b6(_0x17a30f); } }, _0x209fb9 = (_0x294195, _0x3f4dcf) => { const _0x2144e6 = _0xe91a; if (!_0x3f4dcf) return _0x294195; if (_0x3f4dcf[_0x2144e6(0xba6)]['match'](VisuMZ[_0x2144e6(0xc9f)][_0x2144e6(0xab9)]['paramFlat'][_0x5743b3])) { var _0x4e8715 = _0x51faca['cmGuI'](Number, RegExp['$1']); _0x294195 += _0x4e8715; } if (_0x3f4dcf['note'][_0x2144e6(0x7a8)](VisuMZ[_0x2144e6(0xc9f)][_0x2144e6(0xab9)][_0x2144e6(0x636) + 'S'][_0x5743b3])) { var _0x3b59b2 = _0x51faca['cmGuI'](String, RegExp['$1']); try { _0x294195 += _0x51faca['cmGuI'](eval, _0x3b59b2); } catch (_0x59c1fc) { if ($gameTemp[_0x2144e6(0x386)]()) console[_0x2144e6(0xaee)](_0x59c1fc); } } return _0x294195; }; return this[_0x4c609d(0x43b) + 'ts']()['reduce'](_0x209fb9, 0x1482 + -0x599 * -0x2 + -0x1fb4); }, Game_BattlerBase['prototype'][_0x3a6da1(0xa58)] = function (_0x232237) { const _0x414c56 = _0x3a6da1, _0x361c75 = { 'VEYOr': function (_0x54838d, _0x6db9c5) { return _0x54838d + _0x6db9c5; }, 'FuSKW': _0x414c56(0xa58), 'RUKDt': 'Total' }; let _0x29cef6 = _0x361c75['VEYOr'](_0x361c75[_0x414c56(0x5d6)](_0x361c75[_0x414c56(0x53a)], _0x232237), _0x361c75[_0x414c56(0x94d)]); if (this[_0x414c56(0x6fd) + _0x414c56(0x834)](_0x29cef6)) return this[_0x414c56(0xe43)][_0x29cef6]; return this['_cache'][_0x29cef6] = Math['round'](VisuMZ[_0x414c56(0xc9f)][_0x414c56(0x316)]['Param']['BasicParam' + _0x414c56(0x9c1) + 'a'][_0x414c56(0xedc)](this, _0x232237)), this[_0x414c56(0xe43)][_0x29cef6]; }, Game_BattlerBase[_0x3a6da1(0x49b)][_0x3a6da1(0x4a0)] = function (_0x1f45d8) { const _0x2fc2fa = _0x3a6da1, _0x519353 = { 'xxHuL': '3|4|1|2|0', 'TzRge': function (_0x1ba511, _0x1b0d72) { return _0x1ba511(_0x1b0d72); }, 'JOAzy': function (_0x46223f, _0x14e7e9) { return _0x46223f(_0x14e7e9); }, 'YFqxM': function (_0x209de3, _0x2031bd) { return _0x209de3 / _0x2031bd; }, 'ehowH': function (_0xaeb06c, _0x351228) { return _0xaeb06c(_0x351228); } }, _0x125e73 = (_0x363037, _0x2d041e) => { const _0x4d03ea = _0xe91a, _0x5a433a = _0x519353[_0x4d03ea(0xdaa)][_0x4d03ea(0x80d)]('|'); let _0x1203fc = 0x10aa + 0x2 * -0x18a + -0xd96; while (!![]) { switch (_0x5a433a[_0x1203fc++]) { case '0': return _0x363037; case '1': if (_0x2d041e[_0x4d03ea(0xba6)]['match'](VisuMZ[_0x4d03ea(0xc9f)][_0x4d03ea(0xab9)][_0x4d03ea(0x4a0) + '2'][_0x1f45d8])) { var _0x1d9331 = _0x519353[_0x4d03ea(0xd6e)](Number, RegExp['$1']); _0x363037 += _0x1d9331; } continue; case '2': if (_0x2d041e[_0x4d03ea(0xba6)][_0x4d03ea(0x7a8)](VisuMZ['CoreEngine'][_0x4d03ea(0xab9)]['xparamPlus' + 'JS'][_0x1f45d8])) { var _0x1148b7 = _0x519353['TzRge'](String, RegExp['$1']); try { _0x363037 += _0x519353[_0x4d03ea(0xebb)](eval, _0x1148b7); } catch (_0x203363) { if ($gameTemp[_0x4d03ea(0x386)]()) console[_0x4d03ea(0xaee)](_0x203363); } } continue; case '3': if (!_0x2d041e) return _0x363037; continue; case '4': if (_0x2d041e[_0x4d03ea(0xba6)][_0x4d03ea(0x7a8)](VisuMZ['CoreEngine'][_0x4d03ea(0xab9)][_0x4d03ea(0x4a0) + '1'][_0x1f45d8])) { var _0x1d9331 = _0x519353[_0x4d03ea(0x690)](_0x519353['ehowH'](Number, RegExp['$1']), 0x2 * 0x564 + -0xb7c + -0x14 * -0xe); _0x363037 += _0x1d9331; } continue; }break; } }; return this[_0x2fc2fa(0x43b) + 'ts']()[_0x2fc2fa(0x20d)](_0x125e73, 0x1342 + 0x26d0 + -0x3a12); }, Game_BattlerBase[_0x3a6da1(0x49b)][_0x3a6da1(0xe57)] = function (_0x219fae) { const _0x3dca1c = _0x3a6da1, _0x1895d0 = { 'lkTxg': '1|0|4|3|2', 'rGCLE': function (_0x53c907, _0x55ad38) { return _0x53c907 / _0x55ad38; }, 'WPkcd': function (_0x4d85d5, _0x45e990) { return _0x4d85d5(_0x45e990); }, 'lYpNi': function (_0x5c1bf6, _0x17b106) { return _0x5c1bf6(_0x17b106); }, 'kyGiD': function (_0x1ecab1, _0x32fd69) { return _0x1ecab1(_0x32fd69); }, 'odnQd': function (_0x23a6dc, _0x36b4e3) { return _0x23a6dc(_0x36b4e3); } }, _0x1d3cbb = (_0x533385, _0x53b5a3) => { const _0x1b1404 = _0xe91a, _0x421d3e = _0x1895d0[_0x1b1404(0xcd4)]['split']('|'); let _0x528a0b = -0x2597 + -0x1dd0 + 0x4367 * 0x1; while (!![]) { switch (_0x421d3e[_0x528a0b++]) { case '0': if (_0x53b5a3[_0x1b1404(0xba6)][_0x1b1404(0x7a8)](VisuMZ[_0x1b1404(0xc9f)][_0x1b1404(0xab9)][_0x1b1404(0xe57) + '1'][_0x219fae])) { var _0x354c29 = _0x1895d0[_0x1b1404(0x26c)](_0x1895d0[_0x1b1404(0x551)](Number, RegExp['$1']), -0xa * -0x37a + -0x11 * -0x5e + -0x289e); _0x533385 *= _0x354c29; } continue; case '1': if (!_0x53b5a3) return _0x533385; continue; case '2': return _0x533385; case '3': if (_0x53b5a3[_0x1b1404(0xba6)]['match'](VisuMZ[_0x1b1404(0xc9f)][_0x1b1404(0xab9)]['xparamRate' + 'JS'][_0x219fae])) { var _0x5180f2 = _0x1895d0['lYpNi'](String, RegExp['$1']); try { _0x533385 *= _0x1895d0[_0x1b1404(0x1060)](eval, _0x5180f2); } catch (_0x565d38) { if ($gameTemp[_0x1b1404(0x386)]()) console[_0x1b1404(0xaee)](_0x565d38); } } continue; case '4': if (_0x53b5a3[_0x1b1404(0xba6)][_0x1b1404(0x7a8)](VisuMZ[_0x1b1404(0xc9f)][_0x1b1404(0xab9)][_0x1b1404(0xe57) + '2'][_0x219fae])) { var _0x354c29 = _0x1895d0['odnQd'](Number, RegExp['$1']); _0x533385 *= _0x354c29; } continue; }break; } }; return this[_0x3dca1c(0x43b) + 'ts']()['reduce'](_0x1d3cbb, 0xe8 * 0x1b + -0x3 * 0x477 + 0x6d * -0x1a); }, Game_BattlerBase['prototype']['xparamFlat' + _0x3a6da1(0xc58)] = function (_0x27132f) { const _0x3f68b8 = _0x3a6da1, _0x488368 = { 'fVNuk': _0x3f68b8(0xf2d), 'NDTsS': function (_0x1ddccc, _0x5db3cd) { return _0x1ddccc / _0x5db3cd; }, 'NGZKf': function (_0x36e96a, _0x4983f1) { return _0x36e96a(_0x4983f1); } }, _0x2ee5c7 = (_0x3521cd, _0x28f171) => { const _0x11f2e3 = _0x3f68b8, _0x17d833 = _0x488368[_0x11f2e3(0xc51)][_0x11f2e3(0x80d)]('|'); let _0x355b62 = -0x15a7 + 0x1916 + -0x36f * 0x1; while (!![]) { switch (_0x17d833[_0x355b62++]) { case '0': return _0x3521cd; case '1': if (_0x28f171[_0x11f2e3(0xba6)][_0x11f2e3(0x7a8)](VisuMZ[_0x11f2e3(0xc9f)][_0x11f2e3(0xab9)][_0x11f2e3(0x43e) + '1'][_0x27132f])) { var _0x5c5e6a = _0x488368[_0x11f2e3(0x756)](_0x488368['NGZKf'](Number, RegExp['$1']), -0x29 * 0x47 + -0x26d0 + 0x3293); _0x3521cd += _0x5c5e6a; } continue; case '2': if (_0x28f171['note'][_0x11f2e3(0x7a8)](VisuMZ[_0x11f2e3(0xc9f)][_0x11f2e3(0xab9)][_0x11f2e3(0x43e) + '2'][_0x27132f])) { var _0x5c5e6a = _0x488368[_0x11f2e3(0x99e)](Number, RegExp['$1']); _0x3521cd += _0x5c5e6a; } continue; case '3': if (_0x28f171['note'][_0x11f2e3(0x7a8)](VisuMZ[_0x11f2e3(0xc9f)][_0x11f2e3(0xab9)][_0x11f2e3(0x43e) + 'JS'][_0x27132f])) { var _0x2329cc = _0x488368['NGZKf'](String, RegExp['$1']); try { _0x3521cd += _0x488368[_0x11f2e3(0x99e)](eval, _0x2329cc); } catch (_0x2e6ed5) { if ($gameTemp['isPlaytest']()) console[_0x11f2e3(0xaee)](_0x2e6ed5); } } continue; case '4': if (!_0x28f171) return _0x3521cd; continue; }break; } }; return this[_0x3f68b8(0x43b) + 'ts']()[_0x3f68b8(0x20d)](_0x2ee5c7, 0x1608 + -0x2245 + 0xf1 * 0xd); }, Game_BattlerBase['prototype']['xparam'] = function (_0x57a851) { const _0x138331 = _0x3a6da1, _0x4ad90a = { 'DBYlA': function (_0x1fa3e1, _0x217b09) { return _0x1fa3e1 + _0x217b09; }, 'UYdOi': function (_0xc74c53, _0x2199f3) { return _0xc74c53 + _0x2199f3; }, 'SZFfm': 'xparam', 'OlELg': _0x138331(0x77c) }; let _0x4f70b0 = _0x4ad90a[_0x138331(0xd7a)](_0x4ad90a[_0x138331(0x516)](_0x4ad90a[_0x138331(0x3d9)], _0x57a851), _0x4ad90a[_0x138331(0xd6b)]); if (this[_0x138331(0x6fd) + _0x138331(0x834)](_0x4f70b0)) return this[_0x138331(0xe43)][_0x4f70b0]; return this['_cache'][_0x4f70b0] = VisuMZ[_0x138331(0xc9f)][_0x138331(0x316)][_0x138331(0x6ad)][_0x138331(0x2fb) + _0x138331(0x8a4)][_0x138331(0xedc)](this, _0x57a851), this[_0x138331(0xe43)][_0x4f70b0]; }, Game_BattlerBase[_0x3a6da1(0x49b)]['sparamPlus'] = function (_0x398e18) { const _0x1945d9 = _0x3a6da1, _0x586084 = { 'KmOUU': '1|2|0|3|4', 'TKzid': function (_0x2b9083, _0x41e08c) { return _0x2b9083(_0x41e08c); }, 'Ilgex': function (_0x1d49c3, _0x1f7695) { return _0x1d49c3 / _0x1f7695; }, 'qboAI': function (_0x5abb98, _0x8cab84) { return _0x5abb98(_0x8cab84); }, 'IZmwM': function (_0x41701d, _0x2c3299) { return _0x41701d(_0x2c3299); } }, _0x4ca3e3 = (_0x56e8e7, _0xebaa29) => { const _0x56a472 = _0xe91a, _0x37a028 = _0x586084['KmOUU'][_0x56a472(0x80d)]('|'); let _0x57831d = 0x27e * -0x5 + 0x2 * -0x5ed + 0x1850; while (!![]) { switch (_0x37a028[_0x57831d++]) { case '0': if (_0xebaa29[_0x56a472(0xba6)]['match'](VisuMZ[_0x56a472(0xc9f)][_0x56a472(0xab9)][_0x56a472(0xe8c) + '2'][_0x398e18])) { var _0xc99570 = _0x586084[_0x56a472(0x2eb)](Number, RegExp['$1']); _0x56e8e7 += _0xc99570; } continue; case '1': if (!_0xebaa29) return _0x56e8e7; continue; case '2': if (_0xebaa29[_0x56a472(0xba6)]['match'](VisuMZ['CoreEngine'][_0x56a472(0xab9)][_0x56a472(0xe8c) + '1'][_0x398e18])) { var _0xc99570 = _0x586084['Ilgex'](_0x586084[_0x56a472(0x414)](Number, RegExp['$1']), 0x1cb4 + -0x28 * -0x31 + -0x23f8); _0x56e8e7 += _0xc99570; } continue; case '3': if (_0xebaa29[_0x56a472(0xba6)][_0x56a472(0x7a8)](VisuMZ[_0x56a472(0xc9f)][_0x56a472(0xab9)][_0x56a472(0xe8c) + 'JS'][_0x398e18])) { var _0x136c9d = _0x586084[_0x56a472(0x2eb)](String, RegExp['$1']); try { _0x56e8e7 += _0x586084[_0x56a472(0xc15)](eval, _0x136c9d); } catch (_0x51d6f3) { if ($gameTemp['isPlaytest']()) console[_0x56a472(0xaee)](_0x51d6f3); } } continue; case '4': return _0x56e8e7; }break; } }; return this['traitObjec' + 'ts']()[_0x1945d9(0x20d)](_0x4ca3e3, -0x4 * -0x836 + 0x209a + -0x2 * 0x20b9); }, Game_BattlerBase['prototype']['sparamRate'] = function (_0x43e079) { const _0x508f40 = _0x3a6da1, _0x4cb3df = { 'UVFLO': _0x508f40(0x6e0), 'jCbjj': function (_0x4fa12b, _0x59bcbb) { return _0x4fa12b(_0x59bcbb); }, 'hkzXo': function (_0x41a570, _0x432400) { return _0x41a570 / _0x432400; }, 'TNuKS': function (_0x354d8, _0x483661) { return _0x354d8(_0x483661); } }, _0x5e0319 = (_0x44a183, _0x1262fa) => { const _0x27d2c4 = _0x508f40, _0x25d8b4 = _0x4cb3df['UVFLO']['split']('|'); let _0x5bc3e0 = 0x861 + -0xba8 + 0x347; while (!![]) { switch (_0x25d8b4[_0x5bc3e0++]) { case '0': if (_0x1262fa[_0x27d2c4(0xba6)]['match'](VisuMZ[_0x27d2c4(0xc9f)][_0x27d2c4(0xab9)]['sparamRate' + 'JS'][_0x43e079])) { var _0x38638f = _0x4cb3df['jCbjj'](String, RegExp['$1']); try { _0x44a183 *= _0x4cb3df[_0x27d2c4(0x7b3)](eval, _0x38638f); } catch (_0x46f106) { if ($gameTemp['isPlaytest']()) console[_0x27d2c4(0xaee)](_0x46f106); } } continue; case '1': if (_0x1262fa[_0x27d2c4(0xba6)][_0x27d2c4(0x7a8)](VisuMZ[_0x27d2c4(0xc9f)]['RegExp']['sparamRate' + '2'][_0x43e079])) { var _0x439402 = _0x4cb3df[_0x27d2c4(0x7b3)](Number, RegExp['$1']); _0x44a183 *= _0x439402; } continue; case '2': if (_0x1262fa[_0x27d2c4(0xba6)]['match'](VisuMZ['CoreEngine']['RegExp'][_0x27d2c4(0xf8c) + '1'][_0x43e079])) { var _0x439402 = _0x4cb3df[_0x27d2c4(0xa07)](_0x4cb3df['TNuKS'](Number, RegExp['$1']), 0x59 + -0x6f * -0x5 + -0x220); _0x44a183 *= _0x439402; } continue; case '3': if (!_0x1262fa) return _0x44a183; continue; case '4': return _0x44a183; }break; } }; return this[_0x508f40(0x43b) + 'ts']()[_0x508f40(0x20d)](_0x5e0319, 0x771 + -0x4 * 0x841 + 0x1994 * 0x1); }, Game_BattlerBase[_0x3a6da1(0x49b)][_0x3a6da1(0xed5) + _0x3a6da1(0xc58)] = function (_0x37d89f) { const _0x41144f = _0x3a6da1, _0x5a1071 = { 'YHGFd': _0x41144f(0xe4b), 'sUpJW': function (_0x15d260, _0x35033d) { return _0x15d260(_0x35033d); }, 'WmxOz': function (_0x532ebf, _0x3fd0a6) { return _0x532ebf / _0x3fd0a6; } }, _0x219e05 = (_0x38db91, _0x34d14d) => { const _0x2bdd3b = _0x41144f, _0x2a2a6a = _0x5a1071[_0x2bdd3b(0xc80)][_0x2bdd3b(0x80d)]('|'); let _0x21d84c = 0x119f * -0x2 + -0x2442 + 0x8f * 0x80; while (!![]) { switch (_0x2a2a6a[_0x21d84c++]) { case '0': if (_0x34d14d[_0x2bdd3b(0xba6)][_0x2bdd3b(0x7a8)](VisuMZ[_0x2bdd3b(0xc9f)][_0x2bdd3b(0xab9)][_0x2bdd3b(0xed5) + 'JS'][_0x37d89f])) { var _0x8b46a6 = _0x5a1071['sUpJW'](String, RegExp['$1']); try { _0x38db91 += _0x5a1071[_0x2bdd3b(0xbcb)](eval, _0x8b46a6); } catch (_0x2931d5) { if ($gameTemp['isPlaytest']()) console[_0x2bdd3b(0xaee)](_0x2931d5); } } continue; case '1': if (_0x34d14d[_0x2bdd3b(0xba6)][_0x2bdd3b(0x7a8)](VisuMZ['CoreEngine'][_0x2bdd3b(0xab9)][_0x2bdd3b(0xed5) + '1'][_0x37d89f])) { var _0x1267b3 = _0x5a1071[_0x2bdd3b(0xfda)](_0x5a1071[_0x2bdd3b(0xbcb)](Number, RegExp['$1']), 0x3e * -0x84 + -0xcee * -0x3 + -0x66e); _0x38db91 += _0x1267b3; } continue; case '2': if (_0x34d14d[_0x2bdd3b(0xba6)]['match'](VisuMZ['CoreEngine'][_0x2bdd3b(0xab9)][_0x2bdd3b(0xed5) + '2'][_0x37d89f])) { var _0x1267b3 = _0x5a1071[_0x2bdd3b(0xbcb)](Number, RegExp['$1']); _0x38db91 += _0x1267b3; } continue; case '3': return _0x38db91; case '4': if (!_0x34d14d) return _0x38db91; continue; }break; } }; return this[_0x41144f(0x43b) + 'ts']()[_0x41144f(0x20d)](_0x219e05, -0x65f + -0x1 * 0xf38 + 0x1597); }, Game_BattlerBase[_0x3a6da1(0x49b)][_0x3a6da1(0xed8)] = function (_0x150b6d) { const _0x3e188d = _0x3a6da1, _0x2747da = { 'FcYMo': function (_0x403ccd, _0x18d9d0) { return _0x403ccd + _0x18d9d0; }, 'mryAU': function (_0x48bf7b, _0x16ed23) { return _0x48bf7b + _0x16ed23; }, 'hlWGV': 'sparam', 'RDqvV': _0x3e188d(0x77c) }; let _0x1e038d = _0x2747da[_0x3e188d(0x693)](_0x2747da[_0x3e188d(0x55c)](_0x2747da[_0x3e188d(0x4eb)], _0x150b6d), _0x2747da['RDqvV']); if (this['checkCache' + _0x3e188d(0x834)](_0x1e038d)) return this[_0x3e188d(0xe43)][_0x1e038d]; return this[_0x3e188d(0xe43)][_0x1e038d] = VisuMZ[_0x3e188d(0xc9f)][_0x3e188d(0x316)][_0x3e188d(0x6ad)][_0x3e188d(0xba8) + 'Formula']['call'](this, _0x150b6d), this[_0x3e188d(0xe43)][_0x1e038d]; }, Game_BattlerBase[_0x3a6da1(0x49b)][_0x3a6da1(0xb66) + _0x3a6da1(0x852)] = function (_0x29dc6c, _0x1f4f27) { const _0x33ff0f = _0x3a6da1, _0x18f689 = { 'UtsAn': function (_0x17081e, _0x3f235a) { return _0x17081e === _0x3f235a; }, 'NupIr': 'number', 'lzzij': function (_0x4f7274, _0x1396af) { return _0x4f7274(_0x1396af); }, 'BIWrJ': function (_0x4b3bf7, _0x6d131f) { return _0x4b3bf7 || _0x6d131f; }, 'DtOkS': _0x33ff0f(0x6b9), 'IyXTY': function (_0x5b24ee, _0xc1e76e) { return _0x5b24ee === _0xc1e76e; }, 'FtXdX': _0x33ff0f(0x4a4), 'BHUsf': _0x33ff0f(0x84e), 'aBopy': _0x33ff0f(0x7e1), 'mOxLb': 'MAT', 'xWker': function (_0x3a5cdf, _0xc3305d) { return _0x3a5cdf === _0xc3305d; }, 'mxCEn': 'MDF', 'PNZdL': function (_0x1a1424, _0x4a5af6) { return _0x1a1424 === _0x4a5af6; }, 'untwg': _0x33ff0f(0x514), 'UqkSF': _0x33ff0f(0xffe), 'THofI': 'HIT', 'fEPJO': function (_0x597181, _0xd4e902) { return _0x597181 + _0xd4e902; }, 'gkkWA': function (_0x3e49b0, _0x88e7e6) { return _0x3e49b0(_0x88e7e6); }, 'IdRCw': function (_0x5ab45d, _0x41efb6) { return _0x5ab45d * _0x41efb6; }, 'fMEJB': 'EVA', 'kTWbm': function (_0x3f4b08, _0x47b325) { return _0x3f4b08 + _0x47b325; }, 'JkUoq': function (_0x49ba87, _0x498302) { return _0x49ba87(_0x498302); }, 'qMvtQ': function (_0x5e675e, _0x391616) { return _0x5e675e * _0x391616; }, 'aFspf': _0x33ff0f(0x27f), 'fQDxg': _0x33ff0f(0xe97), 'acryr': function (_0x59c976, _0x3c3a03) { return _0x59c976 + _0x3c3a03; }, 'wIiae': function (_0x4e9308, _0x3ace79) { return _0x4e9308(_0x3ace79); }, 'VzwZw': function (_0x4ac090, _0x4bb67d) { return _0x4ac090 * _0x4bb67d; }, 'ZKbqS': function (_0x319e7b, _0x25cdfd) { return _0x319e7b === _0x25cdfd; }, 'ULjpa': _0x33ff0f(0x7f2), 'SVvyQ': function (_0x5b428e, _0x580c8e) { return _0x5b428e + _0x580c8e; }, 'RDRSp': function (_0x3abc14, _0x5eaf67) { return _0x3abc14(_0x5eaf67); }, 'OVVND': _0x33ff0f(0x1040), 'gFDWk': function (_0x33189c, _0x20caf9) { return _0x33189c + _0x20caf9; }, 'fWHPR': function (_0x1b3a29, _0x4517c) { return _0x1b3a29(_0x4517c); }, 'Urvjp': function (_0x3228c8, _0x49ee0d) { return _0x3228c8 * _0x49ee0d; }, 'vOtIL': function (_0x2c748f, _0x1ad9d2) { return _0x2c748f === _0x1ad9d2; }, 'Ekvyw': _0x33ff0f(0xf81), 'GwfVj': function (_0x58fd91, _0x5da26b) { return _0x58fd91(_0x5da26b); }, 'UbVgV': _0x33ff0f(0x830), 'OQArg': function (_0x58803e, _0x16a632) { return _0x58803e + _0x16a632; }, 'VylTf': function (_0x2480be, _0x35443f) { return _0x2480be * _0x35443f; }, 'dTJjN': 'MRG', 'hZxTB': function (_0x5c4665, _0x5654f5) { return _0x5c4665 + _0x5654f5; }, 'PDZuv': function (_0x5e1626, _0x17284c) { return _0x5e1626 === _0x17284c; }, 'WwOPZ': _0x33ff0f(0xf6e), 'awUfF': function (_0x5c4cb5, _0x378051) { return _0x5c4cb5(_0x378051); }, 'nlzWr': _0x33ff0f(0xf7b), 'UVjHM': function (_0x27d2e9, _0x2cde81) { return _0x27d2e9 * _0x2cde81; }, 'SQmCn': function (_0x3f8de8, _0x40a05e) { return _0x3f8de8 === _0x40a05e; }, 'IlLQO': 'GRD', 'IBEqU': function (_0x2fccd8, _0x5b8ed3) { return _0x2fccd8(_0x5b8ed3); }, 'gplAO': _0x33ff0f(0x4f4), 'VTMkV': function (_0x4c9298, _0x319868) { return _0x4c9298 + _0x319868; }, 'zxeXf': function (_0x3fd582, _0x2dec51) { return _0x3fd582 * _0x2dec51; }, 'bJLCy': _0x33ff0f(0x1054), 'nvoRe': function (_0x285131, _0x2a4b9) { return _0x285131(_0x2a4b9); }, 'vlOPs': function (_0xeb246, _0x22a7f0) { return _0xeb246 * _0x22a7f0; }, 'eJKLr': function (_0x1114f2, _0x5ac938) { return _0x1114f2 === _0x5ac938; }, 'gIsZe': 'MCR', 'EcDJz': function (_0x496e01, _0x9ee5f2) { return _0x496e01(_0x9ee5f2); }, 'XLqll': function (_0x37a960, _0x449611) { return _0x37a960 === _0x449611; }, 'vWfRR': _0x33ff0f(0x9dd), 'peZPU': function (_0x2f65e8, _0x283493) { return _0x2f65e8 + _0x283493; }, 'TBZUr': function (_0x4bd5fc, _0x5a3e72) { return _0x4bd5fc(_0x5a3e72); }, 'fApgj': _0x33ff0f(0x763), 'DOFSo': function (_0x5599ae, _0x5168c7) { return _0x5599ae(_0x5168c7); }, 'TkOFc': _0x33ff0f(0x371), 'esmYQ': function (_0xdd2370, _0x57b9f0) { return _0xdd2370 + _0x57b9f0; }, 'QazDK': function (_0x2a7480, _0x4b124e) { return _0x2a7480 * _0x4b124e; }, 'JzZVM': 'FDR', 'unDUX': function (_0xfd531, _0x266815) { return _0xfd531 + _0x266815; }, 'pmcXG': function (_0x281b6e, _0x4e60c5) { return _0x281b6e(_0x4e60c5); }, 'PYONS': function (_0x3c2119, _0x9d5327) { return _0x3c2119 * _0x9d5327; }, 'KcjkL': function (_0x5f2fe4, _0xc20fc) { return _0x5f2fe4 === _0xc20fc; }, 'xBIIG': _0x33ff0f(0xf63), 'HnwWa': function (_0x1d6b8b, _0x292092) { return _0x1d6b8b + _0x292092; }, 'DftTg': _0x33ff0f(0x4c7), 'uoxiQ': function (_0x2fb388, _0x459494) { return _0x2fb388 + _0x459494; }, 'fEVsy': function (_0x502bd9, _0x4beeb3) { return _0x502bd9(_0x4beeb3); }, 'maLpa': function (_0x6ae8d0, _0x11ca23) { return _0x6ae8d0 * _0x11ca23; } }; if (_0x18f689[_0x33ff0f(0x609)](typeof paramId, _0x18f689['NupIr'])) return this[_0x33ff0f(0xa58)](_0x29dc6c); _0x29dc6c = _0x18f689[_0x33ff0f(0x436)](String, _0x18f689['BIWrJ'](_0x29dc6c, ''))['toUpperCas' + 'e'](); if (_0x18f689[_0x33ff0f(0x609)](_0x29dc6c, _0x18f689[_0x33ff0f(0x490)])) return this['param'](-0x4a * -0x1 + -0x1 * 0xa7f + -0x367 * -0x3); if (_0x18f689[_0x33ff0f(0x8ed)](_0x29dc6c, _0x18f689[_0x33ff0f(0xb2d)])) return this[_0x33ff0f(0xa58)](0x1daa + -0x1 * -0xfa9 + -0x2 * 0x16a9); if (_0x18f689['UtsAn'](_0x29dc6c, _0x18f689[_0x33ff0f(0x93a)])) return this[_0x33ff0f(0xa58)](0x2c6 * -0x6 + 0x5ab + -0xafb * -0x1); if (_0x18f689[_0x33ff0f(0x8ed)](_0x29dc6c, _0x18f689[_0x33ff0f(0x841)])) return this['param'](0x259a + 0x21d1 + -0x4768); if (_0x18f689[_0x33ff0f(0x609)](_0x29dc6c, _0x18f689['mOxLb'])) return this[_0x33ff0f(0xa58)](-0x8 * 0x51 + 0x18bb + -0x162f); if (_0x18f689['xWker'](_0x29dc6c, _0x18f689[_0x33ff0f(0xa05)])) return this['param'](-0x3 * 0xcd2 + 0x79 * -0x39 + 0x2 * 0x20b6); if (_0x18f689[_0x33ff0f(0xd0e)](_0x29dc6c, _0x18f689[_0x33ff0f(0xa6b)])) return this[_0x33ff0f(0xa58)](-0x1725 + 0xbe1 * 0x1 + 0x5 * 0x242); if (_0x18f689[_0x33ff0f(0x609)](_0x29dc6c, _0x18f689[_0x33ff0f(0xfe6)])) return this[_0x33ff0f(0xa58)](0xa55 * -0x1 + 0x9e3 + 0x79); if (_0x18f689[_0x33ff0f(0xd0e)](_0x29dc6c, _0x18f689[_0x33ff0f(0xcda)])) return _0x1f4f27 ? _0x18f689[_0x33ff0f(0x317)](_0x18f689[_0x33ff0f(0x222)](String, Math[_0x33ff0f(0x48a)](_0x18f689['IdRCw'](this[_0x33ff0f(0x241)](-0x1c65 * 0x1 + 0x1 * 0x854 + 0x1411), -0xa4 * 0x1c + -0x2214 + -0x22f * -0x18))), '%') : this['xparam'](-0x1 * -0x1951 + -0x98f + -0xfc2); if (_0x18f689['UtsAn'](_0x29dc6c, _0x18f689[_0x33ff0f(0xd4c)])) return _0x1f4f27 ? _0x18f689[_0x33ff0f(0x106a)](_0x18f689[_0x33ff0f(0x1009)](String, Math[_0x33ff0f(0x48a)](_0x18f689['qMvtQ'](this['xparam'](0xaf9 + -0x6c * 0x4 + -0xc * 0xc6), 0x20f + -0x13a * 0x18 + 0x1bc5))), '%') : this[_0x33ff0f(0x241)](-0x53 * 0x32 + 0x3f9 + -0x2 * -0x61f); if (_0x18f689['UtsAn'](_0x29dc6c, _0x18f689['aFspf'])) return _0x1f4f27 ? _0x18f689[_0x33ff0f(0x317)](_0x18f689[_0x33ff0f(0x222)](String, Math[_0x33ff0f(0x48a)](_0x18f689[_0x33ff0f(0x8d1)](this[_0x33ff0f(0x241)](0xbb + 0x26 + -0xdf), -0xc * 0x1cf + -0x183b * -0x1 + -0x223))), '%') : this[_0x33ff0f(0x241)](0x217b + 0x7 * -0x143 + -0x18a4); if (_0x18f689[_0x33ff0f(0x609)](_0x29dc6c, _0x18f689[_0x33ff0f(0xe2d)])) return _0x1f4f27 ? _0x18f689[_0x33ff0f(0xa56)](_0x18f689[_0x33ff0f(0xf48)](String, Math[_0x33ff0f(0x48a)](_0x18f689['VzwZw'](this[_0x33ff0f(0x241)](0x1d39 + -0x3cb * 0x2 + -0x20 * 0xad), -0x1d5e + 0x1836 * -0x1 + 0x35f8))), '%') : this[_0x33ff0f(0x241)](0x12a3 * 0x2 + 0x11 * -0x6b + 0x78a * -0x4); if (_0x18f689[_0x33ff0f(0x2aa)](_0x29dc6c, _0x18f689[_0x33ff0f(0xa98)])) return _0x1f4f27 ? _0x18f689[_0x33ff0f(0x42c)](_0x18f689[_0x33ff0f(0x3a6)](String, Math[_0x33ff0f(0x48a)](_0x18f689[_0x33ff0f(0x8d1)](this[_0x33ff0f(0x241)](-0x3c * -0x8a + 0x1f3 * -0x7 + 0x1 * -0x12af), 0x5e * 0x51 + 0x44 * 0x47 + -0x6 * 0x809))), '%') : this['xparam'](0x3 * 0x61f + 0x32 * -0x10 + -0xf39); if (_0x18f689[_0x33ff0f(0x1091)](_0x29dc6c, _0x18f689[_0x33ff0f(0xdd1)])) return _0x1f4f27 ? _0x18f689['gFDWk'](_0x18f689[_0x33ff0f(0x8c1)](String, Math['round'](_0x18f689[_0x33ff0f(0x4be)](this[_0x33ff0f(0x241)](-0x44 * -0x1 + 0x1840 + -0x187f), -0xb * -0x37a + 0x18fd * 0x1 + 0x1 * -0x3ed7))), '%') : this[_0x33ff0f(0x241)](-0x2519 * 0x1 + -0xc71 + 0x1085 * 0x3); if (_0x18f689[_0x33ff0f(0x1e3)](_0x29dc6c, _0x18f689[_0x33ff0f(0xb13)])) return _0x1f4f27 ? _0x18f689[_0x33ff0f(0x317)](_0x18f689[_0x33ff0f(0x9ad)](String, Math[_0x33ff0f(0x48a)](_0x18f689['VzwZw'](this['xparam'](0x8a * -0x42 + -0x741 + -0xe49 * -0x3), 0xc * -0x2b1 + 0x1fde * 0x1 + 0xd2))), '%') : this[_0x33ff0f(0x241)](0x527 * 0x2 + 0x179a * -0x1 + 0x6a9 * 0x2); if (_0x18f689[_0x33ff0f(0xd0e)](_0x29dc6c, _0x18f689['UbVgV'])) return _0x1f4f27 ? _0x18f689['OQArg'](_0x18f689[_0x33ff0f(0xf48)](String, Math['round'](_0x18f689[_0x33ff0f(0x106d)](this[_0x33ff0f(0x241)](-0x2 * 0x1015 + -0x4b2 + 0x24e3), 0x1 * -0x64c + 0x1 * 0x751 + -0xa1))), '%') : this[_0x33ff0f(0x241)](-0x855 + -0x951 + 0x1 * 0x11ad); if (_0x18f689['IyXTY'](_0x29dc6c, _0x18f689[_0x33ff0f(0x109d)])) return _0x1f4f27 ? _0x18f689[_0x33ff0f(0x6a4)](_0x18f689[_0x33ff0f(0xf48)](String, Math[_0x33ff0f(0x48a)](_0x18f689[_0x33ff0f(0x8d1)](this[_0x33ff0f(0x241)](0x11a9 * -0x1 + -0x63 * -0x33 + -0x208), 0x13da + 0x1f5a + 0x8 * -0x65a))), '%') : this[_0x33ff0f(0x241)](-0x3fc * -0x7 + 0x595 * 0x1 + 0x1 * -0x2171); if (_0x18f689[_0x33ff0f(0xe8f)](_0x29dc6c, _0x18f689[_0x33ff0f(0xafe)])) return _0x1f4f27 ? _0x18f689[_0x33ff0f(0x106a)](_0x18f689['awUfF'](String, Math[_0x33ff0f(0x48a)](_0x18f689[_0x33ff0f(0xb0b)](this['xparam'](-0xa81 + -0x1231 * -0x2 + -0x19d8), 0x4be * 0x1 + 0xb95 + 0xfef * -0x1))), '%') : this['xparam'](0x25 * -0xd4 + -0x2475 + 0xd * 0x52a); if (_0x18f689[_0x33ff0f(0x1091)](_0x29dc6c, _0x18f689[_0x33ff0f(0x273)])) return _0x1f4f27 ? _0x18f689[_0x33ff0f(0x106a)](_0x18f689[_0x33ff0f(0x436)](String, Math[_0x33ff0f(0x48a)](_0x18f689['UVjHM'](this['sparam'](0x7c2 * -0x1 + -0x76e + 0xf30), 0x1e58 + 0x10dd + -0x55 * 0x8d))), '%') : this[_0x33ff0f(0xed8)](-0x8ea * -0x1 + -0x466 + -0x242 * 0x2); if (_0x18f689[_0x33ff0f(0xaae)](_0x29dc6c, _0x18f689[_0x33ff0f(0x1070)])) return _0x1f4f27 ? _0x18f689['fEPJO'](_0x18f689[_0x33ff0f(0x43c)](String, Math['round'](_0x18f689['IdRCw'](this[_0x33ff0f(0xed8)](-0xcf6 + -0x1651 + 0x11a4 * 0x2), -0x2701 + 0xa * 0xec + 0x1 * 0x1e2d))), '%') : this['sparam'](0x3f * 0x2f + -0x19b + -0x9f5 * 0x1); if (_0x18f689[_0x33ff0f(0xaae)](_0x29dc6c, _0x18f689[_0x33ff0f(0x108a)])) return _0x1f4f27 ? _0x18f689[_0x33ff0f(0x9fd)](_0x18f689[_0x33ff0f(0x3a6)](String, Math[_0x33ff0f(0x48a)](_0x18f689['zxeXf'](this[_0x33ff0f(0xed8)](-0xe * -0x2a1 + 0x1 * 0xed + 0x25 * -0x105), -0x1 * -0x1517 + 0xd * 0x241 + -0x280 * 0x14))), '%') : this[_0x33ff0f(0xed8)](0x26ad + -0x67a + -0x7b * 0x43); if (_0x18f689['SQmCn'](_0x29dc6c, _0x18f689[_0x33ff0f(0xfd4)])) return _0x1f4f27 ? _0x18f689[_0x33ff0f(0x317)](_0x18f689[_0x33ff0f(0xb69)](String, Math[_0x33ff0f(0x48a)](_0x18f689['vlOPs'](this[_0x33ff0f(0xed8)](0x25bc + 0x3c9 + -0x2982), -0x3 * -0x2af + -0x2a * -0x79 + -0x1b83))), '%') : this[_0x33ff0f(0xed8)](0x256f + 0x31c * -0x3 + 0xe8 * -0x1f); if (_0x18f689[_0x33ff0f(0x1dd)](_0x29dc6c, _0x18f689['gIsZe'])) return _0x1f4f27 ? _0x18f689[_0x33ff0f(0xc5d)](_0x18f689[_0x33ff0f(0x731)](String, Math[_0x33ff0f(0x48a)](_0x18f689[_0x33ff0f(0x106d)](this['sparam'](-0x2 * -0xcbb + 0x58d + 0x73 * -0x45), 0x3 * 0x1a9 + -0x4e1 * 0x3 + 0xa0c))), '%') : this['sparam'](0x17b9 * -0x1 + 0x1b2b + -0x36e); if (_0x18f689[_0x33ff0f(0x4e3)](_0x29dc6c, _0x18f689[_0x33ff0f(0xeb1)])) return _0x1f4f27 ? _0x18f689[_0x33ff0f(0x507)](_0x18f689['TBZUr'](String, Math[_0x33ff0f(0x48a)](_0x18f689[_0x33ff0f(0xdb6)](this['sparam'](0x100c + 0x1 * 0x22db + -0x32e2), -0x13f9 + -0x1c04 + 0x3061))), '%') : this['sparam'](-0xc4 * 0xb + -0xa2 * -0x5 + 0x547); if (_0x18f689['UtsAn'](_0x29dc6c, _0x18f689[_0x33ff0f(0x2c6)])) return _0x1f4f27 ? _0x18f689[_0x33ff0f(0x317)](_0x18f689[_0x33ff0f(0x1020)](String, Math[_0x33ff0f(0x48a)](_0x18f689[_0x33ff0f(0x9cc)](this['sparam'](-0x26b9 * -0x1 + 0xffe + -0x36b1), 0x17ea * 0x1 + 0x137 * -0x1 + -0x164f))), '%') : this[_0x33ff0f(0xed8)](-0x1db4 + -0xe29 + -0xf * -0x2ed); if (_0x18f689[_0x33ff0f(0x2aa)](_0x29dc6c, _0x18f689[_0x33ff0f(0x918)])) return _0x1f4f27 ? _0x18f689[_0x33ff0f(0xae4)](_0x18f689['RDRSp'](String, Math[_0x33ff0f(0x48a)](_0x18f689[_0x33ff0f(0x7f8)](this[_0x33ff0f(0xed8)](0x1c15 + -0x11bc + 0x1 * -0xa52), -0x1035 + 0x75f * -0x4 + -0x2f * -0xfb))), '%') : this['sparam'](0x45d * 0x1 + 0x176 + -0x5cc); if (_0x18f689[_0x33ff0f(0x1dd)](_0x29dc6c, _0x18f689[_0x33ff0f(0xbc0)])) return _0x1f4f27 ? _0x18f689[_0x33ff0f(0xac7)](_0x18f689['pmcXG'](String, Math[_0x33ff0f(0x48a)](_0x18f689[_0x33ff0f(0x993)](this[_0x33ff0f(0xed8)](-0x256 * 0x2 + 0x1 * -0x121e + 0x16d2), -0x14da * -0x1 + 0xd1 * 0x1f + 0x2dc5 * -0x1))), '%') : this['sparam'](-0x5c + 0x248f + 0xc5 * -0x2f); if (_0x18f689[_0x33ff0f(0x8a2)](_0x29dc6c, _0x18f689[_0x33ff0f(0xb4e)])) return _0x1f4f27 ? _0x18f689[_0x33ff0f(0xfa2)](_0x18f689['wIiae'](String, Math[_0x33ff0f(0x48a)](_0x18f689[_0x33ff0f(0x4be)](this['sparam'](-0x896 + 0x22d8 + -0x1a39), -0x15a2 + 0x1 * 0xf6f + 0x697))), '%') : this[_0x33ff0f(0xed8)](0x1dbe + 0x1c11 + 0x3 * -0x1342); if (VisuMZ[_0x33ff0f(0xc9f)][_0x33ff0f(0xf93) + 'mAbb'][_0x29dc6c]) { const _0x2d4cb8 = VisuMZ[_0x33ff0f(0xc9f)][_0x33ff0f(0xf93) + 'mAbb'][_0x29dc6c], _0xa24f08 = this[_0x2d4cb8]; return _0x18f689[_0x33ff0f(0xaae)](VisuMZ[_0x33ff0f(0xc9f)][_0x33ff0f(0xf93) + _0x33ff0f(0x46f)][_0x29dc6c], _0x18f689[_0x33ff0f(0xd75)]) ? _0xa24f08 : _0x1f4f27 ? _0x18f689[_0x33ff0f(0xcc9)](_0x18f689['fEVsy'](String, Math[_0x33ff0f(0x48a)](_0x18f689[_0x33ff0f(0xae0)](_0xa24f08, 0x2031 + 0x1e2 * 0x1 + -0x1 * 0x21af))), '%') : _0xa24f08; } return ''; }, Game_BattlerBase[_0x3a6da1(0x49b)][_0x3a6da1(0xd1a)] = function () { const _0x4f544e = _0x3a6da1, _0x5b3938 = { 'RvVem': function (_0x472de8, _0x4cc39a) { return _0x472de8 < _0x4cc39a; }, 'LZVId': function (_0x5c55bd, _0x37a6f8) { return _0x5c55bd * _0x37a6f8; } }; return this[_0x4f544e(0x33f)]() && _0x5b3938['RvVem'](this[_0x4f544e(0xca7)], _0x5b3938[_0x4f544e(0x9bd)](this[_0x4f544e(0x9a7)], VisuMZ[_0x4f544e(0xc9f)][_0x4f544e(0x316)][_0x4f544e(0x6ad)][_0x4f544e(0xd53)])); }, Game_Battler[_0x3a6da1(0x49b)][_0x3a6da1(0x423) + 's'] = function () { const _0x2fceb3 = _0x3a6da1, _0x6ed7ff = { 'vhibB': _0x2fceb3(0x72d) }; SoundManager[_0x2fceb3(0xbe4)](), this[_0x2fceb3(0x1004) + 'ion'](_0x6ed7ff[_0x2fceb3(0x59a)]); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xedb) + '_paramBase'] = Game_Actor[_0x3a6da1(0x49b)][_0x3a6da1(0xc1d)], Game_Actor[_0x3a6da1(0x49b)][_0x3a6da1(0xc1d)] = function (_0x3ce76e) { const _0x466b6c = _0x3a6da1, _0x4fe3b3 = { 'VXmjy': function (_0x419630, _0x5293c5) { return _0x419630 > _0x5293c5; } }; if (_0x4fe3b3[_0x466b6c(0x5cc)](this[_0x466b6c(0x512)], 0x1f0f + 0x2338 + -0x41e4)) return this[_0x466b6c(0x984) + _0x466b6c(0x729) + '9'](_0x3ce76e); return VisuMZ[_0x466b6c(0xc9f)]['Game_Actor' + _0x466b6c(0x8fd)][_0x466b6c(0xedc)](this, _0x3ce76e); }, Game_Actor[_0x3a6da1(0x49b)]['paramBaseA' + _0x3a6da1(0x729) + '9'] = function (_0x7e5df4) { const _0x5f52da = _0x3a6da1, _0x25533b = { 'fjpdj': function (_0x42ba12, _0x1d2dc6) { return _0x42ba12 + _0x1d2dc6; }, 'IiaQr': function (_0x395c81, _0x50a0f9) { return _0x395c81 * _0x50a0f9; }, 'cliyG': function (_0x15547c, _0x2c730a) { return _0x15547c - _0x2c730a; }, 'EZsKQ': function (_0x29214c, _0x4ccaa4) { return _0x29214c - _0x4ccaa4; } }, _0x27d037 = this[_0x5f52da(0x9f4) + 'ss']()['params'][_0x7e5df4][0x7 * 0xd + -0x1f33 * -0x1 + -0x1f2b], _0x505d00 = this[_0x5f52da(0x9f4) + 'ss']()[_0x5f52da(0xdd6)][_0x7e5df4][0xb * -0x119 + -0x2 * 0xb11 + -0x6eb * -0x5]; return _0x25533b[_0x5f52da(0x4cb)](_0x27d037, _0x25533b[_0x5f52da(0xc54)](_0x25533b[_0x5f52da(0x3a1)](_0x27d037, _0x505d00), _0x25533b[_0x5f52da(0xd98)](this[_0x5f52da(0x512)], 0xcb1 * 0x3 + 0xee3 + -0x3493))); }, VisuMZ['CoreEngine']['Game_Actor' + _0x3a6da1(0x84b) + 'ss'] = Game_Actor['prototype'][_0x3a6da1(0xb82) + 's'], Game_Actor[_0x3a6da1(0x49b)][_0x3a6da1(0xb82) + 's'] = function (_0x2e35d6, _0x9be871) { const _0x4bbe11 = _0x3a6da1; $gameTemp[_0x4bbe11(0xe68) + 'lass'] = !![], VisuMZ[_0x4bbe11(0xc9f)]['Game_Actor' + _0x4bbe11(0x84b) + 'ss']['call'](this, _0x2e35d6, _0x9be871), $gameTemp[_0x4bbe11(0xe68) + _0x4bbe11(0x7eb)] = undefined; }, VisuMZ[_0x3a6da1(0xc9f)]['Game_Actor' + _0x3a6da1(0x7a9)] = Game_Actor[_0x3a6da1(0x49b)][_0x3a6da1(0xdbc)], Game_Actor['prototype'][_0x3a6da1(0xdbc)] = function () { const _0x5b625c = _0x3a6da1; VisuMZ[_0x5b625c(0xc9f)][_0x5b625c(0xedb) + _0x5b625c(0x7a9)][_0x5b625c(0xedc)](this); if (!$gameTemp['_changingC' + _0x5b625c(0x7eb)]) this['levelUpRec' + _0x5b625c(0xc1c)](); }, Game_Actor['prototype'][_0x3a6da1(0x500) + _0x3a6da1(0xc1c)] = function () { const _0x5283b1 = _0x3a6da1; this[_0x5283b1(0xe43)] = {}; if (VisuMZ['CoreEngine'][_0x5283b1(0x316)]['QoL'][_0x5283b1(0x1015) + _0x5283b1(0x892)]) this[_0x5283b1(0xca7)] = this[_0x5283b1(0x9a7)]; if (VisuMZ[_0x5283b1(0xc9f)][_0x5283b1(0x316)][_0x5283b1(0xfee)][_0x5283b1(0x1015) + 'lMp']) this[_0x5283b1(0x453)] = this['mmp']; }, Game_Actor[_0x3a6da1(0x49b)][_0x3a6da1(0xcf9)] = function () { const _0x4e55ab = _0x3a6da1, _0x47db16 = { 'wELgo': function (_0x462dca, _0x377316) { return _0x462dca - _0x377316; }, 'OCaCG': function (_0x57ce6d, _0xa8712e) { return _0x57ce6d - _0xa8712e; }, 'sLZXL': function (_0x3e388f, _0x1472e5) { return _0x3e388f / _0x1472e5; } }; if (this[_0x4e55ab(0xeec)]()) return -0x84d + 0x1c3f * -0x1 + -0xc2f * -0x3; const _0x37c432 = _0x47db16['wELgo'](this['nextLevelE' + 'xp'](), this[_0x4e55ab(0x422) + _0x4e55ab(0xd7f)]()), _0x5eaf94 = _0x47db16[_0x4e55ab(0x2ad)](this['currentExp'](), this[_0x4e55ab(0x422) + _0x4e55ab(0xd7f)]()); return _0x47db16[_0x4e55ab(0x380)](_0x5eaf94, _0x37c432)['clamp'](-0x1 * 0x15b2 + -0x1d0 + 0x66 * 0x3b, 0x23b * 0x8 + -0x1ca5 + 0xace); }, Game_Actor[_0x3a6da1(0x49b)]['traitObjec' + 'ts'] = function () { const _0x5df289 = _0x3a6da1, _0x105ae3 = Game_Battler['prototype'][_0x5df289(0x43b) + 'ts'][_0x5df289(0xedc)](this); for (const _0x1c3349 of this['equips']()) { _0x1c3349 && _0x105ae3[_0x5df289(0x92f)](_0x1c3349); } return _0x105ae3['push'](this[_0x5df289(0x9f4) + 'ss'](), this['actor']()), _0x105ae3; }, Object[_0x3a6da1(0xb5b) + 'erty'](Game_Enemy[_0x3a6da1(0x49b)], _0x3a6da1(0x512), { 'get': function () { const _0x5584ac = _0x3a6da1; return this[_0x5584ac(0x3f6)](); }, 'configurable': !![] }), Game_Enemy[_0x3a6da1(0x49b)][_0x3a6da1(0x3f6)] = function () { const _0x47ed62 = _0x3a6da1; return this[_0x47ed62(0x789)]()[_0x47ed62(0x512)]; }, Game_Enemy[_0x3a6da1(0x49b)][_0x3a6da1(0x4dc) + _0x3a6da1(0x8de) + _0x3a6da1(0xb67)] = function () { const _0x5c4c8f = _0x3a6da1, _0x1d3bb2 = { 'ZDVHf': function (_0x4c9a24, _0x44890b) { return _0x4c9a24 / _0x44890b; }, 'XhNPO': function (_0x18941c, _0x48b1c6) { return _0x18941c - _0x48b1c6; }, 'huPTe': function (_0x5e341d, _0x7a6079) { return _0x5e341d - _0x7a6079; }, 'gdsCN': function (_0x4005e3, _0x2f6a55) { return _0x4005e3 / _0x2f6a55; } }; !this['_repositio' + _0x5c4c8f(0xaa6)] && (this['_screenY'] += Math['round'](_0x1d3bb2['ZDVHf'](_0x1d3bb2[_0x5c4c8f(0x3d3)](Graphics['height'], -0x1 * 0x3e8 + 0x1c9c * -0x1 + -0x1 * -0x22f4), 0x2 * 0x1143 + -0x7 * 0x488 + -0x1 * 0x2cc)), this[_0x5c4c8f(0xfb6)] -= Math[_0x5c4c8f(0x719)](_0x1d3bb2['ZDVHf'](_0x1d3bb2['XhNPO'](Graphics['height'], Graphics['boxHeight']), 0x4 * 0x445 + 0x1 * 0x2f9 + 0x2dd * -0x7)), $gameSystem['isSideView']() ? this[_0x5c4c8f(0x695)] -= Math['floor'](_0x1d3bb2['ZDVHf'](_0x1d3bb2[_0x5c4c8f(0xfae)](Graphics[_0x5c4c8f(0x4c0)], Graphics[_0x5c4c8f(0xa90)]), 0xcf3 + 0x76 * 0x3c + 0x223 * -0x13)) : this[_0x5c4c8f(0x695)] += Math[_0x5c4c8f(0x48a)](_0x1d3bb2[_0x5c4c8f(0x58b)](_0x1d3bb2[_0x5c4c8f(0x3d3)](Graphics['boxWidth'], 0x4 * -0x7df + 0x1b7b * -0x1 + 0x3e27), -0x21cc + 0x945 + 0x1889))), this[_0x5c4c8f(0x53e) + _0x5c4c8f(0xaa6)] = !![]; }, Game_Party[_0x3a6da1(0x49b)][_0x3a6da1(0x1fa)] = function () { const _0x2f6c4a = _0x3a6da1; return VisuMZ[_0x2f6c4a(0xc9f)][_0x2f6c4a(0x316)][_0x2f6c4a(0x320)][_0x2f6c4a(0x5ce)]; }, VisuMZ['CoreEngine'][_0x3a6da1(0x313) + _0x3a6da1(0x2f8) + 'em'] = Game_Party[_0x3a6da1(0x49b)]['consumeIte' + 'm'], Game_Party[_0x3a6da1(0x49b)]['consumeIte' + 'm'] = function (_0x1298bf) { const _0x672965 = _0x3a6da1; if (VisuMZ[_0x672965(0xc9f)][_0x672965(0x316)]['QoL'][_0x672965(0xe6f) + _0x672965(0x4b1)] && DataManager[_0x672965(0x3fc)](_0x1298bf)) return; VisuMZ[_0x672965(0xc9f)]['Game_Party' + _0x672965(0x2f8) + 'em'][_0x672965(0xedc)](this, _0x1298bf); }, Game_Party[_0x3a6da1(0x49b)][_0x3a6da1(0x3c4) + 'eTestItems'] = function () { const _0x3cad4a = _0x3a6da1, _0x57692c = { 'ZSDDV': function (_0x437940, _0x3da651) { return _0x437940 <= _0x3da651; } }, _0x21f59c = VisuMZ[_0x3cad4a(0xc9f)][_0x3cad4a(0x316)]['QoL'], _0x54e27d = _0x21f59c[_0x3cad4a(0xd62) + _0x3cad4a(0x362)] ?? 0x1bd9 + -0x5bb + -0x15bb; let _0x42e8b3 = []; (_0x21f59c[_0x3cad4a(0x510)] ?? !![]) && (_0x42e8b3 = _0x42e8b3['concat']($dataItems)); (_0x21f59c[_0x3cad4a(0x780) + 'ns'] ?? !![]) && (_0x42e8b3 = _0x42e8b3[_0x3cad4a(0xb7f)]($dataWeapons)); (_0x21f59c[_0x3cad4a(0xf6f) + 's'] ?? !![]) && (_0x42e8b3 = _0x42e8b3[_0x3cad4a(0xb7f)]($dataArmors)); for (const _0x51cce2 of _0x42e8b3) { if (!_0x51cce2) continue; if (_0x57692c[_0x3cad4a(0x36f)](_0x51cce2['name'][_0x3cad4a(0x2d6)](), 0x1b9a + -0x1 * 0xaf + -0x1aeb)) continue; if (_0x51cce2['name'][_0x3cad4a(0x7a8)](/-----/i)) continue; this['gainItem'](_0x51cce2, _0x54e27d); } }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x6e6) + _0x3a6da1(0xeba)] = Game_Troop[_0x3a6da1(0x49b)][_0x3a6da1(0xdd9)], Game_Troop[_0x3a6da1(0x49b)][_0x3a6da1(0xdd9)] = function (_0x3dacc4) { const _0x593c1b = _0x3a6da1; $gameTemp[_0x593c1b(0x72c) + _0x593c1b(0xba1) + 'SettingsCo' + 'reEngine'](), $gameTemp[_0x593c1b(0x60d) + 'dGameTroop' + _0x593c1b(0x37f) + 'reEngine'](_0x3dacc4), VisuMZ[_0x593c1b(0xc9f)][_0x593c1b(0x6e6) + _0x593c1b(0xeba)][_0x593c1b(0xedc)](this, _0x3dacc4); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xcfd) + _0x3a6da1(0x9ef)] = Game_Map[_0x3a6da1(0x49b)]['setup'], Game_Map[_0x3a6da1(0x49b)]['setup'] = function (_0x5a4498) { const _0x708ec2 = _0x3a6da1; VisuMZ[_0x708ec2(0xc9f)][_0x708ec2(0xcfd) + _0x708ec2(0x9ef)][_0x708ec2(0xedc)](this, _0x5a4498), this[_0x708ec2(0xa78) + _0x708ec2(0xdf7) + _0x708ec2(0x91c)](), this[_0x708ec2(0xff4) + _0x708ec2(0x573)](_0x5a4498); }, Game_Map[_0x3a6da1(0x49b)]['setupCoreE' + _0x3a6da1(0x573)] = function () { const _0x5949f2 = _0x3a6da1, _0x3f6ea3 = { 'LFQsc': function (_0x41c9b2, _0x2b44cd) { return _0x41c9b2(_0x2b44cd); }, 'JqubV': function (_0x32f95e, _0x490dd6) { return _0x32f95e(_0x490dd6); } }; this[_0x5949f2(0x863) + 'hadows'] = VisuMZ['CoreEngine'][_0x5949f2(0x316)][_0x5949f2(0xfee)]['NoTileShad' + _0x5949f2(0xbea)] || ![]; const _0x54f99f = VisuMZ[_0x5949f2(0xc9f)][_0x5949f2(0x316)][_0x5949f2(0x5ac) + _0x5949f2(0x2c5)], _0x5eef94 = $dataMap ? $dataMap[_0x5949f2(0xba6)] || '' : ''; if (_0x5eef94[_0x5949f2(0x7a8)](/<SHOW TILE SHADOWS>/i)) this['_hideTileS' + 'hadows'] = ![]; else _0x5eef94[_0x5949f2(0x7a8)](/<HIDE TILE SHADOWS>/i) && (this[_0x5949f2(0x863) + _0x5949f2(0xcdb)] = !![]); if (_0x5eef94[_0x5949f2(0x7a8)](/<SCROLL LOCK X>/i)) this['centerCame' + _0x5949f2(0x3ca) + 'a']()[_0x5949f2(0x6f3)] = !![], this[_0x5949f2(0x6d5) + 'raCheckDat' + 'a']()['displayX'] = _0x54f99f[_0x5949f2(0xd51) + 'kX']; else _0x5eef94[_0x5949f2(0x7a8)](/<SCROLL LOCK X: (.*?)>/i) && (this[_0x5949f2(0x6d5) + _0x5949f2(0x3ca) + 'a']()['centerX'] = !![], this['centerCame' + _0x5949f2(0x3ca) + 'a']()['displayX'] = _0x3f6ea3[_0x5949f2(0x91f)](Number, RegExp['$1'])); if (_0x5eef94[_0x5949f2(0x7a8)](/<SCROLL LOCK Y>/i)) this[_0x5949f2(0x6d5) + _0x5949f2(0x3ca) + 'a']()[_0x5949f2(0xf1d)] = !![], this[_0x5949f2(0x6d5) + _0x5949f2(0x3ca) + 'a']()[_0x5949f2(0xc3b)] = _0x54f99f[_0x5949f2(0xd51) + 'kY']; else _0x5eef94['match'](/<SCROLL LOCK Y: (.*?)>/i) && (this['centerCame' + _0x5949f2(0x3ca) + 'a']()[_0x5949f2(0xf1d)] = !![], this[_0x5949f2(0x6d5) + 'raCheckDat' + 'a']()['displayY'] = _0x3f6ea3[_0x5949f2(0x5e9)](Number, RegExp['$1'])); }, Game_Map[_0x3a6da1(0x49b)]['areTileSha' + _0x3a6da1(0xa65)] = function () { const _0x375f69 = _0x3a6da1, _0x20ba8b = { 'jADRj': function (_0x4d5e9a, _0x6eaeba) { return _0x4d5e9a === _0x6eaeba; } }; if (_0x20ba8b[_0x375f69(0x373)](this['_hideTileS' + _0x375f69(0xcdb)], undefined)) this[_0x375f69(0xff4) + _0x375f69(0x573)](); return this[_0x375f69(0x863) + 'hadows']; }, Game_Map['prototype'][_0x3a6da1(0xa78) + 'ngineDispl' + 'ayCenter'] = function () { const _0x1f70f1 = _0x3a6da1, _0x4bf0e7 = { 'SEblB': function (_0x37cd17, _0x3016fb) { return _0x37cd17 / _0x3016fb; }, 'vgrCh': function (_0x1a6c2c, _0x128847) { return _0x1a6c2c !== _0x128847; }, 'Hrsyn': function (_0x506552, _0x38801b) { return _0x506552 % _0x38801b; }, 'dMswv': function (_0x23ed8c, _0x52484c) { return _0x23ed8c === _0x52484c; }, 'zfspc': function (_0x37aeb7, _0x133fd9) { return _0x37aeb7 / _0x133fd9; }, 'kiGPM': function (_0x264a33, _0x364bd3) { return _0x264a33 !== _0x364bd3; } }, _0x2a0a85 = VisuMZ['CoreEngine']['Settings'][_0x1f70f1(0x5ac) + _0x1f70f1(0x2c5)]; this['_centerCam' + 'eraCheck'] = { 'centerX': ![], 'centerY': ![], 'displayX': 0x0, 'displayY': 0x0 }; if (_0x2a0a85['AutoScroll' + 'LockX']) { const _0x3d4298 = _0x4bf0e7[_0x1f70f1(0xaf9)](Graphics[_0x1f70f1(0x4c0)], this['tileWidth']()); _0x4bf0e7[_0x1f70f1(0xd9b)](_0x4bf0e7[_0x1f70f1(0x7b7)](_0x3d4298, 0x199 * -0x4 + -0x1 * -0x22e5 + -0x1c8 * 0x10), 0x7 * 0x520 + 0x3 * -0x62c + -0x115c) && _0x4bf0e7[_0x1f70f1(0x271)](Math[_0x1f70f1(0xa25)](_0x3d4298), this['width']()) && !this[_0x1f70f1(0x629) + _0x1f70f1(0xca9)]() && (this[_0x1f70f1(0x7ba) + _0x1f70f1(0x1046)][_0x1f70f1(0x6f3)] = !![], this['_centerCam' + 'eraCheck'][_0x1f70f1(0xc91)] = _0x2a0a85[_0x1f70f1(0xd51) + 'kX'] || -0x1687 + -0x1430 + -0xf3 * -0x2d); } if (_0x2a0a85[_0x1f70f1(0x441) + _0x1f70f1(0x560)]) { const _0x3afbdc = _0x4bf0e7[_0x1f70f1(0x78e)](Graphics[_0x1f70f1(0x944)], this['tileHeight']()); _0x4bf0e7['kiGPM'](_0x4bf0e7[_0x1f70f1(0x7b7)](_0x3afbdc, -0x577 + -0xb * 0x4f + 0x8dd), -0x256 * 0xe + -0x9f6 + 0x2aaa) && _0x4bf0e7['dMswv'](Math[_0x1f70f1(0xa25)](_0x3afbdc), this[_0x1f70f1(0x944)]()) && !this['isLoopVert' + _0x1f70f1(0xbbf)]() && (this[_0x1f70f1(0x7ba) + 'eraCheck']['centerY'] = !![], this['_centerCam' + 'eraCheck'][_0x1f70f1(0xc3b)] = _0x2a0a85['DisplayLoc' + 'kY'] || -0x22a + -0x1652 + 0x187c); } _0x4bf0e7[_0x1f70f1(0x271)]($gameScreen[_0x1f70f1(0xa4d)](), -0x1020 + -0x11c3 * 0x1 + 0x1 * 0x21e4) && (this['centerCame' + _0x1f70f1(0x3ca) + 'a']()[_0x1f70f1(0x6f3)] && (this['_displayX'] = this[_0x1f70f1(0x6d5) + _0x1f70f1(0x3ca) + 'a']()[_0x1f70f1(0xc91)]), this['centerCame' + _0x1f70f1(0x3ca) + 'a']()['centerY'] && (this[_0x1f70f1(0x2da)] = this[_0x1f70f1(0x6d5) + _0x1f70f1(0x3ca) + 'a']()[_0x1f70f1(0xc3b)])); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xcfd) + _0x3a6da1(0xba9) + 'os'] = Game_Map[_0x3a6da1(0x49b)][_0x3a6da1(0x7c7) + _0x3a6da1(0x3b3)], Game_Map[_0x3a6da1(0x49b)]['setDisplay' + 'Pos'] = function (_0x8fb8c5, _0x5b6cd1) { const _0x1aced8 = _0x3a6da1, _0x503608 = { 'NJNfw': function (_0x516816, _0x2e5ce6) { return _0x516816 === _0x2e5ce6; } }; VisuMZ['CoreEngine'][_0x1aced8(0xcfd) + 'etDisplayP' + 'os'][_0x1aced8(0xedc)](this, _0x8fb8c5, _0x5b6cd1), _0x503608[_0x1aced8(0x5de)]($gameScreen['zoomScale'](), -0x175 + -0x1 * 0x311 + 0x487) && (!this['isLoopHori' + _0x1aced8(0xca9)]() && this[_0x1aced8(0x6d5) + _0x1aced8(0x3ca) + 'a']()[_0x1aced8(0x6f3)] && (this['_displayX'] = this[_0x1aced8(0x6d5) + _0x1aced8(0x3ca) + 'a']()[_0x1aced8(0xc91)]), !this[_0x1aced8(0x97d) + _0x1aced8(0xbbf)]() && this[_0x1aced8(0x6d5) + _0x1aced8(0x3ca) + 'a']()[_0x1aced8(0xf1d)] && (this[_0x1aced8(0x2da)] = this[_0x1aced8(0x6d5) + _0x1aced8(0x3ca) + 'a']()[_0x1aced8(0xc3b)])); }, Game_Map[_0x3a6da1(0x49b)]['centerCame' + _0x3a6da1(0x3ca) + 'a'] = function () { const _0x2521f5 = _0x3a6da1, _0x996687 = { 'Ljzyi': function (_0x2b0934, _0x36ac49) { return _0x2b0934 === _0x36ac49; } }; if (_0x996687[_0x2521f5(0xec4)](this['_centerCam' + _0x2521f5(0x1046)], undefined)) this['checkCoreE' + _0x2521f5(0xdf7) + _0x2521f5(0x91c)](); return this[_0x2521f5(0x7ba) + _0x2521f5(0x1046)]; }, VisuMZ[_0x3a6da1(0xc9f)]['Game_Map_s' + _0x3a6da1(0x839)] = Game_Map[_0x3a6da1(0x49b)][_0x3a6da1(0x1023)], Game_Map[_0x3a6da1(0x49b)][_0x3a6da1(0x1023)] = function (_0x131060) { const _0x3cd4b0 = _0x3a6da1, _0x162dde = { 'kWrZr': function (_0x37f3ad, _0x2fc31e) { return _0x37f3ad === _0x2fc31e; } }; if (this[_0x3cd4b0(0x6d5) + _0x3cd4b0(0x3ca) + 'a']()[_0x3cd4b0(0xf1d)] && _0x162dde['kWrZr']($gameScreen[_0x3cd4b0(0xa4d)](), -0x2a0 * 0xc + 0x23e8 + 0x7 * -0xa1)) { this['_displayY'] = this[_0x3cd4b0(0x6d5) + _0x3cd4b0(0x3ca) + 'a']()[_0x3cd4b0(0xc3b)]; return; } VisuMZ[_0x3cd4b0(0xc9f)]['Game_Map_s' + _0x3cd4b0(0x839)][_0x3cd4b0(0xedc)](this, _0x131060); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xcfd) + 'crollLeft'] = Game_Map[_0x3a6da1(0x49b)][_0x3a6da1(0xe0f)], Game_Map['prototype'][_0x3a6da1(0xe0f)] = function (_0x237fdf) { const _0x45a060 = _0x3a6da1, _0x199d12 = { 'MyhcS': function (_0x31ab79, _0x3df31f) { return _0x31ab79 === _0x3df31f; } }; if (this[_0x45a060(0x6d5) + 'raCheckDat' + 'a']()[_0x45a060(0x6f3)] && _0x199d12[_0x45a060(0x578)]($gameScreen[_0x45a060(0xa4d)](), 0xecb + -0x176 + -0xd54)) { this[_0x45a060(0x726)] = this['centerCame' + _0x45a060(0x3ca) + 'a']()[_0x45a060(0xc91)]; return; } VisuMZ[_0x45a060(0xc9f)]['Game_Map_s' + _0x45a060(0x1022)][_0x45a060(0xedc)](this, _0x237fdf); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xcfd) + 'crollRight'] = Game_Map[_0x3a6da1(0x49b)][_0x3a6da1(0x2a9) + 't'], Game_Map[_0x3a6da1(0x49b)][_0x3a6da1(0x2a9) + 't'] = function (_0x23f1a9) { const _0x18a167 = _0x3a6da1, _0x53bfea = { 'IbtOC': function (_0x170b50, _0x4cffa0) { return _0x170b50 === _0x4cffa0; } }; if (this[_0x18a167(0x6d5) + _0x18a167(0x3ca) + 'a']()[_0x18a167(0x6f3)] && _0x53bfea[_0x18a167(0x1e6)]($gameScreen[_0x18a167(0xa4d)](), -0x270f + -0xf80 + -0x184 * -0x24)) { this['_displayX'] = this[_0x18a167(0x6d5) + _0x18a167(0x3ca) + 'a']()[_0x18a167(0xc91)]; return; } VisuMZ['CoreEngine'][_0x18a167(0xcfd) + _0x18a167(0x608)][_0x18a167(0xedc)](this, _0x23f1a9); }, VisuMZ['CoreEngine']['Game_Map_s' + _0x3a6da1(0x894)] = Game_Map[_0x3a6da1(0x49b)]['scrollUp'], Game_Map[_0x3a6da1(0x49b)]['scrollUp'] = function (_0x1e4cf3) { const _0x14ccd6 = _0x3a6da1, _0x3af49a = { 'OyVTs': function (_0x1306b7, _0x46a0d) { return _0x1306b7 === _0x46a0d; } }; if (this[_0x14ccd6(0x6d5) + _0x14ccd6(0x3ca) + 'a']()[_0x14ccd6(0xf1d)] && _0x3af49a[_0x14ccd6(0x65e)]($gameScreen['zoomScale'](), 0xdaa * 0x1 + -0x1f6f * -0x1 + -0x2d18)) { this[_0x14ccd6(0x2da)] = this[_0x14ccd6(0x6d5) + _0x14ccd6(0x3ca) + 'a']()[_0x14ccd6(0xc3b)]; return; } VisuMZ['CoreEngine']['Game_Map_s' + 'crollUp'][_0x14ccd6(0xedc)](this, _0x1e4cf3); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xca6) + 'cter_proce' + _0x3a6da1(0x406) + _0x3a6da1(0xce4)] = Game_Character['prototype']['processMov' + _0x3a6da1(0x3e2)], Game_Character[_0x3a6da1(0x49b)]['processMov' + _0x3a6da1(0x3e2)] = function (_0x3bb1c1) { const _0xcae5de = _0x3a6da1; try { VisuMZ[_0xcae5de(0xc9f)][_0xcae5de(0xca6) + _0xcae5de(0x715) + _0xcae5de(0x406) + _0xcae5de(0xce4)][_0xcae5de(0xedc)](this, _0x3bb1c1); } catch (_0x467d92) { if ($gameTemp[_0xcae5de(0x386)]()) console['log'](_0x467d92); } }, Game_Player[_0x3a6da1(0x49b)][_0x3a6da1(0xceb) + 'terCount'] = function () { const _0x25916a = _0x3a6da1, _0x5ad2fb = { 'XZbUy': function (_0x363f88, _0x364ecd) { return _0x363f88 + _0x364ecd; } }, _0x5f08a3 = $gameMap[_0x25916a(0x990) + 'tep'](); this[_0x25916a(0xdb4) + _0x25916a(0x4bf)] = _0x5ad2fb[_0x25916a(0xaf5)](_0x5ad2fb[_0x25916a(0xaf5)](Math['randomInt'](_0x5f08a3), Math['randomInt'](_0x5f08a3)), this[_0x25916a(0x990) + _0x25916a(0x1094) + 'm']()); }, Game_Player['prototype'][_0x3a6da1(0x990) + _0x3a6da1(0x1094) + 'm'] = function () { const _0x3b12d4 = _0x3a6da1, _0x3ada95 = { 'djirg': function (_0x2db982, _0x27fb79) { return _0x2db982(_0x27fb79); } }; return $dataMap && $dataMap[_0x3b12d4(0xba6)] && $dataMap[_0x3b12d4(0xba6)][_0x3b12d4(0x7a8)](/<MINIMUM ENCOUNTER STEPS:[ ](\d+)>/i) ? _0x3ada95[_0x3b12d4(0x27d)](Number, RegExp['$1']) : VisuMZ['CoreEngine'][_0x3b12d4(0x316)][_0x3b12d4(0xfee)]['EncounterR' + _0x3b12d4(0x4da)]; }, VisuMZ[_0x3a6da1(0xc9f)]['Game_Event' + '_isCollide' + _0x3a6da1(0x548) + 's'] = Game_Event[_0x3a6da1(0x49b)][_0x3a6da1(0xc9a) + 'WithEvents'], Game_Event[_0x3a6da1(0x49b)][_0x3a6da1(0xc9a) + _0x3a6da1(0x7c5)] = function (_0x255ca6, _0x957abf) { const _0x2f5573 = _0x3a6da1; return this['isSmartEve' + _0x2f5573(0x1d6) + _0x2f5573(0xa44)]() ? this[_0x2f5573(0x920) + _0x2f5573(0xdda) + _0x2f5573(0xb29)](_0x255ca6, _0x957abf) : VisuMZ['CoreEngine']['Game_Event' + '_isCollide' + _0x2f5573(0x548) + 's']['call'](this, _0x255ca6, _0x957abf); }, Game_Event[_0x3a6da1(0x49b)][_0x3a6da1(0x1045) + _0x3a6da1(0x1d6) + _0x3a6da1(0xa44)] = function () { const _0x27d631 = _0x3a6da1; return VisuMZ[_0x27d631(0xc9f)][_0x27d631(0x316)][_0x27d631(0xfee)][_0x27d631(0x64f) + _0x27d631(0x603) + _0x27d631(0x10a8)]; }, Game_Event[_0x3a6da1(0x49b)][_0x3a6da1(0x920) + 'EventColli' + _0x3a6da1(0xb29)] = function (_0x46b3a3, _0x4fb8ac) { const _0x3cd9b1 = _0x3a6da1, _0x2546bc = { 'PPFDL': function (_0x3a94d9, _0x1c4383) { return _0x3a94d9 > _0x1c4383; } }; if (!this[_0x3cd9b1(0xbec) + _0x3cd9b1(0xf06)]()) return ![]; else { const _0x491c1a = $gameMap[_0x3cd9b1(0xf65)](_0x46b3a3, _0x4fb8ac)[_0x3cd9b1(0x3e7)](_0x2c958e => _0x2c958e[_0x3cd9b1(0xbec) + 'iority']()); return _0x2546bc['PPFDL'](_0x491c1a[_0x3cd9b1(0x786)], 0x1c8d + -0x1d71 + 0xe4); } }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xd97) + 'preter_com' + _0x3a6da1(0x7e9)] = Game_Interpreter['prototype']['command105'], Game_Interpreter[_0x3a6da1(0x49b)][_0x3a6da1(0x2e3)] = function (_0xb7af98) { const _0x215d35 = _0x3a6da1, _0x493059 = this['getCombine' + 'dScrolling' + 'Text'](); return _0x493059[_0x215d35(0x7a8)](/\/\/[ ]SCRIPT[ ]CALL/i) ? this[_0x215d35(0xb7e) + _0x215d35(0xab2) + _0x215d35(0xcab)](_0x493059) : VisuMZ[_0x215d35(0xc9f)][_0x215d35(0xd97) + 'preter_com' + _0x215d35(0x7e9)][_0x215d35(0xedc)](this, _0xb7af98); }, Game_Interpreter[_0x3a6da1(0x49b)][_0x3a6da1(0x24d) + _0x3a6da1(0xab2) + _0x3a6da1(0x84d)] = function () { const _0x12371c = _0x3a6da1, _0x1bfdb1 = { 'cITFu': function (_0x39f3cb, _0x173b31) { return _0x39f3cb + _0x173b31; }, 'NSATP': function (_0x241a8a, _0x1c1069) { return _0x241a8a === _0x1c1069; }, 'qOLQy': function (_0x1dc8c0, _0x360c69) { return _0x1dc8c0 + _0x360c69; } }; let _0x5e9613 = '', _0x2632c6 = _0x1bfdb1[_0x12371c(0xec0)](this['_index'], 0x6cc + 0x3b7 * -0x1 + -0x314); while (this[_0x12371c(0x109f)][_0x2632c6] && _0x1bfdb1[_0x12371c(0x882)](this[_0x12371c(0x109f)][_0x2632c6]['code'], -0x39a * 0x1 + 0x162b + -0x10fc)) { _0x5e9613 += _0x1bfdb1[_0x12371c(0x6eb)](this[_0x12371c(0x109f)][_0x2632c6]['parameters'][0x23b * -0x1 + -0x5b9 * -0x3 + 0xef * -0x10], '\x0a'), _0x2632c6++; } return _0x5e9613; }, Game_Interpreter[_0x3a6da1(0x49b)][_0x3a6da1(0xb7e) + 'dScrolling' + 'TextAsCode'] = function (_0x53248d) { const _0x5dc917 = _0x3a6da1, _0x5e6906 = { 'CiZVg': function (_0x58d847, _0x27b8bf) { return _0x58d847(_0x27b8bf); }, 'mIilr': _0x5dc917(0x61f) + _0x5dc917(0xb42) + _0x5dc917(0xd8a) + 'or' }; try { _0x5e6906['CiZVg'](eval, _0x53248d); } catch (_0x529222) { $gameTemp[_0x5dc917(0x386)]() && (console[_0x5dc917(0xaee)](_0x5e6906[_0x5dc917(0xd9e)]), console[_0x5dc917(0xaee)](_0x529222)); } return !![]; }, VisuMZ[_0x3a6da1(0xc9f)]['Game_Inter' + _0x3a6da1(0x22b) + _0x3a6da1(0x528)] = Game_Interpreter[_0x3a6da1(0x49b)][_0x3a6da1(0xfc9)], Game_Interpreter[_0x3a6da1(0x49b)][_0x3a6da1(0xfc9)] = function (_0x35b12d) { const _0x11abb8 = _0x3a6da1, _0x546809 = { 'rlCWJ': _0x11abb8(0xf27) + _0x11abb8(0x25d) + 'cript\x20Erro' + 'r' }; try { VisuMZ[_0x11abb8(0xc9f)][_0x11abb8(0xd97) + 'preter_com' + _0x11abb8(0x528)][_0x11abb8(0xedc)](this, _0x35b12d); } catch (_0x551531) { $gameTemp[_0x11abb8(0x386)]() && (console[_0x11abb8(0xaee)](_0x546809[_0x11abb8(0x5f0)]), console[_0x11abb8(0xaee)](_0x551531)), this[_0x11abb8(0xaaf)](); } return !![]; }, VisuMZ[_0x3a6da1(0xc9f)]['Game_Inter' + _0x3a6da1(0x22b) + _0x3a6da1(0x765)] = Game_Interpreter[_0x3a6da1(0x49b)][_0x3a6da1(0x842)], Game_Interpreter['prototype'][_0x3a6da1(0x842)] = function (_0x3237c6) { const _0x265b32 = _0x3a6da1, _0x2178e0 = { 'xuIqU': _0x265b32(0x544) + _0x265b32(0x612) + _0x265b32(0x8d2) }; try { VisuMZ[_0x265b32(0xc9f)][_0x265b32(0xd97) + 'preter_com' + _0x265b32(0x765)][_0x265b32(0xedc)](this, _0x3237c6); } catch (_0x483149) { $gameTemp['isPlaytest']() && (console[_0x265b32(0xaee)](_0x2178e0[_0x265b32(0xd29)]), console[_0x265b32(0xaee)](_0x483149)); } return !![]; }, VisuMZ['CoreEngine'][_0x3a6da1(0xd97) + 'preter_com' + 'mand355'] = Game_Interpreter[_0x3a6da1(0x49b)][_0x3a6da1(0xc1b)], Game_Interpreter[_0x3a6da1(0x49b)][_0x3a6da1(0xc1b)] = function () { const _0x5972e6 = _0x3a6da1, _0x781312 = { 'fHOpr': 'Script\x20Cal' + _0x5972e6(0xfb7) }; try { VisuMZ[_0x5972e6(0xc9f)][_0x5972e6(0xd97) + _0x5972e6(0x22b) + _0x5972e6(0xdd5)]['call'](this); } catch (_0x28307a) { $gameTemp[_0x5972e6(0x386)]() && (console[_0x5972e6(0xaee)](_0x781312[_0x5972e6(0x590)]), console[_0x5972e6(0xaee)](_0x28307a)); } return !![]; }, VisuMZ['CoreEngine'][_0x3a6da1(0xd97) + 'preter_Plu' + _0x3a6da1(0x7ea)] = Game_Interpreter[_0x3a6da1(0x49b)][_0x3a6da1(0x217)], Game_Interpreter[_0x3a6da1(0x49b)][_0x3a6da1(0x217)] = function (_0x100a1d) { const _0xd3766b = _0x3a6da1; return $gameTemp[_0xd3766b(0x41a) + 'ginCommand' + _0xd3766b(0x1018) + 'r'](this), VisuMZ[_0xd3766b(0xc9f)][_0xd3766b(0xd97) + _0xd3766b(0x239) + _0xd3766b(0x7ea)][_0xd3766b(0xedc)](this, _0x100a1d); }, Scene_Base['prototype'][_0x3a6da1(0x3a8)] = function () { const _0x2959f5 = _0x3a6da1; return VisuMZ[_0x2959f5(0xc9f)][_0x2959f5(0x316)]['UI'][_0x2959f5(0x3c2)]; }, Scene_Base[_0x3a6da1(0x49b)][_0x3a6da1(0xa2b) + _0x3a6da1(0x88a)] = function () { const _0x5a0b58 = _0x3a6da1; return VisuMZ['CoreEngine'][_0x5a0b58(0x316)]['UI']['BottomHelp']; }, Scene_Base[_0x3a6da1(0x49b)][_0x3a6da1(0x39e) + 'ttonMode'] = function () { const _0x444f4a = _0x3a6da1; return VisuMZ[_0x444f4a(0xc9f)][_0x444f4a(0x316)]['UI']['BottomButt' + _0x444f4a(0xeb3)]; }, Scene_Base[_0x3a6da1(0x49b)]['isRightInp' + 'utMode'] = function () { const _0x4adee2 = _0x3a6da1; return VisuMZ[_0x4adee2(0xc9f)][_0x4adee2(0x316)]['UI'][_0x4adee2(0x991)]; }, Scene_Base['prototype'][_0x3a6da1(0xc03) + _0x3a6da1(0x8ee)] = function () { const _0x3368d7 = _0x3a6da1; return VisuMZ[_0x3368d7(0xc9f)]['Settings']['UI'][_0x3368d7(0x7b4) + 'th']; }, Scene_Base[_0x3a6da1(0x49b)]['buttonArea' + _0x3a6da1(0x32b)] = function () { const _0x548fc0 = _0x3a6da1; return VisuMZ[_0x548fc0(0xc9f)]['Settings']['UI'][_0x548fc0(0x749) + 'ht']; }, Scene_Base['prototype'][_0x3a6da1(0xcb6) + _0x3a6da1(0x2c9) + 'ed'] = function () { const _0x255524 = _0x3a6da1; return VisuMZ['CoreEngine']['Settings'][_0x255524(0x3ef)][_0x255524(0x3c5) + _0x255524(0x4d4)]; }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x6ea) + _0x3a6da1(0xd25) + _0x3a6da1(0x880)] = Scene_Base['prototype']['createWind' + 'owLayer'], Scene_Base[_0x3a6da1(0x49b)][_0x3a6da1(0xaba) + _0x3a6da1(0x79f)] = function () { const _0x3e3d09 = _0x3a6da1, _0x4086cd = { 'nAdRP': _0x3e3d09(0x394) }, _0x1be6c3 = _0x4086cd[_0x3e3d09(0x311)][_0x3e3d09(0x80d)]('|'); let _0x44ca42 = 0xa88 + -0x1c97 + -0x3 * -0x605; while (!![]) { switch (_0x1be6c3[_0x44ca42++]) { case '0': this[_0x3e3d09(0xe79) + 'er']['x'] = Math[_0x3e3d09(0x48a)](this['_windowLay' + 'er']['x']); continue; case '1': this['_windowLay' + 'er']['y'] = Math[_0x3e3d09(0x48a)](this[_0x3e3d09(0xe79) + 'er']['y']); continue; case '2': this[_0x3e3d09(0x6a0) + 'PopupWindo' + 'w'](); continue; case '3': this[_0x3e3d09(0xa0d) + 'onAssistWi' + _0x3e3d09(0x41f)](); continue; case '4': VisuMZ[_0x3e3d09(0xc9f)][_0x3e3d09(0x6ea) + _0x3e3d09(0xd25) + 'dowLayer']['call'](this); continue; }break; } }, Scene_Base[_0x3a6da1(0x49b)][_0x3a6da1(0xa0d) + _0x3a6da1(0x10a9) + _0x3a6da1(0x41f)] = function () { }, Scene_Base['prototype'][_0x3a6da1(0x6a0) + _0x3a6da1(0xec6) + 'w'] = function () { const _0xf7990e = _0x3a6da1; this['_textPopup' + _0xf7990e(0x3ef)] = new Window_TextPopup(), this['addChild'](this[_0xf7990e(0xe33) + _0xf7990e(0x3ef)]); }, $textPopup = function (_0x3bbc7e) { const _0x5bf7e0 = _0x3a6da1, _0x4773ec = SceneManager[_0x5bf7e0(0xda5)][_0x5bf7e0(0xe33) + _0x5bf7e0(0x3ef)]; _0x4773ec && _0x4773ec[_0x5bf7e0(0x7ad)](_0x3bbc7e); }, Scene_Base[_0x3a6da1(0x49b)]['buttonAssi' + 'stKey1'] = function () { const _0x36e89e = _0x3a6da1, _0x9025c9 = { 'HXOLZ': _0x36e89e(0x22a), 'UDJoZ': 'pagedown' }; return TextManager['getInputMu' + _0x36e89e(0x6b3) + 'trings'](_0x9025c9['HXOLZ'], _0x9025c9['UDJoZ']); }, Scene_Base[_0x3a6da1(0x49b)][_0x3a6da1(0x647) + _0x3a6da1(0x102f)] = function () { const _0x3faace = _0x3a6da1, _0x66f4c7 = { 'YkfPX': _0x3faace(0x9a3) }; return TextManager[_0x3faace(0xc94) + _0x3faace(0x816)](_0x66f4c7[_0x3faace(0x20a)]); }, Scene_Base[_0x3a6da1(0x49b)][_0x3a6da1(0x647) + _0x3a6da1(0x1e7)] = function () { const _0x3cee37 = _0x3a6da1, _0x22fc3b = { 'hGxXz': _0x3cee37(0xdab) }; return TextManager[_0x3cee37(0xc94) + _0x3cee37(0x816)](_0x22fc3b[_0x3cee37(0xbb0)]); }, Scene_Base[_0x3a6da1(0x49b)][_0x3a6da1(0x647) + 'stKey4'] = function () { const _0x69fb29 = _0x3a6da1; return TextManager[_0x69fb29(0xc94) + _0x69fb29(0x816)]('ok'); }, Scene_Base[_0x3a6da1(0x49b)][_0x3a6da1(0x647) + _0x3a6da1(0x460)] = function () { const _0x249ec7 = _0x3a6da1, _0x3e182a = { 'NPpPE': _0x249ec7(0x558) }; return TextManager[_0x249ec7(0xc94) + _0x249ec7(0x816)](_0x3e182a[_0x249ec7(0x48c)]); }, Scene_Base['prototype'][_0x3a6da1(0x647) + 'stText1'] = function () { const _0x203fcf = _0x3a6da1; return this[_0x203fcf(0xeed) + 'ton'] && this[_0x203fcf(0xeed) + _0x203fcf(0x747)][_0x203fcf(0xe15)] ? TextManager[_0x203fcf(0x647) + _0x203fcf(0xcee)] : ''; }, Scene_Base['prototype'][_0x3a6da1(0x647) + _0x3a6da1(0xe7d)] = function () { return ''; }, Scene_Base[_0x3a6da1(0x49b)][_0x3a6da1(0x647) + _0x3a6da1(0x7ae)] = function () { return ''; }, Scene_Base[_0x3a6da1(0x49b)]['buttonAssi' + _0x3a6da1(0xe6e)] = function () { const _0x2657aa = _0x3a6da1; return TextManager[_0x2657aa(0x647) + _0x2657aa(0x4f8)]; }, Scene_Base[_0x3a6da1(0x49b)]['buttonAssi' + _0x3a6da1(0x1002)] = function () { const _0x462723 = _0x3a6da1; return TextManager[_0x462723(0x647) + 'stCancel']; }, Scene_Base['prototype'][_0x3a6da1(0x647) + 'stOffset1'] = function () { return 0x2256 + -0xaf2 + 0x5d9 * -0x4; }, Scene_Base[_0x3a6da1(0x49b)][_0x3a6da1(0x647) + _0x3a6da1(0xa6a)] = function () { return -0x33e + -0x24f8 + 0x1 * 0x2836; }, Scene_Base[_0x3a6da1(0x49b)]['buttonAssi' + _0x3a6da1(0x32d)] = function () { return -0x1531 + 0x1 * -0x1db + 0x170c; }, Scene_Base[_0x3a6da1(0x49b)][_0x3a6da1(0x647) + 'stOffset4'] = function () { return -0x2 * -0x2e3 + -0x1783 * 0x1 + -0x11bd * -0x1; }, Scene_Base['prototype']['buttonAssi' + _0x3a6da1(0xd56)] = function () { return 0x2 * -0x4d5 + 0x19ea + -0x1040; }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xd43) + _0x3a6da1(0x499) + _0x3a6da1(0x59d)] = Scene_Boot[_0x3a6da1(0x49b)][_0x3a6da1(0x875) + _0x3a6da1(0x927)], Scene_Boot['prototype'][_0x3a6da1(0x875) + _0x3a6da1(0x927)] = function () { const _0x2ef41d = _0x3a6da1; VisuMZ['CoreEngine'][_0x2ef41d(0xd43) + _0x2ef41d(0x499) + _0x2ef41d(0x59d)][_0x2ef41d(0xedc)](this), this[_0x2ef41d(0xdf8) + _0x2ef41d(0x24a) + _0x2ef41d(0xd2e)](); }, Scene_Boot['prototype']['loadGameIm' + _0x3a6da1(0x24a) + _0x3a6da1(0xd2e)] = function () { const _0x39eca4 = _0x3a6da1, _0x550485 = { 'bviJn': 'animations', 'Joztt': 'battleback' + 's1', 'lLBsV': _0x39eca4(0x391) + 's2', 'KBSSr': _0x39eca4(0x3dc), 'TPDrH': 'enemies', 'MPWsO': _0x39eca4(0x104f), 'BhsrE': 'parallaxes', 'TFXwC': _0x39eca4(0x46c), 'ZFTaR': _0x39eca4(0xfb0), 'gHwGY': _0x39eca4(0x7bc), 'fNpnH': _0x39eca4(0xf03), 'woqzm': _0x39eca4(0x82a), 'NYlHc': _0x39eca4(0x484), 'gsdbG': _0x39eca4(0x57b), 'brGGE': _0x39eca4(0xe69) }, _0x2172fa = [_0x550485['bviJn'], _0x550485[_0x39eca4(0x767)], _0x550485[_0x39eca4(0x1033)], _0x550485[_0x39eca4(0x264)], _0x550485[_0x39eca4(0x429)], _0x550485[_0x39eca4(0xb0a)], _0x550485[_0x39eca4(0x434)], _0x550485[_0x39eca4(0x8b9)], _0x550485['ZFTaR'], _0x550485['gHwGY'], _0x550485[_0x39eca4(0x2b9)], _0x550485[_0x39eca4(0xfe5)], _0x550485[_0x39eca4(0xcd7)], _0x550485['gsdbG']]; for (const _0x4fcf87 of _0x2172fa) { const _0x6ead6b = VisuMZ[_0x39eca4(0xc9f)][_0x39eca4(0x316)]['ImgLoad'][_0x4fcf87], _0x204f71 = _0x550485[_0x39eca4(0x883)][_0x39eca4(0xfc8)](_0x4fcf87); for (const _0x1cb099 of _0x6ead6b) { ImageManager[_0x39eca4(0x4b5)](_0x204f71, _0x1cb099); } } }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xd43) + _0x3a6da1(0x2ff) + _0x3a6da1(0xbfb)] = Scene_Boot[_0x3a6da1(0x49b)][_0x3a6da1(0xc24) + _0x3a6da1(0x1071)], Scene_Boot[_0x3a6da1(0x49b)][_0x3a6da1(0xc24) + _0x3a6da1(0x1071)] = function () { const _0x5266b7 = _0x3a6da1, _0x50f8e1 = { 'nreiq': _0x5266b7(0xa0e) }; Utils['isOptionVa' + _0x5266b7(0xd96)](_0x50f8e1['nreiq']) && VisuMZ[_0x5266b7(0xc9f)]['Settings'][_0x5266b7(0xfee)][_0x5266b7(0xae7) + 't'] ? this['startAutoN' + _0x5266b7(0x91e)]() : VisuMZ[_0x5266b7(0xc9f)][_0x5266b7(0xd43) + _0x5266b7(0x2ff) + _0x5266b7(0xbfb)][_0x5266b7(0xedc)](this); }, Scene_Boot[_0x3a6da1(0x49b)][_0x3a6da1(0x706) + 'ewGame'] = function () { const _0x16959f = _0x3a6da1; this[_0x16959f(0x476) + 'rLocation'](), DataManager[_0x16959f(0x9f3) + 'me'](), SceneManager[_0x16959f(0x66f)](Scene_Map); }, Scene_Boot[_0x3a6da1(0x49b)][_0x3a6da1(0x91b) + _0x3a6da1(0x105d)] = function () { const _0x182e76 = _0x3a6da1, _0x1a0ea8 = { 'pPcpP': function (_0x1b8033, _0x76e38b) { return _0x1b8033 - _0x76e38b; }, 'IsMBK': function (_0x464fb9, _0x3e4a3e) { return _0x464fb9 * _0x3e4a3e; }, 'YesNM': function (_0x2d6f07, _0x10d6d3) { return _0x2d6f07 * _0x10d6d3; } }, _0x1a56c9 = $dataSystem[_0x182e76(0x4d5)][_0x182e76(0x88d) + 'h'], _0x3e6a1a = $dataSystem[_0x182e76(0x4d5)]['uiAreaHeig' + 'ht'], _0x2eb54c = VisuMZ[_0x182e76(0xc9f)][_0x182e76(0x316)]['UI'][_0x182e76(0x4e6)]; Graphics['boxWidth'] = _0x1a0ea8[_0x182e76(0x5cb)](_0x1a56c9, _0x1a0ea8[_0x182e76(0x7f9)](_0x2eb54c, 0x2538 + 0x22e2 + -0x4818)), Graphics['boxHeight'] = _0x1a0ea8[_0x182e76(0x5cb)](_0x3e6a1a, _0x1a0ea8[_0x182e76(0x101b)](_0x2eb54c, -0x1744 + 0x46a * -0x2 + -0xe * -0x24b)), this[_0x182e76(0xaf8) + _0x182e76(0xf21) + _0x182e76(0x532)](); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xd43) + _0x3a6da1(0x2e2) + _0x3a6da1(0x100b)] = Scene_Boot[_0x3a6da1(0x49b)][_0x3a6da1(0x8a7) + _0x3a6da1(0x996)], Scene_Boot[_0x3a6da1(0x49b)][_0x3a6da1(0x8a7) + _0x3a6da1(0x996)] = function () { const _0x24e5bc = _0x3a6da1; this[_0x24e5bc(0x85b) + _0x24e5bc(0x996)]() ? this[_0x24e5bc(0xc11) + _0x24e5bc(0x5fc)]() : VisuMZ['CoreEngine'][_0x24e5bc(0xd43) + _0x24e5bc(0x2e2) + _0x24e5bc(0x100b)]['call'](this); }, Scene_Boot['prototype'][_0x3a6da1(0x85b) + _0x3a6da1(0x996)] = function () { const _0x291737 = _0x3a6da1, _0x10b395 = { 'XgAFo': '4|0|2|3|1', 'TEJzH': function (_0x27e85a, _0x4f09a7) { return _0x27e85a === _0x4f09a7; }, 'JKdon': _0x291737(0xe2c), 'rpNGw': function (_0x248f27, _0xfa1e4b) { return _0x248f27 === _0xfa1e4b; }, 'UGyGG': _0x291737(0x445) }, _0x41b94f = _0x10b395[_0x291737(0x625)][_0x291737(0x80d)]('|'); let _0x478787 = 0x260f + 0x1211 * -0x2 + -0x1ed; while (!![]) { switch (_0x41b94f[_0x478787++]) { case '0': if (_0x10b395[_0x291737(0x245)](Scene_Title[_0x291737(0xba4)], _0x10b395[_0x291737(0xe4f)])) return ![]; continue; case '1': return !![]; case '2': if (_0x10b395[_0x291737(0x255)](Scene_Title[_0x291737(0x4f5)], '')) return ![]; continue; case '3': if (_0x10b395[_0x291737(0x245)](Scene_Title[_0x291737(0x4f5)], _0x10b395['UGyGG'])) return ![]; continue; case '4': if (_0x10b395['TEJzH'](Scene_Title[_0x291737(0xba4)], '')) return ![]; continue; }break; } }, Scene_Boot['prototype'][_0x3a6da1(0xc11) + _0x3a6da1(0x5fc)] = function () { const _0x4c20db = _0x3a6da1, _0x32c678 = $dataSystem[_0x4c20db(0xc3d)], _0x5eab1a = Scene_Title['subtitle'] || '', _0x4de47f = Scene_Title[_0x4c20db(0x4f5)] || '', _0x235006 = VisuMZ['CoreEngine'][_0x4c20db(0x316)][_0x4c20db(0x943)]['Title']['DocumentTi' + 'tleFmt'], _0xed4b7f = _0x235006[_0x4c20db(0xfc8)](_0x32c678, _0x5eab1a, _0x4de47f); document[_0x4c20db(0xaad)] = _0xed4b7f; }, Scene_Boot[_0x3a6da1(0x49b)][_0x3a6da1(0xaf8) + 'ideButtonL' + _0x3a6da1(0x532)] = function () { const _0x57a30f = _0x3a6da1, _0x6f54ed = { 'PTBYF': function (_0xab2ea0, _0x246b31) { return _0xab2ea0 - _0x246b31; }, 'vkRfm': function (_0x307036, _0xf78e57) { return _0x307036 * _0xf78e57; }, 'qKjaq': function (_0x53f5e0, _0x115ef4) { return _0x53f5e0 * _0x115ef4; }, 'EbgDv': function (_0x12a658, _0x365f65) { return _0x12a658 >= _0x365f65; } }; if (VisuMZ[_0x57a30f(0xc9f)]['Settings']['UI'][_0x57a30f(0x8fb) + 's']) { const _0x17b5f8 = _0x6f54ed['PTBYF'](_0x6f54ed['PTBYF'](Graphics['width'], Graphics[_0x57a30f(0xa90)]), _0x6f54ed[_0x57a30f(0xee0)](VisuMZ['CoreEngine'][_0x57a30f(0x316)]['UI'][_0x57a30f(0x4e6)], 0x3df * 0x7 + -0x1 * 0x167 + -0x19b0)), _0x10df17 = _0x6f54ed[_0x57a30f(0xb4c)](Sprite_Button[_0x57a30f(0x49b)][_0x57a30f(0x5fd)][_0x57a30f(0xedc)](this), -0x24b * 0xd + -0x3 * -0x699 + -0x4 * -0x282); if (_0x6f54ed[_0x57a30f(0xf96)](_0x17b5f8, _0x10df17)) SceneManager['setSideBut' + 'tonLayout'](!![]); } }, Scene_Title[_0x3a6da1(0xba4)] = VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x316)][_0x3a6da1(0x943)][_0x3a6da1(0x79e)][_0x3a6da1(0xe2c)], Scene_Title['version'] = VisuMZ['CoreEngine'][_0x3a6da1(0x316)][_0x3a6da1(0x943)][_0x3a6da1(0x79e)][_0x3a6da1(0x10a0)], Scene_Title[_0x3a6da1(0x853) + _0x3a6da1(0x356)] = VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x316)][_0x3a6da1(0x845) + _0x3a6da1(0x965)], VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xb60) + _0x3a6da1(0xf57) + _0x3a6da1(0x79e)] = Scene_Title[_0x3a6da1(0x49b)][_0x3a6da1(0x485) + _0x3a6da1(0x633)], Scene_Title['prototype']['drawGameTi' + _0x3a6da1(0x633)] = function () { const _0x370c85 = _0x3a6da1, _0x3e1c2e = { 'LKFfq': function (_0x43c096, _0x103fc9) { return _0x43c096 !== _0x103fc9; }, 'ucSIi': function (_0xe42997, _0x11aafe) { return _0xe42997 !== _0x11aafe; }, 'QVRIZ': 'Subtitle', 'zziKI': function (_0x22988, _0x373101) { return _0x22988 !== _0x373101; }, 'YphDT': '0.00' }; VisuMZ[_0x370c85(0xc9f)][_0x370c85(0x316)][_0x370c85(0x943)][_0x370c85(0x79e)][_0x370c85(0x485) + _0x370c85(0x633)]['call'](this); if (_0x3e1c2e[_0x370c85(0x409)](Scene_Title[_0x370c85(0xba4)], '') && _0x3e1c2e[_0x370c85(0x8c3)](Scene_Title['subtitle'], _0x3e1c2e[_0x370c85(0x742)])) this[_0x370c85(0x923) + _0x370c85(0xbdd)](); if (_0x3e1c2e[_0x370c85(0x8c3)](Scene_Title[_0x370c85(0x4f5)], '') && _0x3e1c2e['zziKI'](Scene_Title[_0x370c85(0x4f5)], _0x3e1c2e[_0x370c85(0xa84)])) this[_0x370c85(0x8b5) + _0x370c85(0xdc7)](); }, Scene_Title[_0x3a6da1(0x49b)][_0x3a6da1(0x923) + 'btitle'] = function () { const _0x2c8567 = _0x3a6da1; VisuMZ[_0x2c8567(0xc9f)][_0x2c8567(0x316)]['MenuLayout'][_0x2c8567(0x79e)][_0x2c8567(0x923) + 'btitle']['call'](this); }, Scene_Title[_0x3a6da1(0x49b)][_0x3a6da1(0x8b5) + _0x3a6da1(0xdc7)] = function () { const _0x366c14 = _0x3a6da1; VisuMZ[_0x366c14(0xc9f)][_0x366c14(0x316)]['MenuLayout'][_0x366c14(0x79e)][_0x366c14(0x8b5) + _0x366c14(0xdc7)][_0x366c14(0xedc)](this); }, Scene_Title[_0x3a6da1(0x49b)][_0x3a6da1(0x1068) + _0x3a6da1(0x738)] = function () { const _0x7379d7 = _0x3a6da1; this[_0x7379d7(0x98d) + _0x7379d7(0x26d)](); const _0x5b3887 = $dataSystem[_0x7379d7(0xe23) + _0x7379d7(0x107e)]['background'], _0x9a6ef0 = this['commandWin' + 'dowRect'](); this['_commandWi' + _0x7379d7(0x41f)] = new Window_TitleCommand(_0x9a6ef0), this[_0x7379d7(0x280) + _0x7379d7(0x41f)]['setBackgro' + _0x7379d7(0xed1)](_0x5b3887); const _0x4b23c9 = this[_0x7379d7(0x567) + _0x7379d7(0x5c1)](); this[_0x7379d7(0x280) + _0x7379d7(0x41f)][_0x7379d7(0x108d)](_0x4b23c9['x'], _0x4b23c9['y'], _0x4b23c9[_0x7379d7(0x4c0)], _0x4b23c9[_0x7379d7(0x944)]), this['_commandWi' + _0x7379d7(0x41f)][_0x7379d7(0x509) + _0x7379d7(0x5ad)](), this[_0x7379d7(0x280) + _0x7379d7(0x41f)]['refresh'](), this['_commandWi' + _0x7379d7(0x41f)][_0x7379d7(0xe20)](), this[_0x7379d7(0x586)](this[_0x7379d7(0x280) + 'ndow']); }, Scene_Title[_0x3a6da1(0x49b)]['commandWin' + _0x3a6da1(0xf80)] = function () { const _0x1a70cf = _0x3a6da1; return this[_0x1a70cf(0x280) + _0x1a70cf(0x41f)] ? this[_0x1a70cf(0x280) + _0x1a70cf(0x41f)][_0x1a70cf(0xd26)]() : VisuMZ[_0x1a70cf(0xc9f)]['Settings'][_0x1a70cf(0x4ca) + _0x1a70cf(0x9cb)]['length']; }, Scene_Title[_0x3a6da1(0x49b)][_0x3a6da1(0x567) + _0x3a6da1(0x5c1)] = function () { const _0x3098c0 = _0x3a6da1; return VisuMZ[_0x3098c0(0xc9f)]['Settings'][_0x3098c0(0x943)][_0x3098c0(0x79e)][_0x3098c0(0x1081) + 't'][_0x3098c0(0xedc)](this); }, Scene_Title[_0x3a6da1(0x49b)][_0x3a6da1(0x98d) + _0x3a6da1(0x26d)] = function () { const _0x568d16 = _0x3a6da1; for (const _0x191dff of Scene_Title[_0x568d16(0x853) + 'tons']) { const _0x1c872a = new Sprite_TitlePictureButton(_0x191dff); this[_0x568d16(0xc5e)](_0x1c872a); } }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x1d9) + _0x3a6da1(0xa40)] = Scene_Map['prototype'][_0x3a6da1(0xa40)], Scene_Map[_0x3a6da1(0x49b)]['initialize'] = function () { const _0x1e9a8b = _0x3a6da1; VisuMZ[_0x1e9a8b(0xc9f)][_0x1e9a8b(0x1d9) + 'initialize'][_0x1e9a8b(0xedc)](this), $gameTemp[_0x1e9a8b(0x72c) + _0x1e9a8b(0xba1) + _0x1e9a8b(0x37f) + 'reEngine'](), this['clearOnceP' + _0x1e9a8b(0x7f6) + _0x1e9a8b(0x5fa)](); }, VisuMZ['CoreEngine'][_0x3a6da1(0x1d9) + _0x3a6da1(0x446) + _0x3a6da1(0xe07)] = Scene_Map[_0x3a6da1(0x49b)][_0x3a6da1(0x446) + _0x3a6da1(0xe07)], Scene_Map[_0x3a6da1(0x49b)][_0x3a6da1(0x446) + 'Multiply'] = function () { const _0x32a714 = _0x3a6da1; VisuMZ[_0x32a714(0xc9f)][_0x32a714(0x1d9) + _0x32a714(0x446) + 'Multiply'][_0x32a714(0xedc)](this), $gameTemp[_0x32a714(0xc45) + _0x32a714(0x39b)] && !$gameMessage[_0x32a714(0x43f)]() && (this[_0x32a714(0x446)](), SceneManager[_0x32a714(0xe9b) + _0x32a714(0x3c8)]()); }, Scene_Map['prototype'][_0x3a6da1(0x266)] = function () { const _0x3b468d = _0x3a6da1; Scene_Message[_0x3b468d(0x49b)][_0x3b468d(0x266)]['call'](this), !SceneManager['isNextScen' + 'e'](Scene_Battle) && (this[_0x3b468d(0xcaf)][_0x3b468d(0xc16)](), this[_0x3b468d(0xabc) + _0x3b468d(0x41f)][_0x3b468d(0x9d0)](), this[_0x3b468d(0xe79) + 'er'][_0x3b468d(0xe15)] = ![], SceneManager[_0x3b468d(0x881) + _0x3b468d(0xc42)]()), $gameScreen['clearZoom'](), this['clearOnceP' + _0x3b468d(0x7f6) + _0x3b468d(0x5fa)](); }, VisuMZ['CoreEngine'][_0x3a6da1(0x1d9) + _0x3a6da1(0xcbf) + _0x3a6da1(0x495)] = Scene_Map['prototype'][_0x3a6da1(0xcbf) + _0x3a6da1(0x495)], Scene_Map['prototype'][_0x3a6da1(0xcbf) + 'Button'] = function () { const _0x5b9be7 = _0x3a6da1; VisuMZ['CoreEngine']['Scene_Map_' + _0x5b9be7(0xcbf) + _0x5b9be7(0x495)]['call'](this), SceneManager[_0x5b9be7(0xef7) + _0x5b9be7(0x427)]() && this[_0x5b9be7(0x9c5) + 'ttonSideBu' + _0x5b9be7(0x2ec)](); }, Scene_Map[_0x3a6da1(0x49b)][_0x3a6da1(0x9c5) + _0x3a6da1(0x8ce) + _0x3a6da1(0x2ec)] = function () { const _0x1f2db1 = _0x3a6da1, _0x35d5c6 = { 'Fzkxf': function (_0x352c72, _0x222004) { return _0x352c72 + _0x222004; } }; this[_0x1f2db1(0xe1a) + 'n']['x'] = _0x35d5c6[_0x1f2db1(0xa3c)](Graphics['boxWidth'], -0x26e9 + 0x79f + -0x2 * -0xfa7); }, VisuMZ[_0x3a6da1(0xc9f)]['Scene_Map_' + _0x3a6da1(0x39f) + 'e'] = Scene_Map[_0x3a6da1(0x49b)][_0x3a6da1(0x39f) + 'e'], Scene_Map[_0x3a6da1(0x49b)][_0x3a6da1(0x39f) + 'e'] = function () { const _0x13caf8 = _0x3a6da1; VisuMZ[_0x13caf8(0xc9f)][_0x13caf8(0x1d9) + _0x13caf8(0x39f) + 'e'][_0x13caf8(0xedc)](this), this[_0x13caf8(0xb35) + 'Toggle'](); }, Scene_Map[_0x3a6da1(0x49b)][_0x3a6da1(0xb35) + 'Toggle'] = function () { const _0x487cde = _0x3a6da1, _0xee52d9 = { 'OmWlZ': 'dashToggle' }; Input[_0x487cde(0xa5a) + 'd'](_0xee52d9[_0x487cde(0xd5b)]) && (ConfigManager[_0x487cde(0xdba)] = !ConfigManager['alwaysDash'], ConfigManager[_0x487cde(0xde3)]()); }, VisuMZ['CoreEngine'][_0x3a6da1(0x1d9) + _0x3a6da1(0x446)] = Scene_Map[_0x3a6da1(0x49b)][_0x3a6da1(0x446)], Scene_Map['prototype']['updateMain'] = function () { const _0x99b5f8 = _0x3a6da1; VisuMZ[_0x99b5f8(0xc9f)][_0x99b5f8(0x1d9) + _0x99b5f8(0x446)][_0x99b5f8(0xedc)](this), this['updateOnce' + _0x99b5f8(0x66b) + _0x99b5f8(0x5e4)](); }, Scene_Map[_0x3a6da1(0x49b)][_0x3a6da1(0x38c) + _0x3a6da1(0x7f6) + 'erpreters'] = function () { const _0x1fabe0 = _0x3a6da1; this[_0x1fabe0(0xc3e) + _0x1fabe0(0xa54) + _0x1fabe0(0x97e)] = []; }, Scene_Map[_0x3a6da1(0x49b)]['updateOnce' + 'ParallelIn' + _0x3a6da1(0x5e4)] = function () { const _0x5ed1c2 = _0x3a6da1; if (!this[_0x5ed1c2(0xc3e) + _0x5ed1c2(0xa54) + _0x5ed1c2(0x97e)]) return; for (const _0x541a8d of this[_0x5ed1c2(0xc3e) + _0x5ed1c2(0xa54) + 'eters']) { _0x541a8d && _0x541a8d[_0x5ed1c2(0xc16)](); } }, Scene_Map[_0x3a6da1(0x49b)][_0x3a6da1(0xa68) + _0x3a6da1(0x3af) + 'rpreter'] = function (_0xcd9144, _0x2ab459) { const _0x2f9491 = _0x3a6da1, _0x52449b = $dataCommonEvents[_0xcd9144]; if (!_0x52449b) return; const _0x579a55 = new Game_OnceParallelInterpreter(); this[_0x2f9491(0x66d) + _0x2f9491(0x536) + 'preter'](_0x579a55), _0x579a55['setCommonE' + _0x2f9491(0xd05)](_0xcd9144), _0x579a55[_0x2f9491(0x5c8)](_0x2ab459); }, Scene_Map[_0x3a6da1(0x49b)][_0x3a6da1(0x66d) + _0x3a6da1(0x536) + _0x3a6da1(0xa9b)] = function (_0x44f1ed) { const _0x13cc3b = _0x3a6da1; this[_0x13cc3b(0xc3e) + _0x13cc3b(0xa54) + _0x13cc3b(0x97e)] = this[_0x13cc3b(0xc3e) + _0x13cc3b(0xa54) + _0x13cc3b(0x97e)] || [], this[_0x13cc3b(0xc3e) + _0x13cc3b(0xa54) + _0x13cc3b(0x97e)]['push'](_0x44f1ed); }, Scene_Map[_0x3a6da1(0x49b)][_0x3a6da1(0x4d6) + _0x3a6da1(0x66b) + 'terpreter'] = function (_0x9e10b6) { const _0x41fbf2 = _0x3a6da1; this['_onceParal' + 'lelInterpr' + _0x41fbf2(0x97e)] = this[_0x41fbf2(0xc3e) + _0x41fbf2(0xa54) + 'eters'] || [], this['_onceParal' + _0x41fbf2(0xa54) + _0x41fbf2(0x97e)][_0x41fbf2(0x7e7)](_0x9e10b6); }; function Game_OnceParallelInterpreter() { const _0x251d40 = _0x3a6da1; this[_0x251d40(0xa40)](...arguments); } Game_OnceParallelInterpreter[_0x3a6da1(0x49b)] = Object[_0x3a6da1(0xc26)](Game_Interpreter[_0x3a6da1(0x49b)]), Game_OnceParallelInterpreter[_0x3a6da1(0x49b)]['constructo' + 'r'] = Game_OnceParallelInterpreter, Game_OnceParallelInterpreter[_0x3a6da1(0x49b)][_0x3a6da1(0x8e0) + 'vent'] = function (_0x33635e) { const _0x3a3e80 = _0x3a6da1, _0x49e490 = $dataCommonEvents[_0x33635e]; _0x49e490 ? this[_0x3a3e80(0xdd9)](_0x49e490[_0x3a3e80(0x63d)], 0x1 * 0x130 + -0x1582 + 0x1452) : this[_0x3a3e80(0x266)](); }, Game_OnceParallelInterpreter['prototype'][_0x3a6da1(0x5c8)] = function (_0x33a86d) { const _0x5d38c2 = _0x3a6da1, _0x245a0a = { 'dkpNx': function (_0x33ebcc, _0x446571) { return _0x33ebcc || _0x446571; } }; this[_0x5d38c2(0xba3)] = _0x245a0a['dkpNx'](_0x33a86d, 0x1 * -0x18e9 + 0x320 + 0x15c9); }, Game_OnceParallelInterpreter['prototype'][_0x3a6da1(0x266)] = function () { const _0x3b9bb9 = _0x3a6da1; if (!SceneManager[_0x3b9bb9(0x8b6)]()) return; SceneManager[_0x3b9bb9(0xda5)][_0x3b9bb9(0x4d6) + 'ParallelIn' + 'terpreter'](this), Game_Interpreter[_0x3b9bb9(0x49b)][_0x3b9bb9(0x266)][_0x3b9bb9(0xedc)](this); }, VisuMZ[_0x3a6da1(0xc9f)]['Scene_Menu' + _0x3a6da1(0x323) + 'reaTop'] = Scene_MenuBase[_0x3a6da1(0x49b)][_0x3a6da1(0xfc2) + 'p'], Scene_MenuBase['prototype']['helpAreaTo' + 'p'] = function () { const _0xc792f = _0x3a6da1; let _0x3a4df5 = -0x1231 + 0x2585 + -0x1354; return SceneManager[_0xc792f(0xa18) + _0xc792f(0x6aa) + _0xc792f(0x1e8)]() ? _0x3a4df5 = this[_0xc792f(0xfc2) + _0xc792f(0xe22) + _0xc792f(0x5c5)]() : _0x3a4df5 = VisuMZ['CoreEngine'][_0xc792f(0x4b0) + _0xc792f(0x323) + 'reaTop'][_0xc792f(0xedc)](this), _0x3a4df5; }, Scene_MenuBase['prototype'][_0x3a6da1(0xfc2) + _0x3a6da1(0xe22) + _0x3a6da1(0x5c5)] = function () { const _0x4a1449 = _0x3a6da1; return this['isBottomHe' + _0x4a1449(0x88a)]() ? this['mainAreaBo' + _0x4a1449(0xd99)]() : -0x1cf2 + 0x35 + 0x1cbd; }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x4b0) + _0x3a6da1(0x291) + _0x3a6da1(0x444)] = Scene_MenuBase[_0x3a6da1(0x49b)]['mainAreaTo' + 'p'], Scene_MenuBase['prototype'][_0x3a6da1(0x97a) + 'p'] = function () { const _0x6a0101 = _0x3a6da1; return SceneManager[_0x6a0101(0xa18) + _0x6a0101(0x6aa) + _0x6a0101(0x1e8)]() ? this[_0x6a0101(0x97a) + 'pSideButto' + 'nLayout']() : VisuMZ[_0x6a0101(0xc9f)][_0x6a0101(0x4b0) + _0x6a0101(0x291) + _0x6a0101(0x444)][_0x6a0101(0xedc)](this); }, Scene_MenuBase['prototype'][_0x3a6da1(0x97a) + _0x3a6da1(0xe22) + _0x3a6da1(0x5c5)] = function () { const _0x2b82ce = _0x3a6da1, _0x8322bd = { 'qBETA': function (_0x2fdd7a, _0x2f4797) { return _0x2fdd7a === _0x2f4797; }, 'QvWse': _0x2b82ce(0xbed) }; if (!this[_0x2b82ce(0xa2b) + _0x2b82ce(0x88a)]()) return this['helpAreaBo' + _0x2b82ce(0xd99)](); else return this[_0x2b82ce(0x837) + _0x2b82ce(0xf69) + 'abled']() && _0x8322bd[_0x2b82ce(0xf99)](this[_0x2b82ce(0xed2) + _0x2b82ce(0x1082) + 'ion'](), _0x8322bd[_0x2b82ce(0xc09)]) ? Window_ButtonAssist[_0x2b82ce(0x49b)]['lineHeight']() : 0x2229 + -0x1 * -0xd49 + -0x2f72; }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x4b0) + _0x3a6da1(0x291) + _0x3a6da1(0xbce)] = Scene_MenuBase[_0x3a6da1(0x49b)][_0x3a6da1(0x230) + 'ight'], Scene_MenuBase['prototype']['mainAreaHe' + _0x3a6da1(0x4d0)] = function () { const _0x5dc1d4 = _0x3a6da1, _0x5ee062 = { 'uWJkp': function (_0x163720, _0x2f0726) { return _0x163720 !== _0x2f0726; }, 'PyiHA': _0x5dc1d4(0x9f5) }; let _0x1a8e9 = 0x1cc8 + -0x15cd + -0x6fb; return SceneManager['areButtons' + _0x5dc1d4(0x6aa) + 'nUI']() ? _0x1a8e9 = this['mainAreaHe' + _0x5dc1d4(0x724) + 'ttonLayout']() : _0x1a8e9 = VisuMZ[_0x5dc1d4(0xc9f)][_0x5dc1d4(0x4b0) + _0x5dc1d4(0x291) + _0x5dc1d4(0xbce)][_0x5dc1d4(0xedc)](this), this[_0x5dc1d4(0x837) + _0x5dc1d4(0xf69) + 'abled']() && _0x5ee062[_0x5dc1d4(0xd0a)](this[_0x5dc1d4(0xed2) + _0x5dc1d4(0x1082) + _0x5dc1d4(0x987)](), _0x5ee062[_0x5dc1d4(0x326)]) && (_0x1a8e9 -= Window_ButtonAssist[_0x5dc1d4(0x49b)][_0x5dc1d4(0xf3c)]()), _0x1a8e9; }, Scene_MenuBase[_0x3a6da1(0x49b)]['mainAreaHe' + 'ightSideBu' + _0x3a6da1(0x2ec)] = function () { const _0x495aa5 = _0x3a6da1, _0x33db57 = { 'RUDue': function (_0x4e7660, _0x5f31ad) { return _0x4e7660 - _0x5f31ad; } }; return _0x33db57[_0x495aa5(0x659)](Graphics[_0x495aa5(0x2dd)], this[_0x495aa5(0x7b1) + _0x495aa5(0x4d0)]()); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x4b0) + 'Base_creat' + _0x3a6da1(0x8bd) + 'd'] = Scene_MenuBase['prototype'][_0x3a6da1(0x515) + _0x3a6da1(0xf3d)], Scene_MenuBase[_0x3a6da1(0x49b)][_0x3a6da1(0x515) + _0x3a6da1(0xf3d)] = function () { const _0xa1d9de = _0x3a6da1, _0x3b7786 = VisuMZ[_0xa1d9de(0xc9f)][_0xa1d9de(0x316)][_0xa1d9de(0x3d5)][_0xa1d9de(0x6a9) + 'th'] ?? -0x2 * -0x724 + 0x150 * 0x2 + -0x10e0; this['_backgroun' + _0xa1d9de(0x8a3)] = new PIXI['filters']['BlurFilter'](_0x3b7786), this[_0xa1d9de(0xbf4) + 'dSprite'] = new Sprite(), this['_backgroun' + _0xa1d9de(0x4d1)]['bitmap'] = SceneManager[_0xa1d9de(0xe3c) + _0xa1d9de(0x670)](), this['_backgroun' + _0xa1d9de(0x4d1)]['filters'] = [this[_0xa1d9de(0xbf4) + _0xa1d9de(0x8a3)]], this[_0xa1d9de(0xc5e)](this['_backgroun' + _0xa1d9de(0x4d1)]), this[_0xa1d9de(0x9ed) + 'undOpacity'](-0x2357 + 0x1d9d + 0x67a), this[_0xa1d9de(0x9ed) + 'undOpacity'](this[_0xa1d9de(0x1f8) + 'undOpacity']()), this[_0xa1d9de(0x309) + _0xa1d9de(0xd32) + _0xa1d9de(0x7fb)](); }, Scene_MenuBase[_0x3a6da1(0x49b)]['getBackgro' + _0x3a6da1(0x998)] = function () { const _0x4420ee = _0x3a6da1, _0x4d506f = { 'zYDhk': function (_0x54d31a, _0x10a7b5) { return _0x54d31a(_0x10a7b5); } }, _0xa792b9 = _0x4d506f['zYDhk'](String, this[_0x4420ee(0x3b0) + 'r'][_0x4420ee(0x796)]), _0xca98df = this['getCustomB' + _0x4420ee(0x5e3) + 'ettings'](_0xa792b9); return _0xca98df ? _0xca98df[_0x4420ee(0x806) + _0x4420ee(0xe06)] : 0x5 * -0x745 + 0x421 * 0x4 + 0xb * 0x1df; }, Scene_MenuBase[_0x3a6da1(0x49b)][_0x3a6da1(0x309) + _0x3a6da1(0xd32) + _0x3a6da1(0x7fb)] = function () { const _0x43616b = _0x3a6da1, _0x542e56 = { 'miytE': function (_0x1430c2, _0x31e4cc) { return _0x1430c2(_0x31e4cc); }, 'MvjGW': function (_0x4c3eac, _0x284ddc) { return _0x4c3eac !== _0x284ddc; }, 'rraGk': _0x43616b(0x7e8) + '0' }, _0x45ede1 = _0x542e56[_0x43616b(0xa41)](String, this[_0x43616b(0x3b0) + 'r'][_0x43616b(0x796)]), _0x2f5589 = this[_0x43616b(0x7a6) + _0x43616b(0x5e3) + _0x43616b(0x717)](_0x45ede1); if (_0x2f5589 && (_0x542e56[_0x43616b(0x8e9)](_0x2f5589[_0x43616b(0x70f) + '1'], '') || _0x542e56['MvjGW'](_0x2f5589['BgFilename' + '2'], ''))) { const _0xfe1159 = _0x542e56[_0x43616b(0xa75)]['split']('|'); let _0x17028a = 0x1aa2 + -0x242f + 0x98d; while (!![]) { switch (_0xfe1159[_0x17028a++]) { case '0': this[_0x43616b(0xd4f) + 'e2'][_0x43616b(0xa7c)]['addLoadLis' + _0x43616b(0x8f0)](this[_0x43616b(0xc59) + 'te'][_0x43616b(0xdeb)](this, this[_0x43616b(0xd4f) + 'e2'])); continue; case '1': this['_backSprit' + 'e1'] = new Sprite(ImageManager['loadTitle1'](_0x2f5589[_0x43616b(0x70f) + '1'])); continue; case '2': this[_0x43616b(0xd4f) + 'e1']['bitmap'][_0x43616b(0x684) + _0x43616b(0x8f0)](this[_0x43616b(0xc59) + 'te'][_0x43616b(0xdeb)](this, this[_0x43616b(0xd4f) + 'e1'])); continue; case '3': this['addChild'](this[_0x43616b(0xd4f) + 'e2']); continue; case '4': this[_0x43616b(0xc5e)](this[_0x43616b(0xd4f) + 'e1']); continue; case '5': this['_backSprit' + 'e2'] = new Sprite(ImageManager['loadTitle2'](_0x2f5589[_0x43616b(0x70f) + '2'])); continue; }break; } } }, Scene_MenuBase[_0x3a6da1(0x49b)][_0x3a6da1(0x7a6) + _0x3a6da1(0x5e3) + _0x3a6da1(0x717)] = function (_0x1dd329) { const _0x18ac13 = _0x3a6da1, _0x3a3dd3 = { 'RRQEu': _0x18ac13(0xdef) + _0x18ac13(0xb1f) }; return VisuMZ[_0x18ac13(0xc9f)][_0x18ac13(0x316)][_0x18ac13(0x3d5)][_0x1dd329] || VisuMZ[_0x18ac13(0xc9f)]['Settings'][_0x18ac13(0x3d5)][_0x3a3dd3['RRQEu']]; }, Scene_MenuBase[_0x3a6da1(0x49b)]['adjustSpri' + 'te'] = function (_0x5c91c4) { const _0x430c29 = _0x3a6da1; this[_0x430c29(0xdf6) + 'e'](_0x5c91c4), this[_0x430c29(0x4b8) + 'te'](_0x5c91c4); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x4b0) + _0x3a6da1(0xa61) + _0x3a6da1(0x468) + 'ton'] = Scene_MenuBase[_0x3a6da1(0x49b)]['createCanc' + _0x3a6da1(0x2fd)], Scene_MenuBase[_0x3a6da1(0x49b)]['createCanc' + _0x3a6da1(0x2fd)] = function () { const _0x4815c0 = _0x3a6da1; VisuMZ[_0x4815c0(0xc9f)][_0x4815c0(0x4b0) + 'Base_creat' + _0x4815c0(0x468) + _0x4815c0(0x747)][_0x4815c0(0xedc)](this), SceneManager[_0x4815c0(0xef7) + _0x4815c0(0x427)]() && this[_0x4815c0(0xae2) + 'ButtonSide' + _0x4815c0(0x5c3) + 'ut'](); }, Scene_MenuBase['prototype'][_0x3a6da1(0xae2) + _0x3a6da1(0x87e) + 'ButtonLayo' + 'ut'] = function () { const _0x329876 = _0x3a6da1, _0x5db8c8 = { 'qolGa': function (_0x474527, _0x10af3e) { return _0x474527 + _0x10af3e; } }; this[_0x329876(0x10a2) + _0x329876(0x747)]['x'] = _0x5db8c8['qolGa'](Graphics[_0x329876(0xa90)], 0x37 * 0xaf + -0x1a10 + -0xb85); }, VisuMZ['CoreEngine']['Scene_Menu' + _0x3a6da1(0xa61) + _0x3a6da1(0x5c4) + 'ns'] = Scene_MenuBase[_0x3a6da1(0x49b)]['createPage' + _0x3a6da1(0xfd7)], Scene_MenuBase[_0x3a6da1(0x49b)][_0x3a6da1(0x376) + 'Buttons'] = function () { const _0xae6c5d = _0x3a6da1; VisuMZ[_0xae6c5d(0xc9f)][_0xae6c5d(0x4b0) + _0xae6c5d(0xa61) + _0xae6c5d(0x5c4) + 'ns'][_0xae6c5d(0xedc)](this), SceneManager[_0xae6c5d(0xef7) + _0xae6c5d(0x427)]() && this['movePageBu' + _0xae6c5d(0x8ce) + _0xae6c5d(0x2ec)](); }, Scene_MenuBase[_0x3a6da1(0x49b)][_0x3a6da1(0x660) + 'ttonSideBu' + 'ttonLayout'] = function () { const _0xe15d77 = _0x3a6da1, _0x2a3126 = { 'PkSOb': function (_0x322dba, _0xbcd346) { return _0x322dba * _0xbcd346; }, 'wMazs': function (_0x5b0f54, _0x25a3c9) { return _0x5b0f54 + _0x25a3c9; }, 'rbOBp': function (_0x4ec3f5, _0x1689e8) { return _0x4ec3f5 + _0x1689e8; }, 'mahPc': function (_0x3e668e, _0x38ef9c) { return _0x3e668e + _0x38ef9c; } }; this[_0xe15d77(0xeed) + _0xe15d77(0x747)]['x'] = _0x2a3126[_0xe15d77(0xed4)](-(-0x6af + 0x11f3 + -0xb43), _0x2a3126['wMazs'](_0x2a3126[_0xe15d77(0x34c)](this[_0xe15d77(0xeed) + _0xe15d77(0x747)][_0xe15d77(0x4c0)], this['_pagedownB' + _0xe15d77(0x962)][_0xe15d77(0x4c0)]), -0x3 * 0x879 + -0x1f84 + 0x1 * 0x38f7)), this[_0xe15d77(0x2cc) + 'utton']['x'] = _0x2a3126[_0xe15d77(0xed4)](-(0x671 + 0x70 + 0xb * -0xa0), _0x2a3126[_0xe15d77(0x284)](this[_0xe15d77(0x2cc) + _0xe15d77(0x962)][_0xe15d77(0x4c0)], -0x2209 + -0x1 * 0xe02 + 0x300f)); }, Scene_MenuBase[_0x3a6da1(0x49b)][_0x3a6da1(0x837) + _0x3a6da1(0xf69) + _0x3a6da1(0xe0e)] = function () { const _0x11f9e7 = _0x3a6da1; return VisuMZ[_0x11f9e7(0xc9f)][_0x11f9e7(0x316)]['ButtonAssi' + 'st'][_0x11f9e7(0x508)]; }, Scene_MenuBase[_0x3a6da1(0x49b)][_0x3a6da1(0xed2) + _0x3a6da1(0x1082) + _0x3a6da1(0x987)] = function () { const _0x222417 = _0x3a6da1, _0x1300a2 = { 'moNOB': _0x222417(0x9f5) }; return SceneManager[_0x222417(0xef7) + _0x222417(0x427)]() || SceneManager[_0x222417(0xa18) + _0x222417(0x73c)]() ? VisuMZ[_0x222417(0xc9f)][_0x222417(0x316)][_0x222417(0xb8a) + 'st'][_0x222417(0xd5e)] : _0x1300a2[_0x222417(0xcbc)]; }, Scene_MenuBase['prototype']['createButt' + _0x3a6da1(0x10a9) + _0x3a6da1(0x41f)] = function () { const _0x534730 = _0x3a6da1; if (!this[_0x534730(0x837) + _0x534730(0xf69) + _0x534730(0xe0e)]()) return; const _0x17ef5c = this[_0x534730(0x647) + 'stWindowRe' + 'ct'](); this[_0x534730(0x479) + _0x534730(0xf88)] = new Window_ButtonAssist(_0x17ef5c), this[_0x534730(0x586)](this[_0x534730(0x479) + _0x534730(0xf88)]); }, Scene_MenuBase[_0x3a6da1(0x49b)][_0x3a6da1(0x647) + _0x3a6da1(0xb3a) + 'ct'] = function () { const _0x117bbc = _0x3a6da1, _0x1d53c9 = { 'DZkOl': function (_0x1971ef, _0x34bda8) { return _0x1971ef === _0x34bda8; }, 'soxOR': 'button' }; return _0x1d53c9[_0x117bbc(0x331)](this[_0x117bbc(0xed2) + _0x117bbc(0x1082) + _0x117bbc(0x987)](), _0x1d53c9['soxOR']) ? this[_0x117bbc(0x647) + 'stWindowBu' + _0x117bbc(0xfeb)]() : this[_0x117bbc(0x647) + _0x117bbc(0x7b5) + _0x117bbc(0x68a)](); }, Scene_MenuBase[_0x3a6da1(0x49b)][_0x3a6da1(0x647) + 'stWindowBu' + _0x3a6da1(0xfeb)] = function () { const _0x38dc94 = _0x3a6da1, _0x3f8071 = { 'OSEQH': function (_0x3c7ba0, _0x58c985) { return _0x3c7ba0 * _0x58c985; }, 'PxQrt': function (_0x241fe1, _0x627d0e) { return _0x241fe1 + _0x627d0e; }, 'KYXdK': function (_0x304e61, _0x476f7f) { return _0x304e61 - _0x476f7f; } }, _0x4975a1 = ConfigManager['touchUI'] ? _0x3f8071[_0x38dc94(0xd18)](_0x3f8071[_0x38dc94(0x4af)](Sprite_Button['prototype'][_0x38dc94(0x5fd)](), 0x404 * -0x2 + -0x5b1 + 0xdbf), 0x1b7 + 0x2 * 0x548 + 0xc45 * -0x1) : 0x23b0 + -0xf * -0xd4 + -0x301c, _0x286842 = this[_0x38dc94(0xc73)](), _0x3c485d = _0x3f8071[_0x38dc94(0x628)](Graphics['boxWidth'], _0x3f8071['OSEQH'](_0x4975a1, -0x1 * 0x845 + 0x1ec6 + -0x167f)), _0x310ac7 = this[_0x38dc94(0x65f) + 'Height'](); return new Rectangle(_0x4975a1, _0x286842, _0x3c485d, _0x310ac7); }, Scene_MenuBase[_0x3a6da1(0x49b)][_0x3a6da1(0x647) + _0x3a6da1(0x7b5) + _0x3a6da1(0x68a)] = function () { const _0x3c9aa1 = _0x3a6da1, _0x17edb2 = { 'pKNEr': function (_0x301375, _0x247798) { return _0x301375 === _0x247798; }, 'xaKyM': _0x3c9aa1(0xbed), 'NiIfY': function (_0x1f7066, _0x3ab1c1) { return _0x1f7066 - _0x3ab1c1; } }, _0x1aaf21 = Graphics[_0x3c9aa1(0xa90)], _0x2d4259 = Window_ButtonAssist['prototype'][_0x3c9aa1(0xf3c)](), _0x61a89 = -0x1517 * 0x1 + -0x5 * 0x81 + -0x2 * -0xbce; let _0xa13310 = -0x667 * 0x1 + -0x20d2 * 0x1 + 0x2739; return _0x17edb2[_0x3c9aa1(0x554)](this['getButtonA' + _0x3c9aa1(0x1082) + _0x3c9aa1(0x987)](), _0x17edb2[_0x3c9aa1(0x790)]) ? _0xa13310 = 0xd75 + 0x511 + -0x943 * 0x2 : _0xa13310 = _0x17edb2['NiIfY'](Graphics[_0x3c9aa1(0x2dd)], _0x2d4259), new Rectangle(_0x61a89, _0xa13310, _0x1aaf21, _0x2d4259); }, Scene_Menu['layoutSett' + _0x3a6da1(0xcd3)] = VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x316)][_0x3a6da1(0x943)][_0x3a6da1(0x680)], VisuMZ['CoreEngine'][_0x3a6da1(0x4b0) + _0x3a6da1(0xc52)] = Scene_Menu[_0x3a6da1(0x49b)][_0x3a6da1(0xc26)], Scene_Menu['prototype'][_0x3a6da1(0xc26)] = function () { const _0x2b6e9e = _0x3a6da1; VisuMZ[_0x2b6e9e(0xc9f)][_0x2b6e9e(0x4b0) + _0x2b6e9e(0xc52)][_0x2b6e9e(0xedc)](this), this[_0x2b6e9e(0xa3e) + 'ineUpdateW' + _0x2b6e9e(0xad3)](); }, Scene_Menu[_0x3a6da1(0x49b)][_0x3a6da1(0xa3e) + _0x3a6da1(0x5aa) + 'indowBg'] = function () { const _0x359245 = _0x3a6da1; this[_0x359245(0x280) + _0x359245(0x41f)] && this[_0x359245(0x280) + _0x359245(0x41f)]['setBackgro' + _0x359245(0xed1)](Scene_Menu[_0x359245(0x275) + _0x359245(0xcd3)][_0x359245(0xf2a) + 'ype']), this[_0x359245(0xae9) + 'w'] && this[_0x359245(0xae9) + 'w']['setBackgro' + _0x359245(0xed1)](Scene_Menu[_0x359245(0x275) + _0x359245(0xcd3)]['GoldBgType']), this[_0x359245(0x75c) + _0x359245(0x7fa)] && this[_0x359245(0x75c) + _0x359245(0x7fa)]['setBackgro' + _0x359245(0xed1)](Scene_Menu[_0x359245(0x275) + _0x359245(0xcd3)][_0x359245(0x4aa) + 'pe']); }, Scene_Menu[_0x3a6da1(0x49b)][_0x3a6da1(0x567) + _0x3a6da1(0x5c1)] = function () { const _0x4cc3b2 = _0x3a6da1; return Scene_Menu[_0x4cc3b2(0x275) + _0x4cc3b2(0xcd3)][_0x4cc3b2(0x1081) + 't'][_0x4cc3b2(0xedc)](this); }, Scene_Menu[_0x3a6da1(0x49b)][_0x3a6da1(0x34f) + _0x3a6da1(0xa22)] = function () { const _0x5e41a6 = _0x3a6da1; return Scene_Menu[_0x5e41a6(0x275) + _0x5e41a6(0xcd3)][_0x5e41a6(0xa12)]['call'](this); }, Scene_Menu[_0x3a6da1(0x49b)][_0x3a6da1(0xcff) + _0x3a6da1(0x982)] = function () { const _0x2448d5 = _0x3a6da1; return Scene_Menu[_0x2448d5(0x275) + _0x2448d5(0xcd3)][_0x2448d5(0xe28)][_0x2448d5(0xedc)](this); }, Scene_Item['layoutSett' + _0x3a6da1(0xcd3)] = VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x316)]['MenuLayout'][_0x3a6da1(0x886)], VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x9fc) + '_create'] = Scene_Item['prototype'][_0x3a6da1(0xc26)], Scene_Item[_0x3a6da1(0x49b)]['create'] = function () { const _0x48fe5f = _0x3a6da1; VisuMZ[_0x48fe5f(0xc9f)][_0x48fe5f(0x9fc) + _0x48fe5f(0xc52)][_0x48fe5f(0xedc)](this), this['setCoreEng' + _0x48fe5f(0x5aa) + _0x48fe5f(0xad3)](); }, Scene_Item[_0x3a6da1(0x49b)][_0x3a6da1(0xa3e) + 'ineUpdateW' + 'indowBg'] = function () { const _0x5bc45c = _0x3a6da1; this[_0x5bc45c(0xc97) + 'w'] && this['_helpWindo' + 'w']['setBackgro' + _0x5bc45c(0xed1)](Scene_Item[_0x5bc45c(0x275) + _0x5bc45c(0xcd3)][_0x5bc45c(0x237)]), this[_0x5bc45c(0xedf) + 'indow'] && this[_0x5bc45c(0xedf) + _0x5bc45c(0x1014)][_0x5bc45c(0x9ed) + _0x5bc45c(0xed1)](Scene_Item['layoutSett' + _0x5bc45c(0xcd3)][_0x5bc45c(0x8cd) + 'Type']), this[_0x5bc45c(0xab6) + 'w'] && this[_0x5bc45c(0xab6) + 'w'][_0x5bc45c(0x9ed) + _0x5bc45c(0xed1)](Scene_Item['layoutSett' + _0x5bc45c(0xcd3)][_0x5bc45c(0x655)]), this[_0x5bc45c(0x1f4) + 'ow'] && this['_actorWind' + 'ow'][_0x5bc45c(0x9ed) + _0x5bc45c(0xed1)](Scene_Item['layoutSett' + _0x5bc45c(0xcd3)]['ActorBgTyp' + 'e']); }, Scene_Item['prototype'][_0x3a6da1(0xc6e) + _0x3a6da1(0xa22)] = function () { const _0x4158d9 = _0x3a6da1; return Scene_Item[_0x4158d9(0x275) + _0x4158d9(0xcd3)]['HelpRect'][_0x4158d9(0xedc)](this); }, Scene_Item[_0x3a6da1(0x49b)][_0x3a6da1(0x754) + _0x3a6da1(0xbff)] = function () { const _0x658cea = _0x3a6da1; return Scene_Item[_0x658cea(0x275) + _0x658cea(0xcd3)][_0x658cea(0xbc1) + 'ct'][_0x658cea(0xedc)](this); }, Scene_Item['prototype'][_0x3a6da1(0xa93) + _0x3a6da1(0xa22)] = function () { const _0x42550e = _0x3a6da1; return Scene_Item[_0x42550e(0x275) + 'ings']['ItemRect']['call'](this); }, Scene_Item['prototype'][_0x3a6da1(0x827) + 'wRect'] = function () { const _0x5dc3ff = _0x3a6da1; return Scene_Item[_0x5dc3ff(0x275) + 'ings'][_0x5dc3ff(0x8fa)]['call'](this); }, Scene_Skill['layoutSett' + _0x3a6da1(0xcd3)] = VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x316)][_0x3a6da1(0x943)][_0x3a6da1(0x321)], VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x624) + _0x3a6da1(0x211)] = Scene_Skill[_0x3a6da1(0x49b)][_0x3a6da1(0xc26)], Scene_Skill['prototype'][_0x3a6da1(0xc26)] = function () { const _0xf566a2 = _0x3a6da1; VisuMZ['CoreEngine'][_0xf566a2(0x624) + _0xf566a2(0x211)][_0xf566a2(0xedc)](this), this[_0xf566a2(0xa3e) + _0xf566a2(0x5aa) + 'indowBg'](); }, Scene_Skill[_0x3a6da1(0x49b)][_0x3a6da1(0xa3e) + _0x3a6da1(0x5aa) + 'indowBg'] = function () { const _0x5314e9 = _0x3a6da1, _0x4efb0b = { 'ymwfY': _0x5314e9(0x556) }, _0x441dd7 = _0x4efb0b[_0x5314e9(0x45c)][_0x5314e9(0x80d)]('|'); let _0x1fa66e = 0x1d56 + -0x17d5 + -0x581 * 0x1; while (!![]) { switch (_0x441dd7[_0x1fa66e++]) { case '0': this['_helpWindo' + 'w'] && this[_0x5314e9(0xc97) + 'w']['setBackgro' + 'undType'](Scene_Skill[_0x5314e9(0x275) + _0x5314e9(0xcd3)]['HelpBgType']); continue; case '1': this[_0x5314e9(0x75c) + 'dow'] && this[_0x5314e9(0x75c) + _0x5314e9(0x7fa)][_0x5314e9(0x9ed) + _0x5314e9(0xed1)](Scene_Skill['layoutSett' + 'ings'][_0x5314e9(0x4aa) + 'pe']); continue; case '2': this[_0x5314e9(0x757) + 'Window'] && this[_0x5314e9(0x757) + _0x5314e9(0x3ef)][_0x5314e9(0x9ed) + _0x5314e9(0xed1)](Scene_Skill[_0x5314e9(0x275) + _0x5314e9(0xcd3)]['SkillTypeB' + 'gType']); continue; case '3': this['_actorWind' + 'ow'] && this[_0x5314e9(0x1f4) + 'ow']['setBackgro' + 'undType'](Scene_Skill[_0x5314e9(0x275) + 'ings']['ActorBgTyp' + 'e']); continue; case '4': this[_0x5314e9(0xab6) + 'w'] && this[_0x5314e9(0xab6) + 'w']['setBackgro' + _0x5314e9(0xed1)](Scene_Skill[_0x5314e9(0x275) + _0x5314e9(0xcd3)][_0x5314e9(0x655)]); continue; }break; } }, Scene_Skill['prototype'][_0x3a6da1(0xc6e) + _0x3a6da1(0xa22)] = function () { const _0x2743b9 = _0x3a6da1; return Scene_Skill[_0x2743b9(0x275) + 'ings'][_0x2743b9(0x8ad)][_0x2743b9(0xedc)](this); }, Scene_Skill['prototype'][_0x3a6da1(0x1057) + 'indowRect'] = function () { const _0x1eb9b9 = _0x3a6da1; return Scene_Skill['layoutSett' + 'ings']['SkillTypeR' + 'ect'][_0x1eb9b9(0xedc)](this); }, Scene_Skill['prototype'][_0x3a6da1(0xcff) + _0x3a6da1(0x982)] = function () { const _0x397fbf = _0x3a6da1; return Scene_Skill[_0x397fbf(0x275) + 'ings'][_0x397fbf(0xe28)][_0x397fbf(0xedc)](this); }, Scene_Skill[_0x3a6da1(0x49b)][_0x3a6da1(0xa93) + _0x3a6da1(0xa22)] = function () { return Scene_Skill['layoutSett' + 'ings']['ItemRect']['call'](this); }, Scene_Skill[_0x3a6da1(0x49b)][_0x3a6da1(0x827) + _0x3a6da1(0xdc8)] = function () { const _0x5a0b00 = _0x3a6da1; return Scene_Skill['layoutSett' + _0x5a0b00(0xcd3)][_0x5a0b00(0x8fa)]['call'](this); }, Scene_Equip[_0x3a6da1(0x275) + _0x3a6da1(0xcd3)] = VisuMZ[_0x3a6da1(0xc9f)]['Settings'][_0x3a6da1(0x943)]['EquipMenu'], VisuMZ[_0x3a6da1(0xc9f)]['Scene_Equi' + _0x3a6da1(0x51a)] = Scene_Equip[_0x3a6da1(0x49b)][_0x3a6da1(0xc26)], Scene_Equip[_0x3a6da1(0x49b)]['create'] = function () { const _0x592014 = _0x3a6da1; VisuMZ[_0x592014(0xc9f)][_0x592014(0x4db) + 'p_create'][_0x592014(0xedc)](this), this['setCoreEng' + _0x592014(0x5aa) + _0x592014(0xad3)](); }, Scene_Equip[_0x3a6da1(0x49b)]['setCoreEng' + _0x3a6da1(0x5aa) + _0x3a6da1(0xad3)] = function () { const _0x18a4a7 = _0x3a6da1, _0x476154 = { 'gakkV': _0x18a4a7(0x1028) }, _0x5d0d15 = _0x476154[_0x18a4a7(0x1d8)][_0x18a4a7(0x80d)]('|'); let _0x7ead66 = 0xb * 0x22d + 0x4 * -0x78b + -0x63d * -0x1; while (!![]) { switch (_0x5d0d15[_0x7ead66++]) { case '0': this[_0x18a4a7(0xfa6) + 'w'] && this[_0x18a4a7(0xfa6) + 'w']['setBackgro' + 'undType'](Scene_Equip[_0x18a4a7(0x275) + _0x18a4a7(0xcd3)][_0x18a4a7(0xeee)]); continue; case '1': this[_0x18a4a7(0xab6) + 'w'] && this[_0x18a4a7(0xab6) + 'w']['setBackgro' + _0x18a4a7(0xed1)](Scene_Equip[_0x18a4a7(0x275) + _0x18a4a7(0xcd3)][_0x18a4a7(0x655)]); continue; case '2': this[_0x18a4a7(0xc97) + 'w'] && this[_0x18a4a7(0xc97) + 'w'][_0x18a4a7(0x9ed) + _0x18a4a7(0xed1)](Scene_Equip[_0x18a4a7(0x275) + _0x18a4a7(0xcd3)][_0x18a4a7(0x237)]); continue; case '3': this[_0x18a4a7(0x280) + _0x18a4a7(0x41f)] && this[_0x18a4a7(0x280) + _0x18a4a7(0x41f)][_0x18a4a7(0x9ed) + _0x18a4a7(0xed1)](Scene_Equip['layoutSett' + _0x18a4a7(0xcd3)][_0x18a4a7(0xf2a) + _0x18a4a7(0xa6e)]); continue; case '4': this[_0x18a4a7(0x75c) + _0x18a4a7(0x7fa)] && this[_0x18a4a7(0x75c) + _0x18a4a7(0x7fa)][_0x18a4a7(0x9ed) + 'undType'](Scene_Equip[_0x18a4a7(0x275) + 'ings'][_0x18a4a7(0x4aa) + 'pe']); continue; }break; } }, Scene_Equip[_0x3a6da1(0x49b)][_0x3a6da1(0xc6e) + _0x3a6da1(0xa22)] = function () { const _0x4e8b9b = _0x3a6da1; return Scene_Equip['layoutSett' + _0x4e8b9b(0xcd3)][_0x4e8b9b(0x8ad)][_0x4e8b9b(0xedc)](this); }, Scene_Equip[_0x3a6da1(0x49b)][_0x3a6da1(0xcff) + 'owRect'] = function () { const _0x5abd5e = _0x3a6da1; return Scene_Equip[_0x5abd5e(0x275) + _0x5abd5e(0xcd3)][_0x5abd5e(0xe28)][_0x5abd5e(0xedc)](this); }, Scene_Equip['prototype'][_0x3a6da1(0x567) + _0x3a6da1(0x5c1)] = function () { const _0x3edb1d = _0x3a6da1; return Scene_Equip['layoutSett' + _0x3edb1d(0xcd3)]['CommandRec' + 't'][_0x3edb1d(0xedc)](this); }, Scene_Equip[_0x3a6da1(0x49b)][_0x3a6da1(0xf1b) + _0x3a6da1(0xa22)] = function () { const _0x35fde8 = _0x3a6da1; return Scene_Equip['layoutSett' + _0x35fde8(0xcd3)][_0x35fde8(0xce3)]['call'](this); }, Scene_Equip['prototype'][_0x3a6da1(0xa93) + _0x3a6da1(0xa22)] = function () { const _0x42d472 = _0x3a6da1; return Scene_Equip[_0x42d472(0x275) + 'ings'][_0x42d472(0xa91)][_0x42d472(0xedc)](this); }, Scene_Status[_0x3a6da1(0x275) + _0x3a6da1(0xcd3)] = VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x316)][_0x3a6da1(0x943)]['StatusMenu'], VisuMZ[_0x3a6da1(0xc9f)]['Scene_Stat' + _0x3a6da1(0xe4d)] = Scene_Status[_0x3a6da1(0x49b)]['create'], Scene_Status[_0x3a6da1(0x49b)][_0x3a6da1(0xc26)] = function () { const _0x3dfb8a = _0x3a6da1; VisuMZ[_0x3dfb8a(0xc9f)][_0x3dfb8a(0xa94) + _0x3dfb8a(0xe4d)][_0x3dfb8a(0xedc)](this), this['setCoreEng' + _0x3dfb8a(0x5aa) + _0x3dfb8a(0xad3)](); }, Scene_Status[_0x3a6da1(0x49b)]['setCoreEng' + _0x3a6da1(0x5aa) + _0x3a6da1(0xad3)] = function () { const _0x136b44 = _0x3a6da1; this[_0x136b44(0x467) + _0x136b44(0x41f)] && this[_0x136b44(0x467) + _0x136b44(0x41f)][_0x136b44(0x9ed) + _0x136b44(0xed1)](Scene_Status[_0x136b44(0x275) + _0x136b44(0xcd3)][_0x136b44(0x2db) + _0x136b44(0xa6e)]), this[_0x136b44(0x75c) + _0x136b44(0x7fa)] && this[_0x136b44(0x75c) + 'dow'][_0x136b44(0x9ed) + _0x136b44(0xed1)](Scene_Status[_0x136b44(0x275) + _0x136b44(0xcd3)][_0x136b44(0x4aa) + 'pe']), this[_0x136b44(0xdbb) + _0x136b44(0xff5)] && this[_0x136b44(0xdbb) + _0x136b44(0xff5)][_0x136b44(0x9ed) + 'undType'](Scene_Status[_0x136b44(0x275) + 'ings'][_0x136b44(0x5dd) + _0x136b44(0x989)]), this['_statusEqu' + _0x136b44(0x713)] && this[_0x136b44(0xdd3) + 'ipWindow'][_0x136b44(0x9ed) + 'undType'](Scene_Status[_0x136b44(0x275) + _0x136b44(0xcd3)][_0x136b44(0x8f2) + 'pBgType']); }, Scene_Status['prototype'][_0x3a6da1(0x48d) + _0x3a6da1(0x5c1)] = function () { const _0x47e121 = _0x3a6da1; return Scene_Status[_0x47e121(0x275) + _0x47e121(0xcd3)][_0x47e121(0x204) + 't']['call'](this); }, Scene_Status['prototype']['statusWind' + _0x3a6da1(0x982)] = function () { const _0xc09909 = _0x3a6da1; return Scene_Status[_0xc09909(0x275) + 'ings']['StatusRect']['call'](this); }, Scene_Status[_0x3a6da1(0x49b)]['statusPara' + _0x3a6da1(0x3db) + 'ct'] = function () { const _0x521988 = _0x3a6da1; return Scene_Status['layoutSett' + _0x521988(0xcd3)][_0x521988(0x5dd) + _0x521988(0xecf)][_0x521988(0xedc)](this); }, Scene_Status['prototype'][_0x3a6da1(0x750) + 'pWindowRec' + 't'] = function () { const _0x3efc3b = _0x3a6da1; return Scene_Status[_0x3efc3b(0x275) + _0x3efc3b(0xcd3)][_0x3efc3b(0x8f2) + _0x3efc3b(0x9e1)][_0x3efc3b(0xedc)](this); }, Scene_Options[_0x3a6da1(0x275) + _0x3a6da1(0xcd3)] = VisuMZ['CoreEngine'][_0x3a6da1(0x316)]['MenuLayout'][_0x3a6da1(0x80f) + 'u'], VisuMZ[_0x3a6da1(0xc9f)]['Scene_Opti' + _0x3a6da1(0xcce)] = Scene_Options['prototype']['create'], Scene_Options['prototype'][_0x3a6da1(0xc26)] = function () { const _0x4c7de0 = _0x3a6da1; VisuMZ[_0x4c7de0(0xc9f)][_0x4c7de0(0x496) + _0x4c7de0(0xcce)][_0x4c7de0(0xedc)](this), this['setCoreEng' + 'ineUpdateW' + 'indowBg'](); }, Scene_Options[_0x3a6da1(0x49b)][_0x3a6da1(0xa3e) + _0x3a6da1(0x5aa) + 'indowBg'] = function () { const _0x5d0438 = _0x3a6da1; this[_0x5d0438(0x926) + _0x5d0438(0x41f)] && this[_0x5d0438(0x926) + _0x5d0438(0x41f)][_0x5d0438(0x9ed) + _0x5d0438(0xed1)](Scene_Options[_0x5d0438(0x275) + _0x5d0438(0xcd3)][_0x5d0438(0x9b9) + _0x5d0438(0xa6e)]); }, Scene_Options[_0x3a6da1(0x49b)][_0x3a6da1(0x5e7) + _0x3a6da1(0x5c1)] = function () { const _0x4fee31 = _0x3a6da1; return Scene_Options['layoutSett' + _0x4fee31(0xcd3)][_0x4fee31(0xdff) + 't'][_0x4fee31(0xedc)](this); }, Scene_Save['layoutSett' + _0x3a6da1(0xcd3)] = VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x316)][_0x3a6da1(0x943)]['SaveMenu'], Scene_Save[_0x3a6da1(0x49b)][_0x3a6da1(0xc26)] = function () { const _0x6d8119 = _0x3a6da1; Scene_File[_0x6d8119(0x49b)]['create']['call'](this), this['setCoreEng' + _0x6d8119(0x5aa) + _0x6d8119(0xad3)](); }, Scene_Save[_0x3a6da1(0x49b)][_0x3a6da1(0xa3e) + _0x3a6da1(0x5aa) + _0x3a6da1(0xad3)] = function () { const _0x1f5434 = _0x3a6da1; this[_0x1f5434(0xc97) + 'w'] && this[_0x1f5434(0xc97) + 'w'][_0x1f5434(0x9ed) + _0x1f5434(0xed1)](Scene_Save[_0x1f5434(0x275) + _0x1f5434(0xcd3)][_0x1f5434(0x237)]), this[_0x1f5434(0x399) + 'w'] && this[_0x1f5434(0x399) + 'w']['setBackgro' + _0x1f5434(0xed1)](Scene_Save[_0x1f5434(0x275) + _0x1f5434(0xcd3)][_0x1f5434(0x913)]); }, Scene_Save[_0x3a6da1(0x49b)][_0x3a6da1(0xc6e) + _0x3a6da1(0xa22)] = function () { const _0x3a69f0 = _0x3a6da1; return Scene_Save['layoutSett' + _0x3a69f0(0xcd3)]['HelpRect'][_0x3a69f0(0xedc)](this); }, Scene_Save[_0x3a6da1(0x49b)][_0x3a6da1(0xc4a) + _0x3a6da1(0xa22)] = function () { const _0x1aa665 = _0x3a6da1; return Scene_Save[_0x1aa665(0x275) + _0x1aa665(0xcd3)]['ListRect']['call'](this); }, Scene_Load['layoutSett' + _0x3a6da1(0xcd3)] = VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x316)][_0x3a6da1(0x943)]['LoadMenu'], Scene_Load[_0x3a6da1(0x49b)][_0x3a6da1(0xc26)] = function () { const _0x292284 = _0x3a6da1; Scene_File[_0x292284(0x49b)][_0x292284(0xc26)]['call'](this), this['setCoreEng' + _0x292284(0x5aa) + 'indowBg'](); }, Scene_Load[_0x3a6da1(0x49b)]['setCoreEng' + _0x3a6da1(0x5aa) + 'indowBg'] = function () { const _0x25e58d = _0x3a6da1; this['_helpWindo' + 'w'] && this['_helpWindo' + 'w'][_0x25e58d(0x9ed) + _0x25e58d(0xed1)](Scene_Load[_0x25e58d(0x275) + _0x25e58d(0xcd3)][_0x25e58d(0x237)]), this[_0x25e58d(0x399) + 'w'] && this['_listWindo' + 'w'][_0x25e58d(0x9ed) + _0x25e58d(0xed1)](Scene_Load[_0x25e58d(0x275) + 'ings'][_0x25e58d(0x913)]); }, Scene_Load[_0x3a6da1(0x49b)][_0x3a6da1(0xc6e) + 'Rect'] = function () { const _0x555ad2 = _0x3a6da1; return Scene_Load[_0x555ad2(0x275) + _0x555ad2(0xcd3)][_0x555ad2(0x8ad)][_0x555ad2(0xedc)](this); }, Scene_Load[_0x3a6da1(0x49b)][_0x3a6da1(0xc4a) + _0x3a6da1(0xa22)] = function () { const _0x29660a = _0x3a6da1; return Scene_Load[_0x29660a(0x275) + _0x29660a(0xcd3)][_0x29660a(0x9ab)]['call'](this); }; function Scene_QuickLoad() { const _0x19e533 = _0x3a6da1; this[_0x19e533(0xa40)](...arguments); } Scene_QuickLoad['prototype'] = Object[_0x3a6da1(0xc26)](Scene_Load['prototype']), Scene_QuickLoad['prototype'][_0x3a6da1(0x3b0) + 'r'] = Scene_QuickLoad, Scene_QuickLoad[_0x3a6da1(0x49b)]['initialize'] = function () { const _0x5240e6 = _0x3a6da1; Scene_Load[_0x5240e6(0x49b)][_0x5240e6(0xa40)][_0x5240e6(0xedc)](this); }, Scene_QuickLoad['prototype'][_0x3a6da1(0xc26)] = function () { const _0x303f3f = _0x3a6da1; this[_0x303f3f(0x6b1) + 'd'](this[_0x303f3f(0x7fd) + 'D']); }, Scene_QuickLoad[_0x3a6da1(0x49b)][_0x3a6da1(0xbdc)] = function (_0x2912a2) { const _0x51094b = _0x3a6da1; this[_0x51094b(0x7fd) + 'D'] = _0x2912a2; }, Scene_QuickLoad[_0x3a6da1(0x49b)][_0x3a6da1(0x2b1)] = function () { const _0x54c432 = _0x3a6da1; Scene_MenuBase[_0x54c432(0x49b)][_0x54c432(0x2b1)]['call'](this); }, Scene_GameEnd['layoutSett' + _0x3a6da1(0xcd3)] = VisuMZ[_0x3a6da1(0xc9f)]['Settings'][_0x3a6da1(0x943)]['GameEnd'], VisuMZ['CoreEngine'][_0x3a6da1(0x60e) + 'End_create' + 'Background'] = Scene_GameEnd[_0x3a6da1(0x49b)][_0x3a6da1(0x515) + _0x3a6da1(0xf3d)], Scene_GameEnd[_0x3a6da1(0x49b)][_0x3a6da1(0x515) + _0x3a6da1(0xf3d)] = function () { const _0x10e515 = _0x3a6da1; Scene_MenuBase[_0x10e515(0x49b)][_0x10e515(0x515) + _0x10e515(0xf3d)][_0x10e515(0xedc)](this); }, Scene_GameEnd['prototype'][_0x3a6da1(0x1068) + _0x3a6da1(0x738)] = function () { const _0x2f69fd = _0x3a6da1, _0x4ea91d = { 'Jsbjw': _0x2f69fd(0x558) }, _0x156c3c = this[_0x2f69fd(0x567) + _0x2f69fd(0x5c1)](); this[_0x2f69fd(0x280) + _0x2f69fd(0x41f)] = new Window_GameEnd(_0x156c3c), this[_0x2f69fd(0x280) + _0x2f69fd(0x41f)][_0x2f69fd(0x4e1)](_0x4ea91d[_0x2f69fd(0xd71)], this[_0x2f69fd(0x569)][_0x2f69fd(0xdeb)](this)), this[_0x2f69fd(0x586)](this['_commandWi' + 'ndow']), this[_0x2f69fd(0x280) + _0x2f69fd(0x41f)][_0x2f69fd(0x9ed) + _0x2f69fd(0xed1)](Scene_GameEnd['layoutSett' + _0x2f69fd(0xcd3)][_0x2f69fd(0xf2a) + 'ype']); }, Scene_GameEnd['prototype']['commandWin' + 'dowRect'] = function () { const _0x529ad6 = _0x3a6da1; return Scene_GameEnd[_0x529ad6(0x275) + _0x529ad6(0xcd3)][_0x529ad6(0x1081) + 't'][_0x529ad6(0xedc)](this); }, Scene_Shop[_0x3a6da1(0x275) + _0x3a6da1(0xcd3)] = VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x316)][_0x3a6da1(0x943)][_0x3a6da1(0x959)], VisuMZ['CoreEngine']['Scene_Shop' + _0x3a6da1(0xc52)] = Scene_Shop[_0x3a6da1(0x49b)][_0x3a6da1(0xc26)], Scene_Shop[_0x3a6da1(0x49b)][_0x3a6da1(0xc26)] = function () { const _0x60f6d8 = _0x3a6da1; VisuMZ['CoreEngine'][_0x60f6d8(0x104b) + _0x60f6d8(0xc52)][_0x60f6d8(0xedc)](this), this[_0x60f6d8(0xa3e) + _0x60f6d8(0x5aa) + _0x60f6d8(0xad3)](); }, Scene_Shop['prototype'][_0x3a6da1(0xa3e) + _0x3a6da1(0x5aa) + _0x3a6da1(0xad3)] = function () { const _0x37871e = _0x3a6da1, _0x14ef73 = { 'IzMtT': _0x37871e(0x5e0) + _0x37871e(0x64d) }, _0x5092c4 = _0x14ef73[_0x37871e(0xc5f)][_0x37871e(0x80d)]('|'); let _0x2f5581 = -0xa7 * 0x3 + -0x637 * 0x1 + -0x82c * -0x1; while (!![]) { switch (_0x5092c4[_0x2f5581++]) { case '0': this[_0x37871e(0xc97) + 'w'] && this[_0x37871e(0xc97) + 'w'][_0x37871e(0x9ed) + 'undType'](Scene_Shop[_0x37871e(0x275) + _0x37871e(0xcd3)]['HelpBgType']); continue; case '1': this[_0x37871e(0x100f)] && this[_0x37871e(0x100f)][_0x37871e(0x9ed) + _0x37871e(0xed1)](Scene_Shop[_0x37871e(0x275) + _0x37871e(0xcd3)]['BuyBgType']); continue; case '2': this[_0x37871e(0x280) + _0x37871e(0x41f)] && this['_commandWi' + _0x37871e(0x41f)]['setBackgro' + _0x37871e(0xed1)](Scene_Shop[_0x37871e(0x275) + _0x37871e(0xcd3)]['CommandBgT' + _0x37871e(0xa6e)]); continue; case '3': this[_0x37871e(0xd94) + 'w'] && this[_0x37871e(0xd94) + 'w'][_0x37871e(0x9ed) + 'undType'](Scene_Shop[_0x37871e(0x275) + 'ings']['SellBgType']); continue; case '4': this[_0x37871e(0xedf) + _0x37871e(0x1014)] && this['_categoryW' + _0x37871e(0x1014)][_0x37871e(0x9ed) + _0x37871e(0xed1)](Scene_Shop[_0x37871e(0x275) + _0x37871e(0xcd3)][_0x37871e(0x8cd) + _0x37871e(0xfac)]); continue; case '5': this[_0x37871e(0xae9) + 'w'] && this[_0x37871e(0xae9) + 'w'][_0x37871e(0x9ed) + 'undType'](Scene_Shop[_0x37871e(0x275) + _0x37871e(0xcd3)][_0x37871e(0xc41)]); continue; case '6': this[_0x37871e(0x30c) + 'ow'] && this[_0x37871e(0x30c) + 'ow'][_0x37871e(0x9ed) + 'undType'](Scene_Shop['layoutSett' + 'ings'][_0x37871e(0x403) + 'e']); continue; case '7': this['_statusWin' + _0x37871e(0x7fa)] && this[_0x37871e(0x75c) + _0x37871e(0x7fa)][_0x37871e(0x9ed) + 'undType'](Scene_Shop[_0x37871e(0x275) + _0x37871e(0xcd3)][_0x37871e(0x4aa) + 'pe']); continue; case '8': this[_0x37871e(0xc98) + _0x37871e(0x7fa)] && this[_0x37871e(0xc98) + _0x37871e(0x7fa)][_0x37871e(0x9ed) + _0x37871e(0xed1)](Scene_Shop['layoutSett' + _0x37871e(0xcd3)]['NumberBgTy' + 'pe']); continue; }break; } }, Scene_Shop['prototype'][_0x3a6da1(0xc6e) + _0x3a6da1(0xa22)] = function () { const _0xf328b0 = _0x3a6da1; return Scene_Shop[_0xf328b0(0x275) + _0xf328b0(0xcd3)][_0xf328b0(0x8ad)][_0xf328b0(0xedc)](this); }, Scene_Shop[_0x3a6da1(0x49b)]['goldWindow' + _0x3a6da1(0xa22)] = function () { const _0x7ee498 = _0x3a6da1; return Scene_Shop[_0x7ee498(0x275) + _0x7ee498(0xcd3)]['GoldRect'][_0x7ee498(0xedc)](this); }, Scene_Shop[_0x3a6da1(0x49b)]['commandWin' + _0x3a6da1(0x5c1)] = function () { const _0x3b9e5c = _0x3a6da1; return Scene_Shop[_0x3b9e5c(0x275) + _0x3b9e5c(0xcd3)][_0x3b9e5c(0x1081) + 't']['call'](this); }, Scene_Shop[_0x3a6da1(0x49b)]['dummyWindo' + _0x3a6da1(0xdc8)] = function () { const _0x589cb8 = _0x3a6da1; return Scene_Shop[_0x589cb8(0x275) + _0x589cb8(0xcd3)][_0x589cb8(0x960)][_0x589cb8(0xedc)](this); }, Scene_Shop[_0x3a6da1(0x49b)][_0x3a6da1(0x1048) + _0x3a6da1(0x982)] = function () { const _0xd8ed2e = _0x3a6da1; return Scene_Shop['layoutSett' + _0xd8ed2e(0xcd3)][_0xd8ed2e(0x1fe)][_0xd8ed2e(0xedc)](this); }, Scene_Shop[_0x3a6da1(0x49b)]['statusWind' + _0x3a6da1(0x982)] = function () { const _0x10c536 = _0x3a6da1; return Scene_Shop['layoutSett' + _0x10c536(0xcd3)][_0x10c536(0xe28)][_0x10c536(0xedc)](this); }, Scene_Shop[_0x3a6da1(0x49b)][_0x3a6da1(0x368) + 'ect'] = function () { const _0x46a0e7 = _0x3a6da1; return Scene_Shop[_0x46a0e7(0x275) + _0x46a0e7(0xcd3)][_0x46a0e7(0xe82)][_0x46a0e7(0xedc)](this); }, Scene_Shop[_0x3a6da1(0x49b)][_0x3a6da1(0x754) + _0x3a6da1(0xbff)] = function () { const _0x1d7162 = _0x3a6da1; return Scene_Shop[_0x1d7162(0x275) + 'ings'][_0x1d7162(0xbc1) + 'ct'][_0x1d7162(0xedc)](this); }, Scene_Shop[_0x3a6da1(0x49b)][_0x3a6da1(0x27e) + _0x3a6da1(0xa22)] = function () { const _0xd2773f = _0x3a6da1; return Scene_Shop['layoutSett' + _0xd2773f(0xcd3)]['SellRect'][_0xd2773f(0xedc)](this); }, Scene_Name[_0x3a6da1(0x275) + _0x3a6da1(0xcd3)] = VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x316)][_0x3a6da1(0x943)][_0x3a6da1(0xf13)], VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x666) + '_create'] = Scene_Name[_0x3a6da1(0x49b)][_0x3a6da1(0xc26)], Scene_Name[_0x3a6da1(0x49b)][_0x3a6da1(0xc26)] = function () { const _0x1d1a34 = _0x3a6da1; VisuMZ['CoreEngine'][_0x1d1a34(0x666) + _0x1d1a34(0xc52)][_0x1d1a34(0xedc)](this), this[_0x1d1a34(0xa3e) + _0x1d1a34(0x5aa) + 'indowBg'](); }, Scene_Name[_0x3a6da1(0x49b)][_0x3a6da1(0xa3e) + _0x3a6da1(0x5aa) + _0x3a6da1(0xad3)] = function () { const _0x2af983 = _0x3a6da1; this[_0x2af983(0x1e9) + 'w'] && this[_0x2af983(0x1e9) + 'w']['setBackgro' + _0x2af983(0xed1)](Scene_Name[_0x2af983(0x275) + _0x2af983(0xcd3)]['EditBgType']), this[_0x2af983(0x53d) + 'ow'] && this['_inputWind' + 'ow'][_0x2af983(0x9ed) + _0x2af983(0xed1)](Scene_Name['layoutSett' + _0x2af983(0xcd3)][_0x2af983(0x6da) + 'e']); }, Scene_Name['prototype'][_0x3a6da1(0x7b1) + _0x3a6da1(0x4d0)] = function () { return -0x1005 + -0x1 * -0x233 + 0x1 * 0xdd2; }, Scene_Name[_0x3a6da1(0x49b)]['editWindow' + 'Rect'] = function () { const _0x1d5d1e = _0x3a6da1; return Scene_Name['layoutSett' + _0x1d5d1e(0xcd3)][_0x1d5d1e(0x57a)][_0x1d5d1e(0xedc)](this); }, Scene_Name[_0x3a6da1(0x49b)][_0x3a6da1(0xff7) + _0x3a6da1(0xdc8)] = function () { const _0x2bc62a = _0x3a6da1; return Scene_Name[_0x2bc62a(0x275) + 'ings'][_0x2bc62a(0x575)][_0x2bc62a(0xedc)](this); }, Scene_Name['prototype'][_0x3a6da1(0x38e) + _0x3a6da1(0x694)] = function () { const _0x186a5c = _0x3a6da1; if (!this['_inputWind' + 'ow']) return ![]; return VisuMZ[_0x186a5c(0xc9f)]['Settings']['KeyboardIn' + _0x186a5c(0xd57)][_0x186a5c(0x38e) + _0x186a5c(0x694)]; }, Scene_Name['prototype']['buttonAssi' + _0x3a6da1(0x9f6)] = function () { const _0x22a2db = _0x3a6da1, _0x2e6b83 = { 'ezgsb': function (_0x421bfb, _0x3e8a6d) { return _0x421bfb !== _0x3e8a6d; }, 'LqESs': _0x22a2db(0x503), 'QUJSp': 'pageup', 'kTSNi': 'pagedown' }; if (this[_0x22a2db(0x38e) + _0x22a2db(0x694)]() && _0x2e6b83[_0x22a2db(0xf34)](this['_inputWind' + 'ow'][_0x22a2db(0xea0)], _0x2e6b83[_0x22a2db(0x2d5)])) return TextManager[_0x22a2db(0x203) + 'ltiButtonS' + _0x22a2db(0xaa7)](_0x2e6b83[_0x22a2db(0x705)], _0x2e6b83['kTSNi']); return Scene_MenuBase['prototype'][_0x22a2db(0x647) + _0x22a2db(0x9f6)][_0x22a2db(0xedc)](this); }, Scene_Name['prototype'][_0x3a6da1(0x647) + _0x3a6da1(0x1e7)] = function () { const _0x439489 = _0x3a6da1, _0x2a6dcc = { 'cVbRN': _0x439489(0x9a3) }; return this[_0x439489(0x38e) + _0x439489(0x694)]() ? TextManager[_0x439489(0xc94) + _0x439489(0x816)](_0x2a6dcc[_0x439489(0x7b0)]) : Scene_MenuBase[_0x439489(0x49b)][_0x439489(0x647) + _0x439489(0x1e7)][_0x439489(0xedc)](this); }, Scene_Name['prototype']['buttonAssi' + _0x3a6da1(0x1079)] = function () { const _0x3eebb7 = _0x3a6da1, _0x384029 = { 'LRGnh': function (_0x409c2d, _0x18ea4e) { return _0x409c2d === _0x18ea4e; }, 'nZdmX': _0x3eebb7(0x503), 'VPUwP': _0x3eebb7(0x800) }; if (this[_0x3eebb7(0x38e) + _0x3eebb7(0x694)]() && _0x384029[_0x3eebb7(0x5f2)](this['_inputWind' + 'ow']['_mode'], _0x384029[_0x3eebb7(0x3ff)])) return TextManager[_0x3eebb7(0xc64) + _0x3eebb7(0xabd) + 'g']([_0x384029[_0x3eebb7(0x262)]]); return Scene_MenuBase[_0x3eebb7(0x49b)][_0x3eebb7(0x647) + _0x3eebb7(0x1079)][_0x3eebb7(0xedc)](this); }, Scene_Name[_0x3a6da1(0x49b)][_0x3a6da1(0x647) + 'stKey5'] = function () { const _0x352316 = _0x3a6da1, _0x77830b = { 'zHXoG': function (_0x557c26, _0x20ee86) { return _0x557c26 === _0x20ee86; }, 'MGryZ': _0x352316(0x503), 'ZhIif': 'BKSP' }; if (this[_0x352316(0x38e) + _0x352316(0x694)]() && _0x77830b[_0x352316(0x36b)](this[_0x352316(0x53d) + 'ow'][_0x352316(0xea0)], _0x77830b[_0x352316(0xe16)])) return TextManager[_0x352316(0xc64) + 'uttonStrin' + 'g']([_0x77830b[_0x352316(0x1f1)]]); return Scene_MenuBase[_0x352316(0x49b)]['buttonAssi' + _0x352316(0x460)][_0x352316(0xedc)](this); }, Scene_Name[_0x3a6da1(0x49b)][_0x3a6da1(0x647) + _0x3a6da1(0x587)] = function () { const _0x247bb1 = _0x3a6da1, _0xcb89d = { 'erCWN': function (_0x531d3a, _0x5ad581) { return _0x531d3a !== _0x5ad581; }, 'TbGAT': 'keyboard', 'HeLgD': _0x247bb1(0x21e) }; if (this[_0x247bb1(0x38e) + _0x247bb1(0x694)]() && _0xcb89d[_0x247bb1(0x653)](this['_inputWind' + 'ow'][_0x247bb1(0xea0)], _0xcb89d['TbGAT'])) { const _0x213270 = VisuMZ[_0x247bb1(0xc9f)][_0x247bb1(0x316)][_0x247bb1(0x988) + _0x247bb1(0xd57)]; return _0x213270[_0x247bb1(0x50f)] || _0xcb89d['HeLgD']; } return Scene_MenuBase[_0x247bb1(0x49b)][_0x247bb1(0x647) + 'stText1'][_0x247bb1(0xedc)](this); }, Scene_Name[_0x3a6da1(0x49b)][_0x3a6da1(0x647) + _0x3a6da1(0x7ae)] = function () { const _0x591d1a = _0x3a6da1, _0x1b385b = { 'VEUUD': function (_0x2dbb5e, _0x42ef50) { return _0x2dbb5e === _0x42ef50; }, 'yJckw': _0x591d1a(0x503), 'npFWi': _0x591d1a(0x82c), 'zqvtg': _0x591d1a(0xda2) }; if (this[_0x591d1a(0x38e) + _0x591d1a(0x694)]()) { const _0x3fca8c = VisuMZ['CoreEngine'][_0x591d1a(0x316)][_0x591d1a(0x988) + 'put']; return _0x1b385b['VEUUD'](this['_inputWind' + 'ow'][_0x591d1a(0xea0)], _0x1b385b['yJckw']) ? _0x3fca8c[_0x591d1a(0x82c)] || _0x1b385b[_0x591d1a(0xa92)] : _0x3fca8c[_0x591d1a(0xda2)] || _0x1b385b[_0x591d1a(0x94c)]; } else return Scene_MenuBase['prototype'][_0x591d1a(0x647) + _0x591d1a(0x7ae)][_0x591d1a(0xedc)](this); }, Scene_Name[_0x3a6da1(0x49b)][_0x3a6da1(0x647) + _0x3a6da1(0xe6e)] = function () { const _0x9b9e69 = _0x3a6da1, _0x5e95bc = { 'zJyQS': function (_0x406179, _0x55f16b) { return _0x406179 === _0x55f16b; }, 'iltqS': _0x9b9e69(0x503), 'efzNF': _0x9b9e69(0xb80) }; if (this[_0x9b9e69(0x38e) + _0x9b9e69(0x694)]()) { const _0x32274d = VisuMZ[_0x9b9e69(0xc9f)][_0x9b9e69(0x316)]['KeyboardIn' + _0x9b9e69(0xd57)]; if (_0x5e95bc[_0x9b9e69(0x3ab)](this[_0x9b9e69(0x53d) + 'ow'][_0x9b9e69(0xea0)], _0x5e95bc[_0x9b9e69(0xb81)])) return _0x32274d[_0x9b9e69(0xb80)] || _0x5e95bc[_0x9b9e69(0x1029)]; } return Scene_MenuBase[_0x9b9e69(0x49b)][_0x9b9e69(0x647) + _0x9b9e69(0xe6e)]['call'](this); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x666) + '_onInputOk'] = Scene_Name['prototype']['onInputOk'], Scene_Name['prototype'][_0x3a6da1(0x4a5)] = function () { const _0x139276 = _0x3a6da1; this[_0x139276(0x8c8) + _0x139276(0x889) + 'dWords']() ? this[_0x139276(0xfcd) + _0x139276(0xff9)]() : VisuMZ[_0x139276(0xc9f)]['Scene_Name' + '_onInputOk'][_0x139276(0xedc)](this); }, Scene_Name[_0x3a6da1(0x49b)]['doesNameCo' + _0x3a6da1(0x889) + _0x3a6da1(0x7d8)] = function () { const _0x398de3 = _0x3a6da1, _0x58cb10 = VisuMZ[_0x398de3(0xc9f)][_0x398de3(0x316)][_0x398de3(0x988) + _0x398de3(0xd57)]; if (!_0x58cb10) return ![]; const _0x27fd95 = _0x58cb10[_0x398de3(0x2e0) + 's']; if (!_0x27fd95) return ![]; const _0x3f77aa = this[_0x398de3(0x1e9) + 'w'][_0x398de3(0x796)]()[_0x398de3(0xb6a) + 'e'](); for (const _0x376a1b of _0x27fd95) { if (_0x3f77aa[_0x398de3(0xa43)](_0x376a1b[_0x398de3(0xb6a) + 'e']())) return !![]; } return ![]; }, Scene_Name[_0x3a6da1(0x49b)][_0x3a6da1(0xfcd) + _0x3a6da1(0xff9)] = function () { SoundManager['playBuzzer'](); }, VisuMZ['CoreEngine'][_0x3a6da1(0x6cd) + _0x3a6da1(0x817)] = Scene_Battle['prototype'][_0x3a6da1(0xc16)], Scene_Battle[_0x3a6da1(0x49b)]['update'] = function () { const _0x4de0c5 = _0x3a6da1; VisuMZ[_0x4de0c5(0xc9f)][_0x4de0c5(0x6cd) + _0x4de0c5(0x817)][_0x4de0c5(0xedc)](this); if ($gameTemp['_playTestF' + _0x4de0c5(0x39b)]) this[_0x4de0c5(0x4e2) + _0x4de0c5(0x218)](); }, Scene_Battle[_0x3a6da1(0x49b)]['updatePlay' + _0x3a6da1(0x218)] = function () { const _0x1e6a3a = _0x3a6da1; !BattleManager[_0x1e6a3a(0xff8) + 'g']() && !this['_playtestF' + _0x1e6a3a(0xcd6)] && !$gameMessage[_0x1e6a3a(0x43f)]() && (this[_0x1e6a3a(0x829) + _0x1e6a3a(0xcd6)] = !![], this[_0x1e6a3a(0xc16)](), SceneManager[_0x1e6a3a(0xe9b) + _0x1e6a3a(0x3c8)](), this['_playtestF' + '7Looping'] = ![]); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x6cd) + _0x3a6da1(0xef8) + 'ancelButto' + 'n'] = Scene_Battle['prototype'][_0x3a6da1(0x2ee) + 'elButton'], Scene_Battle[_0x3a6da1(0x49b)][_0x3a6da1(0x2ee) + _0x3a6da1(0x2fd)] = function () { const _0x5e5472 = _0x3a6da1; VisuMZ[_0x5e5472(0xc9f)][_0x5e5472(0x6cd) + _0x5e5472(0xef8) + _0x5e5472(0xabb) + 'n'][_0x5e5472(0xedc)](this), SceneManager[_0x5e5472(0xef7) + 'onLayout']() && this[_0x5e5472(0x6f1) + _0x5e5472(0x105a) + _0x5e5472(0x407) + _0x5e5472(0x427)](); }, Scene_Battle[_0x3a6da1(0x49b)][_0x3a6da1(0x6f1) + _0x3a6da1(0x105a) + _0x3a6da1(0x407) + _0x3a6da1(0x427)] = function () { const _0x1b9b8a = _0x3a6da1, _0x3fbf52 = { 'FDMmU': function (_0x3bc25b, _0x572224) { return _0x3bc25b + _0x572224; }, 'eJJSd': function (_0x245309, _0x118030) { return _0x245309 - _0x118030; } }; this['_cancelBut' + _0x1b9b8a(0x747)]['x'] = _0x3fbf52[_0x1b9b8a(0x675)](Graphics[_0x1b9b8a(0xa90)], 0xc44 + 0x4cc + -0x110c), this[_0x1b9b8a(0x39e) + 'ttonMode']() ? this[_0x1b9b8a(0x10a2) + _0x1b9b8a(0x747)]['y'] = _0x3fbf52[_0x1b9b8a(0x27a)](Graphics[_0x1b9b8a(0x2dd)], this[_0x1b9b8a(0x65f) + _0x1b9b8a(0x32b)]()) : this['_cancelBut' + _0x1b9b8a(0x747)]['y'] = 0x611 + 0x248 + -0x859; }, VisuMZ['CoreEngine']['Sprite_But' + 'ton_initia' + _0x3a6da1(0xb7c)] = Sprite_Button[_0x3a6da1(0x49b)][_0x3a6da1(0xa40)], Sprite_Button['prototype'][_0x3a6da1(0xa40)] = function (_0x2fc588) { const _0x5034d4 = _0x3a6da1; VisuMZ[_0x5034d4(0xc9f)][_0x5034d4(0xdde) + _0x5034d4(0x25b) + 'lize'][_0x5034d4(0xedc)](this, _0x2fc588), this['initButton' + _0x5034d4(0x73c)](); }, Sprite_Button[_0x3a6da1(0x49b)][_0x3a6da1(0xb87) + 'Hidden'] = function () { const _0x353977 = _0x3a6da1, _0x53d13e = { 'ZJEdp': _0x353977(0x558), 'STNGA': _0x353977(0x22a), 'ncdAJ': 'pagedown', 'MTfWk': 'down', 'oIQJD': _0x353977(0x999), 'XFRPP': _0x353977(0x53c), 'jaehY': 'menu' }, _0x3eb487 = VisuMZ[_0x353977(0xc9f)][_0x353977(0x316)]['UI']; this[_0x353977(0xca0) + 'idden'] = ![]; switch (this[_0x353977(0xc71) + 'e']) { case _0x53d13e[_0x353977(0x9b7)]: this[_0x353977(0xca0) + _0x353977(0xb6c)] = !_0x3eb487['cancelShow' + _0x353977(0x495)]; break; case _0x53d13e[_0x353977(0xcbe)]: case _0x53d13e[_0x353977(0x6c7)]: this[_0x353977(0xca0) + _0x353977(0xb6c)] = !_0x3eb487[_0x353977(0xfce) + _0x353977(0xfa8)]; break; case _0x53d13e[_0x353977(0xd55)]: case 'up': case _0x53d13e[_0x353977(0x5bc)]: case _0x53d13e[_0x353977(0x5c2)]: case 'ok': this[_0x353977(0xca0) + _0x353977(0xb6c)] = !_0x3eb487[_0x353977(0x8ef) + _0x353977(0x495)]; break; case _0x53d13e[_0x353977(0x7bf)]: this[_0x353977(0xca0) + _0x353977(0xb6c)] = !_0x3eb487[_0x353977(0x879) + _0x353977(0xd6c)]; break; } }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xdde) + 'ton_update' + 'Opacity'] = Sprite_Button[_0x3a6da1(0x49b)][_0x3a6da1(0xb31) + 'ity'], Sprite_Button[_0x3a6da1(0x49b)]['updateOpac' + _0x3a6da1(0x1025)] = function () { const _0x1bfbfb = _0x3a6da1; SceneManager[_0x1bfbfb(0xa18) + _0x1bfbfb(0x73c)]() || this[_0x1bfbfb(0xca0) + _0x1bfbfb(0xb6c)] ? this[_0x1bfbfb(0x1050) + _0x1bfbfb(0x40a)]() : VisuMZ[_0x1bfbfb(0xc9f)][_0x1bfbfb(0xdde) + _0x1bfbfb(0xa29) + 'Opacity']['call'](this); }, Sprite_Button[_0x3a6da1(0x49b)][_0x3a6da1(0x1050) + _0x3a6da1(0x40a)] = function () { const _0x2030ef = _0x3a6da1, _0x4eb1c7 = { 'kionY': function (_0x4472c5, _0x2f4fca) { return _0x4472c5 * _0x2f4fca; } }; this[_0x2030ef(0xe15)] = ![], this['opacity'] = -0x240e + -0x998 + 0x1 * 0x2da6, this['x'] = _0x4eb1c7[_0x2030ef(0x5eb)](Graphics['width'], 0xb41 * 0x3 + -0xa6 * -0x12 + -0x2d65 * 0x1), this['y'] = _0x4eb1c7['kionY'](Graphics[_0x2030ef(0x944)], -0x2081 * 0x1 + -0x5 * -0x349 + 0x101e); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x363) + _0x3a6da1(0x874) + _0x3a6da1(0x751)] = Sprite_Battler[_0x3a6da1(0x49b)][_0x3a6da1(0xc87)], Sprite_Battler[_0x3a6da1(0x49b)][_0x3a6da1(0xc87)] = function (_0x15f66a, _0xe28e85, _0x1f83c5) { const _0x54ac8c = _0x3a6da1, _0xb79988 = { 'pxJeJ': function (_0x633bd6, _0x1eaec9) { return _0x633bd6 !== _0x1eaec9; }, 'tOYYd': function (_0x2ebf66, _0xa3b59e) { return _0x2ebf66 !== _0xa3b59e; }, 'EUzQa': 'Linear' }; (_0xb79988['pxJeJ'](this[_0x54ac8c(0xc72) + _0x54ac8c(0x906)], _0x15f66a) || _0xb79988['tOYYd'](this[_0x54ac8c(0xc72) + _0x54ac8c(0x872)], _0xe28e85)) && (this[_0x54ac8c(0x992) + _0x54ac8c(0xf4c)](_0xb79988[_0x54ac8c(0xeb7)]), this['_movementW' + _0x54ac8c(0x379) + 'on'] = _0x1f83c5), VisuMZ['CoreEngine'][_0x54ac8c(0x363) + _0x54ac8c(0x874) + 'Move'][_0x54ac8c(0xedc)](this, _0x15f66a, _0xe28e85, _0x1f83c5); }, Sprite_Battler[_0x3a6da1(0x49b)][_0x3a6da1(0x992) + _0x3a6da1(0xf4c)] = function (_0x9a1b2b) { const _0x47aa41 = _0x3a6da1; this[_0x47aa41(0x6f0) + _0x47aa41(0xb6e)] = _0x9a1b2b; }, Sprite_Battler['prototype'][_0x3a6da1(0x697)] = function () { const _0x15ee8e = _0x3a6da1, _0x2841f2 = { 'AAFrD': function (_0x4847e5, _0xd1fb17) { return _0x4847e5 <= _0xd1fb17; } }; if (_0x2841f2['AAFrD'](this[_0x15ee8e(0x29b) + _0x15ee8e(0x8ec)], -0x3 * -0xc0b + -0x144b + -0xfd6)) return; const _0x18027e = this[_0x15ee8e(0x29b) + _0x15ee8e(0x8ec)], _0x1aae92 = this[_0x15ee8e(0xba2) + _0x15ee8e(0x379) + 'on'], _0x37bf4f = this[_0x15ee8e(0x6f0) + _0x15ee8e(0xb6e)]; this['_offsetX'] = this['applyEasin' + 'g'](this['_offsetX'], this[_0x15ee8e(0xc72) + _0x15ee8e(0x906)], _0x18027e, _0x1aae92, _0x37bf4f), this[_0x15ee8e(0x701)] = this[_0x15ee8e(0x4f3) + 'g'](this[_0x15ee8e(0x701)], this[_0x15ee8e(0xc72) + _0x15ee8e(0x872)], _0x18027e, _0x1aae92, _0x37bf4f), this[_0x15ee8e(0x29b) + _0x15ee8e(0x8ec)]--; if (_0x2841f2[_0x15ee8e(0xf24)](this[_0x15ee8e(0x29b) + _0x15ee8e(0x8ec)], 0x5e * -0x23 + -0x187e + 0x8 * 0x4ab)) this[_0x15ee8e(0x85c)](); }, Sprite_Battler['prototype'][_0x3a6da1(0x4f3) + 'g'] = function (_0x41bb9b, _0x5217dc, _0x1a7d50, _0x429f2c, _0x4d2df1) { const _0x29aebc = _0x3a6da1, _0x315e22 = { 'HEDCS': function (_0x210da8, _0x15281b) { return _0x210da8 / _0x15281b; }, 'Xeofp': function (_0x366819, _0x3ed147) { return _0x366819 - _0x3ed147; }, 'cQMfQ': function (_0x2fb06a, _0x481711) { return _0x2fb06a || _0x481711; }, 'zshCQ': _0x29aebc(0x90d), 'wIFBD': function (_0x430cfd, _0x27d262) { return _0x430cfd / _0x27d262; }, 'LNwPK': function (_0x46211e, _0x2a328) { return _0x46211e + _0x2a328; }, 'orOYH': function (_0x53eb8d, _0x7ef66c) { return _0x53eb8d || _0x7ef66c; }, 'PMZio': function (_0x4c5ca4, _0x30622d) { return _0x4c5ca4 * _0x30622d; }, 'NQIDq': function (_0x587fa5, _0x3b8f69) { return _0x587fa5 * _0x3b8f69; }, 'wsPSR': function (_0x277101, _0x2e32ff) { return _0x277101 - _0x2e32ff; } }, _0xdc2669 = VisuMZ['ApplyEasin' + 'g'](_0x315e22[_0x29aebc(0x32f)](_0x315e22[_0x29aebc(0x791)](_0x429f2c, _0x1a7d50), _0x429f2c), _0x315e22[_0x29aebc(0x89b)](_0x4d2df1, _0x315e22['zshCQ'])), _0xee4c2f = VisuMZ[_0x29aebc(0x77a) + 'g'](_0x315e22['wIFBD'](_0x315e22['LNwPK'](_0x315e22['Xeofp'](_0x429f2c, _0x1a7d50), -0x26e * 0x4 + 0x9 * 0x2b5 + -0xea4), _0x429f2c), _0x315e22[_0x29aebc(0x1061)](_0x4d2df1, _0x315e22[_0x29aebc(0xf52)])), _0xf853be = _0x315e22[_0x29aebc(0x32f)](_0x315e22['Xeofp'](_0x41bb9b, _0x315e22[_0x29aebc(0x62d)](_0x5217dc, _0xdc2669)), _0x315e22[_0x29aebc(0x791)](0x4bd + -0x91d * 0x2 + 0x13a * 0xb, _0xdc2669)); return _0x315e22[_0x29aebc(0xfd0)](_0xf853be, _0x315e22[_0x29aebc(0xdf2)](_0x315e22[_0x29aebc(0x261)](_0x5217dc, _0xf853be), _0xee4c2f)); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xa0a) + _0x3a6da1(0x4b4) + 'rHome'] = Sprite_Actor[_0x3a6da1(0x49b)][_0x3a6da1(0xfe0) + 'me'], Sprite_Actor[_0x3a6da1(0x49b)][_0x3a6da1(0xfe0) + 'me'] = function (_0x37b261) { const _0x3d855a = _0x3a6da1; VisuMZ[_0x3d855a(0xc9f)]['Settings']['UI']['Reposition' + 'Actors'] ? this[_0x3d855a(0xfe0) + _0x3d855a(0xd36) + 'oned'](_0x37b261) : VisuMZ['CoreEngine'][_0x3d855a(0xa0a) + _0x3d855a(0x4b4) + _0x3d855a(0x5af)][_0x3d855a(0xedc)](this, _0x37b261); }, Sprite_Actor[_0x3a6da1(0x49b)][_0x3a6da1(0xfe0) + 'meRepositi' + _0x3a6da1(0x47c)] = function (_0x3a1c2c) { const _0x4d81f7 = _0x3a6da1, _0x457811 = { 'ohJFU': function (_0xa72aad, _0x33dc92) { return _0xa72aad + _0x33dc92; }, 'qcoWH': function (_0x4a4267, _0x465fd3) { return _0x4a4267 / _0x465fd3; }, 'IFUyX': function (_0x6df65f, _0x2d2bf3) { return _0x6df65f / _0x2d2bf3; }, 'rXRiw': function (_0x3eeb88, _0x32232b) { return _0x3eeb88 - _0x32232b; }, 'ilBCx': function (_0xfd234c, _0x379b6f) { return _0xfd234c * _0x379b6f; }, 'bbwwW': function (_0x331aff, _0x5bc1dd) { return _0x331aff - _0x5bc1dd; }, 'HzLvB': function (_0x476f6d, _0x34e41e) { return _0x476f6d - _0x34e41e; }, 'wjaqi': function (_0x1025aa, _0x33667a) { return _0x1025aa * _0x33667a; }, 'UkNrO': function (_0x3ce479, _0x21c13c) { return _0x3ce479 * _0x21c13c; } }; let _0x49ae82 = Math[_0x4d81f7(0x48a)](_0x457811[_0x4d81f7(0x4b6)](_0x457811[_0x4d81f7(0xa9e)](Graphics[_0x4d81f7(0x4c0)], 0x7 * -0x1bf + 0x1 * 0x1397 + 0x13a * -0x6), 0x1a55 * 0x1 + -0xb7d + 0x8 * -0x1c3)); _0x49ae82 -= Math['floor'](_0x457811[_0x4d81f7(0x769)](_0x457811[_0x4d81f7(0xab1)](Graphics['width'], Graphics['boxWidth']), -0x1522 + -0x1c1c + 0x3140)), _0x49ae82 += _0x457811[_0x4d81f7(0x1039)](_0x3a1c2c, 0x5 * 0x63b + -0xab8 + -0x144f); let _0x79edee = _0x457811['bbwwW'](_0x457811['HzLvB'](Graphics[_0x4d81f7(0x944)], -0x239 * -0x9 + -0x14f7 + 0xdf * 0x2), _0x457811['wjaqi']($gameParty['maxBattleM' + _0x4d81f7(0x772)](), 0x88f + 0x1 * -0x29 + -0x836)); _0x79edee -= Math[_0x4d81f7(0x719)](_0x457811[_0x4d81f7(0x769)](_0x457811['rXRiw'](Graphics[_0x4d81f7(0x944)], Graphics[_0x4d81f7(0x2dd)]), -0x65 * -0x23 + 0x3a6 * 0x3 + -0x18bf)), _0x79edee += _0x457811[_0x4d81f7(0x102a)](_0x3a1c2c, 0x21b4 + -0x2173 + -0x11 * 0x1), this[_0x4d81f7(0x214)](_0x49ae82, _0x79edee); }, Sprite_Actor['prototype'][_0x3a6da1(0x3b7)] = function () { this['startMove'](0xdf2 + 0xa89 + -0x13cb, -0x19f7 * 0x1 + -0x1019 + 0x2a10, -0x553 * -0x4 + -0x1 * 0xec2 + -0x612); }, Sprite_Animation[_0x3a6da1(0x49b)][_0x3a6da1(0xbd7)] = function (_0x22c2d0) { const _0x3195dd = _0x3a6da1; this[_0x3195dd(0x3ed)] = _0x22c2d0; }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x99d) + _0x3a6da1(0xdcc) + 'cessSoundT' + _0x3a6da1(0x565)] = Sprite_Animation['prototype'][_0x3a6da1(0x593) + _0x3a6da1(0xdbf)], Sprite_Animation['prototype'][_0x3a6da1(0x593) + _0x3a6da1(0xdbf)] = function () { const _0x240e57 = _0x3a6da1; if (this[_0x240e57(0x3ed)]) return; VisuMZ[_0x240e57(0xc9f)]['Sprite_Ani' + _0x240e57(0xdcc) + _0x240e57(0xe7f) + 'imings'][_0x240e57(0xedc)](this); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x99d) + 'mation_set' + _0x3a6da1(0xb8c)] = Sprite_Animation[_0x3a6da1(0x49b)][_0x3a6da1(0xee4) + 't'], Sprite_Animation[_0x3a6da1(0x49b)][_0x3a6da1(0xee4) + 't'] = function (_0x49f87e) { const _0x28e794 = _0x3a6da1; this['isAnimatio' + _0x28e794(0xe91) + _0x28e794(0x6db)]() ? this[_0x28e794(0xee4) + _0x28e794(0xd54) + _0x28e794(0xd88)](_0x49f87e) : VisuMZ[_0x28e794(0xc9f)][_0x28e794(0x99d) + _0x28e794(0xfc1) + _0x28e794(0xb8c)][_0x28e794(0xedc)](this, _0x49f87e); }, Sprite_Animation[_0x3a6da1(0x49b)]['isAnimatio' + 'nOffsetXMi' + _0x3a6da1(0x6db)] = function () { const _0x205de7 = _0x3a6da1; if (!this[_0x205de7(0xe67)]) return ![]; const _0x288c30 = this[_0x205de7(0xe67)][_0x205de7(0x796)] || ''; if (_0x288c30[_0x205de7(0x7a8)](/<MIRROR OFFSET X>/i)) return !![]; if (_0x288c30[_0x205de7(0x7a8)](/<NO MIRROR OFFSET X>/i)) return ![]; return VisuMZ[_0x205de7(0xc9f)][_0x205de7(0x316)]['QoL'][_0x205de7(0x6b4) + _0x205de7(0xb38) + 't']; }, Sprite_Animation[_0x3a6da1(0x49b)][_0x3a6da1(0xee4) + 'tCoreEngin' + 'eFix'] = function (_0x323f72) { const _0x5e005a = _0x3a6da1, _0x36bd2c = { 'fKzeJ': function (_0x4ef212, _0x394539) { return _0x4ef212 - _0x394539; }, 'xMtlv': function (_0x550a89, _0x53edab) { return _0x550a89 * _0x53edab; }, 'FYWmm': function (_0x4c1e38, _0x1f6f78) { return _0x4c1e38 / _0x1f6f78; }, 'uXkCJ': function (_0xf52bb9, _0x1bc841) { return _0xf52bb9 - _0x1bc841; }, 'BerjP': function (_0x3de514, _0x1ce935) { return _0x3de514 / _0x1ce935; }, 'MPOrH': function (_0x175f70, _0x55fdbc) { return _0x175f70 + _0x55fdbc; }, 'tOWVL': function (_0x4cd252, _0x49fd13) { return _0x4cd252 + _0x49fd13; } }, _0x43717c = this[_0x5e005a(0x3c9) + _0x5e005a(0x105d)], _0x53eb85 = this[_0x5e005a(0x3c9) + _0x5e005a(0x105d)], _0x2bcaa0 = _0x36bd2c[_0x5e005a(0xc69)](_0x36bd2c[_0x5e005a(0x542)](this[_0x5e005a(0xe67)][_0x5e005a(0xc4b)], this[_0x5e005a(0xd3b)] ? -(-0x1 * 0x15f7 + 0x1fb4 + -0x9bc) : -0x26 + 0x4f * 0x69 + -0x560 * 0x6), _0x36bd2c[_0x5e005a(0xb58)](_0x43717c, -0x11 * -0x7f + 0x1d92 + -0x25ff * 0x1)), _0x31bee0 = _0x36bd2c[_0x5e005a(0xef2)](this[_0x5e005a(0xe67)][_0x5e005a(0x5db)], _0x36bd2c[_0x5e005a(0xe42)](_0x53eb85, 0x19e6 + 0xc1 * -0x26 + 0x2c2)), _0x38864c = this['targetPosi' + _0x5e005a(0x56c)](_0x323f72); _0x323f72['gl'][_0x5e005a(0x208)](_0x36bd2c[_0x5e005a(0x44c)](_0x2bcaa0, _0x38864c['x']), _0x36bd2c[_0x5e005a(0x1042)](_0x31bee0, _0x38864c['y']), _0x43717c, _0x53eb85); }, Sprite_Animation[_0x3a6da1(0x49b)]['targetSpri' + _0x3a6da1(0x6ba)] = function (_0x3b8b53) { const _0x1d4a2b = _0x3a6da1, _0x1f04dc = { 'kvddk': function (_0x416d72, _0x567191) { return _0x416d72 * _0x567191; }, 'wsyzF': function (_0x5817e8, _0x419f0c) { return _0x5817e8 / _0x419f0c; }, 'sVBUr': function (_0x306ac8, _0x235978) { return _0x306ac8(_0x235978); }, 'JxXGM': function (_0x39da45, _0x2eeea4) { return _0x39da45 - _0x2eeea4; }, 'tVduc': function (_0x415efc, _0x404ce1) { return _0x415efc(_0x404ce1); }, 'jISLI': function (_0x474323, _0x5c54bc) { return _0x474323 * _0x5c54bc; }, 'wOvdS': function (_0x1bf681, _0x501958) { return _0x1bf681(_0x501958); }, 'tHwDs': function (_0x2386ae, _0x5c8e71) { return _0x2386ae - _0x5c8e71; }, 'TvmfL': function (_0x39b78e, _0x45a090) { return _0x39b78e(_0x45a090); }, 'QJOMn': function (_0x3a9a78, _0x392fa0) { return _0x3a9a78(_0x392fa0); }, 'iptLf': function (_0x12f005, _0x464411) { return _0x12f005(_0x464411); } }; if (_0x3b8b53[_0x1d4a2b(0x783) + 'e']) { } const _0x2b0c61 = this[_0x1d4a2b(0xe67)][_0x1d4a2b(0x796)]; let _0x1bc030 = _0x1f04dc['kvddk'](_0x3b8b53[_0x1d4a2b(0x944)], _0x3b8b53[_0x1d4a2b(0x357)]['y']), _0x3cc189 = 0x1 * 0x18da + -0xb3 + 0x2af * -0x9, _0x142abc = _0x1f04dc['wsyzF'](-_0x1bc030, 0x1 * -0x2433 + 0x13 * 0x1f + 0x38 * 0x9b); if (_0x2b0c61[_0x1d4a2b(0x7a8)](/<(?:HEAD|HEADER|TOP)>/i)) _0x142abc = -_0x1bc030; if (_0x2b0c61[_0x1d4a2b(0x7a8)](/<(?:FOOT|FOOTER|BOTTOM)>/i)) _0x142abc = -0xc * 0x2d6 + -0x5 * 0x391 + 0x33dd; if (this[_0x1d4a2b(0xe67)]['alignBotto' + 'm']) _0x142abc = 0x6 * -0x2f5 + -0x39a * 0x1 + 0x1558; if (_0x2b0c61['match'](/<(?:LEFT)>/i)) _0x3cc189 = _0x1f04dc[_0x1d4a2b(0x51d)](-_0x3b8b53[_0x1d4a2b(0x4c0)], 0x3 * -0x5ab + 0x15aa + -0x4a7); if (_0x2b0c61['match'](/<(?:RIGHT)>/i)) _0x3cc189 = _0x1f04dc['wsyzF'](_0x3b8b53['width'], 0x11a7 * 0x1 + -0x253f + 0x9cd * 0x2); _0x2b0c61[_0x1d4a2b(0x7a8)](/<ANCHOR X:[ ](\d+\.?\d*)>/i) && (_0x3cc189 = _0x1f04dc[_0x1d4a2b(0xc2c)](_0x1f04dc[_0x1d4a2b(0xf64)](Number, RegExp['$1']), _0x3b8b53[_0x1d4a2b(0x4c0)])); _0x2b0c61[_0x1d4a2b(0x7a8)](/<ANCHOR Y:[ ](\d+\.?\d*)>/i) && (_0x142abc = _0x1f04dc['kvddk'](_0x1f04dc[_0x1d4a2b(0xc2d)](-0x1 * -0xbb9 + -0x1509 + 0x951, _0x1f04dc['tVduc'](Number, RegExp['$1'])), -_0x1bc030)); _0x2b0c61[_0x1d4a2b(0x7a8)](/<ANCHOR:[ ](\d+\.?\d*),[ ](\d+\.?\d*)>/i) && (_0x3cc189 = _0x1f04dc[_0x1d4a2b(0x914)](_0x1f04dc[_0x1d4a2b(0x3b9)](Number, RegExp['$1']), _0x3b8b53[_0x1d4a2b(0x4c0)]), _0x142abc = _0x1f04dc[_0x1d4a2b(0x914)](_0x1f04dc['tHwDs'](0x2011 + 0x24d2 + -0x44e2, _0x1f04dc[_0x1d4a2b(0x3b9)](Number, RegExp['$2'])), -_0x1bc030)); if (_0x2b0c61['match'](/<OFFSET X:[ ]([\+\-]\d+)>/i)) _0x3cc189 += _0x1f04dc[_0x1d4a2b(0x89a)](Number, RegExp['$1']); if (_0x2b0c61[_0x1d4a2b(0x7a8)](/<OFFSET Y:[ ]([\+\-]\d+)>/i)) _0x142abc += _0x1f04dc[_0x1d4a2b(0x7db)](Number, RegExp['$1']); _0x2b0c61[_0x1d4a2b(0x7a8)](/<OFFSET:[ ]([\+\-]\d+),[ ]([\+\-]\d+)>/i) && (_0x3cc189 += _0x1f04dc[_0x1d4a2b(0x868)](Number, RegExp['$1']), _0x142abc += _0x1f04dc['sVBUr'](Number, RegExp['$2'])); const _0x49e1a9 = new Point(_0x3cc189, _0x142abc); return _0x3b8b53[_0x1d4a2b(0xfbb) + _0x1d4a2b(0xe03)](), _0x3b8b53[_0x1d4a2b(0x930) + 'form'][_0x1d4a2b(0x432)](_0x49e1a9); }, Sprite_AnimationMV[_0x3a6da1(0x49b)][_0x3a6da1(0x45b)] = function () { const _0x28d2fd = _0x3a6da1; this[_0x28d2fd(0x604)] = VisuMZ[_0x28d2fd(0xc9f)]['Settings'][_0x28d2fd(0xfee)][_0x28d2fd(0x487) + 'nRate'] ?? -0x1e5 * -0x1 + -0x2 * -0xabd + -0x175b, this['setupCusto' + _0x28d2fd(0xa79) + _0x28d2fd(0x573)](), this[_0x28d2fd(0x604)] = this[_0x28d2fd(0x604)][_0x28d2fd(0x759)](-0x5 * 0x680 + -0x380 * -0x2 + 0x1981, 0x59d + -0x12ac + 0xd19); }, Sprite_AnimationMV[_0x3a6da1(0x49b)][_0x3a6da1(0xf31) + _0x3a6da1(0xa79) + _0x3a6da1(0x573)] = function () { const _0x550fd6 = _0x3a6da1, _0x4fd97c = { 'ItUFg': function (_0x54df1a, _0x3a9346) { return _0x54df1a(_0x3a9346); } }; if (!this[_0x550fd6(0xe67)]); const _0x190554 = this[_0x550fd6(0xe67)][_0x550fd6(0x796)] || ''; _0x190554['match'](/<RATE:[ ](\d+)>/i) && (this[_0x550fd6(0x604)] = (_0x4fd97c[_0x550fd6(0x4de)](Number, RegExp['$1']) || -0x1 * 0xa57 + -0x245 + -0xc9d * -0x1)[_0x550fd6(0x759)](-0x20dd + -0x1a6 + 0x2284, -0x1f78 + -0x1 * -0x1a45 + 0x1bf * 0x3)); }, Sprite_AnimationMV[_0x3a6da1(0x49b)][_0x3a6da1(0xbd7)] = function (_0x475477) { this['_muteSound'] = _0x475477; }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x99d) + 'mationMV_p' + _0x3a6da1(0x57f) + 'ngData'] = Sprite_AnimationMV['prototype']['processTim' + 'ingData'], Sprite_AnimationMV[_0x3a6da1(0x49b)]['processTim' + 'ingData'] = function (_0x3c6140) { const _0x5a9fd7 = _0x3a6da1; this[_0x5a9fd7(0x3ed)] && (_0x3c6140 = JsonEx[_0x5a9fd7(0x4fd) + 'py'](_0x3c6140), _0x3c6140['se'] && (_0x3c6140['se']['volume'] = 0x995 + 0x1824 + 0x1 * -0x21b9)), VisuMZ[_0x5a9fd7(0xc9f)]['Sprite_Ani' + _0x5a9fd7(0x707) + _0x5a9fd7(0x57f) + 'ngData'][_0x5a9fd7(0xedc)](this, _0x3c6140); }, VisuMZ[_0x3a6da1(0xc9f)]['Sprite_Ani' + _0x3a6da1(0x1f6) + 'pdatePosit' + _0x3a6da1(0x987)] = Sprite_AnimationMV[_0x3a6da1(0x49b)][_0x3a6da1(0xb41) + _0x3a6da1(0x56c)], Sprite_AnimationMV[_0x3a6da1(0x49b)][_0x3a6da1(0xb41) + _0x3a6da1(0x56c)] = function () { const _0x1eaa3a = _0x3a6da1, _0x3e8295 = { 'Fvqeo': function (_0xdb670b, _0x50ef3b) { return _0xdb670b === _0x50ef3b; }, 'RSecT': function (_0x1fc1d4, _0xd209be) { return _0x1fc1d4 === _0xd209be; }, 'ildjY': function (_0x2a658f, _0x40d46e) { return _0x2a658f / _0x40d46e; } }; VisuMZ[_0x1eaa3a(0xc9f)][_0x1eaa3a(0x99d) + _0x1eaa3a(0x1f6) + _0x1eaa3a(0xf8f) + _0x1eaa3a(0x987)][_0x1eaa3a(0xedc)](this); if (_0x3e8295['Fvqeo'](this[_0x1eaa3a(0xe67)][_0x1eaa3a(0xf72)], -0x1 * 0xd01 + 0xad * 0x2f + -0x12bf)) { if (_0x3e8295[_0x1eaa3a(0xc93)](this['x'], -0x1111 * -0x2 + 0x20a4 * 0x1 + -0x42c6)) this['x'] = Math['round'](_0x3e8295['ildjY'](Graphics[_0x1eaa3a(0x4c0)], 0xf30 + -0x26e3 + 0x77 * 0x33)); if (_0x3e8295[_0x1eaa3a(0x102b)](this['y'], -0xab9 + -0x232f * 0x1 + 0x2de8)) this['y'] = Math[_0x1eaa3a(0x48a)](_0x3e8295[_0x1eaa3a(0x258)](Graphics['height'], -0x6e9 * 0x2 + 0xc * 0x1eb + -0x930)); } }, Sprite_Damage[_0x3a6da1(0x49b)][_0x3a6da1(0xb47) + 'ts'] = function (_0x2d8b5b) { const _0x36d284 = _0x3a6da1, _0x38c980 = { 'vfKBd': function (_0x2337cd, _0x3f842e) { return _0x2337cd * _0x3f842e; }, 'QYFna': function (_0x53e6a7, _0x1349cb) { return _0x53e6a7 < _0x1349cb; }, 'GpKgg': _0x36d284(0xb1e), 'Grxgk': function (_0x2e01a0, _0x23afaf) { return _0x2e01a0 * _0x23afaf; }, 'qWOst': function (_0xbe5f65, _0x5392ac) { return _0xbe5f65 - _0x5392ac; }, 'wtZDi': function (_0x548f96, _0xcb5ea7) { return _0x548f96 / _0xcb5ea7; }, 'pVLTb': function (_0x470241, _0x2131b2) { return _0x470241 - _0x2131b2; } }; let _0xa7e1e4 = Math[_0x36d284(0x24f)](_0x2d8b5b)[_0x36d284(0x1016)](); this['useDigitGr' + 'ouping']() && (_0xa7e1e4 = VisuMZ[_0x36d284(0x438) + 's'](_0xa7e1e4)); const _0x302c65 = this[_0x36d284(0x541)](), _0x1385bf = Math[_0x36d284(0x719)](_0x38c980[_0x36d284(0x5bb)](_0x302c65, 0x1 * 0x23c5 + 0x7 * 0x559 + 0x2 * -0x249a + 0.75)); for (let _0x3c489a = -0x1c15 + 0x1bf6 + 0x1f; _0x38c980[_0x36d284(0xa3f)](_0x3c489a, _0xa7e1e4[_0x36d284(0x786)]); _0x3c489a++) { const _0x4f8e7d = this[_0x36d284(0x81a) + _0x36d284(0x4d1)](_0x1385bf, _0x302c65); _0x4f8e7d[_0x36d284(0xa7c)][_0x36d284(0x46a)](_0xa7e1e4[_0x3c489a], -0x1e * -0x22 + 0x171d + -0x1b19, 0xd * -0xde + -0xe * -0x83 + 0x41c, _0x1385bf, _0x302c65, _0x38c980['GpKgg']), _0x4f8e7d['x'] = _0x38c980[_0x36d284(0xf29)](_0x38c980['qWOst'](_0x3c489a, _0x38c980[_0x36d284(0x69c)](_0x38c980[_0x36d284(0xc33)](_0xa7e1e4[_0x36d284(0x786)], -0x13b * 0x12 + 0x1645 * -0x1 + 0x2c6c), 0x782 + -0x25ab + 0x1e2b * 0x1)), _0x1385bf), _0x4f8e7d['dy'] = -_0x3c489a; } }, Sprite_Damage[_0x3a6da1(0x49b)][_0x3a6da1(0x3eb) + _0x3a6da1(0x108e)] = function () { const _0x2826f0 = _0x3a6da1; return VisuMZ[_0x2826f0(0xc9f)][_0x2826f0(0x316)]['QoL'][_0x2826f0(0xacd) + _0x2826f0(0x378) + _0x2826f0(0xb4d)]; }, Sprite_Damage[_0x3a6da1(0x49b)][_0x3a6da1(0x6f4) + _0x3a6da1(0xa3a)] = function () { const _0x418c9b = _0x3a6da1; return ColorManager[_0x418c9b(0xcf0) + _0x418c9b(0xec2)](); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x8ff) + _0x3a6da1(0x8af) + 'te'] = Sprite_Gauge[_0x3a6da1(0x49b)]['gaugeRate'], Sprite_Gauge[_0x3a6da1(0x49b)][_0x3a6da1(0xbb8)] = function () { const _0x4376de = _0x3a6da1; return VisuMZ[_0x4376de(0xc9f)][_0x4376de(0x8ff) + _0x4376de(0x8af) + 'te']['call'](this)[_0x4376de(0x759)](0xdf + 0xf26 + -0x1005, -0x84b + 0xd * -0x1b1 + 0x1e49 * 0x1); }, VisuMZ[_0x3a6da1(0xc9f)]['Sprite_Gau' + _0x3a6da1(0x5f4) + _0x3a6da1(0xaf0)] = Sprite_Gauge[_0x3a6da1(0x49b)]['currentVal' + 'ue'], Sprite_Gauge[_0x3a6da1(0x49b)][_0x3a6da1(0xcea) + 'ue'] = function () { const _0x2bd53f = _0x3a6da1; let _0x188523 = VisuMZ['CoreEngine'][_0x2bd53f(0x8ff) + _0x2bd53f(0x5f4) + _0x2bd53f(0xaf0)][_0x2bd53f(0xedc)](this); return _0x188523; }, Sprite_Gauge['prototype'][_0x3a6da1(0x721)] = function () { const _0x3c71e8 = _0x3a6da1, _0x1ae142 = { 'KjBwV': function (_0x2d7cfb, _0x1bf3d7) { return _0x2d7cfb - _0x1bf3d7; }, 'XJigI': _0x3c71e8(0x950) }; let _0x2fbd75 = this[_0x3c71e8(0xcea) + 'ue'](); this[_0x3c71e8(0x3eb) + _0x3c71e8(0x108e)]() && (_0x2fbd75 = VisuMZ[_0x3c71e8(0x438) + 's'](_0x2fbd75)); const _0x3de947 = _0x1ae142[_0x3c71e8(0x5b7)](this[_0x3c71e8(0xe89) + 'h'](), -0x1 * -0xdcb + 0xb43 + 0x79 * -0x35), _0x4ca594 = this[_0x3c71e8(0xb4f)] ? this[_0x3c71e8(0xb4f)]() : this[_0x3c71e8(0x65d) + 'ht'](); this[_0x3c71e8(0xbe6) + 'Font'](), this[_0x3c71e8(0xa7c)][_0x3c71e8(0x46a)](_0x2fbd75, 0x15b * 0xe + 0x174d + -0x1 * 0x2a47, -0x1 * -0x12f3 + 0x1420 + -0x2713, _0x3de947, _0x4ca594, _0x1ae142[_0x3c71e8(0x9c6)]); }, Sprite_Gauge[_0x3a6da1(0x49b)][_0x3a6da1(0x6f4) + 'neWidth'] = function () { return 0x105a + 0x2706 + -0x375d; }, Sprite_Gauge[_0x3a6da1(0x49b)][_0x3a6da1(0x3eb) + 'ouping'] = function () { const _0x6febbe = _0x3a6da1; return VisuMZ[_0x6febbe(0xc9f)][_0x6febbe(0x316)]['QoL'][_0x6febbe(0xacd) + _0x6febbe(0x69a) + 'rites']; }, Sprite_Gauge['prototype'][_0x3a6da1(0x6f4) + _0x3a6da1(0xa3a)] = function () { const _0x1b63fd = _0x3a6da1; return ColorManager[_0x1b63fd(0xcf0) + _0x1b63fd(0x107a)](); }, Sprite_StateIcon[_0x3a6da1(0xd85)] = VisuMZ['CoreEngine'][_0x3a6da1(0x316)]['UI'][_0x3a6da1(0xcbd) + _0x3a6da1(0xdf4)] ?? !![], VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x3e4) + _0x3a6da1(0xf2f) + _0x3a6da1(0x552)] = Sprite_StateIcon['prototype'][_0x3a6da1(0x4b5)], Sprite_StateIcon[_0x3a6da1(0x49b)]['loadBitmap'] = function () { const _0x2bf484 = _0x3a6da1; Sprite_StateIcon['NON_FRAME'] ? this['loadBitmap' + 'CoreEngine']() : VisuMZ[_0x2bf484(0xc9f)][_0x2bf484(0x3e4) + _0x2bf484(0xf2f) + 'dBitmap'][_0x2bf484(0xedc)](this); }, Sprite_StateIcon[_0x3a6da1(0x49b)][_0x3a6da1(0x4b5) + _0x3a6da1(0xc9f)] = function () { const _0x44048c = _0x3a6da1, _0x30abe0 = { 'bHFnN': 'IconSet' }; this[_0x44048c(0xa7c)] = new Bitmap(ImageManager['iconWidth'], ImageManager[_0x44048c(0xce2)]), this[_0x44048c(0x3b8)] = ImageManager[_0x44048c(0x875)](_0x30abe0[_0x44048c(0x8d7)]); }, VisuMZ['CoreEngine'][_0x3a6da1(0x3e4) + _0x3a6da1(0x1011) + _0x3a6da1(0xe65)] = Sprite_StateIcon[_0x3a6da1(0x49b)][_0x3a6da1(0xa47) + 'e'], Sprite_StateIcon[_0x3a6da1(0x49b)]['updateFram' + 'e'] = function () { const _0x13ec98 = _0x3a6da1; Sprite_StateIcon[_0x13ec98(0xd85)] ? this[_0x13ec98(0xa47) + _0x13ec98(0x2b4) + 'e']() : VisuMZ['CoreEngine'][_0x13ec98(0x3e4) + _0x13ec98(0x1011) + _0x13ec98(0xe65)][_0x13ec98(0xedc)](this); }, Sprite_StateIcon[_0x3a6da1(0x49b)][_0x3a6da1(0xa47) + _0x3a6da1(0x2b4) + 'e'] = function () { const _0xa329e7 = _0x3a6da1, _0x1bbcc4 = { 'RTbpq': function (_0x5bcecb, _0x13731a) { return _0x5bcecb === _0x13731a; }, 'jpqZz': function (_0x4f242e, _0x1a2551) { return _0x4f242e * _0x1a2551; }, 'gNWDy': function (_0x4dd965, _0x58a527) { return _0x4dd965 % _0x58a527; }, 'JjOfm': function (_0x43f302, _0x3a10f9) { return _0x43f302 * _0x3a10f9; }, 'JXkHi': function (_0x1e66c0, _0x5bc687) { return _0x1e66c0 / _0x5bc687; } }; if (_0x1bbcc4[_0xa329e7(0xe27)](this['_lastIconI' + _0xa329e7(0xf84)], this['_iconIndex'])) return; this[_0xa329e7(0x87d) + _0xa329e7(0xf84)] = this['_iconIndex']; const _0x41c453 = ImageManager[_0xa329e7(0xc76)], _0x3aa795 = ImageManager['iconHeight'], _0x41cceb = _0x1bbcc4['jpqZz'](_0x1bbcc4[_0xa329e7(0xdd8)](this[_0xa329e7(0x770)], 0x343 + -0x37 * -0x6d + 0x1a9e * -0x1), _0x41c453), _0x44822e = _0x1bbcc4['JjOfm'](Math[_0xa329e7(0x719)](_0x1bbcc4[_0xa329e7(0xac3)](this[_0xa329e7(0x770)], -0x3 * -0x7 + -0x19b2 + 0x3 * 0x88f)), _0x3aa795), _0x27b437 = this[_0xa329e7(0x3b8)], _0x56b854 = this[_0xa329e7(0xa7c)]; _0x56b854[_0xa329e7(0x7ee)](), _0x56b854['blt'](_0x27b437, _0x41cceb, _0x44822e, _0x41c453, _0x3aa795, 0xb6a + 0x10 * -0xb9 + 0x1 * 0x26, 0x16a0 + -0x7f * 0x3c + -0x2 * -0x392, _0x56b854['width'], _0x56b854[_0xa329e7(0x944)]); }, VisuMZ['CoreEngine'][_0x3a6da1(0x416) + _0x3a6da1(0xfe8) + _0x3a6da1(0x685)] = Sprite_Picture[_0x3a6da1(0x49b)]['loadBitmap'], Sprite_Picture[_0x3a6da1(0x49b)]['loadBitmap'] = function () { const _0xa05a5a = _0x3a6da1, _0x2a3518 = { 'PJDqT': function (_0x2da538, _0x57fe05) { return _0x2da538(_0x57fe05); } }; this[_0xa05a5a(0xdc1) + 'me'] && this[_0xa05a5a(0xdc1) + 'me'][_0xa05a5a(0x7a8)](/VisuMZ CoreEngine PictureIcon (\d+)/i) ? this['loadIconBi' + _0xa05a5a(0xd76)](_0x2a3518[_0xa05a5a(0x6b7)](Number, RegExp['$1'])) : VisuMZ[_0xa05a5a(0xc9f)]['Sprite_Pic' + _0xa05a5a(0xfe8) + _0xa05a5a(0x685)]['call'](this); }, Sprite_Picture[_0x3a6da1(0x49b)][_0x3a6da1(0xd3d) + _0x3a6da1(0xd76)] = function (_0x30c734) { const _0x59d841 = _0x3a6da1, _0x469f42 = { 'oDdiT': _0x59d841(0xe5d), 'aseYI': function (_0x3a3da7, _0x28564d) { return _0x3a3da7 * _0x28564d; }, 'eBhmi': function (_0x2dd438, _0x2d91c7) { return _0x2dd438 % _0x2d91c7; }, 'QgDIC': function (_0x4eaec1, _0x52a266) { return _0x4eaec1 * _0x52a266; }, 'NrxMC': function (_0x3faf75, _0x3c79f8) { return _0x3faf75 / _0x3c79f8; } }, _0x5d63fa = ImageManager['iconWidth'], _0x131a39 = ImageManager[_0x59d841(0xce2)], _0x45d65d = this[_0x59d841(0xdc1) + 'me'][_0x59d841(0x7a8)](/SMOOTH/i); this['bitmap'] = new Bitmap(_0x5d63fa, _0x131a39); const _0x24c551 = ImageManager[_0x59d841(0x875)](_0x469f42['oDdiT']), _0x522e20 = _0x469f42['aseYI'](_0x469f42[_0x59d841(0x349)](_0x30c734, 0xce * -0x1b + 0x20f * 0x3 + 0xf9d), _0x5d63fa), _0x1a1a31 = _0x469f42[_0x59d841(0xcc2)](Math[_0x59d841(0x719)](_0x469f42[_0x59d841(0xd95)](_0x30c734, -0x11d3 + -0x1645 + -0xa * -0x404)), _0x131a39); this[_0x59d841(0xa7c)][_0x59d841(0xf7a)] = _0x45d65d, this['bitmap'][_0x59d841(0x53b)](_0x24c551, _0x522e20, _0x1a1a31, _0x5d63fa, _0x131a39, 0x1038 + 0xf * -0xa + -0xfa2, 0x23e7 + -0x1 * 0x2659 + -0x2 * -0x139, _0x5d63fa, _0x131a39); }; function Sprite_TitlePictureButton() { const _0x40b84a = _0x3a6da1; this[_0x40b84a(0xa40)](...arguments); } Sprite_TitlePictureButton['prototype'] = Object['create'](Sprite_Clickable[_0x3a6da1(0x49b)]), Sprite_TitlePictureButton['prototype'][_0x3a6da1(0x3b0) + 'r'] = Sprite_TitlePictureButton, Sprite_TitlePictureButton[_0x3a6da1(0x49b)][_0x3a6da1(0xa40)] = function (_0x10cb2c) { const _0x5ee518 = _0x3a6da1; Sprite_Clickable['prototype'][_0x5ee518(0xa40)]['call'](this), this[_0x5ee518(0xb4b)] = _0x10cb2c, this['_clickHand' + _0x5ee518(0x25a)] = null, this['setup'](); }, Sprite_TitlePictureButton[_0x3a6da1(0x49b)][_0x3a6da1(0xdd9)] = function () { const _0x362bfa = _0x3a6da1; this['x'] = Graphics[_0x362bfa(0x4c0)], this['y'] = Graphics[_0x362bfa(0x944)], this[_0x362bfa(0xe15)] = ![], this[_0x362bfa(0x652) + _0x362bfa(0xcb3)](); }, Sprite_TitlePictureButton['prototype'][_0x3a6da1(0x652) + 'nImage'] = function () { const _0x1a6bbd = _0x3a6da1; this[_0x1a6bbd(0xa7c)] = ImageManager[_0x1a6bbd(0x73b) + 'e'](this[_0x1a6bbd(0xb4b)][_0x1a6bbd(0x21f) + _0x1a6bbd(0xfff)]), this[_0x1a6bbd(0xa7c)]['addLoadLis' + _0x1a6bbd(0x8f0)](this[_0x1a6bbd(0x299) + _0x1a6bbd(0x10a1)]['bind'](this)); }, Sprite_TitlePictureButton[_0x3a6da1(0x49b)][_0x3a6da1(0x299) + _0x3a6da1(0x10a1)] = function () { const _0x37d383 = _0x3a6da1; this[_0x37d383(0xb4b)]['OnLoadJS']['call'](this), this[_0x37d383(0xb4b)][_0x37d383(0xefc)][_0x37d383(0xedc)](this), this[_0x37d383(0x5b0) + _0x37d383(0x65c)](this[_0x37d383(0xb4b)][_0x37d383(0xd9a) + 'rJS'][_0x37d383(0xdeb)](this)); }, Sprite_TitlePictureButton[_0x3a6da1(0x49b)]['update'] = function () { const _0x48973f = _0x3a6da1; Sprite_Clickable[_0x48973f(0x49b)][_0x48973f(0xc16)][_0x48973f(0xedc)](this), this['updateOpac' + _0x48973f(0x1025)](), this['processTou' + 'ch'](); }, Sprite_TitlePictureButton[_0x3a6da1(0x49b)]['fadeSpeed'] = function () { const _0x1b98e3 = _0x3a6da1; return VisuMZ['CoreEngine'][_0x1b98e3(0x316)][_0x1b98e3(0x943)]['Title'][_0x1b98e3(0x98e) + 'Speed']; }, Sprite_TitlePictureButton[_0x3a6da1(0x49b)]['updateOpac' + _0x3a6da1(0x1025)] = function () { const _0x5b3965 = _0x3a6da1, _0xf5bff6 = { 'FpNzb': function (_0x135354, _0x59dbe0) { return _0x135354 * _0x59dbe0; } }; this[_0x5b3965(0xb1c)] || this[_0x5b3965(0x599)] ? this[_0x5b3965(0x579)] = -0xdb1 + -0x5bc + -0x2 * -0xa36 : (this[_0x5b3965(0x579)] += this['visible'] ? this['fadeSpeed']() : _0xf5bff6[_0x5b3965(0x98b)](-(-0x6a1 * -0x2 + 0x1 * -0x629 + -0x1c6 * 0x4), this['fadeSpeed']()), this['opacity'] = Math[_0x5b3965(0xb36)](-0x12db * -0x1 + -0x1aab * -0x1 + 0x1663 * -0x2, this[_0x5b3965(0x579)])); }, Sprite_TitlePictureButton[_0x3a6da1(0x49b)][_0x3a6da1(0x5b0) + _0x3a6da1(0x65c)] = function (_0x5650e8) { const _0x18c68e = _0x3a6da1; this['_clickHand' + _0x18c68e(0x25a)] = _0x5650e8; }, Sprite_TitlePictureButton['prototype'][_0x3a6da1(0x38d)] = function () { const _0x2dbe29 = _0x3a6da1; this[_0x2dbe29(0xa35) + _0x2dbe29(0x25a)] && this[_0x2dbe29(0xa35) + _0x2dbe29(0x25a)](); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x73e) + _0x3a6da1(0x7d7) + _0x3a6da1(0xdc0)] = Spriteset_Base['prototype'][_0x3a6da1(0xa40)], Spriteset_Base[_0x3a6da1(0x49b)][_0x3a6da1(0xa40)] = function () { const _0x3fae26 = _0x3a6da1; VisuMZ[_0x3fae26(0xc9f)][_0x3fae26(0x73e) + _0x3fae26(0x7d7) + 'alize'][_0x3fae26(0xedc)](this), this[_0x3fae26(0xad1) + _0x3fae26(0xa7b) + 'e'](); }, Spriteset_Base[_0x3a6da1(0x49b)][_0x3a6da1(0xad1) + _0x3a6da1(0xa7b) + 'e'] = function () { const _0x376f27 = _0x3a6da1; this[_0x376f27(0x9fb) + _0x376f27(0x92a) + 's'] = [], this[_0x376f27(0x563) + _0x376f27(0xb76) + 'es'] = [], this[_0x376f27(0x4c1) + 'eX'] = this[_0x376f27(0x357)]['x'], this[_0x376f27(0x4c1) + 'eY'] = this[_0x376f27(0x357)]['y']; }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x73e) + _0x3a6da1(0x8d0) + 'oy'] = Spriteset_Base[_0x3a6da1(0x49b)][_0x3a6da1(0xf25)], Spriteset_Base[_0x3a6da1(0x49b)][_0x3a6da1(0xf25)] = function (_0x3dd30c) { const _0x18af07 = _0x3a6da1; this[_0x18af07(0x8d8) + _0x18af07(0x242) + _0x18af07(0xeb3)](), this[_0x18af07(0xf2b) + 'ointAnimat' + _0x18af07(0xb8d)](), VisuMZ[_0x18af07(0xc9f)][_0x18af07(0x73e) + _0x18af07(0x8d0) + 'oy'][_0x18af07(0xedc)](this, _0x3dd30c); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x73e) + _0x3a6da1(0xf14) + 'e'] = Spriteset_Base[_0x3a6da1(0x49b)][_0x3a6da1(0xc16)], Spriteset_Base['prototype']['update'] = function () { const _0x4f7a84 = _0x3a6da1, _0x5239f0 = { 'XsEbc': _0x4f7a84(0xe24) }, _0x5d2b02 = _0x5239f0['XsEbc']['split']('|'); let _0x3df6fd = -0xb7b * -0x2 + 0x582 + 0x71e * -0x4; while (!![]) { switch (_0x5d2b02[_0x3df6fd++]) { case '0': VisuMZ[_0x4f7a84(0xc9f)][_0x4f7a84(0x73e) + 'Base_updat' + 'e'][_0x4f7a84(0xedc)](this); continue; case '1': this[_0x4f7a84(0x2f5) + _0x4f7a84(0x95c) + 'm'](); continue; case '2': this['updatePict' + _0x4f7a84(0xf6c) + 's'](); continue; case '3': this[_0x4f7a84(0xf8d) + _0x4f7a84(0xff6)](); continue; case '4': this[_0x4f7a84(0x4fe) + _0x4f7a84(0xb9b) + 's'](); continue; }break; } }, Spriteset_Base[_0x3a6da1(0x49b)]['updatePict' + _0x3a6da1(0xf6c) + 's'] = function () { }, Spriteset_Base['prototype'][_0x3a6da1(0x2f5) + 'ureAntiZoo' + 'm'] = function () { const _0x3d87d2 = _0x3a6da1, _0x4399ee = { 'Cxkbl': _0x3d87d2(0x5e6), 'YrDVO': function (_0x5ec36b, _0x5627cf) { return _0x5ec36b === _0x5627cf; } }, _0x160ba5 = _0x4399ee[_0x3d87d2(0x522)][_0x3d87d2(0x80d)]('|'); let _0x56eff2 = -0xaed * 0x3 + -0x6c9 + 0x2790; while (!![]) { switch (_0x160ba5[_0x56eff2++]) { case '0': if (_0x4399ee[_0x3d87d2(0x8d5)](this[_0x3d87d2(0x4c1) + 'eX'], this[_0x3d87d2(0x357)]['x']) && _0x4399ee['YrDVO'](this[_0x3d87d2(0x4c1) + 'eY'], this['scale']['y'])) return; continue; case '1': this[_0x3d87d2(0xeef) + _0x3d87d2(0x95c) + 'm'](); continue; case '2': this[_0x3d87d2(0x4c1) + 'eX'] = this['scale']['x']; continue; case '3': if (!VisuMZ[_0x3d87d2(0xc9f)][_0x3d87d2(0x316)][_0x3d87d2(0xfee)][_0x3d87d2(0x387) + _0x3d87d2(0x752)]) return; continue; case '4': this[_0x3d87d2(0x4c1) + 'eY'] = this[_0x3d87d2(0x357)]['y']; continue; }break; } }, Spriteset_Base[_0x3a6da1(0x49b)]['adjustPict' + _0x3a6da1(0x95c) + 'm'] = function () { const _0x2cf7c7 = _0x3a6da1, _0x4d9229 = { 'oSWdn': function (_0x442611, _0x288a38) { return _0x442611 !== _0x288a38; }, 'yEkdX': function (_0x49ba03, _0x59c550) { return _0x49ba03 / _0x59c550; }, 'UujwI': function (_0x1ee1b8, _0x26b879) { return _0x1ee1b8 !== _0x26b879; }, 'NvJUe': function (_0x3d858c, _0x210e07) { return _0x3d858c / _0x210e07; } }; if (SceneManager[_0x2cf7c7(0x8b6)]() && Spriteset_Map[_0x2cf7c7(0x2a6) + _0x2cf7c7(0x301) + _0x2cf7c7(0xc0d)]) return; else { if (SceneManager[_0x2cf7c7(0xf95) + _0x2cf7c7(0x633)]() && Spriteset_Battle['DETACH_PIC' + _0x2cf7c7(0x301) + _0x2cf7c7(0xc0d)]) return; } _0x4d9229['oSWdn'](this[_0x2cf7c7(0x357)]['x'], -0x12e7 * -0x1 + 0xef2 + 0x5 * -0x6c5) && (this[_0x2cf7c7(0xa77) + _0x2cf7c7(0x8c0)][_0x2cf7c7(0x357)]['x'] = _0x4d9229['yEkdX'](-0x1 * -0x85d + 0x1df5 + 0x11 * -0x241, this['scale']['x']), this['_pictureCo' + _0x2cf7c7(0x8c0)]['x'] = -_0x4d9229[_0x2cf7c7(0xd8b)](this['x'], this[_0x2cf7c7(0x357)]['x'])), _0x4d9229['UujwI'](this[_0x2cf7c7(0x357)]['y'], 0x1bb1 + -0xa52 * 0x2 + -0x5 * 0x169) && (this['_pictureCo' + _0x2cf7c7(0x8c0)][_0x2cf7c7(0x357)]['y'] = _0x4d9229['yEkdX'](-0x1 * -0x315 + -0x6ca * 0x5 + 0x1ede, this[_0x2cf7c7(0x357)]['y']), this[_0x2cf7c7(0xa77) + 'ntainer']['y'] = -_0x4d9229['NvJUe'](this['y'], this[_0x2cf7c7(0x357)]['y'])); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x73e) + 'Base_updat' + _0x3a6da1(0x74c)] = Spriteset_Base[_0x3a6da1(0x49b)][_0x3a6da1(0xb41) + _0x3a6da1(0x56c)], Spriteset_Base[_0x3a6da1(0x49b)][_0x3a6da1(0xb41) + _0x3a6da1(0x56c)] = function () { const _0x240512 = _0x3a6da1; VisuMZ[_0x240512(0xc9f)]['Spriteset_' + 'Base_updat' + 'ePosition'][_0x240512(0xedc)](this), this[_0x240512(0xb41) + 'tionCoreEn' + 'gine'](); }, Spriteset_Base[_0x3a6da1(0x49b)][_0x3a6da1(0xb41) + _0x3a6da1(0x296) + _0x3a6da1(0xd2e)] = function () { const _0x20020b = _0x3a6da1, _0x62f385 = { 'TdSUg': function (_0x68fa60, _0x164ec8) { return _0x68fa60 <= _0x164ec8; }, 'KdoWa': _0x20020b(0x1e1), 'kZeOA': _0x20020b(0x2b2), 'yxohD': _0x20020b(0x916) }; if (!$gameScreen) return; if (_0x62f385['TdSUg']($gameScreen[_0x20020b(0x231) + _0x20020b(0x56c)], 0x148a + -0x84c * -0x4 + 0x256 * -0x17)) return; this['x'] -= Math[_0x20020b(0x48a)]($gameScreen['shake']()); const _0x5c137d = $gameScreen[_0x20020b(0xc08) + _0x20020b(0xb21) + _0x20020b(0x101f)](); switch ($gameScreen[_0x20020b(0xc08) + 'ineScreenS' + _0x20020b(0x101f)]()) { case _0x62f385[_0x20020b(0x263)]: this['updatePosi' + _0x20020b(0x296) + _0x20020b(0x734) + 'riginal'](); break; case _0x62f385[_0x20020b(0xe1f)]: this[_0x20020b(0xb41) + _0x20020b(0x296) + 'gineShakeH' + _0x20020b(0x929)](); break; case _0x62f385[_0x20020b(0xc57)]: this['updatePosi' + _0x20020b(0x296) + _0x20020b(0x5ba) + _0x20020b(0xf92)](); break; default: this[_0x20020b(0xb41) + _0x20020b(0x296) + _0x20020b(0x89f) + _0x20020b(0xce4)](); break; } }, Spriteset_Base[_0x3a6da1(0x49b)][_0x3a6da1(0xb41) + _0x3a6da1(0x296) + _0x3a6da1(0x734) + _0x3a6da1(0xdfe)] = function () { const _0x2313d2 = _0x3a6da1, _0xd34af9 = VisuMZ['CoreEngine'][_0x2313d2(0x316)][_0x2313d2(0x9f7) + 'e']; if (_0xd34af9 && _0xd34af9['originalJS']) return _0xd34af9[_0x2313d2(0x6d7)][_0x2313d2(0xedc)](this); this['x'] += Math['round']($gameScreen[_0x2313d2(0x65b)]()); }, Spriteset_Base[_0x3a6da1(0x49b)][_0x3a6da1(0xb41) + _0x3a6da1(0x296) + _0x3a6da1(0x89f) + _0x3a6da1(0xce4)] = function () { const _0x2ca274 = _0x3a6da1, _0x468ba6 = { 'wQJmC': function (_0x4a3ee3, _0x1dbdb0) { return _0x4a3ee3 * _0x1dbdb0; }, 'npcqs': function (_0x1f9481, _0x31b43a) { return _0x1f9481 * _0x31b43a; }, 'zjghl': function (_0x4686e4, _0x44134e) { return _0x4686e4 * _0x44134e; }, 'Vytgt': function (_0x445f59, _0x5ae154) { return _0x445f59 - _0x5ae154; } }, _0x3d7055 = VisuMZ[_0x2ca274(0xc9f)][_0x2ca274(0x316)][_0x2ca274(0x9f7) + 'e']; if (_0x3d7055 && _0x3d7055['randomJS']) return _0x3d7055[_0x2ca274(0xc4c)][_0x2ca274(0xedc)](this); const _0x3cdb8b = _0x468ba6['wQJmC']($gameScreen[_0x2ca274(0xc63) + 'r'], 0xc30 + 0x1238 + -0x38 * 0x8b + 0.75), _0x4d80fc = _0x468ba6[_0x2ca274(0xa8b)]($gameScreen[_0x2ca274(0x7a7) + 'd'], -0x14c2 + 0x1c78 + -0x7b6 + 0.6), _0x45d9e9 = $gameScreen[_0x2ca274(0x231) + _0x2ca274(0x56c)]; this['x'] += _0x468ba6[_0x2ca274(0x75a)](Math[_0x2ca274(0x48a)](_0x468ba6[_0x2ca274(0x1069)](Math[_0x2ca274(0xb91)](_0x3cdb8b), Math[_0x2ca274(0xb91)](_0x4d80fc))), _0x468ba6['zjghl'](Math[_0x2ca274(0xb36)](_0x45d9e9, 0xc0 * -0x25 + -0x1fe2 + 0x3bc0), -0x1e74 + -0x6c6 + 0x253a + 0.5)), this['y'] += _0x468ba6[_0x2ca274(0xbac)](Math[_0x2ca274(0x48a)](_0x468ba6['Vytgt'](Math[_0x2ca274(0xb91)](_0x3cdb8b), Math[_0x2ca274(0xb91)](_0x4d80fc))), _0x468ba6[_0x2ca274(0xa8b)](Math['min'](_0x45d9e9, 0x5d6 + -0x326 * -0x4 + 0x24a * -0x8), 0x1a7d * -0x1 + -0x1 * 0x2248 + 0x3cc5 + 0.5)); }, Spriteset_Base[_0x3a6da1(0x49b)][_0x3a6da1(0xb41) + _0x3a6da1(0x296) + _0x3a6da1(0x398) + _0x3a6da1(0x929)] = function () { const _0x1fb416 = _0x3a6da1, _0x34476d = { 'WGHqv': function (_0x120acc, _0x5a0bbb) { return _0x120acc * _0x5a0bbb; }, 'omHnY': function (_0x294e7d, _0x527230) { return _0x294e7d * _0x527230; }, 'fEloS': function (_0x255b1b, _0x1dd2fa) { return _0x255b1b * _0x1dd2fa; }, 'CnLKk': function (_0x4691e0, _0x212b5a) { return _0x4691e0 - _0x212b5a; } }, _0x16992a = VisuMZ[_0x1fb416(0xc9f)][_0x1fb416(0x316)]['ScreenShak' + 'e']; if (_0x16992a && _0x16992a['horzJS']) return _0x16992a['horzJS'][_0x1fb416(0xedc)](this); const _0x35bb5e = _0x34476d[_0x1fb416(0x6cc)]($gameScreen[_0x1fb416(0xc63) + 'r'], 0x73 * -0x53 + 0x36e + 0x21db + 0.75), _0x4078cc = _0x34476d[_0x1fb416(0xaca)]($gameScreen['_shakeSpee' + 'd'], -0x892 + 0x95a + -0xc8 + 0.6), _0x216a14 = $gameScreen[_0x1fb416(0x231) + _0x1fb416(0x56c)]; this['x'] += _0x34476d[_0x1fb416(0xe0a)](Math[_0x1fb416(0x48a)](_0x34476d[_0x1fb416(0xf09)](Math[_0x1fb416(0xb91)](_0x35bb5e), Math[_0x1fb416(0xb91)](_0x4078cc))), _0x34476d[_0x1fb416(0xaca)](Math['min'](_0x216a14, -0xb3f * -0x1 + -0x34 * 0x73 + 0xc3b), -0x5 * 0x6d1 + -0x221c + 0x3 * 0x16bb + 0.5)); }, Spriteset_Base[_0x3a6da1(0x49b)][_0x3a6da1(0xb41) + 'tionCoreEn' + 'gineShakeV' + 'ert'] = function () { const _0x59516f = _0x3a6da1, _0x57ffa8 = { 'lSqvM': function (_0x44158b, _0x10b767) { return _0x44158b * _0x10b767; }, 'ZMaSU': function (_0x5dfb0c, _0x468792) { return _0x5dfb0c - _0x468792; }, 'XmiDm': function (_0x5f3cbf, _0x406c56) { return _0x5f3cbf * _0x406c56; } }, _0x4a269d = VisuMZ[_0x59516f(0xc9f)][_0x59516f(0x316)]['ScreenShak' + 'e']; if (_0x4a269d && _0x4a269d[_0x59516f(0x365)]) return _0x4a269d[_0x59516f(0x365)][_0x59516f(0xedc)](this); const _0xfe7e35 = _0x57ffa8['lSqvM']($gameScreen[_0x59516f(0xc63) + 'r'], 0x57 * 0x6 + -0xf9d * -0x1 + -0x11a7 + 0.75), _0x5cbf74 = _0x57ffa8[_0x59516f(0x3a7)]($gameScreen[_0x59516f(0x7a7) + 'd'], -0x3 * -0x7ac + -0x1 * -0x1af0 + -0x17 * 0x22c + 0.6), _0x51f864 = $gameScreen[_0x59516f(0x231) + _0x59516f(0x56c)]; this['y'] += _0x57ffa8[_0x59516f(0x3a7)](Math['round'](_0x57ffa8[_0x59516f(0xbe8)](Math[_0x59516f(0xb91)](_0xfe7e35), Math[_0x59516f(0xb91)](_0x5cbf74))), _0x57ffa8[_0x59516f(0x6d2)](Math[_0x59516f(0xb36)](_0x51f864, 0x17bb + -0x849 * -0x3 + -0x1 * 0x3078), -0x2de * -0x1 + -0x2173 + 0x1e95 + 0.5)); }, Spriteset_Base['prototype'][_0x3a6da1(0xf8d) + _0x3a6da1(0xff6)] = function () { const _0x52b610 = _0x3a6da1; for (const _0x455ce3 of this[_0x52b610(0x9fb) + 'tionSprite' + 's']) { !_0x455ce3[_0x52b610(0x83d)]() && this[_0x52b610(0x7c6) + _0x52b610(0x848)](_0x455ce3); } this[_0x52b610(0x5d5) + _0x52b610(0xe2e) + _0x52b610(0x664)](); }, Spriteset_Base[_0x3a6da1(0x49b)][_0x3a6da1(0x5d5) + _0x3a6da1(0xe2e) + _0x3a6da1(0x664)] = function () { const _0x55ee04 = _0x3a6da1; for (; ;) { const _0x234f9d = $gameTemp['retrieveFa' + _0x55ee04(0xc8c) + 'n'](); if (_0x234f9d) this[_0x55ee04(0x716) + _0x55ee04(0x848)](_0x234f9d); else break; } }, Spriteset_Base['prototype'][_0x3a6da1(0x716) + 'Animation'] = function (_0x49c62a) { const _0x45bb69 = _0x3a6da1, _0x2ba105 = $dataAnimations[_0x49c62a[_0x45bb69(0x38a) + 'd']], _0x2bc228 = _0x49c62a[_0x45bb69(0x22d)], _0x5246e7 = _0x49c62a[_0x45bb69(0x648)], _0x26006f = _0x49c62a[_0x45bb69(0x2b8)]; let _0x35860a = this[_0x45bb69(0x10a4) + 'aseDelay'](); const _0x5c9e23 = this[_0x45bb69(0xd41) + 'extDelay'](); if (this['isAnimatio' + 'nForEach'](_0x2ba105)) for (const _0x193873 of _0x2bc228) { this[_0x45bb69(0x716) + 'AnimationS' + _0x45bb69(0xd0b)]([_0x193873], _0x2ba105, _0x5246e7, _0x35860a, _0x26006f), _0x35860a += _0x5c9e23; } else this['createFaux' + _0x45bb69(0x226) + _0x45bb69(0xd0b)](_0x2bc228, _0x2ba105, _0x5246e7, _0x35860a, _0x26006f); }, Spriteset_Base[_0x3a6da1(0x49b)][_0x3a6da1(0x352) + 'ationSprit' + 'e'] = function (_0x220863, _0xb076e3, _0x1a5815, _0x5c3ce7) { const _0x53f6dc = _0x3a6da1, _0x51a79e = { 'cDAQb': function (_0x13d5ab, _0x1f3ae6) { return _0x13d5ab > _0x1f3ae6; } }, _0x1ded5f = this[_0x53f6dc(0xc8b) + _0x53f6dc(0x987)](_0xb076e3), _0x2885fd = new (_0x1ded5f ? Sprite_AnimationMV : Sprite_Animation)(), _0x23cc6f = this[_0x53f6dc(0xb6d) + 'Sprites'](_0x220863), _0xc3d43 = this[_0x53f6dc(0x10a4) + _0x53f6dc(0x92b)](), _0xe927cf = _0x51a79e[_0x53f6dc(0xd48)](_0x5c3ce7, _0xc3d43) ? this[_0x53f6dc(0x351) + _0x53f6dc(0x408)]() : null; this[_0x53f6dc(0x951) + _0x53f6dc(0xc6f) + 'r'](_0x220863[0x2 * 0xbf9 + 0x961 + 0x13 * -0x1c1]) && (_0x1a5815 = !_0x1a5815), _0x2885fd['targetObje' + _0x53f6dc(0x3e0)] = _0x220863, _0x2885fd[_0x53f6dc(0xdd9)](_0x23cc6f, _0xb076e3, _0x1a5815, _0x5c3ce7, _0xe927cf), this['addAnimati' + _0x53f6dc(0x38b) + _0x53f6dc(0x83b)](_0x2885fd), this['_animation' + _0x53f6dc(0xf61)]['push'](_0x2885fd); }, Spriteset_Base[_0x3a6da1(0x49b)][_0x3a6da1(0x716) + _0x3a6da1(0x226) + _0x3a6da1(0xd0b)] = function (_0x58b9bf, _0x433bc6, _0x3aca5d, _0x33e4b5, _0xa9140b) { const _0x909921 = _0x3a6da1, _0x3c8ac2 = this[_0x909921(0xc8b) + _0x909921(0x987)](_0x433bc6), _0x1f932a = new (_0x3c8ac2 ? Sprite_AnimationMV : Sprite_Animation)(), _0x2c1b94 = this[_0x909921(0xb6d) + 'Sprites'](_0x58b9bf); this[_0x909921(0x951) + _0x909921(0xc6f) + 'r'](_0x58b9bf[-0x55 * -0x5 + -0x2 * 0xc0e + 0x1673]) && (_0x3aca5d = !_0x3aca5d); _0x1f932a[_0x909921(0xe81) + 'cts'] = _0x58b9bf, _0x1f932a[_0x909921(0xdd9)](_0x2c1b94, _0x433bc6, _0x3aca5d, _0x33e4b5), _0x1f932a[_0x909921(0xbd7)](_0xa9140b), this[_0x909921(0x678) + 'onSpriteTo' + 'Container'](_0x1f932a); if (this['_animation' + 'Sprites']) this[_0x909921(0xe67) + 'Sprites'][_0x909921(0x7e7)](_0x1f932a); this[_0x909921(0x9fb) + _0x909921(0x92a) + 's']['push'](_0x1f932a); }, Spriteset_Base[_0x3a6da1(0x49b)][_0x3a6da1(0x678) + 'onSpriteTo' + _0x3a6da1(0x83b)] = function (_0x38b7d8) { const _0x4ba026 = _0x3a6da1; this[_0x4ba026(0xf4d) + _0x4ba026(0x8c0)]['addChild'](_0x38b7d8); }, Spriteset_Base['prototype'][_0x3a6da1(0x410) + 'ation'] = function (_0x6f7466) { const _0x44f6b1 = _0x3a6da1; this[_0x44f6b1(0xe67) + _0x44f6b1(0xf61)][_0x44f6b1(0x7e7)](_0x6f7466), this[_0x44f6b1(0x410) + 'ationFromC' + _0x44f6b1(0xb7d)](_0x6f7466); for (const _0x52160b of _0x6f7466['targetObje' + _0x44f6b1(0x3e0)]) { _0x52160b[_0x44f6b1(0x761) + 'on'] && _0x52160b[_0x44f6b1(0x761) + 'on'](); } _0x6f7466[_0x44f6b1(0xf25)](); }, Spriteset_Base[_0x3a6da1(0x49b)][_0x3a6da1(0x7c6) + _0x3a6da1(0x848)] = function (_0xaac3e1) { const _0x27347a = _0x3a6da1; this[_0x27347a(0x9fb) + _0x27347a(0x92a) + 's'][_0x27347a(0x7e7)](_0xaac3e1), this[_0x27347a(0x410) + _0x27347a(0xddd) + 'ontainer'](_0xaac3e1); for (const _0x542190 of _0xaac3e1[_0x27347a(0xe81) + _0x27347a(0x3e0)]) { _0x542190[_0x27347a(0x761) + 'on'] && _0x542190[_0x27347a(0x761) + 'on'](); } _0xaac3e1['destroy'](); }, Spriteset_Base[_0x3a6da1(0x49b)][_0x3a6da1(0x410) + _0x3a6da1(0xddd) + 'ontainer'] = function (_0x377d04) { const _0x47b060 = _0x3a6da1; this[_0x47b060(0xf4d) + _0x47b060(0x8c0)][_0x47b060(0xd47) + 'd'](_0x377d04); }, Spriteset_Base[_0x3a6da1(0x49b)][_0x3a6da1(0x8d8) + _0x3a6da1(0x242) + _0x3a6da1(0xeb3)] = function () { const _0x5e58a9 = _0x3a6da1; for (const _0x33cfad of this['_fauxAnima' + _0x5e58a9(0x92a) + 's']) { this[_0x5e58a9(0x7c6) + _0x5e58a9(0x848)](_0x33cfad); } }, Spriteset_Base[_0x3a6da1(0x49b)][_0x3a6da1(0x64c) + 'ationPlayi' + 'ng'] = function () { const _0x5c3617 = _0x3a6da1, _0x1f269e = { 'GCSLc': function (_0x54670c, _0x14e840) { return _0x54670c > _0x14e840; } }; return _0x1f269e['GCSLc'](this['_fauxAnima' + _0x5c3617(0x92a) + 's']['length'], -0x2f * -0x78 + 0x5 * -0x3b3 + -0x389); }, Spriteset_Base[_0x3a6da1(0x49b)][_0x3a6da1(0x4fe) + _0x3a6da1(0xb9b) + 's'] = function () { const _0x33b2f0 = _0x3a6da1; for (const _0x184203 of this[_0x33b2f0(0x563) + _0x33b2f0(0xb76) + 'es']) { !_0x184203[_0x33b2f0(0x83d)]() && this['removePoin' + _0x33b2f0(0xb9b)](_0x184203); } this[_0x33b2f0(0x9ce) + 'ntAnimatio' + _0x33b2f0(0x866)](); }, Spriteset_Base[_0x3a6da1(0x49b)][_0x3a6da1(0x9ce) + 'ntAnimatio' + _0x3a6da1(0x866)] = function () { const _0x6d1b8b = _0x3a6da1; for (; ;) { const _0x21272d = $gameTemp[_0x6d1b8b(0xd9c) + _0x6d1b8b(0xc8a) + 'on'](); if (_0x21272d) this[_0x6d1b8b(0x1096) + _0x6d1b8b(0xb9b)](_0x21272d); else break; } }, Spriteset_Base[_0x3a6da1(0x49b)][_0x3a6da1(0x1096) + _0x3a6da1(0xb9b)] = function (_0x27a916) { const _0x2eec00 = _0x3a6da1, _0x3a0360 = $dataAnimations[_0x27a916[_0x2eec00(0x38a) + 'd']], _0x3450bd = this[_0x2eec00(0x1096) + _0x2eec00(0xb9b) + _0x2eec00(0x2ef)](_0x27a916), _0x404166 = _0x27a916[_0x2eec00(0x648)], _0x2fbee8 = _0x27a916[_0x2eec00(0x2b8)]; let _0x19afb1 = this[_0x2eec00(0x10a4) + 'aseDelay'](); const _0x2ac6a1 = this[_0x2eec00(0xd41) + _0x2eec00(0xf3e)](); if (this[_0x2eec00(0xfbf) + 'nForEach'](_0x3a0360)) for (const _0x2a12cc of _0x3450bd) { this['createPoin' + _0x2eec00(0xb9b) + _0x2eec00(0x54a)]([_0x2a12cc], _0x3a0360, _0x404166, _0x19afb1, _0x2fbee8), _0x19afb1 += _0x2ac6a1; } else this[_0x2eec00(0x1096) + _0x2eec00(0xb9b) + _0x2eec00(0x54a)](_0x3450bd, _0x3a0360, _0x404166, _0x19afb1, _0x2fbee8); }, Spriteset_Base[_0x3a6da1(0x49b)]['createPoin' + _0x3a6da1(0xb9b) + _0x3a6da1(0x2ef)] = function (_0x5e6598) { const _0x34e95f = _0x3a6da1, _0x174d11 = { 'wIDsY': function (_0xc3d43a, _0xfcd007) { return _0xc3d43a - _0xfcd007; } }, _0x1aead7 = new Sprite_Clickable(), _0x3a22bc = this[_0x34e95f(0x354) + _0x34e95f(0x95a) + 'er'](); _0x1aead7['x'] = _0x174d11[_0x34e95f(0xad0)](_0x5e6598['x'], _0x3a22bc['x']), _0x1aead7['y'] = _0x174d11[_0x34e95f(0xad0)](_0x5e6598['y'], _0x3a22bc['y']), _0x1aead7['z'] = -0x1fee + 0x2283 + -0x231; const _0x5db525 = this[_0x34e95f(0x354) + _0x34e95f(0x95a) + 'er'](); return _0x5db525[_0x34e95f(0xc5e)](_0x1aead7), [_0x1aead7]; }, Spriteset_Base['prototype']['getPointAn' + 'imationLay' + 'er'] = function () { return this; }, Spriteset_Map['prototype'][_0x3a6da1(0x354) + 'imationLay' + 'er'] = function () { return this['_tilemap'] || this; }, Spriteset_Battle[_0x3a6da1(0x49b)][_0x3a6da1(0x354) + _0x3a6da1(0x95a) + 'er'] = function () { const _0x1971cd = _0x3a6da1; return this[_0x1971cd(0x265) + 'ld'] || this; }, Spriteset_Base[_0x3a6da1(0x49b)][_0x3a6da1(0x1096) + _0x3a6da1(0xb9b) + _0x3a6da1(0x54a)] = function (_0xdf91ac, _0x5d03ec, _0x555f00, _0x276d8e, _0x4288af) { const _0x15bead = _0x3a6da1, _0x165ee7 = this['isMVAnimat' + 'ion'](_0x5d03ec), _0x49ce47 = new (_0x165ee7 ? Sprite_AnimationMV : Sprite_Animation)(); _0x49ce47[_0x15bead(0xe81) + _0x15bead(0x3e0)] = _0xdf91ac, _0x49ce47['setup'](_0xdf91ac, _0x5d03ec, _0x555f00, _0x276d8e), _0x49ce47[_0x15bead(0xbd7)](_0x4288af), this[_0x15bead(0x678) + 'onSpriteTo' + _0x15bead(0x83b)](_0x49ce47), this[_0x15bead(0x563) + _0x15bead(0xb76) + 'es'][_0x15bead(0x92f)](_0x49ce47); }, Spriteset_Base['prototype'][_0x3a6da1(0x327) + _0x3a6da1(0xb9b)] = function (_0x37ac42) { const _0x2430ca = _0x3a6da1; this[_0x2430ca(0x563) + _0x2430ca(0xb76) + 'es'][_0x2430ca(0x7e7)](_0x37ac42), this['_effectsCo' + _0x2430ca(0x8c0)][_0x2430ca(0xd47) + 'd'](_0x37ac42); for (const _0x2a1bed of _0x37ac42[_0x2430ca(0xe81) + _0x2430ca(0x3e0)]) { _0x2a1bed[_0x2430ca(0x761) + 'on'] && _0x2a1bed[_0x2430ca(0x761) + 'on'](); const _0x515d75 = this[_0x2430ca(0x354) + _0x2430ca(0x95a) + 'er'](); if (_0x515d75) _0x515d75[_0x2430ca(0xd47) + 'd'](_0x2a1bed); } _0x37ac42[_0x2430ca(0xf25)](); }, Spriteset_Base[_0x3a6da1(0x49b)]['removeAllP' + _0x3a6da1(0x7df) + _0x3a6da1(0xb8d)] = function () { const _0x3da6ef = _0x3a6da1; for (const _0x268784 of this[_0x3da6ef(0x563) + 'ationSprit' + 'es']) { this[_0x3da6ef(0x327) + _0x3da6ef(0xb9b)](_0x268784); } }, Spriteset_Base[_0x3a6da1(0x49b)][_0x3a6da1(0x1051) + _0x3a6da1(0x1d7) + _0x3a6da1(0x4d4)] = function () { const _0x28bf6b = _0x3a6da1, _0x3975a3 = { 'tDekD': function (_0x42ca0d, _0x37203c) { return _0x42ca0d > _0x37203c; } }; return _0x3975a3[_0x28bf6b(0x7ca)](this[_0x28bf6b(0x563) + _0x28bf6b(0xb76) + 'es'][_0x28bf6b(0x786)], -0x1d6d + -0x4a3 * -0x1 + -0x18ca * -0x1); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x73e) + _0x3a6da1(0xeb9) + 'mationPlay' + _0x3a6da1(0x4d4)] = Spriteset_Base[_0x3a6da1(0x49b)][_0x3a6da1(0xfbf) + _0x3a6da1(0xfbc)], Spriteset_Base[_0x3a6da1(0x49b)][_0x3a6da1(0xfbf) + _0x3a6da1(0xfbc)] = function () { const _0x7b84ac = _0x3a6da1; return VisuMZ[_0x7b84ac(0xc9f)]['Spriteset_' + _0x7b84ac(0xeb9) + _0x7b84ac(0x1d7) + _0x7b84ac(0x4d4)][_0x7b84ac(0xedc)](this) || this['isPointAni' + _0x7b84ac(0x1d7) + _0x7b84ac(0x4d4)](); }, Spriteset_Map[_0x3a6da1(0x2a6) + 'TURE_CONTA' + _0x3a6da1(0xc0d)] = VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x316)][_0x3a6da1(0xfee)][_0x3a6da1(0x473) + _0x3a6da1(0xc86) + _0x3a6da1(0xda4)] || ![], VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x1d9) + _0x3a6da1(0xdd0) + _0x3a6da1(0x314) + 'ch'] = Scene_Map['prototype']['createSpri' + _0x3a6da1(0xe45)], Scene_Map[_0x3a6da1(0x49b)][_0x3a6da1(0xdd0) + _0x3a6da1(0xe45)] = function () { const _0x16f668 = _0x3a6da1; VisuMZ['CoreEngine'][_0x16f668(0x1d9) + _0x16f668(0xdd0) + _0x16f668(0x314) + 'ch'][_0x16f668(0xedc)](this); if (!Spriteset_Map['DETACH_PIC' + 'TURE_CONTA' + 'INER']) return; const _0x472a6e = this[_0x16f668(0xcaf)]; if (!_0x472a6e) return; this[_0x16f668(0xa77) + _0x16f668(0x8c0)] = _0x472a6e[_0x16f668(0xa77) + _0x16f668(0x8c0)]; if (!this['_pictureCo' + _0x16f668(0x8c0)]) return; this[_0x16f668(0xc5e)](this['_pictureCo' + 'ntainer']); }, Spriteset_Battle[_0x3a6da1(0x2a6) + _0x3a6da1(0x301) + _0x3a6da1(0xc0d)] = VisuMZ[_0x3a6da1(0xc9f)]['Settings'][_0x3a6da1(0xfee)][_0x3a6da1(0xef3) + _0x3a6da1(0xa08) + _0x3a6da1(0xb7d)] || ![], VisuMZ['CoreEngine'][_0x3a6da1(0x6cd) + _0x3a6da1(0xadc) + _0x3a6da1(0xb17) + 'etach'] = Scene_Battle[_0x3a6da1(0x49b)][_0x3a6da1(0xdd0) + _0x3a6da1(0xe45)], Scene_Battle[_0x3a6da1(0x49b)]['createSpri' + 'teset'] = function () { const _0x29aaf7 = _0x3a6da1; VisuMZ['CoreEngine']['Scene_Batt' + _0x29aaf7(0xadc) + _0x29aaf7(0xb17) + _0x29aaf7(0x1e0)][_0x29aaf7(0xedc)](this); if (!Spriteset_Battle[_0x29aaf7(0x2a6) + 'TURE_CONTA' + _0x29aaf7(0xc0d)]) return; const _0x51e7cb = this['_spriteset']; if (!_0x51e7cb) return; this[_0x29aaf7(0xa77) + _0x29aaf7(0x8c0)] = _0x51e7cb['_pictureCo' + 'ntainer']; if (!this[_0x29aaf7(0xa77) + _0x29aaf7(0x8c0)]) return; this['addChild'](this[_0x29aaf7(0xa77) + 'ntainer']); }, Spriteset_Battle[_0x3a6da1(0x49b)][_0x3a6da1(0x515) + _0x3a6da1(0xf3d)] = function () { const _0x4ff4b8 = _0x3a6da1, _0x5b31e2 = { 'tntzj': '2|1|4|0|3' }, _0x21195a = _0x5b31e2[_0x4ff4b8(0x96d)][_0x4ff4b8(0x80d)]('|'); let _0x502891 = 0x2fe * 0xd + -0x11a5 * -0x1 + 0x3 * -0x12d9; while (!![]) { switch (_0x21195a[_0x502891++]) { case '0': this[_0x4ff4b8(0xbf4) + _0x4ff4b8(0x4d1)][_0x4ff4b8(0xcc8)] = [this[_0x4ff4b8(0xbf4) + 'dFilter']]; continue; case '1': this[_0x4ff4b8(0xbf4) + _0x4ff4b8(0x4d1)] = new Sprite(); continue; case '2': this[_0x4ff4b8(0xbf4) + 'dFilter'] = new PIXI[(_0x4ff4b8(0xcc8))][(_0x4ff4b8(0x346))](clamp = !![]); continue; case '3': this[_0x4ff4b8(0x3d8) + 'e'][_0x4ff4b8(0xc5e)](this[_0x4ff4b8(0xbf4) + _0x4ff4b8(0x4d1)]); continue; case '4': this[_0x4ff4b8(0xbf4) + _0x4ff4b8(0x4d1)]['bitmap'] = SceneManager['background' + _0x4ff4b8(0x670)](); continue; }break; } }, VisuMZ['CoreEngine'][_0x3a6da1(0x73e) + _0x3a6da1(0xfc4) + _0x3a6da1(0x549)] = Spriteset_Battle[_0x3a6da1(0x49b)][_0x3a6da1(0x481) + _0x3a6da1(0x3ce)], Spriteset_Battle['prototype'][_0x3a6da1(0x481) + _0x3a6da1(0x3ce)] = function () { const _0x4a6d34 = _0x3a6da1; this[_0x4a6d34(0x3df) + _0x4a6d34(0xcc4) + _0x4a6d34(0x388)]() && this[_0x4a6d34(0x6f1) + _0x4a6d34(0xcb7) + _0x4a6d34(0xc0b)](), VisuMZ[_0x4a6d34(0xc9f)][_0x4a6d34(0x73e) + _0x4a6d34(0xfc4) + _0x4a6d34(0x549)][_0x4a6d34(0xedc)](this); }, Spriteset_Battle[_0x3a6da1(0x49b)][_0x3a6da1(0x3df) + _0x3a6da1(0xcc4) + _0x3a6da1(0x388)] = function () { const _0x180858 = _0x3a6da1, _0x32585f = { 'wcomi': function (_0xae3412, _0x526d23) { return _0xae3412 >= _0x526d23; }, 'rmfXE': _0x180858(0x106e) }, _0x5673a6 = VisuMZ[_0x180858(0xc9f)][_0x180858(0x316)][_0x180858(0x5ac) + _0x180858(0x2c5)]; if (!_0x5673a6) return ![]; if (_0x32585f[_0x180858(0x673)](Utils[_0x180858(0x900) + _0x180858(0x5a3)], _0x32585f[_0x180858(0x54e)]) && !_0x5673a6[_0x180858(0xcc4) + _0x180858(0xf35)]) return ![]; return _0x5673a6['Reposition' + 'Enemies']; }, Spriteset_Battle['prototype'][_0x3a6da1(0x6f1) + _0x3a6da1(0xcb7) + _0x3a6da1(0xc0b)] = function () { const _0x21f78e = _0x3a6da1; for (member of $gameTroop[_0x21f78e(0x200)]()) { member[_0x21f78e(0x4dc) + _0x21f78e(0x8de) + _0x21f78e(0xb67)](); } }, VisuMZ[_0x3a6da1(0xc9f)]['Window_Bas' + _0x3a6da1(0x426) + 'ze'] = Window_Base[_0x3a6da1(0x49b)]['initialize'], Window_Base[_0x3a6da1(0x49b)][_0x3a6da1(0xa40)] = function (_0x3b3033) { const _0x5bf382 = _0x3a6da1, _0x4b2c89 = { 'xZlOl': _0x5bf382(0x1067) + _0x5bf382(0x70a) }, _0x281de3 = _0x4b2c89[_0x5bf382(0xc30)][_0x5bf382(0x80d)]('|'); let _0x2e2924 = 0x1 * -0x24b + -0x7 * -0x7f + -0x12e; while (!![]) { switch (_0x281de3[_0x2e2924++]) { case '0': _0x3b3033[_0x5bf382(0x4c0)] = Math[_0x5bf382(0x48a)](_0x3b3033[_0x5bf382(0x4c0)]); continue; case '1': this[_0x5bf382(0x61a) + _0x5bf382(0x4e8)](); continue; case '2': VisuMZ['CoreEngine']['Window_Bas' + _0x5bf382(0x426) + 'ze'][_0x5bf382(0xedc)](this, _0x3b3033); continue; case '3': _0x3b3033[_0x5bf382(0x944)] = Math[_0x5bf382(0x48a)](_0x3b3033[_0x5bf382(0x944)]); continue; case '4': _0x3b3033['x'] = Math[_0x5bf382(0x48a)](_0x3b3033['x']); continue; case '5': this['initDigitG' + _0x5bf382(0xfa3)](); continue; case '6': _0x3b3033['y'] = Math[_0x5bf382(0x48a)](_0x3b3033['y']); continue; }break; } }, Window_Base[_0x3a6da1(0x49b)]['initDigitG' + _0x3a6da1(0xfa3)] = function () { const _0x25ee87 = _0x3a6da1; this[_0x25ee87(0x384) + _0x25ee87(0x44f)] = VisuMZ[_0x25ee87(0xc9f)][_0x25ee87(0x316)][_0x25ee87(0xfee)][_0x25ee87(0xacd) + _0x25ee87(0xf49) + _0x25ee87(0xf47)], this[_0x25ee87(0x384) + _0x25ee87(0xe7b)] = VisuMZ[_0x25ee87(0xc9f)]['Settings'][_0x25ee87(0xfee)]['DigitGroup' + _0x25ee87(0xd5f)]; }, Window_Base['prototype'][_0x3a6da1(0xf3c)] = function () { const _0x130d2a = _0x3a6da1; return VisuMZ[_0x130d2a(0xc9f)][_0x130d2a(0x316)]['Window']['LineHeight']; }, Window_Base[_0x3a6da1(0x49b)][_0x3a6da1(0xa37) + 'g'] = function () { const _0x550c90 = _0x3a6da1; return VisuMZ['CoreEngine'][_0x550c90(0x316)][_0x550c90(0x3ef)][_0x550c90(0x895) + 'g']; }, Window_Base[_0x3a6da1(0x49b)][_0x3a6da1(0xa2f) + _0x3a6da1(0x100c)] = function () { const _0x4f4ddb = _0x3a6da1; $gameSystem[_0x4f4ddb(0xb68) + _0x4f4ddb(0x1025)] ? this[_0x4f4ddb(0x333) + 'y'] = $gameSystem[_0x4f4ddb(0xb68) + 'ity']() : this[_0x4f4ddb(0x333) + 'y'] = VisuMZ[_0x4f4ddb(0xc9f)][_0x4f4ddb(0x316)][_0x4f4ddb(0x3ef)]['BackOpacit' + 'y']; }, Window_Base[_0x3a6da1(0x49b)][_0x3a6da1(0xd67) + _0x3a6da1(0xd27)] = function () { const _0x45645f = _0x3a6da1; return VisuMZ[_0x45645f(0xc9f)][_0x45645f(0x316)][_0x45645f(0x3ef)]['Translucen' + 'tOpacity']; }, Window_Base['prototype']['openingSpe' + 'ed'] = function () { const _0x5d65cb = _0x3a6da1; return VisuMZ[_0x5d65cb(0xc9f)][_0x5d65cb(0x316)][_0x5d65cb(0x3ef)][_0x5d65cb(0x9a4)]; }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xbd8) + 'e_update'] = Window_Base[_0x3a6da1(0x49b)]['update'], Window_Base[_0x3a6da1(0x49b)][_0x3a6da1(0xc16)] = function () { const _0xde2f5b = _0x3a6da1; VisuMZ['CoreEngine'][_0xde2f5b(0xbd8) + _0xde2f5b(0x6fb)][_0xde2f5b(0xedc)](this), this['updateCore' + _0xde2f5b(0x52d)](); }, Window_Base[_0x3a6da1(0x49b)][_0x3a6da1(0xe8e)] = function () { const _0x4ac702 = _0x3a6da1; this[_0x4ac702(0xead)] && (this['openness'] += this[_0x4ac702(0xd3f) + 'ed'](), this[_0x4ac702(0x4a7)]() && (this[_0x4ac702(0xead)] = ![])); }, Window_Base[_0x3a6da1(0x49b)]['updateClos' + 'e'] = function () { const _0x437efd = _0x3a6da1; this[_0x437efd(0x28e)] && (this['openness'] -= this[_0x437efd(0xd3f) + 'ed'](), this[_0x437efd(0xf7f)]() && (this[_0x437efd(0x28e)] = ![])); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xbd8) + _0x3a6da1(0x9d4)] = Window_Base[_0x3a6da1(0x49b)][_0x3a6da1(0x46a)], Window_Base[_0x3a6da1(0x49b)][_0x3a6da1(0x46a)] = function (_0x2cdce2, _0x2e1538, _0x27387a, _0x1afaa9, _0x426e2a) { const _0xb08a11 = _0x3a6da1; if (this[_0xb08a11(0x3eb) + 'ouping']()) _0x2cdce2 = VisuMZ[_0xb08a11(0x438) + 's'](_0x2cdce2); VisuMZ[_0xb08a11(0xc9f)]['Window_Bas' + _0xb08a11(0x9d4)][_0xb08a11(0xedc)](this, _0x2cdce2, _0x2e1538, _0x27387a, _0x1afaa9, _0x426e2a); }, Window_Base['prototype']['useDigitGr' + _0x3a6da1(0x108e)] = function () { const _0x1b7275 = _0x3a6da1; return this[_0x1b7275(0x384) + _0x1b7275(0x44f)]; }, VisuMZ['CoreEngine'][_0x3a6da1(0xbd8) + _0x3a6da1(0xd86) + _0x3a6da1(0x428)] = Window_Base[_0x3a6da1(0x49b)]['createText' + 'State'], Window_Base[_0x3a6da1(0x49b)][_0x3a6da1(0x6a0) + _0x3a6da1(0x808)] = function (_0x120ab8, _0xd63d2, _0x3b7757, _0x1b2fed) { const _0xc03f6d = _0x3a6da1, _0x3fbce3 = { 'otTSY': function (_0x4ace24, _0x115c1e) { return _0x4ace24(_0x115c1e); } }; var _0x55eb29 = VisuMZ[_0xc03f6d(0xc9f)][_0xc03f6d(0xbd8) + _0xc03f6d(0xd86) + _0xc03f6d(0x428)]['call'](this, _0x120ab8, _0xd63d2, _0x3b7757, _0x1b2fed); if (this[_0xc03f6d(0x3eb) + _0xc03f6d(0x355)]()) _0x55eb29['text'] = _0x3fbce3[_0xc03f6d(0x88c)](String, VisuMZ['GroupDigit' + 's'](_0x55eb29[_0xc03f6d(0x671)])) || ''; return _0x55eb29; }, Window_Base[_0x3a6da1(0x49b)][_0x3a6da1(0x3eb) + 'oupingEx'] = function () { const _0x4f2734 = _0x3a6da1; return this[_0x4f2734(0x384) + _0x4f2734(0xe7b)]; }, Window_Base[_0x3a6da1(0x49b)][_0x3a6da1(0x811) + 'tGrouping'] = function (_0x3ab571) { const _0x46c828 = _0x3a6da1; this['_digitGrou' + _0x46c828(0x44f)] = _0x3ab571; }, Window_Base[_0x3a6da1(0x49b)][_0x3a6da1(0x811) + _0x3a6da1(0x56e) + 'x'] = function (_0x22ac93) { const _0xafb756 = _0x3a6da1; this[_0xafb756(0x384) + 'pingEx'] = _0x22ac93; }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xbd8) + 'e_drawIcon'] = Window_Base[_0x3a6da1(0x49b)]['drawIcon'], Window_Base[_0x3a6da1(0x49b)][_0x3a6da1(0xf58)] = function (_0x2d1329, _0x3ef4c7, _0x199d48) { const _0x2c8d84 = _0x3a6da1; _0x3ef4c7 = Math[_0x2c8d84(0x48a)](_0x3ef4c7), _0x199d48 = Math[_0x2c8d84(0x48a)](_0x199d48), VisuMZ[_0x2c8d84(0xc9f)][_0x2c8d84(0xbd8) + _0x2c8d84(0xda0)][_0x2c8d84(0xedc)](this, _0x2d1329, _0x3ef4c7, _0x199d48); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xbd8) + _0x3a6da1(0x617)] = Window_Base[_0x3a6da1(0x49b)][_0x3a6da1(0x727)], Window_Base[_0x3a6da1(0x49b)][_0x3a6da1(0x727)] = function (_0x39a3aa, _0x4acaea, _0x2af279, _0x568007, _0x267a0c, _0x356869) { const _0x78cd07 = _0x3a6da1, _0x51e9b8 = { 'WKTkk': _0x78cd07(0xc7e) + _0x78cd07(0xe62) }, _0x5f535b = _0x51e9b8[_0x78cd07(0x547)][_0x78cd07(0x80d)]('|'); let _0x55e564 = 0x21c5 + -0x169f + 0xb26 * -0x1; while (!![]) { switch (_0x5f535b[_0x55e564++]) { case '0': _0x356869 = Math[_0x78cd07(0x48a)](_0x356869); continue; case '1': VisuMZ[_0x78cd07(0xc9f)][_0x78cd07(0xbd8) + _0x78cd07(0x617)][_0x78cd07(0xedc)](this, _0x39a3aa, _0x4acaea, _0x2af279, _0x568007, _0x267a0c, _0x356869); continue; case '2': _0x356869 = _0x356869 || ImageManager[_0x78cd07(0xc21)]; continue; case '3': _0x267a0c = Math[_0x78cd07(0x48a)](_0x267a0c); continue; case '4': _0x568007 = Math[_0x78cd07(0x48a)](_0x568007); continue; case '5': _0x267a0c = _0x267a0c || ImageManager[_0x78cd07(0xf91)]; continue; case '6': _0x2af279 = Math['round'](_0x2af279); continue; }break; } }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xbd8) + _0x3a6da1(0x6ee) + _0x3a6da1(0x28c)] = Window_Base[_0x3a6da1(0x49b)]['drawCharac' + 'ter'], Window_Base[_0x3a6da1(0x49b)][_0x3a6da1(0x400) + _0x3a6da1(0xdf5)] = function (_0x3e3ce3, _0x2ea893, _0x51193d, _0x450edd) { const _0x55477e = _0x3a6da1; _0x51193d = Math[_0x55477e(0x48a)](_0x51193d), _0x450edd = Math[_0x55477e(0x48a)](_0x450edd), VisuMZ[_0x55477e(0xc9f)][_0x55477e(0xbd8) + 'e_drawChar' + _0x55477e(0x28c)]['call'](this, _0x3e3ce3, _0x2ea893, _0x51193d, _0x450edd); }, VisuMZ['CoreEngine']['Window_Sel' + 'ectable_it' + _0x3a6da1(0x9b8)] = Window_Selectable[_0x3a6da1(0x49b)]['itemRect'], Window_Selectable[_0x3a6da1(0x49b)][_0x3a6da1(0x31f)] = function (_0x90ceb1) { const _0x276c88 = _0x3a6da1; let _0x1ad04c = VisuMZ['CoreEngine'][_0x276c88(0x627) + _0x276c88(0xc75) + _0x276c88(0x9b8)][_0x276c88(0xedc)](this, _0x90ceb1); return _0x1ad04c['x'] = Math[_0x276c88(0x48a)](_0x1ad04c['x']), _0x1ad04c['y'] = Math[_0x276c88(0x48a)](_0x1ad04c['y']), _0x1ad04c['width'] = Math[_0x276c88(0x48a)](_0x1ad04c['width']), _0x1ad04c['height'] = Math[_0x276c88(0x48a)](_0x1ad04c['height']), _0x1ad04c; }, VisuMZ['CoreEngine'][_0x3a6da1(0xc95) + _0x3a6da1(0x5ed) + _0x3a6da1(0x3cb) + _0x3a6da1(0xca8)] = Window_StatusBase[_0x3a6da1(0x49b)][_0x3a6da1(0x634) + 'impleStatu' + 's'], Window_StatusBase[_0x3a6da1(0x49b)]['drawActorS' + _0x3a6da1(0x90f) + 's'] = function (_0x2bfe80, _0x2b7db2, _0x4a86be) { const _0x1f1374 = _0x3a6da1; _0x2b7db2 = Math[_0x1f1374(0x48a)](_0x2b7db2), _0x4a86be = Math['round'](_0x4a86be), VisuMZ['CoreEngine']['Window_Sta' + _0x1f1374(0x5ed) + _0x1f1374(0x3cb) + 'pleStatus'][_0x1f1374(0xedc)](this, _0x2bfe80, _0x2b7db2, _0x4a86be); }, Window_Base[_0x3a6da1(0x49b)][_0x3a6da1(0x61a) + _0x3a6da1(0x4e8)] = function () { const _0x198435 = _0x3a6da1, _0x59a85e = { 'ZMVHm': _0x198435(0x934) }; this[_0x198435(0x85e) + 'g'] = { 'duration': 0x0, 'wholeDuration': 0x0, 'type': _0x59a85e[_0x198435(0xb5a)], 'targetX': this['x'], 'targetY': this['y'], 'targetScaleX': this[_0x198435(0x357)]['x'], 'targetScaleY': this[_0x198435(0x357)]['y'], 'targetOpacity': this['opacity'], 'targetBackOpacity': this[_0x198435(0x333) + 'y'], 'targetContentsOpacity': this[_0x198435(0x94b) + _0x198435(0xe06)] }; }, Window_Base[_0x3a6da1(0x49b)]['updateCore' + 'Easing'] = function () { const _0x9bf436 = _0x3a6da1, _0x2e4ddd = { 'HcpZo': _0x9bf436(0x6b5) + _0x9bf436(0x3f9), 'yyCfr': function (_0x4eff94, _0x22efa0) { return _0x4eff94 <= _0x22efa0; } }, _0x372731 = _0x2e4ddd[_0x9bf436(0x878)][_0x9bf436(0x80d)]('|'); let _0x39a3bc = -0x1173 + -0x8 * -0x207 + 0x13b; while (!![]) { switch (_0x372731[_0x39a3bc++]) { case '0': this['x'] = this[_0x9bf436(0x1eb) + _0x9bf436(0xadd)](this['x'], this[_0x9bf436(0x85e) + 'g'][_0x9bf436(0x5a4)]); continue; case '1': this[_0x9bf436(0x357)]['y'] = this[_0x9bf436(0x1eb) + _0x9bf436(0xadd)](this[_0x9bf436(0x357)]['y'], this[_0x9bf436(0x85e) + 'g'][_0x9bf436(0x7dd) + 'eY']); continue; case '2': this[_0x9bf436(0x94b) + _0x9bf436(0xe06)] = this[_0x9bf436(0x1eb) + _0x9bf436(0xadd)](this[_0x9bf436(0x94b) + _0x9bf436(0xe06)], this[_0x9bf436(0x85e) + 'g'][_0x9bf436(0xa4c) + 'entsOpacit' + 'y']); continue; case '3': this[_0x9bf436(0x333) + 'y'] = this[_0x9bf436(0x1eb) + _0x9bf436(0xadd)](this['backOpacit' + 'y'], this[_0x9bf436(0x85e) + 'g'][_0x9bf436(0x77e) + 'Opacity']); continue; case '4': this[_0x9bf436(0x357)]['x'] = this['applyCoreE' + _0x9bf436(0xadd)](this['scale']['x'], this[_0x9bf436(0x85e) + 'g'][_0x9bf436(0x7dd) + 'eX']); continue; case '5': this[_0x9bf436(0x85e) + 'g']['duration']--; continue; case '6': if (!this[_0x9bf436(0x85e) + 'g']) return; continue; case '7': this[_0x9bf436(0x579)] = this['applyCoreE' + _0x9bf436(0xadd)](this[_0x9bf436(0x579)], this[_0x9bf436(0x85e) + 'g'][_0x9bf436(0x2c4) + 'ity']); continue; case '8': this['y'] = this[_0x9bf436(0x1eb) + _0x9bf436(0xadd)](this['y'], this[_0x9bf436(0x85e) + 'g'][_0x9bf436(0x201)]); continue; case '9': if (_0x2e4ddd[_0x9bf436(0xd64)](this[_0x9bf436(0x85e) + 'g']['duration'], -0x5 * -0x285 + -0xf53 * 0x2 + 0x120d)) return; continue; }break; } }, Window_Base['prototype'][_0x3a6da1(0x1eb) + 'asing'] = function (_0x19b93e, _0x1cce54) { const _0x339d92 = _0x3a6da1, _0x31d3da = { 'FavOP': function (_0xbb7420, _0x3dc0e9) { return _0xbb7420 / _0x3dc0e9; }, 'LrApJ': function (_0x5e16a9, _0x4433a5) { return _0x5e16a9 - _0x4433a5; }, 'LkBJq': function (_0x48a647, _0x20daf0) { return _0x48a647 + _0x20daf0; }, 'xLqMy': function (_0x11d98d, _0x2965fd) { return _0x11d98d - _0x2965fd; }, 'ZnOVL': function (_0x121bcb, _0x419961) { return _0x121bcb * _0x419961; }, 'vhgwM': function (_0x335a7a, _0x2367bb) { return _0x335a7a - _0x2367bb; }, 'MoRoh': function (_0x2a8bed, _0x26b105) { return _0x2a8bed - _0x26b105; } }; if (!this[_0x339d92(0x85e) + 'g']) return _0x1cce54; const _0x1f64f3 = this[_0x339d92(0x85e) + 'g'][_0x339d92(0xbb7)], _0x3c9718 = this[_0x339d92(0x85e) + 'g'][_0x339d92(0xac4) + _0x339d92(0x987)], _0x19cbe3 = this[_0x339d92(0x584) + _0x339d92(0x4e8)](_0x31d3da['FavOP'](_0x31d3da[_0x339d92(0x5ec)](_0x3c9718, _0x1f64f3), _0x3c9718)), _0x2dc56a = this[_0x339d92(0x584) + _0x339d92(0x4e8)](_0x31d3da[_0x339d92(0xf42)](_0x31d3da[_0x339d92(0x58f)](_0x31d3da['xLqMy'](_0x3c9718, _0x1f64f3), -0x1 * -0x1b5 + -0x3 * -0x705 + -0x16c3), _0x3c9718)), _0xe7976f = _0x31d3da[_0x339d92(0xf42)](_0x31d3da[_0x339d92(0x5ec)](_0x19b93e, _0x31d3da['ZnOVL'](_0x1cce54, _0x19cbe3)), _0x31d3da[_0x339d92(0xf9c)](-0x24fb + -0x1 * 0x9f8 + 0x2ef4, _0x19cbe3)); return _0x31d3da[_0x339d92(0x58f)](_0xe7976f, _0x31d3da['ZnOVL'](_0x31d3da[_0x339d92(0x7e0)](_0x1cce54, _0xe7976f), _0x2dc56a)); }, Window_Base[_0x3a6da1(0x49b)]['calcCoreEa' + 'sing'] = function (_0x20a2e4) { const _0x577862 = _0x3a6da1, _0x3468fa = { 'LlfcC': _0x577862(0x934) }; if (!this[_0x577862(0x85e) + 'g']) return _0x20a2e4; return VisuMZ[_0x577862(0x77a) + 'g'](_0x20a2e4, this[_0x577862(0x85e) + 'g'][_0x577862(0x47e)] || _0x3468fa[_0x577862(0x1e4)]); }, Window_Base['prototype']['anchorCore' + _0x3a6da1(0x52d)] = function (_0x222a2f, _0x4c48a6) { const _0x591068 = _0x3a6da1, _0x295ec1 = { 'LbLgB': _0x591068(0xc77) + _0x591068(0x205) }, _0x41c20c = _0x295ec1[_0x591068(0x109c)][_0x591068(0x80d)]('|'); let _0x36d768 = -0x1e30 + 0x1703 + 0x72d; while (!![]) { switch (_0x41c20c[_0x36d768++]) { case '0': this[_0x591068(0x579)] = this[_0x591068(0x85e) + 'g'][_0x591068(0x2c4) + _0x591068(0x1025)]; continue; case '1': this[_0x591068(0x357)]['x'] = this[_0x591068(0x85e) + 'g'][_0x591068(0x7dd) + 'eX']; continue; case '2': this['y'] = this['_coreEasin' + 'g']['targetY']; continue; case '3': this['x'] = this[_0x591068(0x85e) + 'g'][_0x591068(0x5a4)]; continue; case '4': this[_0x591068(0x357)]['y'] = this[_0x591068(0x85e) + 'g']['targetScal' + 'eY']; continue; case '5': this[_0x591068(0xff4) + _0x591068(0xadd)](_0x222a2f, _0x4c48a6, this['x'], this['y'], this[_0x591068(0x357)]['x'], this[_0x591068(0x357)]['y'], this[_0x591068(0x579)], this['backOpacit' + 'y'], this[_0x591068(0x94b) + _0x591068(0xe06)]); continue; case '6': if (!this['_coreEasin' + 'g']) return; continue; case '7': this[_0x591068(0x333) + 'y'] = this[_0x591068(0x85e) + 'g']['targetBack' + _0x591068(0x100c)]; continue; case '8': this['contentsOp' + _0x591068(0xe06)] = this[_0x591068(0x85e) + 'g']['targetCont' + _0x591068(0x30d) + 'y']; continue; }break; } }, Window_Base['prototype'][_0x3a6da1(0xff4) + _0x3a6da1(0xadd)] = function (_0x387ab6, _0x651147, _0x19b6b7, _0xd8c88, _0x476f11, _0x566f26, _0x4e6b5e, _0x327272, _0x10b907) { this['_coreEasin' + 'g'] = { 'duration': _0x387ab6, 'wholeDuration': _0x387ab6, 'type': _0x651147, 'targetX': _0x19b6b7, 'targetY': _0xd8c88, 'targetScaleX': _0x476f11, 'targetScaleY': _0x566f26, 'targetOpacity': _0x4e6b5e, 'targetBackOpacity': _0x327272, 'targetContentsOpacity': _0x10b907 }; }, Window_Base['prototype'][_0x3a6da1(0xd10) + _0x3a6da1(0xe66)] = function (_0x56e310, _0x198c55, _0x584619, _0x49e2b1, _0x1eb1f5) { const _0x360b3b = _0x3a6da1, _0x38b7bc = { 'icYNY': function (_0x234ef2, _0x18d76f) { return _0x234ef2 > _0x18d76f; }, 'nEKtG': function (_0x15a142, _0x12e98) { return _0x15a142 === _0x12e98; }, 'wYKLp': function (_0xba3490, _0x716e33) { return _0xba3490 + _0x716e33; }, 'kjsKP': function (_0x54cace, _0x8bb90b) { return _0x54cace / _0x8bb90b; }, 'olxUz': function (_0x1d9bf5, _0x564b95) { return _0x1d9bf5 - _0x564b95; }, 'YHePR': function (_0x495e92, _0x47f82d) { return _0x495e92 - _0x47f82d; }, 'nJRFD': function (_0x1630ad, _0x2c3cbe) { return _0x1630ad + _0x2c3cbe; }, 'IGbbO': 'right', 'kylsS': function (_0x92f656, _0xcf4153) { return _0x92f656 + _0xcf4153; }, 'aHRnR': function (_0x5a9275, _0x5a08ae) { return _0x5a9275 > _0x5a08ae; } }; this[_0x360b3b(0x6ce) + _0x360b3b(0x717)](), this[_0x360b3b(0xbb2)][_0x360b3b(0x541)] = VisuMZ['CoreEngine']['Settings'][_0x360b3b(0x320)]['GoldFontSi' + 'ze']; const _0x4947d7 = VisuMZ[_0x360b3b(0xc9f)]['Settings']['Gold'][_0x360b3b(0x491)]; if (_0x38b7bc[_0x360b3b(0x25f)](_0x4947d7, -0x163f + 0x1 * -0x2fa + -0x24b * -0xb) && _0x38b7bc[_0x360b3b(0x33d)](_0x198c55, TextManager[_0x360b3b(0xa4e) + 'it'])) { const _0xcdbcbe = _0x38b7bc[_0x360b3b(0x42e)](_0x49e2b1, _0x38b7bc['kjsKP'](_0x38b7bc['olxUz'](this['lineHeight'](), ImageManager[_0x360b3b(0xce2)]), -0x1 * 0x20d7 + 0x1604 + 0xad5)); this[_0x360b3b(0xf58)](_0x4947d7, _0x38b7bc['wYKLp'](_0x584619, _0x38b7bc[_0x360b3b(0xbc2)](_0x1eb1f5, ImageManager[_0x360b3b(0xc76)])), _0xcdbcbe), _0x1eb1f5 -= _0x38b7bc[_0x360b3b(0x360)](ImageManager[_0x360b3b(0xc76)], 0x281 * -0x1 + 0x1 * 0x1b59 + 0xe * -0x1c6); } else this['changeText' + _0x360b3b(0x2ca)](ColorManager[_0x360b3b(0x42f) + 'r']()), this[_0x360b3b(0x46a)](_0x198c55, _0x584619, _0x49e2b1, _0x1eb1f5, _0x38b7bc[_0x360b3b(0xbf3)]), _0x1eb1f5 -= _0x38b7bc[_0x360b3b(0x543)](this[_0x360b3b(0xc68)](_0x198c55), -0x1c54 + -0x1491 + 0x30eb * 0x1); this[_0x360b3b(0xf5d) + _0x360b3b(0x81b)](); const _0x1939ba = this['textWidth'](this['_digitGrou' + _0x360b3b(0x44f)] ? VisuMZ['GroupDigit' + 's'](_0x56e310) : _0x56e310); _0x38b7bc[_0x360b3b(0x7d3)](_0x1939ba, _0x1eb1f5) ? this[_0x360b3b(0x46a)](VisuMZ['CoreEngine'][_0x360b3b(0x316)][_0x360b3b(0x320)][_0x360b3b(0x7da) + 'p'], _0x584619, _0x49e2b1, _0x1eb1f5, _0x38b7bc['IGbbO']) : this[_0x360b3b(0x46a)](_0x56e310, _0x584619, _0x49e2b1, _0x1eb1f5, _0x38b7bc[_0x360b3b(0xbf3)]), this['resetFontS' + _0x360b3b(0x717)](); }, Window_Base[_0x3a6da1(0x49b)][_0x3a6da1(0xf53) + _0x3a6da1(0xb86)] = function (_0x4b1ea1, _0x21cdee, _0xe74720, _0x48c5be, _0x5060af) { const _0xe60475 = _0x3a6da1, _0x31b3b9 = { 'EeGVW': _0xe60475(0xe5d), 'TTSdw': function (_0x5550a8, _0xe03241) { return _0x5550a8 * _0xe03241; }, 'Zibil': function (_0x166ed2, _0x1524f3) { return _0x166ed2 % _0x1524f3; }, 'mzlPT': function (_0x2f8e8b, _0x4dbb51) { return _0x2f8e8b / _0x4dbb51; } }, _0x20f6e5 = ImageManager[_0xe60475(0x875)](_0x31b3b9['EeGVW']), _0xbab9ea = ImageManager[_0xe60475(0xc76)], _0x3002ec = ImageManager['iconHeight'], _0x137022 = _0x31b3b9[_0xe60475(0x1003)](_0x31b3b9[_0xe60475(0x68e)](_0x4b1ea1, 0xeaa * -0x2 + -0x1f9d * -0x1 + -0x239), _0xbab9ea), _0x504a4a = _0x31b3b9[_0xe60475(0x1003)](Math['floor'](_0x31b3b9[_0xe60475(0x9a0)](_0x4b1ea1, 0x1 * -0x2c3 + -0x2402 + 0x26d5)), _0x3002ec), _0x2e2d58 = _0x48c5be, _0x2773fa = _0x48c5be; this[_0xe60475(0xbb2)][_0xe60475(0xcc7)][_0xe60475(0x30a) + _0xe60475(0x23a) + 'd'] = _0x5060af, this[_0xe60475(0xbb2)]['blt'](_0x20f6e5, _0x137022, _0x504a4a, _0xbab9ea, _0x3002ec, _0x21cdee, _0xe74720, _0x2e2d58, _0x2773fa), this[_0xe60475(0xbb2)][_0xe60475(0xcc7)]['imageSmoot' + 'hingEnable' + 'd'] = !![]; }, Window_Base[_0x3a6da1(0x49b)]['drawGauge'] = function (_0xa58532, _0x24f031, _0x1d4f5a, _0xe89ec7, _0x1dbd0a, _0x5ca6a0) { const _0x5371f3 = _0x3a6da1, _0x5e853e = { 'gSrPo': function (_0x46d7b4, _0x1ad4e0) { return _0x46d7b4 * _0x1ad4e0; }, 'AhqeV': function (_0x37d975, _0x572ff8) { return _0x37d975 - _0x572ff8; }, 'StPeR': function (_0x9d6c9f, _0x5533a6) { return _0x9d6c9f - _0x5533a6; }, 'OXKqh': function (_0x299383, _0x4c9cb2) { return _0x299383 + _0x4c9cb2; }, 'jUpsm': function (_0x1ac90b, _0x53beaa) { return _0x1ac90b + _0x53beaa; } }, _0x47d0b0 = Math[_0x5371f3(0x719)](_0x5e853e[_0x5371f3(0x969)](_0x5e853e[_0x5371f3(0x6a8)](_0x1d4f5a, 0x1067 * 0x1 + 0x21b9 * -0x1 + 0x1154), _0xe89ec7)), _0x40693f = Sprite_Gauge[_0x5371f3(0x49b)][_0x5371f3(0x8c4) + 't'][_0x5371f3(0xedc)](this), _0x2c8d56 = _0x5e853e[_0x5371f3(0xb12)](_0x5e853e[_0x5371f3(0x6a8)](_0x5e853e[_0x5371f3(0xccf)](_0x24f031, this[_0x5371f3(0xf3c)]()), _0x40693f), 0x5 * 0x197 + -0x71e * 0x3 + -0x1 * -0xd69); this[_0x5371f3(0xbb2)][_0x5371f3(0x9c2)](_0xa58532, _0x2c8d56, _0x1d4f5a, _0x40693f, ColorManager[_0x5371f3(0x103e) + 'olor']()), this[_0x5371f3(0xbb2)][_0x5371f3(0x7e4) + _0x5371f3(0xe61)](_0x5e853e[_0x5371f3(0xccf)](_0xa58532, 0xcdc + -0x2b * 0xd + -0xaac), _0x5e853e[_0x5371f3(0xbd6)](_0x2c8d56, 0x1b56 + -0x19dc + 0x179 * -0x1), _0x47d0b0, _0x5e853e[_0x5371f3(0xb12)](_0x40693f, -0x5 * -0x52f + -0x65 + -0x1984), _0x1dbd0a, _0x5ca6a0); }, Window_Scrollable[_0x3a6da1(0xdaf)] = { 'enabled': VisuMZ[_0x3a6da1(0xc9f)]['Settings'][_0x3a6da1(0x3ef)][_0x3a6da1(0x5a1) + _0x3a6da1(0x5b6)] ?? !![], 'thickness': VisuMZ['CoreEngine'][_0x3a6da1(0x316)]['Window']['BarThickne' + 'ss'] ?? 0x1d3 * 0xb + -0x67 * 0x1d + -0x864, 'offset': VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x316)][_0x3a6da1(0x3ef)][_0x3a6da1(0x538)] ?? -0x1 * 0x13c + -0x14ba + 0x15f8, 'bodyColor': VisuMZ['CoreEngine'][_0x3a6da1(0x316)][_0x3a6da1(0x3ef)][_0x3a6da1(0x777) + 'or'] ?? 0x5a * 0x4e + -0x2 * -0x756 + -0x2a18, 'offColor': VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x316)][_0x3a6da1(0x3ef)]['OffBarColo' + 'r'] ?? 0x4 * 0x649 + 0xd8d * -0x2 + 0x1 * 0x1fd, 'offOpacity': VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x316)][_0x3a6da1(0x3ef)][_0x3a6da1(0x813) + _0x3a6da1(0x1025)] ?? -0xc4d + -0x51f + 0x7c * 0x25 }, Window_Base[_0x3a6da1(0x49b)][_0x3a6da1(0x36d) + 'rVisible'] = function () { const _0x1f094b = _0x3a6da1, _0x2ff902 = { 'jvWet': function (_0x3c1b1f, _0x575e25) { return _0x3c1b1f > _0x575e25; } }; return Window_Scrollable['SCROLLBAR'][_0x1f094b(0xe00)] && _0x2ff902[_0x1f094b(0xbc4)](Window_Scrollable['SCROLLBAR'][_0x1f094b(0x431)], 0x6b7 + 0x1 * 0x7f + -0x736); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xbd8) + _0x3a6da1(0xc31) + _0x3a6da1(0x7d1)] = Window_Base[_0x3a6da1(0x49b)][_0x3a6da1(0x509) + 'ents'], Window_Base[_0x3a6da1(0x49b)][_0x3a6da1(0x509) + _0x3a6da1(0x5ad)] = function () { const _0x120082 = _0x3a6da1; VisuMZ['CoreEngine']['Window_Bas' + 'e_createCo' + _0x120082(0x7d1)]['call'](this), this[_0x120082(0x686) + _0x120082(0x553) + 'es'](), this[_0x120082(0x997) + 'lBarBitmap'](!![]), this[_0x120082(0x997) + _0x120082(0x372)](![]); }, Window_Base[_0x3a6da1(0x49b)][_0x3a6da1(0x686) + 'llBarSprit' + 'es'] = function () { const _0x50bdee = _0x3a6da1, _0xfb4e1 = { 'mQQpW': _0x50bdee(0x28f) + _0x50bdee(0x288) }, _0x3cd01d = _0xfb4e1[_0x50bdee(0x4d7)][_0x50bdee(0x80d)]('|'); let _0x268325 = -0x7 * 0x54a + -0x3 * 0x3b9 + 0x3031; while (!![]) { switch (_0x3cd01d[_0x268325++]) { case '0': this[_0x50bdee(0xfdb) + _0x50bdee(0xddb)] = { 'horz': null, 'vert': null, 'maxHorz': null, 'maxVert': null }; continue; case '1': if (!this[_0x50bdee(0x36d) + _0x50bdee(0x534)]()) return; continue; case '2': this[_0x50bdee(0xc5e)](this[_0x50bdee(0x54b) + _0x50bdee(0xfb2)]); continue; case '3': this[_0x50bdee(0xc5e)](this[_0x50bdee(0x54b) + 'Vert']); continue; case '4': if (this[_0x50bdee(0x54b) + _0x50bdee(0xfb2)] || this[_0x50bdee(0x54b) + 'Vert']) return; continue; case '5': this['_scrollBar' + _0x50bdee(0xfb2)] = new Sprite(); continue; case '6': this['_scrollBar' + _0x50bdee(0xaf7)] = new Sprite(); continue; }break; } }, Window_Base[_0x3a6da1(0x49b)][_0x3a6da1(0x997) + _0x3a6da1(0x372)] = function (_0x1e49b3) { const _0x3133ba = _0x3a6da1, _0x388fd9 = { 'BWkZx': function (_0x51801e, _0x37e467) { return _0x51801e - _0x37e467; }, 'aZwuU': function (_0x903d18, _0x99404f) { return _0x903d18 * _0x99404f; }, 'JWvXZ': function (_0x57d68d, _0x4a9e48) { return _0x57d68d - _0x4a9e48; }, 'XXSoa': function (_0x1cc0b8, _0xce8979) { return _0x1cc0b8 * _0xce8979; } }, _0x5cbd2c = _0x1e49b3 ? this['_scrollBar' + _0x3133ba(0xfb2)] : this[_0x3133ba(0x54b) + _0x3133ba(0xaf7)]; if (!_0x5cbd2c) return; const _0x4d2410 = Window_Scrollable[_0x3133ba(0xdaf)], _0x3d9bf0 = _0x4d2410[_0x3133ba(0x431)], _0x32c4a9 = _0x1e49b3 ? _0x388fd9['BWkZx'](this['innerWidth'], _0x388fd9[_0x3133ba(0xe09)](_0x3d9bf0, 0x1da3 + 0xee7 + 0xa * -0x474)) : _0x3d9bf0, _0x1e4eae = _0x1e49b3 ? _0x3d9bf0 : _0x388fd9[_0x3133ba(0x979)](this[_0x3133ba(0xb48) + 't'], _0x388fd9['XXSoa'](_0x3d9bf0, -0x2249 * -0x1 + 0x2431 + 0x386 * -0x14)); _0x5cbd2c[_0x3133ba(0xa7c)] = new Bitmap(_0x32c4a9, _0x1e4eae), _0x5cbd2c[_0x3133ba(0xb57)](-0xffa + -0x1ad2 + 0x1 * 0x2acc, 0x22a5 + -0x347 * -0x1 + -0x1 * 0x25ec, _0x32c4a9, _0x1e4eae), this['updateScro' + 'llBarPosit' + _0x3133ba(0x987)](_0x1e49b3); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xbd8) + _0x3a6da1(0x937) + 'ontents'] = Window_Base[_0x3a6da1(0x49b)][_0x3a6da1(0xf79) + 'tents'], Window_Base[_0x3a6da1(0x49b)][_0x3a6da1(0xf79) + _0x3a6da1(0xed7)] = function () { const _0x4060d4 = _0x3a6da1; VisuMZ[_0x4060d4(0xc9f)][_0x4060d4(0xbd8) + 'e_destroyC' + _0x4060d4(0xe3d)][_0x4060d4(0xedc)](this), this['destroyScr' + _0x4060d4(0x328) + _0x4060d4(0xdae)](); }, Window_Base['prototype']['destroyScr' + 'ollBarBitm' + _0x3a6da1(0xdae)] = function () { const _0x4df04a = _0x3a6da1, _0x2b17fe = [this[_0x4df04a(0x54b) + _0x4df04a(0xfb2)], this[_0x4df04a(0x54b) + _0x4df04a(0xaf7)]]; for (const _0x4dac0b of _0x2b17fe) { if (_0x4dac0b && _0x4dac0b[_0x4df04a(0xa7c)]) _0x4dac0b[_0x4df04a(0xa7c)][_0x4df04a(0xf25)](); } }, VisuMZ['CoreEngine'][_0x3a6da1(0x337) + _0x3a6da1(0x3fe) + _0x3a6da1(0x95d)] = Window_Scrollable[_0x3a6da1(0x49b)][_0x3a6da1(0xc16)], Window_Scrollable[_0x3a6da1(0x49b)]['update'] = function () { const _0x2120cf = _0x3a6da1; VisuMZ['CoreEngine'][_0x2120cf(0x337) + _0x2120cf(0x3fe) + _0x2120cf(0x95d)][_0x2120cf(0xedc)](this), this[_0x2120cf(0x2c3) + _0x2120cf(0xe48)](); }, Window_Scrollable[_0x3a6da1(0x49b)][_0x3a6da1(0x2c3) + 'llBars'] = function () { const _0x379deb = _0x3a6da1, _0x4c5886 = { 'mhPvG': _0x379deb(0xe85) }, _0x5915a5 = _0x4c5886[_0x379deb(0x6a7)]['split']('|'); let _0x6614bd = -0x3b3 * 0x3 + 0x31f * 0xb + -0x1 * 0x173c; while (!![]) { switch (_0x5915a5[_0x6614bd++]) { case '0': this[_0x379deb(0x1ed) + _0x379deb(0x372)](![]); continue; case '1': this[_0x379deb(0x1ed) + _0x379deb(0x372)](!![]); continue; case '2': this[_0x379deb(0x2c3) + 'llBarPosit' + _0x379deb(0x987)](![]); continue; case '3': this[_0x379deb(0x2c3) + _0x379deb(0xd63) + _0x379deb(0x781)](); continue; case '4': this[_0x379deb(0x2c3) + _0x379deb(0x5ee) + _0x379deb(0x987)](!![]); continue; }break; } }, Window_Scrollable[_0x3a6da1(0x49b)][_0x3a6da1(0x2c3) + _0x3a6da1(0xd63) + _0x3a6da1(0x781)] = function () { const _0x443b57 = _0x3a6da1, _0xd88b3d = [this[_0x443b57(0x54b) + _0x443b57(0xfb2)], this[_0x443b57(0x54b) + _0x443b57(0xaf7)]]; for (const _0x2741d7 of _0xd88b3d) { _0x2741d7 && (_0x2741d7[_0x443b57(0xe15)] = this[_0x443b57(0x36d) + _0x443b57(0x534)]() && this['isOpen']()); } }, Window_Scrollable['prototype']['checkScrol' + _0x3a6da1(0x372)] = function (_0x3e0798) { const _0x1e5309 = _0x3a6da1, _0x55e18a = { 'PmpKn': _0x1e5309(0xd91), 'faBut': _0x1e5309(0xc9c), 'bkMtq': _0x1e5309(0x52e), 'ybVFT': 'maxVert', 'EcfmA': function (_0x42db74, _0x5d3d70) { return _0x42db74 !== _0x5d3d70; } }; if (!this['_lastScrol' + _0x1e5309(0xddb)]) return; const _0x35792d = this[_0x1e5309(0xe83)](_0x3e0798), _0x94926 = this[_0x1e5309(0x802) + 'ar'](_0x3e0798), _0x149acc = _0x3e0798 ? _0x55e18a[_0x1e5309(0x37c)] : _0x55e18a[_0x1e5309(0xde2)], _0x3c45b1 = _0x3e0798 ? _0x55e18a[_0x1e5309(0x310)] : _0x55e18a[_0x1e5309(0x687)]; (_0x55e18a['EcfmA'](this[_0x1e5309(0xfdb) + 'lBarValues'][_0x149acc], _0x35792d) || _0x55e18a[_0x1e5309(0xb90)](this[_0x1e5309(0xfdb) + 'lBarValues'][_0x3c45b1], _0x94926)) && (this[_0x1e5309(0xfdb) + _0x1e5309(0xddb)][_0x149acc] = _0x35792d, this[_0x1e5309(0xfdb) + _0x1e5309(0xddb)][_0x3c45b1] = _0x94926, this[_0x1e5309(0x9b0) + _0x1e5309(0x328) + 'ap'](_0x3e0798, _0x35792d, _0x94926)); }, Window_Scrollable[_0x3a6da1(0x49b)]['scrollbar'] = function (_0x437c32) { const _0x5484d7 = _0x3a6da1, _0x4b7eb2 = { 'iiElT': function (_0x4578a1, _0x1e1072) { return _0x4578a1 !== _0x1e1072; } }; if (_0x4b7eb2[_0x5484d7(0x9d8)](this[_0x5484d7(0x2b0) + _0x5484d7(0x4d0)], undefined)) return _0x437c32 ? this[_0x5484d7(0xbee)]() : this['origin']['y']; return _0x437c32 ? this['scrollX']() : this['scrollY'](); }, Window_Scrollable[_0x3a6da1(0x49b)][_0x3a6da1(0x802) + 'ar'] = function (_0x5203fa) { const _0x266e58 = _0x3a6da1, _0x93e921 = { 'IWGki': function (_0x4cbaa0, _0x1a0dbd) { return _0x4cbaa0 !== _0x1a0dbd; }, 'bXWfd': function (_0x4dabb2, _0x5ef6fe) { return _0x4dabb2 - _0x5ef6fe; } }; if (_0x93e921[_0x266e58(0x56f)](this[_0x266e58(0x2b0) + _0x266e58(0x4d0)], undefined)) return _0x5203fa ? this[_0x266e58(0x104d)]() : Math[_0x266e58(0xeb6)](0x16f7 + -0x3a4 + -0x33 * 0x61, _0x93e921[_0x266e58(0x109e)](this[_0x266e58(0x2b0) + 'ight'], this['innerHeigh' + 't'])); return _0x5203fa ? this[_0x266e58(0x104d)]() : this[_0x266e58(0xab7)](); }, Window_Scrollable['prototype']['scrollbarH' + _0x3a6da1(0x52f)] = function () { const _0x252bb4 = _0x3a6da1, _0x543132 = { 'FtrzD': function (_0x2989be, _0xc9358b) { return _0x2989be !== _0xc9358b; } }; if (_0x543132[_0x252bb4(0x4cc)](this['_allTextHe' + _0x252bb4(0x4d0)], undefined)) return Math[_0x252bb4(0xeb6)](-0x60a + -0x1 * 0x593 + 0xb9d, this[_0x252bb4(0x2b0) + _0x252bb4(0x4d0)]); return this[_0x252bb4(0xa48) + _0x252bb4(0xde0)](); }, Window_Scrollable[_0x3a6da1(0x49b)]['refreshScr' + _0x3a6da1(0x328) + 'ap'] = function (_0x13eb91, _0x2a29c1, _0xbf7100) { const _0x4c3c26 = _0x3a6da1, _0xc3e622 = { 'sTKBd': function (_0x1c8219, _0x2b5bd2) { return _0x1c8219 <= _0x2b5bd2; }, 'Umiqs': function (_0x522342, _0x38e3aa) { return _0x522342 / _0x38e3aa; }, 'rdCFt': function (_0x2d9532, _0x192b43) { return _0x2d9532 / _0x192b43; }, 'YnJds': function (_0x241246, _0x1b9ca7) { return _0x241246 * _0x1b9ca7; }, 'NweRQ': function (_0x3ef02c, _0x547014) { return _0x3ef02c * _0x547014; }, 'SumHJ': function (_0x4b5b46, _0x237131) { return _0x4b5b46 * _0x237131; } }, _0x271903 = _0x13eb91 ? this[_0x4c3c26(0x54b) + _0x4c3c26(0xfb2)] : this[_0x4c3c26(0x54b) + _0x4c3c26(0xaf7)]; if (!_0x271903) return; if (!_0x271903[_0x4c3c26(0xa7c)]) return; const _0x68aa85 = _0x271903[_0x4c3c26(0xa7c)]; _0x68aa85['clear'](); if (_0xc3e622[_0x4c3c26(0xebe)](_0xbf7100, -0xa75 + 0x1 * -0x7d3 + 0x1248)) return; const _0xb337b9 = _0x13eb91 ? _0xc3e622[_0x4c3c26(0x470)](this['innerWidth'], this[_0x4c3c26(0x342) + 'th']()) : _0xc3e622[_0x4c3c26(0x405)](this['innerHeigh' + 't'], this[_0x4c3c26(0xd2b) + _0x4c3c26(0x52f)]()), _0x1884cf = _0x13eb91 ? Math['round'](_0xc3e622[_0x4c3c26(0x9a9)](_0x2a29c1, _0xb337b9)) : 0xdf6 + -0x5 * 0x443 + 0x759, _0x3324a2 = _0x13eb91 ? -0x1 * 0x20de + -0x437 + -0xb * -0x35f : Math[_0x4c3c26(0x48a)](_0xc3e622[_0x4c3c26(0xadf)](_0x2a29c1, _0xb337b9)), _0x263718 = _0x13eb91 ? Math[_0x4c3c26(0x48a)](_0xc3e622[_0x4c3c26(0xd50)](_0x68aa85[_0x4c3c26(0x4c0)], _0xb337b9)) : _0x68aa85[_0x4c3c26(0x4c0)], _0x2a762a = _0x13eb91 ? _0x68aa85[_0x4c3c26(0x944)] : Math['round'](_0xc3e622[_0x4c3c26(0x9a9)](_0x68aa85[_0x4c3c26(0x944)], _0xb337b9)), _0x4b2cbd = Window_Scrollable[_0x4c3c26(0xdaf)], _0x1c2d31 = ColorManager[_0x4c3c26(0xf07)](_0x4b2cbd[_0x4c3c26(0x896)]), _0x4ab7ce = ColorManager['getColor'](_0x4b2cbd[_0x4c3c26(0xef4)]), _0x451963 = _0x4b2cbd[_0x4c3c26(0x47b)]; _0x68aa85[_0x4c3c26(0x3b6) + 'ty'] = _0x451963, _0x68aa85[_0x4c3c26(0xf59)](_0x1c2d31), _0x68aa85['paintOpaci' + 'ty'] = -0x181e + 0x26c9 + 0x1c * -0x7d, _0x68aa85[_0x4c3c26(0x9c2)](_0x1884cf, _0x3324a2, _0x263718, _0x2a762a, _0x4ab7ce); }, Window_Base['prototype'][_0x3a6da1(0x2c3) + _0x3a6da1(0x5ee) + _0x3a6da1(0x987)] = function (_0x3b366b) { const _0x374249 = _0x3a6da1, _0x352438 = { 'ZGykx': function (_0x5e1712, _0x5ef660) { return _0x5e1712 + _0x5ef660; }, 'fTIMu': function (_0x4f58ad, _0x3385ee) { return _0x4f58ad + _0x3385ee; } }, _0x1993d = _0x3b366b ? this[_0x374249(0x54b) + _0x374249(0xfb2)] : this['_scrollBar' + _0x374249(0xaf7)]; if (!_0x1993d) return; const _0x53d15c = Window_Scrollable[_0x374249(0xdaf)], _0x23f413 = _0x53d15c[_0x374249(0x431)], _0x7734a5 = _0x53d15c['offset']; if (!_0x1993d['transform']) return; _0x1993d['x'] = _0x352438[_0x374249(0x1006)](this[_0x374249(0xd07)], _0x3b366b ? _0x23f413 : _0x352438['fTIMu'](this['innerWidth'], _0x7734a5)), _0x1993d['y'] = _0x352438[_0x374249(0x1006)](this[_0x374249(0xd07)], _0x3b366b ? _0x352438[_0x374249(0x1006)](this[_0x374249(0xb48) + 't'], _0x7734a5) : _0x23f413); }, Window_Selectable[_0x3a6da1(0x49b)][_0x3a6da1(0xa45)] = function (_0x36a468) { const _0x24c98e = _0x3a6da1, _0x47aaa9 = { 'zfzEd': function (_0x318998, _0x3e05bb) { return _0x318998 < _0x3e05bb; }, 'wyyAU': function (_0x2a9071, _0x2c6f00) { return _0x2a9071 === _0x2c6f00; }, 'kvQgz': function (_0x1e18da, _0x5770e1) { return _0x1e18da >= _0x5770e1; }, 'IyjUx': function (_0x16b35a, _0xf8292) { return _0x16b35a - _0xf8292; }, 'CCibk': function (_0x7398bd, _0x403718) { return _0x7398bd % _0x403718; }, 'Qwcmq': function (_0x11f845, _0x4ba5a5) { return _0x11f845 + _0x4ba5a5; } }; let _0xbdc838 = this['index'](); const _0x297a84 = this[_0x24c98e(0xd26)](), _0x32e4bc = this[_0x24c98e(0x3e6)](); if (this[_0x24c98e(0x698) + _0x24c98e(0x81f)]() && (_0x47aaa9[_0x24c98e(0xab0)](_0xbdc838, _0x297a84) || _0x36a468 && _0x47aaa9[_0x24c98e(0x497)](_0x32e4bc, 0x1 * -0x1997 + -0x1 * -0x1ab7 + -0x11f * 0x1))) { _0xbdc838 += _0x32e4bc; if (_0x47aaa9[_0x24c98e(0x109b)](_0xbdc838, _0x297a84)) _0xbdc838 = _0x47aaa9[_0x24c98e(0x6dd)](_0x297a84, 0x2 * -0x30a + -0x169f + 0x1cb4); this[_0x24c98e(0x30b) + 'ct'](_0xbdc838); } else !this[_0x24c98e(0x698) + _0x24c98e(0x81f)]() && ((_0x47aaa9['zfzEd'](_0xbdc838, _0x47aaa9[_0x24c98e(0x6dd)](_0x297a84, _0x32e4bc)) || _0x36a468 && _0x47aaa9['wyyAU'](_0x32e4bc, 0x10be * -0x1 + -0x2012 + 0x30d1 * 0x1)) && this[_0x24c98e(0x30b) + 'ct'](_0x47aaa9['CCibk'](_0x47aaa9['Qwcmq'](_0xbdc838, _0x32e4bc), _0x297a84))); }, VisuMZ[_0x3a6da1(0xc9f)]['Window_Sel' + _0x3a6da1(0xf70) + _0x3a6da1(0x45e)] = Window_Selectable[_0x3a6da1(0x49b)]['cursorDown'], Window_Selectable['prototype']['cursorDown'] = function (_0x526684) { const _0x5b0bc4 = _0x3a6da1, _0x733cd4 = { 'bvoMX': function (_0x44d107, _0x26c613) { return _0x44d107 === _0x26c613; }, 'rEeZo': function (_0x34e6b7, _0x1cfd62) { return _0x34e6b7 === _0x1cfd62; }, 'ybXjs': function (_0x5ea609, _0x3ed406) { return _0x5ea609 - _0x3ed406; } }; this[_0x5b0bc4(0x698) + _0x5b0bc4(0x81f)]() && _0x526684 && _0x733cd4[_0x5b0bc4(0x9eb)](this['maxCols'](), 0x3 * 0x204 + -0x5 * 0x1b9 + 0x292) && _0x733cd4[_0x5b0bc4(0xc3f)](this[_0x5b0bc4(0x9e2)](), _0x733cd4['ybXjs'](this[_0x5b0bc4(0xd26)](), -0x4 * 0x94d + -0x3f5 + 0x292a)) ? this['smoothSele' + 'ct'](-0x7b + 0x99 * -0x1 + 0x45 * 0x4) : VisuMZ[_0x5b0bc4(0xc9f)]['Window_Sel' + 'ectable_cu' + _0x5b0bc4(0x45e)][_0x5b0bc4(0xedc)](this, _0x526684); }, Window_Selectable[_0x3a6da1(0x49b)][_0x3a6da1(0xafb)] = function (_0x1f3c13) { const _0x3f3aa8 = _0x3a6da1, _0x433c7c = { 'jmfsU': function (_0x27819c, _0x508155) { return _0x27819c > _0x508155; }, 'WXqQz': function (_0x5b0988, _0x30882b) { return _0x5b0988 === _0x30882b; }, 'GbjLx': function (_0x498268, _0x5d3ce9) { return _0x498268 <= _0x5d3ce9; }, 'seNaD': function (_0xc8ff9c, _0x32ba9d) { return _0xc8ff9c >= _0x32ba9d; }, 'wextF': function (_0xd1aa2d, _0x1c2de9) { return _0xd1aa2d % _0x1c2de9; }, 'PpSqX': function (_0x46ae7b, _0x54223b) { return _0x46ae7b + _0x54223b; }, 'ufXUj': function (_0x5d2340, _0x2407b0) { return _0x5d2340 - _0x2407b0; } }; let _0x23e661 = Math[_0x3f3aa8(0xeb6)](0x69c + 0x5b * -0x6 + -0x6 * 0xbf, this[_0x3f3aa8(0x9e2)]()); const _0x538eb1 = this['maxItems'](), _0x249ba5 = this[_0x3f3aa8(0x3e6)](); if (this['isUseModer' + _0x3f3aa8(0x81f)]() && _0x433c7c[_0x3f3aa8(0x4ed)](_0x23e661, -0xba + 0xc1 * 0x1f + 0x11 * -0x155) || _0x1f3c13 && _0x433c7c[_0x3f3aa8(0x94a)](_0x249ba5, 0x1 * 0x18f5 + -0x1fde + -0x5 * -0x162)) { _0x23e661 -= _0x249ba5; if (_0x433c7c['GbjLx'](_0x23e661, -0x5 * -0x2eb + 0x2420 + -0x32b7)) _0x23e661 = -0x78 * -0x16 + 0x76d * 0x1 + -0x11bd; this[_0x3f3aa8(0x30b) + 'ct'](_0x23e661); } else !this[_0x3f3aa8(0x698) + _0x3f3aa8(0x81f)]() && ((_0x433c7c[_0x3f3aa8(0xd08)](_0x23e661, _0x249ba5) || _0x1f3c13 && _0x433c7c['WXqQz'](_0x249ba5, -0xcd5 * -0x3 + -0xa51 * -0x2 + -0x3b20)) && this[_0x3f3aa8(0x30b) + 'ct'](_0x433c7c['wextF'](_0x433c7c[_0x3f3aa8(0xb16)](_0x433c7c['ufXUj'](_0x23e661, _0x249ba5), _0x538eb1), _0x538eb1))); }, VisuMZ['CoreEngine'][_0x3a6da1(0x627) + _0x3a6da1(0xf70) + _0x3a6da1(0xb28)] = Window_Selectable[_0x3a6da1(0x49b)][_0x3a6da1(0xafb)], Window_Selectable[_0x3a6da1(0x49b)][_0x3a6da1(0xafb)] = function (_0x452f14) { const _0x45fe0d = _0x3a6da1, _0x4b7b16 = { 'fjTyi': function (_0x211ec3, _0x51335f) { return _0x211ec3 === _0x51335f; }, 'kUilE': function (_0x330a85, _0x59478a) { return _0x330a85 === _0x59478a; }, 'lMWEk': function (_0x3ececd, _0x2130dc) { return _0x3ececd - _0x2130dc; } }; this[_0x45fe0d(0x698) + 'nControls']() && _0x452f14 && _0x4b7b16[_0x45fe0d(0x1017)](this[_0x45fe0d(0x3e6)](), -0x111 + -0xfd8 + 0x10ea) && _0x4b7b16[_0x45fe0d(0x739)](this[_0x45fe0d(0x9e2)](), -0x1d47 + 0x3c * 0x2 + 0x1ccf) ? this['smoothSele' + 'ct'](_0x4b7b16[_0x45fe0d(0xeca)](this[_0x45fe0d(0xd26)](), -0x10 * -0x13c + 0x1091 * 0x1 + -0x2450)) : VisuMZ[_0x45fe0d(0xc9f)][_0x45fe0d(0x627) + _0x45fe0d(0xf70) + 'rsorUp'][_0x45fe0d(0xedc)](this, _0x452f14); }, Window_Selectable[_0x3a6da1(0x49b)]['isUseModer' + 'nControls'] = function () { const _0x254cb5 = _0x3a6da1; return VisuMZ['CoreEngine'][_0x254cb5(0x316)][_0x254cb5(0xfee)][_0x254cb5(0xe49) + _0x254cb5(0x465)]; }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x627) + _0x3a6da1(0x970) + 'ocessCurso' + 'rMove'] = Window_Selectable[_0x3a6da1(0x49b)]['processCur' + _0x3a6da1(0x469)], Window_Selectable[_0x3a6da1(0x49b)][_0x3a6da1(0x7aa) + 'sorMove'] = function () { const _0x3dc72c = _0x3a6da1; this[_0x3dc72c(0x698) + _0x3dc72c(0x81f)]() ? (this[_0x3dc72c(0x7aa) + _0x3dc72c(0x949) + _0x3dc72c(0x61b) + 's'](), this[_0x3dc72c(0x7aa) + 'sorHomeEnd' + _0x3dc72c(0xcdf)]()) : VisuMZ['CoreEngine']['Window_Sel' + _0x3dc72c(0x970) + _0x3dc72c(0xcc1) + _0x3dc72c(0xbc5)]['call'](this); }, Window_Selectable[_0x3a6da1(0x49b)][_0x3a6da1(0x35e) + 'Scrolling'] = function () { return !![]; }, Window_Selectable[_0x3a6da1(0x49b)]['processCur' + _0x3a6da1(0x949) + _0x3a6da1(0x61b) + 's'] = function () { const _0x26226c = _0x3a6da1, _0x2f72f7 = { 'BjBBI': 'down', 'qFEyk': _0x26226c(0xdab), 'XAjFj': 'right', 'NEfgK': 'left', 'ZWPvV': 'pagedown', 'LGLIq': 'pageup', 'BkgHC': function (_0x4e537e, _0x129164) { return _0x4e537e !== _0x129164; } }; if (this[_0x26226c(0x964) + _0x26226c(0x27c)]()) { const _0x268c91 = this[_0x26226c(0x9e2)](); Input[_0x26226c(0xe38)](_0x2f72f7[_0x26226c(0x768)]) && (Input[_0x26226c(0x347)](_0x2f72f7[_0x26226c(0x448)]) && this['allowShift' + _0x26226c(0x9e3)]() ? this[_0x26226c(0xef6) + _0x26226c(0xb40)]() : this[_0x26226c(0xa45)](Input['isTriggere' + 'd'](_0x2f72f7['BjBBI']))), Input[_0x26226c(0xe38)]('up') && (Input[_0x26226c(0x347)](_0x2f72f7[_0x26226c(0x448)]) && this[_0x26226c(0x35e) + 'Scrolling']() ? this[_0x26226c(0xef6) + 'up']() : this[_0x26226c(0xafb)](Input[_0x26226c(0xa5a) + 'd']('up'))), Input['isRepeated'](_0x2f72f7[_0x26226c(0x9e0)]) && this[_0x26226c(0xaf3) + 't'](Input[_0x26226c(0xa5a) + 'd'](_0x2f72f7['XAjFj'])), Input['isRepeated'](_0x2f72f7[_0x26226c(0xa3d)]) && this[_0x26226c(0xb01)](Input[_0x26226c(0xa5a) + 'd'](_0x2f72f7[_0x26226c(0xa3d)])), !this[_0x26226c(0xf20)](_0x2f72f7[_0x26226c(0xb08)]) && Input['isRepeated'](_0x2f72f7[_0x26226c(0xb08)]) && this[_0x26226c(0xef6) + 'down'](), !this[_0x26226c(0xf20)](_0x2f72f7[_0x26226c(0x293)]) && Input[_0x26226c(0xe38)](_0x2f72f7[_0x26226c(0x293)]) && this[_0x26226c(0xef6) + 'up'](), _0x2f72f7[_0x26226c(0x344)](this[_0x26226c(0x9e2)](), _0x268c91) && this[_0x26226c(0xb78) + _0x26226c(0x3f5)](); } }, Window_Selectable[_0x3a6da1(0x49b)][_0x3a6da1(0x7aa) + 'sorHomeEnd' + _0x3a6da1(0xcdf)] = function () { const _0x3f4381 = _0x3a6da1, _0x39f6ed = { 'GoHGO': 'home', 'MikPM': _0x3f4381(0xb3c), 'ZEMKm': function (_0x389f11, _0x585a35) { return _0x389f11 - _0x585a35; }, 'LOTlX': function (_0x295d66, _0x3c8800) { return _0x295d66 !== _0x3c8800; } }; if (this[_0x3f4381(0x964) + _0x3f4381(0x27c)]()) { const _0x1ea117 = this['index'](); Input[_0x3f4381(0xa5a) + 'd'](_0x39f6ed[_0x3f4381(0x5a5)]) && this[_0x3f4381(0x30b) + 'ct'](Math[_0x3f4381(0xb36)](this['index'](), -0xd * 0x98 + -0x4e8 + 0xca0)), Input[_0x3f4381(0xa5a) + 'd'](_0x39f6ed[_0x3f4381(0x353)]) && this[_0x3f4381(0x30b) + 'ct'](Math[_0x3f4381(0xeb6)](this[_0x3f4381(0x9e2)](), _0x39f6ed['ZEMKm'](this[_0x3f4381(0xd26)](), -0x6f * 0x2 + -0x1 * -0x2379 + -0x67 * 0x56))), _0x39f6ed[_0x3f4381(0xc55)](this[_0x3f4381(0x9e2)](), _0x1ea117) && this['playCursor' + _0x3f4381(0x3f5)](); } }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x627) + _0x3a6da1(0x970) + 'ocessTouch'] = Window_Selectable[_0x3a6da1(0x49b)][_0x3a6da1(0x415) + 'ch'], Window_Selectable[_0x3a6da1(0x49b)][_0x3a6da1(0x415) + 'ch'] = function () { const _0x16b4b6 = _0x3a6da1; this[_0x16b4b6(0x698) + _0x16b4b6(0x81f)]() ? this['processTou' + 'chModernCo' + _0x16b4b6(0x23c)]() : VisuMZ['CoreEngine'][_0x16b4b6(0x627) + _0x16b4b6(0x970) + 'ocessTouch'][_0x16b4b6(0xedc)](this); }, Window_Selectable[_0x3a6da1(0x49b)][_0x3a6da1(0x415) + 'chModernCo' + _0x3a6da1(0x23c)] = function () { const _0x1a7e4d = _0x3a6da1; VisuMZ[_0x1a7e4d(0xc9f)][_0x1a7e4d(0x627) + _0x1a7e4d(0x970) + _0x1a7e4d(0x5b5)][_0x1a7e4d(0xedc)](this); }, Window_Selectable[_0x3a6da1(0x49b)][_0x3a6da1(0x5c0)] = function () { const _0x415f0b = _0x3a6da1; return VisuMZ[_0x415f0b(0xc9f)][_0x415f0b(0x316)][_0x415f0b(0x3ef)]['ColSpacing']; }, Window_Selectable['prototype'][_0x3a6da1(0xa15)] = function () { const _0x3835c6 = _0x3a6da1; return VisuMZ[_0x3835c6(0xc9f)][_0x3835c6(0x316)][_0x3835c6(0x3ef)][_0x3835c6(0xf5e)]; }, Window_Selectable[_0x3a6da1(0x49b)][_0x3a6da1(0x691)] = function () { const _0x365a45 = _0x3a6da1, _0x440ff3 = { 'EWdqz': function (_0x4f982c, _0x467558) { return _0x4f982c + _0x467558; } }; return _0x440ff3[_0x365a45(0xa2a)](Window_Scrollable[_0x365a45(0x49b)]['itemHeight'][_0x365a45(0xedc)](this), VisuMZ[_0x365a45(0xc9f)][_0x365a45(0x316)][_0x365a45(0x3ef)][_0x365a45(0x276)]);; }, VisuMZ[_0x3a6da1(0xc9f)]['Window_Sel' + _0x3a6da1(0xe34) + _0x3a6da1(0x4ff) + _0x3a6da1(0xda1)] = Window_Selectable['prototype'][_0x3a6da1(0xa96) + _0x3a6da1(0xb30)], Window_Selectable[_0x3a6da1(0x49b)][_0x3a6da1(0xa96) + 'oundRect'] = function (_0x19eca9) { const _0x5af3e6 = _0x3a6da1, _0x5c05d9 = { 'EOVjA': function (_0x349212, _0x4719c5) { return _0x349212 === _0x4719c5; } }, _0x325383 = VisuMZ[_0x5af3e6(0xc9f)][_0x5af3e6(0x316)]['Window']; if (_0x5c05d9['EOVjA'](_0x325383[_0x5af3e6(0xb46) + _0x5af3e6(0x975)], ![])) return; _0x325383[_0x5af3e6(0x459) + 'ckgroundJS'] ? _0x325383['DrawItemBa' + _0x5af3e6(0xb94)][_0x5af3e6(0xedc)](this, _0x19eca9) : VisuMZ['CoreEngine'][_0x5af3e6(0x627) + 'ectable_dr' + _0x5af3e6(0x4ff) + 'ndRect']['call'](this, _0x19eca9); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x41d) + _0x3a6da1(0x4e7)] = Window_Gold[_0x3a6da1(0x49b)][_0x3a6da1(0x6d0)], Window_Gold[_0x3a6da1(0x49b)][_0x3a6da1(0x6d0)] = function () { const _0x54c88b = _0x3a6da1; this[_0x54c88b(0x35f) + 'e']() ? this['drawGoldIt' + _0x54c88b(0x70d)]() : VisuMZ['CoreEngine'][_0x54c88b(0x41d) + _0x54c88b(0x4e7)][_0x54c88b(0xedc)](this); }, Window_Gold[_0x3a6da1(0x49b)][_0x3a6da1(0x35f) + 'e'] = function () { const _0x1cc6da = _0x3a6da1, _0x557c1f = { 'JOIoO': function (_0x2714c9, _0x47f035) { return _0x2714c9 !== _0x47f035; } }; if (_0x557c1f[_0x1cc6da(0xc34)](TextManager[_0x1cc6da(0xa4e) + 'it'], this['currencyUn' + 'it']())) return ![]; return VisuMZ[_0x1cc6da(0xc9f)]['Settings'][_0x1cc6da(0x320)][_0x1cc6da(0x2e6)]; }, Window_Gold[_0x3a6da1(0x49b)][_0x3a6da1(0xff0) + _0x3a6da1(0x70d)] = function () { const _0x79fc25 = _0x3a6da1, _0x44e4f1 = { 'ObUpx': function (_0x1cd01b, _0x3fd7a1) { return _0x1cd01b > _0x3fd7a1; }, 'GMzyQ': function (_0xdbf56, _0x304990) { return _0xdbf56 + _0x304990; }, 'kMrNA': function (_0x3431aa, _0x2c7441) { return _0x3431aa / _0x2c7441; }, 'xOsaV': function (_0x2e73b4, _0x564373) { return _0x2e73b4 - _0x564373; }, 'QBfNH': _0x79fc25(0x10a7), 'awRNW': function (_0x16809b, _0x499f24) { return _0x16809b + _0x499f24; }, 'CqdUd': function (_0x37030d, _0xcbfa17) { return _0x37030d > _0xcbfa17; }, 'zGnrr': _0x79fc25(0x950) }; this[_0x79fc25(0x6ce) + _0x79fc25(0x717)](), this[_0x79fc25(0xbb2)][_0x79fc25(0x7ee)](), this[_0x79fc25(0xbb2)][_0x79fc25(0x541)] = VisuMZ['CoreEngine'][_0x79fc25(0x316)]['Gold'][_0x79fc25(0x23e) + 'ze']; const _0x2242c5 = VisuMZ[_0x79fc25(0xc9f)][_0x79fc25(0x316)][_0x79fc25(0x320)]['GoldIcon'], _0x220633 = this[_0x79fc25(0xa36) + 'ct'](-0x126 + 0x2fa * -0x5 + 0x1008); if (_0x44e4f1[_0x79fc25(0x8e8)](_0x2242c5, 0x17a3 + -0x1029 + -0x77a)) { const _0x2d409a = _0x44e4f1['GMzyQ'](_0x220633['y'], _0x44e4f1[_0x79fc25(0xcf4)](_0x44e4f1[_0x79fc25(0x8cf)](this[_0x79fc25(0xf3c)](), ImageManager[_0x79fc25(0xce2)]), 0x34 * 0x59 + 0x6 * 0x16a + 0x3 * -0x8da)); this[_0x79fc25(0xf58)](_0x2242c5, _0x220633['x'], _0x2d409a); const _0x40f9c5 = _0x44e4f1[_0x79fc25(0xf0a)](ImageManager['iconWidth'], -0x67 * -0x17 + 0x1e10 + -0x274d); _0x220633['x'] += _0x40f9c5, _0x220633[_0x79fc25(0x4c0)] -= _0x40f9c5; } this[_0x79fc25(0x268) + _0x79fc25(0x2ca)](ColorManager['systemColo' + 'r']()), this['drawText'](this[_0x79fc25(0xa4e) + 'it'](), _0x220633['x'], _0x220633['y'], _0x220633[_0x79fc25(0x4c0)], _0x44e4f1[_0x79fc25(0xa8c)]); const _0x48377f = _0x44e4f1[_0x79fc25(0xeb4)](this[_0x79fc25(0xc68)](this[_0x79fc25(0xa4e) + 'it']()), 0x824 * 0x1 + 0x5ec * -0x2 + 0x6a * 0x9);; _0x220633['x'] += _0x48377f, _0x220633[_0x79fc25(0x4c0)] -= _0x48377f, this[_0x79fc25(0xf5d) + _0x79fc25(0x81b)](); const _0x5318f6 = this['value'](), _0x2b8fcf = this[_0x79fc25(0xc68)](this['_digitGrou' + _0x79fc25(0x44f)] ? VisuMZ[_0x79fc25(0x438) + 's'](this[_0x79fc25(0x395)]()) : this[_0x79fc25(0x395)]()); _0x44e4f1[_0x79fc25(0x20f)](_0x2b8fcf, _0x220633['width']) ? this[_0x79fc25(0x46a)](VisuMZ[_0x79fc25(0xc9f)][_0x79fc25(0x316)]['Gold']['GoldOverla' + 'p'], _0x220633['x'], _0x220633['y'], _0x220633[_0x79fc25(0x4c0)], _0x44e4f1['zGnrr']) : this[_0x79fc25(0x46a)](this['value'](), _0x220633['x'], _0x220633['y'], _0x220633[_0x79fc25(0x4c0)], _0x44e4f1[_0x79fc25(0xd65)]), this[_0x79fc25(0x6ce) + _0x79fc25(0x717)](); }, Window_StatusBase[_0x3a6da1(0x49b)]['drawParamT' + 'ext'] = function (_0x503f62, _0x3b60bc, _0x526424, _0x369ce5, _0x29b850) { const _0x32f1fd = _0x3a6da1, _0x308c0d = { 'cQHYj': function (_0x5bf51d, _0xe3030b) { return _0x5bf51d(_0xe3030b); }, 'wniZc': function (_0x524f1e, _0xcef140) { return _0x524f1e || _0xcef140; }, 'FGLDw': function (_0x468518, _0x52bba6) { return _0x468518 + _0x52bba6; }, 'TCKMQ': function (_0x98b9eb, _0x1ac47) { return _0x98b9eb + _0x1ac47; }, 'DNhZr': function (_0x5c0105, _0x473a15) { return _0x5c0105 + _0x473a15; }, 'BIhJx': function (_0x1c40ad, _0x7aee52) { return _0x1c40ad + _0x7aee52; }, 'YWape': 'left' }; _0x369ce5 = _0x308c0d[_0x32f1fd(0xeaa)](String, _0x308c0d[_0x32f1fd(0xf90)](_0x369ce5, ''))['toUpperCas' + 'e'](); if (VisuMZ[_0x32f1fd(0xc9f)][_0x32f1fd(0x316)][_0x32f1fd(0x6ad)]['DrawIcons']) { const _0x3fd8d6 = VisuMZ[_0x32f1fd(0x107f) + 'on'](_0x369ce5); _0x29b850 ? (this['drawIconBy' + _0x32f1fd(0xb86)](_0x3fd8d6, _0x503f62, _0x3b60bc, this['gaugeLineH' + _0x32f1fd(0x52f)]()), _0x526424 -= _0x308c0d['FGLDw'](this[_0x32f1fd(0x5c9) + _0x32f1fd(0x52f)](), 0x13f9 + 0x1220 * 0x2 + -0x3837), _0x503f62 += _0x308c0d[_0x32f1fd(0xfcc)](this['gaugeLineH' + _0x32f1fd(0x52f)](), 0x248d + 0x53c + 0x1f * -0x159)) : (this[_0x32f1fd(0xf58)](_0x3fd8d6, _0x308c0d[_0x32f1fd(0xfb3)](_0x503f62, 0x24ff + 0x5 * 0x100 + -0x29fd), _0x308c0d[_0x32f1fd(0xfcc)](_0x3b60bc, -0x4 * -0x103 + 0x1d9d + -0x21a7)), _0x526424 -= _0x308c0d[_0x32f1fd(0x6e2)](ImageManager[_0x32f1fd(0xc76)], 0x6ac + -0x2 * -0x10f2 + -0x288c), _0x503f62 += _0x308c0d[_0x32f1fd(0x6f7)](ImageManager['iconWidth'], -0x21e2 + -0x1374 + -0x355a * -0x1)); } const _0xc6ed8a = TextManager[_0x32f1fd(0xa58)](_0x369ce5); this[_0x32f1fd(0x6ce) + 'ettings'](), this[_0x32f1fd(0x268) + _0x32f1fd(0x2ca)](ColorManager[_0x32f1fd(0x42f) + 'r']()), _0x29b850 ? (this[_0x32f1fd(0xbb2)][_0x32f1fd(0x541)] = this[_0x32f1fd(0xa86) + _0x32f1fd(0x3b5)](), this['contents'][_0x32f1fd(0x46a)](_0xc6ed8a, _0x503f62, _0x3b60bc, _0x526424, this[_0x32f1fd(0x5c9) + 'eight'](), _0x308c0d['YWape'])) : this[_0x32f1fd(0x46a)](_0xc6ed8a, _0x503f62, _0x3b60bc, _0x526424), this['resetFontS' + _0x32f1fd(0x717)](); }, Window_StatusBase[_0x3a6da1(0x49b)][_0x3a6da1(0xa86) + _0x3a6da1(0x3b5)] = function () { const _0x57e0b0 = _0x3a6da1, _0x5f816 = { 'JPekA': function (_0x321ea3, _0x12076c) { return _0x321ea3 - _0x12076c; } }; return _0x5f816[_0x57e0b0(0xaf2)]($gameSystem[_0x57e0b0(0x51c) + 'ze'](), -0x9 * 0x266 + 0x20e * -0x9 + 0x281c); }, Window_StatusBase['prototype'][_0x3a6da1(0xc89) + _0x3a6da1(0x7eb)] = function (_0x156958, _0x36976b, _0x328d6f, _0x4aecd6) { const _0x3d1cf7 = _0x3a6da1, _0x2d5641 = { 'TVNHQ': function (_0x17a814, _0x1825b1) { return _0x17a814 || _0x1825b1; } }; _0x4aecd6 = _0x2d5641[_0x3d1cf7(0x5d8)](_0x4aecd6, 0xbe * -0x10 + -0xb57 * 0x3 + 0x2e8d), this[_0x3d1cf7(0xf5d) + _0x3d1cf7(0x81b)](); if (VisuMZ['CoreEngine'][_0x3d1cf7(0x316)]['UI']['TextCodeCl' + 'assNames']) this[_0x3d1cf7(0x9bf)](_0x156958[_0x3d1cf7(0x9f4) + 'ss']()['name'], _0x36976b, _0x328d6f, _0x4aecd6); else { const _0xaeba4e = _0x156958[_0x3d1cf7(0x9f4) + 'ss']()[_0x3d1cf7(0x796)][_0x3d1cf7(0xdac)](/\\I\[(\d+)\]/gi, ''); this[_0x3d1cf7(0x46a)](_0xaeba4e, _0x36976b, _0x328d6f, _0x4aecd6); } }, Window_StatusBase[_0x3a6da1(0x49b)][_0x3a6da1(0x909) + 'ickname'] = function (_0x5b129c, _0x30ee87, _0xa8f975, _0x134b68) { const _0x40f1bf = _0x3a6da1, _0x192886 = { 'fytnm': function (_0x201658, _0x4e9e4e) { return _0x201658 || _0x4e9e4e; } }; _0x134b68 = _0x192886[_0x40f1bf(0x7d2)](_0x134b68, 0x1ec1 * -0x1 + 0x3a5 + -0x5a2 * -0x5), this[_0x40f1bf(0xf5d) + 'olor'](); if (VisuMZ['CoreEngine'][_0x40f1bf(0x316)]['UI'][_0x40f1bf(0x6fc) + _0x40f1bf(0xdad)]) this[_0x40f1bf(0x9bf)](_0x5b129c['nickname'](), _0x30ee87, _0xa8f975, _0x134b68); else { const _0x4d7d9c = _0x5b129c['nickname']()[_0x40f1bf(0xdac)](/\\I\[(\d+)\]/gi, ''); this[_0x40f1bf(0x46a)](_0x5b129c['nickname'](), _0x30ee87, _0xa8f975, _0x134b68); } }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xc95) + _0x3a6da1(0x5ed) + _0x3a6da1(0xd4b) + 'el'] = Window_StatusBase[_0x3a6da1(0x49b)][_0x3a6da1(0x9bb) + 'evel'], Window_StatusBase[_0x3a6da1(0x49b)][_0x3a6da1(0x9bb) + _0x3a6da1(0x725)] = function (_0x2fd0f4, _0x5d1f2e, _0x4950cc) { const _0x2c6674 = _0x3a6da1, _0x4c47c4 = { 'KRJCa': function (_0x3b9476, _0x42a0e8) { return _0x3b9476 === _0x42a0e8; } }; if (_0x4c47c4[_0x2c6674(0x103c)](VisuMZ[_0x2c6674(0xc9f)]['Settings']['Param'][_0x2c6674(0x3b2) + _0x2c6674(0x725)], ![])) return; if (this[_0x2c6674(0x84a) + _0x2c6674(0xf0f)]()) this[_0x2c6674(0xecc) + _0x2c6674(0x602)](_0x2fd0f4, _0x5d1f2e, _0x4950cc); VisuMZ[_0x2c6674(0xc9f)][_0x2c6674(0xc95) + _0x2c6674(0x5ed) + _0x2c6674(0xd4b) + 'el'][_0x2c6674(0xedc)](this, _0x2fd0f4, _0x5d1f2e, _0x4950cc); }, Window_StatusBase[_0x3a6da1(0x49b)][_0x3a6da1(0x84a) + _0x3a6da1(0xf0f)] = function () { const _0x150baf = _0x3a6da1; return VisuMZ[_0x150baf(0xc9f)][_0x150baf(0x316)]['UI'][_0x150baf(0x256)]; }, Window_StatusBase[_0x3a6da1(0x49b)][_0x3a6da1(0xecc) + _0x3a6da1(0x602)] = function (_0x204e1d, _0x368543, _0x3147f1) { const _0x167736 = _0x3a6da1, _0x323431 = { 'xZOmO': function (_0x28b135, _0x4fb7e2) { return _0x28b135 >= _0x4fb7e2; } }; if (!_0x204e1d) return; if (!_0x204e1d[_0x167736(0xd40)]()) return; const _0x45194e = -0x56 * -0x2f + -0x1b76 + 0xc2c, _0x3e319e = _0x204e1d[_0x167736(0xcf9)](); let _0x382453 = ColorManager[_0x167736(0xbd9) + _0x167736(0x54c)](), _0x71820b = ColorManager[_0x167736(0xbd9) + _0x167736(0xcd5)](); _0x323431[_0x167736(0xef1)](_0x3e319e, -0x26b * 0x1 + -0x870 + -0x1 * -0xadc) && (_0x382453 = ColorManager['maxLvGauge' + _0x167736(0xb7b)](), _0x71820b = ColorManager[_0x167736(0xa88) + _0x167736(0x1089)]()), this[_0x167736(0x334)](_0x368543, _0x3147f1, _0x45194e, _0x3e319e, _0x382453, _0x71820b); }, Window_EquipStatus['prototype'][_0x3a6da1(0x23d) + 'ams'] = function () { const _0x3860d4 = _0x3a6da1; let _0x222973 = 0x1cba + 0x1d79 + -0x13d * 0x2f; for (const _0x1df46d of VisuMZ[_0x3860d4(0xc9f)][_0x3860d4(0x316)][_0x3860d4(0x6ad)]['DisplayedP' + _0x3860d4(0x915)]) { const _0x5e104a = this['itemPaddin' + 'g'](), _0x6221c8 = this[_0x3860d4(0x60f)](_0x222973); this[_0x3860d4(0xd3c)](_0x5e104a, _0x6221c8, _0x1df46d), _0x222973++; } }, Window_EquipStatus[_0x3a6da1(0x49b)][_0x3a6da1(0x520) + _0x3a6da1(0xa13)] = function (_0x4d48e2, _0x50da5e, _0x59c395) { const _0x2b9f73 = _0x3a6da1, _0x29fd6f = { 'AarIr': function (_0x273f5f, _0x584caf) { return _0x273f5f - _0x584caf; }, 'kVmup': function (_0x526066, _0x364a1c) { return _0x526066 * _0x364a1c; } }, _0x360d12 = _0x29fd6f[_0x2b9f73(0x34d)](this[_0x2b9f73(0x758)](), _0x29fd6f[_0x2b9f73(0xb51)](this[_0x2b9f73(0xa37) + 'g'](), 0x2e * -0xd4 + 0x1 * -0x258d + -0x4ba7 * -0x1)); this['drawParamT' + _0x2b9f73(0x450)](_0x4d48e2, _0x50da5e, _0x360d12, _0x59c395, ![]); }, Window_EquipStatus['prototype'][_0x3a6da1(0xd10) + _0x3a6da1(0xf11)] = function (_0x107e24, _0x536426, _0x514fd1) { const _0x1f5682 = _0x3a6da1, _0x2e0d48 = { 'VrLmZ': _0x1f5682(0x950) }, _0x596851 = this[_0x1f5682(0x6ec)](); this['resetTextC' + 'olor'](), this[_0x1f5682(0x46a)](this[_0x1f5682(0x464)][_0x1f5682(0xb66) + 'ByName'](_0x514fd1, !![]), _0x107e24, _0x536426, _0x596851, _0x2e0d48['VrLmZ']); }, Window_EquipStatus[_0x3a6da1(0x49b)][_0x3a6da1(0x90b) + 'rrow'] = function (_0xa3a40a, _0x1bad52) { const _0x265ead = _0x3a6da1, _0x2ea558 = { 'tpwJM': _0x265ead(0xb1e) }, _0x500f2d = this[_0x265ead(0xee7) + 'Width'](); this[_0x265ead(0x268) + _0x265ead(0x2ca)](ColorManager[_0x265ead(0x42f) + 'r']()); const _0x2a6d34 = VisuMZ[_0x265ead(0xc9f)][_0x265ead(0x316)]['UI'][_0x265ead(0xeb5)]; this[_0x265ead(0x46a)](_0x2a6d34, _0xa3a40a, _0x1bad52, _0x500f2d, _0x2ea558['tpwJM']); }, Window_EquipStatus[_0x3a6da1(0x49b)][_0x3a6da1(0x10a3) + 'am'] = function (_0x1d4e42, _0x1e4aba, _0x4faf7b) { const _0x392a90 = _0x3a6da1, _0x3243d0 = { 'REuAV': function (_0x3f49d9, _0x43caa0) { return _0x3f49d9 - _0x43caa0; }, 'fXBKo': _0x392a90(0x950) }, _0x3c1a32 = this[_0x392a90(0x6ec)](), _0x8b1267 = this[_0x392a90(0xa63)]['paramValue' + _0x392a90(0x852)](_0x4faf7b), _0x2d93e6 = _0x3243d0[_0x392a90(0x955)](_0x8b1267, this[_0x392a90(0x464)]['paramValue' + 'ByName'](_0x4faf7b)); this['changeText' + 'Color'](ColorManager['paramchang' + _0x392a90(0x3e3)](_0x2d93e6)), this['drawText'](this[_0x392a90(0xa63)][_0x392a90(0xb66) + _0x392a90(0x852)](_0x4faf7b, !![]), _0x1d4e42, _0x1e4aba, _0x3c1a32, _0x3243d0[_0x392a90(0x3c0)]); }, VisuMZ['CoreEngine'][_0x3a6da1(0xa74) + _0x3a6da1(0x71d) + _0x3a6da1(0xa83)] = Window_EquipItem[_0x3a6da1(0x49b)]['isEnabled'], Window_EquipItem['prototype'][_0x3a6da1(0xb71)] = function (_0x2b9f21) { const _0x30576b = _0x3a6da1; return _0x2b9f21 && this[_0x30576b(0x464)] ? this[_0x30576b(0x464)][_0x30576b(0x862)](_0x2b9f21) : VisuMZ['CoreEngine'][_0x30576b(0xa74) + _0x30576b(0x71d) + 'nabled'][_0x30576b(0xedc)](this, _0x2b9f21); }, Window_StatusParams[_0x3a6da1(0x49b)][_0x3a6da1(0xd26)] = function () { const _0x3896e7 = _0x3a6da1; return VisuMZ[_0x3896e7(0xc9f)]['Settings']['Param'][_0x3896e7(0x74f) + _0x3896e7(0x915)]['length']; }, Window_StatusParams[_0x3a6da1(0x49b)][_0x3a6da1(0xd3c)] = function (_0x3902be) { const _0x39fb24 = _0x3a6da1, _0x2081d4 = { 'rcjbs': function (_0x83bc5e, _0x21f73a) { return _0x83bc5e + _0x21f73a; }, 'lXHOT': _0x39fb24(0x950) }, _0x3ebd7a = this[_0x39fb24(0xa36) + 'ct'](_0x3902be), _0x3a5f67 = VisuMZ['CoreEngine']['Settings'][_0x39fb24(0x6ad)][_0x39fb24(0x74f) + _0x39fb24(0x915)][_0x3902be], _0x29d862 = TextManager['param'](_0x3a5f67), _0x2f4b47 = this['_actor'][_0x39fb24(0xb66) + _0x39fb24(0x852)](_0x3a5f67, !![]); this[_0x39fb24(0xf02) + 'ext'](_0x3ebd7a['x'], _0x3ebd7a['y'], 0x1b44 + -0x6 * -0x322 + -0x2 * 0x16b8, _0x3a5f67, ![]), this[_0x39fb24(0xf5d) + _0x39fb24(0x81b)](), this['drawText'](_0x2f4b47, _0x2081d4[_0x39fb24(0xd45)](_0x3ebd7a['x'], 0x1132 + -0x1c7c + 0x1 * 0xbea), _0x3ebd7a['y'], 0x2 * 0x18d + -0x2d5 * 0xb + 0x1c49 * 0x1, _0x2081d4[_0x39fb24(0xcc3)]); }; function _0xe91a(_0x28769b, _0x550b07) { const _0x144d4b = _0x1e0c(); return _0xe91a = function (_0x276f9f, _0x44fdaf) { _0x276f9f = _0x276f9f - (0xfa0 + -0x1a45 + -0x163 * -0x9); let _0x1ebae9 = _0x144d4b[_0x276f9f]; return _0x1ebae9; }, _0xe91a(_0x28769b, _0x550b07); } if (VisuMZ['CoreEngine']['Settings'][_0x3a6da1(0x988) + _0x3a6da1(0xd57)][_0x3a6da1(0x38e) + 'Input']) { VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x316)][_0x3a6da1(0x988) + _0x3a6da1(0xd57)][_0x3a6da1(0x71b) + 'ut'] && (Window_NameInput['LATIN1'] = ['Q', 'W', 'E', 'R', 'T', 'Y', 'U', 'I', 'O', 'P', 'A', 'S', 'D', 'F', 'G', 'H', 'J', 'K', 'L', '\x27', '`', 'Z', 'X', 'C', 'V', 'B', 'N', 'M', ',', '.', 'q', 'w', 'e', 'r', 't', 'y', 'u', 'i', 'o', 'p', 'a', 's', 'd', 'f', 'g', 'h', 'j', 'k', 'l', ':', '~', 'z', 'x', 'c', 'v', 'b', 'n', 'm', '\x22', ';', '1', '2', '3', '4', '5', '6', '7', '8', '9', '0', '!', '@', '#', '$', '%', '^', '&', '*', '(', ')', '<', '>', '[', ']', '-', '_', '/', '\x20', _0x3a6da1(0x21e), 'OK']);; VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xad7) + _0x3a6da1(0x73f) + _0x3a6da1(0xb0e)] = Window_NameInput[_0x3a6da1(0x49b)][_0x3a6da1(0xa40)], Window_NameInput[_0x3a6da1(0x49b)][_0x3a6da1(0xa40)] = function (_0x514155) { const _0x410ff0 = _0x3a6da1, _0x4d4a25 = { 'TJeET': function (_0x31f0df, _0x46c332) { return _0x31f0df === _0x46c332; }, 'CpvJQ': _0x410ff0(0xe94) }; this['_mode'] = this[_0x410ff0(0x8fe) + _0x410ff0(0xb8b)](), VisuMZ[_0x410ff0(0xc9f)]['Window_Nam' + _0x410ff0(0x73f) + _0x410ff0(0xb0e)][_0x410ff0(0xedc)](this, _0x514155), _0x4d4a25[_0x410ff0(0x68b)](this[_0x410ff0(0xea0)], _0x4d4a25[_0x410ff0(0xb73)]) ? this[_0x410ff0(0x722)](0x1 * -0x136d + 0x20cf + -0xd62) : (Input[_0x410ff0(0x7ee)](), this['deselect']()); }, Window_NameInput['prototype'][_0x3a6da1(0x8fe) + 'utMode'] = function () { const _0x4565c7 = _0x3a6da1, _0x19f3a6 = { 'zfvSk': _0x4565c7(0xe94), 'zBqXk': _0x4565c7(0x503) }; if (Input[_0x4565c7(0x4c3) + _0x4565c7(0xd52)]()) return _0x19f3a6['zfvSk']; return VisuMZ[_0x4565c7(0xc9f)]['Settings'][_0x4565c7(0x988) + _0x4565c7(0xd57)][_0x4565c7(0x53f) + 'e'] || _0x19f3a6['zBqXk']; }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xad7) + _0x3a6da1(0xf01) + _0x3a6da1(0x31b) + 'ng'] = Window_NameInput[_0x3a6da1(0x49b)][_0x3a6da1(0x561) + _0x3a6da1(0xb26)], Window_NameInput['prototype'][_0x3a6da1(0x561) + _0x3a6da1(0xb26)] = function () { const _0x2b8557 = _0x3a6da1, _0x187e3e = { 'cdYrt': function (_0x421294, _0x46c4ff) { return _0x421294 === _0x46c4ff; }, 'isQCe': _0x2b8557(0x503), 'XGWBU': _0x2b8557(0xe94), 'FDmBE': 'backspace', 'ZAByN': _0x2b8557(0x9a3), 'kPZER': function (_0x221a77, _0x5643f9) { return _0x221a77 === _0x5643f9; }, 'uaGnu': function (_0x284762, _0xcda127) { return _0x284762 === _0xcda127; }, 'eJvMB': 'escape' }; if (!this[_0x2b8557(0x4a7)]()) return; if (!this[_0x2b8557(0x6be)]) return; if (_0x187e3e[_0x2b8557(0x8b2)](this['_mode'], _0x187e3e[_0x2b8557(0x5a8)]) && Input['isGamepadT' + _0x2b8557(0x71c)]()) this[_0x2b8557(0x681) + 's'](_0x187e3e[_0x2b8557(0x5a9)]); else { if (Input[_0x2b8557(0xc44) + _0x2b8557(0xe37)](_0x187e3e['FDmBE'])) Input[_0x2b8557(0x7ee)](), this[_0x2b8557(0x5da) + 'k'](); else { if (Input[_0x2b8557(0xa5a) + 'd'](_0x187e3e[_0x2b8557(0x41c)])) Input[_0x2b8557(0x7ee)](), _0x187e3e[_0x2b8557(0x9e9)](this[_0x2b8557(0xea0)], _0x187e3e['isQCe']) ? this['switchMode' + 's'](_0x187e3e[_0x2b8557(0x5a9)]) : this[_0x2b8557(0x681) + 's'](_0x187e3e['isQCe']); else { if (_0x187e3e[_0x2b8557(0xbad)](this[_0x2b8557(0xea0)], _0x187e3e['isQCe'])) this[_0x2b8557(0xc17) + _0x2b8557(0xa9d) + 'ing'](); else Input[_0x2b8557(0xc44) + _0x2b8557(0xe37)](_0x187e3e[_0x2b8557(0xe4c)]) ? (Input['clear'](), this[_0x2b8557(0x681) + 's'](_0x187e3e[_0x2b8557(0x5a8)])) : VisuMZ[_0x2b8557(0xc9f)][_0x2b8557(0xad7) + _0x2b8557(0xf01) + _0x2b8557(0x31b) + 'ng'][_0x2b8557(0xedc)](this); } } } }, VisuMZ['CoreEngine'][_0x3a6da1(0xad7) + 'eInput_pro' + _0x3a6da1(0x7bb)] = Window_NameInput[_0x3a6da1(0x49b)]['processTou' + 'ch'], Window_NameInput[_0x3a6da1(0x49b)]['processTou' + 'ch'] = function () { const _0x2287f3 = _0x3a6da1, _0x20705c = { 'IyKxA': function (_0x1142b0, _0x34d2d6) { return _0x1142b0 === _0x34d2d6; }, 'TEjVT': _0x2287f3(0x503), 'EDUic': 'default' }; if (!this[_0x2287f3(0x303) + _0x2287f3(0x3f2)]()) return; if (_0x20705c[_0x2287f3(0x803)](this[_0x2287f3(0xea0)], _0x20705c['TEjVT'])) { if (TouchInput[_0x2287f3(0xa5a) + 'd']() && this['isTouchedI' + _0x2287f3(0xeda)]()) this['switchMode' + 's'](_0x20705c[_0x2287f3(0xcf3)]); else TouchInput[_0x2287f3(0xd13) + 'd']() && this[_0x2287f3(0x681) + 's'](_0x20705c[_0x2287f3(0xcf3)]); } else VisuMZ[_0x2287f3(0xc9f)][_0x2287f3(0xad7) + _0x2287f3(0xf01) + _0x2287f3(0x7bb)][_0x2287f3(0xedc)](this); }, Window_NameInput['prototype'][_0x3a6da1(0xc17) + _0x3a6da1(0xa9d) + _0x3a6da1(0x4d4)] = function () { const _0x522796 = _0x3a6da1, _0xeba67e = { 'oZqOT': _0x522796(0xed6), 'mhovL': function (_0x337eaa, _0x14ed6f) { return _0x337eaa !== _0x14ed6f; }, 'rukzi': function (_0x1d6680, _0x8b4247) { return _0x1d6680 < _0x8b4247; } }; if (Input[_0x522796(0xc44) + _0x522796(0xe37)](_0xeba67e[_0x522796(0x9f8)])) Input[_0x522796(0x7ee)](), this[_0x522796(0xe05)](); else { if (_0xeba67e[_0x522796(0x274)](Input[_0x522796(0xb39) + 'ng'], undefined)) { let _0x59e460 = Input[_0x522796(0xb39) + 'ng'], _0x2eee64 = _0x59e460[_0x522796(0x786)]; for (let _0xd59097 = 0x525 + 0x1c1b + -0x2140; _0xeba67e[_0x522796(0x700)](_0xd59097, _0x2eee64); ++_0xd59097) { this[_0x522796(0x1e9) + 'w'][_0x522796(0xe8b)](_0x59e460[_0xd59097]) ? SoundManager[_0x522796(0x9d6)]() : SoundManager[_0x522796(0xcc6)](); } Input[_0x522796(0x7ee)](); } } }, Window_NameInput['prototype'][_0x3a6da1(0x681) + 's'] = function (_0x4ce4f2) { const _0x2bef94 = _0x3a6da1, _0x1f9966 = { 'HYFth': function (_0x427397, _0x4a9223) { return _0x427397 !== _0x4a9223; }, 'fAMxn': function (_0x158c71, _0x187ee4) { return _0x158c71 === _0x187ee4; }, 'RkYmv': _0x2bef94(0xe94) }; let _0x3f3cdb = this[_0x2bef94(0xea0)]; this['_mode'] = _0x4ce4f2, _0x1f9966[_0x2bef94(0xde7)](_0x3f3cdb, this[_0x2bef94(0xea0)]) && (this[_0x2bef94(0x6d0)](), SoundManager[_0x2bef94(0x9d6)](), _0x1f9966[_0x2bef94(0x523)](this['_mode'], _0x1f9966[_0x2bef94(0x935)]) ? this[_0x2bef94(0x722)](-0x21a4 + -0x235 * -0x6 + 0x2 * 0xa33) : this[_0x2bef94(0x722)](-(0x3 * 0x711 + 0x1ad3 + 0x287 * -0x13))); }, VisuMZ['CoreEngine'][_0x3a6da1(0xad7) + 'eInput_cur' + _0x3a6da1(0x3f7)] = Window_NameInput['prototype'][_0x3a6da1(0xa45)], Window_NameInput[_0x3a6da1(0x49b)][_0x3a6da1(0xa45)] = function (_0x2ded43) { const _0x2e17c1 = _0x3a6da1, _0x43b7ef = { 'pQcCz': function (_0x4814d4, _0x1ca6ca) { return _0x4814d4 === _0x1ca6ca; }, 'XvNyg': 'keyboard', 'YkGjv': _0x2e17c1(0xe94) }; if (_0x43b7ef[_0x2e17c1(0x8e4)](this[_0x2e17c1(0xea0)], _0x43b7ef['XvNyg']) && !Input['isArrowPre' + _0x2e17c1(0x4a1)]()) return; if (Input[_0x2e17c1(0xbbd) + 'essed']()) return; VisuMZ[_0x2e17c1(0xc9f)]['Window_Nam' + _0x2e17c1(0xf56) + 'sorDown'][_0x2e17c1(0xedc)](this, _0x2ded43), this[_0x2e17c1(0x681) + 's'](_0x43b7ef[_0x2e17c1(0x89c)]); }, VisuMZ['CoreEngine']['Window_Nam' + 'eInput_cur' + 'sorUp'] = Window_NameInput[_0x3a6da1(0x49b)][_0x3a6da1(0xafb)], Window_NameInput[_0x3a6da1(0x49b)]['cursorUp'] = function (_0x527ac0) { const _0x377978 = _0x3a6da1, _0x470c7a = { 'orDBZ': function (_0x3fcde8, _0x5e6b5b) { return _0x3fcde8 === _0x5e6b5b; }, 'jbbXd': 'keyboard', 'rfRbO': _0x377978(0xe94) }; if (_0x470c7a[_0x377978(0x5ea)](this[_0x377978(0xea0)], _0x470c7a[_0x377978(0xb61)]) && !Input[_0x377978(0xd77) + 'ssed']()) return; if (Input[_0x377978(0xbbd) + _0x377978(0xb44)]()) return; VisuMZ[_0x377978(0xc9f)][_0x377978(0xad7) + 'eInput_cur' + _0x377978(0x233)][_0x377978(0xedc)](this, _0x527ac0), this[_0x377978(0x681) + 's'](_0x470c7a[_0x377978(0xe5a)]); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xad7) + 'eInput_cur' + _0x3a6da1(0x3f8)] = Window_NameInput[_0x3a6da1(0x49b)][_0x3a6da1(0xaf3) + 't'], Window_NameInput[_0x3a6da1(0x49b)][_0x3a6da1(0xaf3) + 't'] = function (_0x27dff3) { const _0x26834f = _0x3a6da1, _0x4cb9b9 = { 'WgUeb': function (_0x4c4346, _0x552b88) { return _0x4c4346 === _0x552b88; }, 'cGhCc': _0x26834f(0x503), 'eDISP': _0x26834f(0xe94) }; if (_0x4cb9b9[_0x26834f(0x44a)](this[_0x26834f(0xea0)], _0x4cb9b9['cGhCc']) && !Input[_0x26834f(0xd77) + _0x26834f(0x4a1)]()) return; if (Input[_0x26834f(0xbbd) + _0x26834f(0xb44)]()) return; VisuMZ[_0x26834f(0xc9f)][_0x26834f(0xad7) + _0x26834f(0xf56) + _0x26834f(0x3f8)][_0x26834f(0xedc)](this, _0x27dff3), this[_0x26834f(0x681) + 's'](_0x4cb9b9['eDISP']); }, VisuMZ[_0x3a6da1(0xc9f)]['Window_Nam' + _0x3a6da1(0xf56) + _0x3a6da1(0xee8)] = Window_NameInput[_0x3a6da1(0x49b)][_0x3a6da1(0xb01)], Window_NameInput['prototype']['cursorLeft'] = function (_0x3c4409) { const _0x50c149 = _0x3a6da1, _0x310283 = { 'EXeQv': function (_0x3d59d0, _0x257ad8) { return _0x3d59d0 === _0x257ad8; }, 'kPwvG': _0x50c149(0x503), 'pMJRy': _0x50c149(0xe94) }; if (_0x310283[_0x50c149(0x787)](this[_0x50c149(0xea0)], _0x310283[_0x50c149(0xaff)]) && !Input['isArrowPre' + _0x50c149(0x4a1)]()) return; if (Input[_0x50c149(0xbbd) + _0x50c149(0xb44)]()) return; VisuMZ[_0x50c149(0xc9f)][_0x50c149(0xad7) + _0x50c149(0xf56) + _0x50c149(0xee8)][_0x50c149(0xedc)](this, _0x3c4409), this[_0x50c149(0x681) + 's'](_0x310283[_0x50c149(0x92e)]); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xad7) + _0x3a6da1(0xf56) + 'sorPagedow' + 'n'] = Window_NameInput[_0x3a6da1(0x49b)][_0x3a6da1(0xef6) + _0x3a6da1(0xb40)], Window_NameInput[_0x3a6da1(0x49b)][_0x3a6da1(0xef6) + _0x3a6da1(0xb40)] = function () { const _0x2aa6c5 = _0x3a6da1, _0x357c86 = { 'jLksO': function (_0x41cfb8, _0x49294c) { return _0x41cfb8 === _0x49294c; }, 'dthwG': _0x2aa6c5(0x503), 'xcwcS': 'default' }; if (_0x357c86[_0x2aa6c5(0x3a2)](this['_mode'], _0x357c86[_0x2aa6c5(0x96b)])) return; if (Input[_0x2aa6c5(0xbbd) + 'essed']()) return; VisuMZ['CoreEngine']['Window_Nam' + _0x2aa6c5(0xf56) + _0x2aa6c5(0xf28) + 'n'][_0x2aa6c5(0xedc)](this), this[_0x2aa6c5(0x681) + 's'](_0x357c86[_0x2aa6c5(0x662)]); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xad7) + 'eInput_cur' + _0x3a6da1(0xb88)] = Window_NameInput[_0x3a6da1(0x49b)][_0x3a6da1(0xef6) + 'up'], Window_NameInput[_0x3a6da1(0x49b)]['cursorPage' + 'up'] = function () { const _0x4b675d = _0x3a6da1, _0x56c976 = { 'fVqCH': function (_0x160ffb, _0x57bbd6) { return _0x160ffb === _0x57bbd6; }, 'HavfM': _0x4b675d(0x503), 'OCoWX': _0x4b675d(0xe94) }; if (_0x56c976['fVqCH'](this['_mode'], _0x56c976[_0x4b675d(0xd8d)])) return; if (Input['isNumpadPr' + _0x4b675d(0xb44)]()) return; VisuMZ[_0x4b675d(0xc9f)]['Window_Nam' + _0x4b675d(0xf56) + _0x4b675d(0xb88)][_0x4b675d(0xedc)](this), this['switchMode' + 's'](_0x56c976['OCoWX']); }, VisuMZ['CoreEngine'][_0x3a6da1(0xad7) + 'eInput_ref' + 'resh'] = Window_NameInput[_0x3a6da1(0x49b)][_0x3a6da1(0x6d0)], Window_NameInput['prototype'][_0x3a6da1(0x6d0)] = function () { const _0x25aa6a = _0x3a6da1, _0x271ddc = { 'bmjlm': function (_0x16658e, _0x54bf17) { return _0x16658e === _0x54bf17; }, 'wqzVP': _0x25aa6a(0x503), 'oFxjO': function (_0x3498a2, _0x24e956) { return _0x3498a2 / _0x24e956; }, 'PEPuM': function (_0x3282f7, _0x188a6f) { return _0x3282f7 - _0x188a6f; }, 'jiLyE': function (_0x192d49, _0x1f323a) { return _0x192d49 * _0x1f323a; }, 'mREne': function (_0x57cfc9, _0x53b754) { return _0x57cfc9 < _0x53b754; } }; if (_0x271ddc[_0x25aa6a(0x411)](this[_0x25aa6a(0xea0)], _0x271ddc['wqzVP'])) { this[_0x25aa6a(0xbb2)][_0x25aa6a(0x7ee)](), this[_0x25aa6a(0xce8) + 'ck'][_0x25aa6a(0x7ee)](), this[_0x25aa6a(0xf5d) + 'olor'](); let _0x447254 = VisuMZ[_0x25aa6a(0xc9f)][_0x25aa6a(0x316)][_0x25aa6a(0x988) + _0x25aa6a(0xd57)]['NameInputM' + _0x25aa6a(0x8ae)][_0x25aa6a(0x80d)]('\x0a'), _0x214f0a = _0x447254['length'], _0x5ae53f = _0x271ddc['oFxjO'](_0x271ddc[_0x25aa6a(0x570)](this[_0x25aa6a(0xb48) + 't'], _0x271ddc[_0x25aa6a(0x37e)](_0x214f0a, this['lineHeight']())), 0x2 * -0x135b + -0x13d2 + 0x3a8a); for (let _0x160e69 = -0x392 * -0x2 + 0xaf * -0x11 + -0x1 * -0x47b; _0x271ddc[_0x25aa6a(0x577)](_0x160e69, _0x214f0a); ++_0x160e69) { let _0x240c37 = _0x447254[_0x160e69], _0x523cea = this[_0x25aa6a(0xf98)](_0x240c37)[_0x25aa6a(0x4c0)], _0x567b24 = Math[_0x25aa6a(0x719)](_0x271ddc[_0x25aa6a(0x425)](_0x271ddc['PEPuM'](this[_0x25aa6a(0xbb2)][_0x25aa6a(0x4c0)], _0x523cea), 0x1559 * 0x1 + 0x1593 + -0x2aea * 0x1)); this[_0x25aa6a(0x9bf)](_0x240c37, _0x567b24, _0x5ae53f), _0x5ae53f += this[_0x25aa6a(0xf3c)](); } } else VisuMZ[_0x25aa6a(0xc9f)][_0x25aa6a(0xad7) + _0x25aa6a(0x283) + _0x25aa6a(0xad9)]['call'](this); }; }; VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xc36) + 'pSell_isEn' + 'abled'] = Window_ShopSell['prototype']['isEnabled'], Window_ShopSell[_0x3a6da1(0x49b)][_0x3a6da1(0xb71)] = function (_0x3f2073) { const _0x553cf7 = _0x3a6da1; return VisuMZ[_0x553cf7(0xc9f)][_0x553cf7(0x316)]['QoL'][_0x553cf7(0xe6f) + 'tect'] && DataManager['isKeyItem'](_0x3f2073) ? ![] : VisuMZ[_0x553cf7(0xc9f)][_0x553cf7(0xc36) + _0x553cf7(0x9e8) + 'abled'][_0x553cf7(0xedc)](this, _0x3f2073); }, Window_NumberInput[_0x3a6da1(0x49b)]['isUseModer' + _0x3a6da1(0x81f)] = function () { return ![]; }; VisuMZ[_0x3a6da1(0xc9f)]['Settings'][_0x3a6da1(0x988) + _0x3a6da1(0xd57)][_0x3a6da1(0x1001) + _0x3a6da1(0x526)] && (VisuMZ[_0x3a6da1(0xc9f)]['Window_Num' + _0x3a6da1(0x1074) + 'tart'] = Window_NumberInput[_0x3a6da1(0x49b)]['start'], Window_NumberInput[_0x3a6da1(0x49b)][_0x3a6da1(0x2b1)] = function () { const _0x2da8cd = _0x3a6da1, _0xfe539e = { 'pCSiY': function (_0x489164, _0x12db12) { return _0x489164 - _0x12db12; } }; VisuMZ[_0x2da8cd(0xc9f)]['Window_Num' + _0x2da8cd(0x1074) + _0x2da8cd(0x559)][_0x2da8cd(0xedc)](this), this['select'](_0xfe539e[_0x2da8cd(0x8b0)](this['_maxDigits'], 0x1893 + 0x5 * 0x446 + -0xf5 * 0x30)), Input[_0x2da8cd(0x7ee)](); }, VisuMZ['CoreEngine']['Window_Num' + _0x3a6da1(0x7fc) + 'rocessDigi' + _0x3a6da1(0x936)] = Window_NumberInput[_0x3a6da1(0x49b)]['processDig' + _0x3a6da1(0xa97)], Window_NumberInput[_0x3a6da1(0x49b)][_0x3a6da1(0x47a) + _0x3a6da1(0xa97)] = function () { const _0x24eada = _0x3a6da1, _0x4bea81 = { 'JGLpn': 'backspace', 'ffdFJ': function (_0x2d4abe, _0x6a264d) { return _0x2d4abe === _0x6a264d; }, 'gVSlQ': function (_0x1cbd35, _0x5611af) { return _0x1cbd35 === _0x5611af; } }; if (!this['isOpenAndA' + _0x24eada(0x3f2)]()) return; if (Input['isNumpadPr' + _0x24eada(0xb44)]()) this[_0x24eada(0xc17) + _0x24eada(0xfab) + 'Change'](); else { if (Input[_0x24eada(0xc44) + _0x24eada(0xe37)](_0x4bea81['JGLpn'])) this[_0x24eada(0xc17) + _0x24eada(0xa34) + _0x24eada(0xb56)](); else { if (_0x4bea81[_0x24eada(0xba0)](Input[_0x24eada(0x78a) + 'ialKeyCode'], 0xce * 0x14 + 0x50 * 0x63 + 0x3 * -0xf9e)) this['processKey' + _0x24eada(0x83a) + 'e'](); else { if (_0x4bea81[_0x24eada(0xc2f)](Input[_0x24eada(0x78a) + 'ialKeyCode'], -0xe7 * 0x15 + -0x11de * 0x1 + 0x24f5)) this[_0x24eada(0xc17) + 'boardHome'](); else _0x4bea81[_0x24eada(0xba0)](Input['_inputSpec' + _0x24eada(0xaea)], 0xc0d + 0x1433 + 0x201d * -0x1) ? this[_0x24eada(0xc17) + _0x24eada(0x5d7)]() : VisuMZ[_0x24eada(0xc9f)][_0x24eada(0x451) + _0x24eada(0x7fc) + _0x24eada(0x1095) + _0x24eada(0x936)][_0x24eada(0xedc)](this); } } } }, Window_NumberInput[_0x3a6da1(0x49b)]['processCur' + _0x3a6da1(0x469)] = function () { const _0x12e7bb = _0x3a6da1; if (!this[_0x12e7bb(0x964) + _0x12e7bb(0x27c)]()) return; Input[_0x12e7bb(0xbbd) + _0x12e7bb(0xb44)]() ? this[_0x12e7bb(0xc17) + _0x12e7bb(0xfab) + _0x12e7bb(0x103b)]() : Window_Selectable[_0x12e7bb(0x49b)][_0x12e7bb(0x7aa) + _0x12e7bb(0x469)][_0x12e7bb(0xedc)](this); }, Window_NumberInput['prototype'][_0x3a6da1(0x7aa) + _0x3a6da1(0xd00) + _0x3a6da1(0xcdf)] = function () { }, Window_NumberInput[_0x3a6da1(0x49b)][_0x3a6da1(0xc17) + _0x3a6da1(0xfab) + _0x3a6da1(0x103b)] = function () { const _0x3697e8 = _0x3a6da1, _0x4479ee = { 'HsHuB': function (_0x8b4f9, _0xedd796) { return _0x8b4f9 >= _0xedd796; }, 'Rjrse': function (_0x508958, _0x3900e3) { return _0x508958(_0x3900e3); }, 'hwvDm': function (_0x4ec370, _0x427813) { return _0x4ec370(_0x427813); }, 'Uqyst': function (_0xb41d42, _0x346f3d) { return _0xb41d42 + _0x346f3d; }, 'xjaCx': function (_0xcfa9e5, _0x14184a) { return _0xcfa9e5(_0x14184a); }, 'frzdk': function (_0x12ca08, _0x254f3d) { return _0x12ca08 - _0x254f3d; } }; if (_0x4479ee[_0x3697e8(0x5c7)](_0x4479ee['Rjrse'](String, this['_number'])['length'], this[_0x3697e8(0x86a)])) return; const _0x2ca326 = _0x4479ee[_0x3697e8(0x41e)](Number, _0x4479ee[_0x3697e8(0x6cb)](_0x4479ee[_0x3697e8(0x41e)](String, this['_number']), Input[_0x3697e8(0xb39) + 'ng'])); if (_0x4479ee['xjaCx'](isNaN, _0x2ca326)) return; this[_0x3697e8(0x318)] = _0x2ca326; const _0x57ab32 = '9'[_0x3697e8(0x692)](this['_maxDigits']); this[_0x3697e8(0x318)] = this[_0x3697e8(0x318)][_0x3697e8(0x759)](-0x3b6 + 0x3 * -0x31a + 0xd04 * 0x1, _0x57ab32), Input[_0x3697e8(0x7ee)](), this['refresh'](), SoundManager['playCursor'](), this[_0x3697e8(0x722)](_0x4479ee[_0x3697e8(0x3e8)](this['_maxDigits'], -0x704 + 0xb7 + -0x6 * -0x10d)); }, Window_NumberInput[_0x3a6da1(0x49b)]['processKey' + _0x3a6da1(0xa34) + 'pace'] = function () { const _0x1e8afa = _0x3a6da1, _0xa77305 = { 'tdAMm': _0x1e8afa(0xb25) + '1', 'eSSte': function (_0x1668d0, _0x1be7b8) { return _0x1668d0 - _0x1be7b8; }, 'GfHsQ': function (_0x4ef4b1, _0x59af21) { return _0x4ef4b1(_0x59af21); } }, _0x595b66 = _0xa77305[_0x1e8afa(0x71e)][_0x1e8afa(0x80d)]('|'); let _0xa27e21 = -0x68 * -0x3d + -0x259f + -0x1 * -0xcd7; while (!![]) { switch (_0x595b66[_0xa27e21++]) { case '0': Input[_0x1e8afa(0x7ee)](); continue; case '1': this['select'](_0xa77305[_0x1e8afa(0xca5)](this[_0x1e8afa(0x86a)], 0xfd1 + -0x4b9 * -0x1 + -0x1489)); continue; case '2': this['_number'] = _0xa77305[_0x1e8afa(0x902)](Number, _0xa77305['GfHsQ'](String, this[_0x1e8afa(0x318)])[_0x1e8afa(0x3a5)](0x2510 + 0x1147 + -0x3657, -(0x9a * 0x7 + 0x4 * 0x4e1 + 0x17b9 * -0x1))); continue; case '3': this[_0x1e8afa(0x6d0)](); continue; case '4': SoundManager[_0x1e8afa(0xb78)](); continue; case '5': this[_0x1e8afa(0x318)] = Math[_0x1e8afa(0xeb6)](0x175 * 0x7 + 0x4 * -0x632 + -0x1 * -0xe95, this[_0x1e8afa(0x318)]); continue; }break; } }, Window_NumberInput[_0x3a6da1(0x49b)][_0x3a6da1(0xc17) + _0x3a6da1(0x83a) + 'e'] = function () { const _0x595a89 = _0x3a6da1, _0x4e8bd6 = { 'oEylz': _0x595a89(0xd5d) + '1', 'ghRNW': function (_0x3cc5e8, _0x5c07ee) { return _0x3cc5e8(_0x5c07ee); }, 'wvTiO': function (_0x3b1350, _0x13bf15) { return _0x3b1350(_0x13bf15); }, 'awrHa': function (_0x33e54e, _0x2ad244) { return _0x33e54e - _0x2ad244; } }, _0x4cac1c = _0x4e8bd6[_0x595a89(0x518)]['split']('|'); let _0x3eb1d6 = -0xf3 + 0xd * -0x2bb + 0x2472; while (!![]) { switch (_0x4cac1c[_0x3eb1d6++]) { case '0': this[_0x595a89(0x318)] = _0x4e8bd6[_0x595a89(0xd30)](Number, _0x4e8bd6[_0x595a89(0xecb)](String, this[_0x595a89(0x318)])[_0x595a89(0x2f2)](-0x248f + 0x2063 + 0x1 * 0x42d)); continue; case '1': this['select'](_0x4e8bd6['awrHa'](this[_0x595a89(0x86a)], -0x1 * -0x9e3 + 0x147b + 0xa1f * -0x3)); continue; case '2': this[_0x595a89(0x318)] = Math[_0x595a89(0xeb6)](-0x862 + 0x19 * 0xb9 + -0x9af, this[_0x595a89(0x318)]); continue; case '3': SoundManager[_0x595a89(0xb78)](); continue; case '4': this[_0x595a89(0x6d0)](); continue; case '5': Input[_0x595a89(0x7ee)](); continue; }break; } }, Window_NumberInput[_0x3a6da1(0x49b)]['processKey' + _0x3a6da1(0xc18)] = function () { const _0x44bb02 = _0x3a6da1, _0x5097cc = { 'uXeaP': '3|1|4|2|0', 'ioAmv': function (_0x1e889d, _0x3848b4) { return _0x1e889d === _0x3848b4; } }, _0xe694c1 = _0x5097cc['uXeaP'][_0x44bb02(0x80d)]('|'); let _0x1d76a1 = -0x1ff7 + 0x16ad + 0x94a * 0x1; while (!![]) { switch (_0xe694c1[_0x1d76a1++]) { case '0': this[_0x44bb02(0x722)](0x964 + 0x26 * 0x8e + -0x1e78); continue; case '1': Input[_0x44bb02(0x7ee)](); continue; case '2': SoundManager[_0x44bb02(0xb78)](); continue; case '3': if (_0x5097cc[_0x44bb02(0x4ae)](this[_0x44bb02(0x9e2)](), 0x770 + 0x9a1 * -0x1 + 0x231)) return; continue; case '4': this[_0x44bb02(0x6d0)](); continue; }break; } }, Window_NumberInput[_0x3a6da1(0x49b)][_0x3a6da1(0xc17) + _0x3a6da1(0x5d7)] = function () { const _0x204e59 = _0x3a6da1, _0x395617 = { 'xXOQs': _0x204e59(0x4f2), 'ihpcu': function (_0x495284, _0x542142) { return _0x495284 - _0x542142; }, 'oftYz': function (_0x24904a, _0x28c7e) { return _0x24904a === _0x28c7e; } }, _0x13839f = _0x395617['xXOQs'][_0x204e59(0x80d)]('|'); let _0x1bdc2f = 0x1208 + 0x2338 + -0x20 * 0x1aa; while (!![]) { switch (_0x13839f[_0x1bdc2f++]) { case '0': Input[_0x204e59(0x7ee)](); continue; case '1': this[_0x204e59(0x722)](_0x395617['ihpcu'](this[_0x204e59(0x86a)], -0xc95 * -0x1 + -0x13c4 * -0x1 + -0x5 * 0x678)); continue; case '2': SoundManager[_0x204e59(0xb78)](); continue; case '3': this['refresh'](); continue; case '4': if (_0x395617['oftYz'](this[_0x204e59(0x9e2)](), _0x395617[_0x204e59(0x55b)](this[_0x204e59(0x86a)], 0x16b9 * 0x1 + -0x6a6 + 0xbb * -0x16))) return; continue; }break; } });; VisuMZ['CoreEngine'][_0x3a6da1(0xd1e) + _0x3a6da1(0xe17) + 'sh'] = Window_MapName[_0x3a6da1(0x49b)][_0x3a6da1(0x6d0)], Window_MapName[_0x3a6da1(0x49b)][_0x3a6da1(0x6d0)] = function () { const _0x56f876 = _0x3a6da1; VisuMZ[_0x56f876(0xc9f)][_0x56f876(0x316)][_0x56f876(0xfee)]['MapNameTex' + _0x56f876(0xb75)] ? this[_0x56f876(0x70e) + _0x56f876(0xffb) + _0x56f876(0xeb2)]() : VisuMZ['CoreEngine'][_0x56f876(0xd1e) + _0x56f876(0xe17) + 'sh'][_0x56f876(0xedc)](this); }, Window_MapName[_0x3a6da1(0x49b)][_0x3a6da1(0x70e) + _0x3a6da1(0xffb) + _0x3a6da1(0xeb2)] = function () { const _0x1669d1 = _0x3a6da1, _0x508797 = { 'vowlu': function (_0x56f37d, _0x1774cb) { return _0x56f37d / _0x1774cb; }, 'KknTf': function (_0x2943bd, _0x186424) { return _0x2943bd - _0x186424; } }; this[_0x1669d1(0xbb2)]['clear'](); if ($gameMap[_0x1669d1(0xe04) + 'e']()) { const _0xe70ea7 = this['innerWidth']; this[_0x1669d1(0xa96) + 'ound'](0x22fd + 0x1cb3 + -0x3fb0, 0xfa + 0x1 * 0x13cd + -0x14c7, _0xe70ea7, this['lineHeight']()); const _0x21de3d = this[_0x1669d1(0xf98)]($gameMap[_0x1669d1(0xe04) + 'e']())[_0x1669d1(0x4c0)]; this[_0x1669d1(0x9bf)]($gameMap[_0x1669d1(0xe04) + 'e'](), Math['floor'](_0x508797[_0x1669d1(0x40b)](_0x508797['KknTf'](_0xe70ea7, _0x21de3d), 0x6 * 0x568 + -0x4de + 0x48 * -0x62)), -0x1ff + -0x2214 + -0x5 * -0x737); } }, Window_TitleCommand[_0x3a6da1(0x7a4) + 'st'] = VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x316)][_0x3a6da1(0x4ca) + _0x3a6da1(0x9cb)], Window_TitleCommand[_0x3a6da1(0x49b)]['makeComman' + _0x3a6da1(0xd20)] = function () { const _0x1cd61b = _0x3a6da1; this[_0x1cd61b(0xa23) + _0x1cd61b(0x782) + _0x1cd61b(0xd20)](); }, Window_TitleCommand['prototype']['makeCoreEn' + _0x3a6da1(0x782) + _0x3a6da1(0xd20)] = function () { const _0xc6e9fc = _0x3a6da1, _0x56d5a3 = { 'GdVmw': _0xc6e9fc(0xe9a) }; for (const _0xf047fb of Window_TitleCommand[_0xc6e9fc(0x7a4) + 'st']) { if (_0xf047fb[_0xc6e9fc(0x539)][_0xc6e9fc(0xedc)](this)) { const _0x127b4e = _0xf047fb['Symbol']; let _0x3ef15f = _0xf047fb[_0xc6e9fc(0x74b)]; if (['', _0x56d5a3[_0xc6e9fc(0x732)]][_0xc6e9fc(0xa43)](_0x3ef15f)) _0x3ef15f = _0xf047fb[_0xc6e9fc(0x711)][_0xc6e9fc(0xedc)](this); const _0x45a75e = _0xf047fb[_0xc6e9fc(0xd61)][_0xc6e9fc(0xedc)](this), _0x3cabd4 = _0xf047fb[_0xc6e9fc(0xcac)][_0xc6e9fc(0xedc)](this); this[_0xc6e9fc(0x635)](_0x3ef15f, _0x127b4e, _0x45a75e, _0x3cabd4), this[_0xc6e9fc(0x4e1)](_0x127b4e, _0xf047fb['CallHandle' + 'rJS'][_0xc6e9fc(0xdeb)](this, _0x3cabd4)); } } }, VisuMZ['CoreEngine'][_0x3a6da1(0x44d) + _0x3a6da1(0x855) + 'selectLast'] = Window_TitleCommand['prototype']['selectLast'], Window_TitleCommand[_0x3a6da1(0x49b)]['selectLast'] = function () { const _0x540901 = _0x3a6da1, _0x59b3f7 = { 'vvILt': function (_0xf53a35, _0x534e76) { return _0xf53a35 - _0x534e76; }, 'skunr': function (_0x2c4500, _0x59b2dd) { return _0x2c4500 / _0x59b2dd; }, 'cIlrX': function (_0x5b1cd1, _0x461d10) { return _0x5b1cd1 > _0x461d10; } }; VisuMZ[_0x540901(0xc9f)]['Window_Tit' + _0x540901(0x855) + 'selectLast'][_0x540901(0xedc)](this); if (!Window_TitleCommand['_lastComma' + _0x540901(0x6e4)]) return; const _0x250d1d = this[_0x540901(0x7a2)](Window_TitleCommand['_lastComma' + _0x540901(0x6e4)]), _0x235fa9 = _0x59b3f7[_0x540901(0x54f)](Math[_0x540901(0x719)](_0x59b3f7[_0x540901(0x466)](this[_0x540901(0xce1) + _0x540901(0xf4f)](), -0x21e0 + 0x3 * 0x417 + 0xb * 0x1f7)), 0xc95 * 0x1 + 0x35 * -0x3 + 0xbf5 * -0x1); this['smoothSele' + 'ct'](_0x250d1d), _0x59b3f7[_0x540901(0x8da)](this[_0x540901(0x3ba) + 'ation'], 0xd1f + 0x1352 + -0x2070) && (this[_0x540901(0x3ba) + _0x540901(0xb37)] = -0x2f4 + -0x22b2 * -0x1 + -0x1fbd, this[_0x540901(0xd8f) + _0x540901(0x4a2)]()), this['setTopRow'](_0x59b3f7[_0x540901(0x54f)](_0x250d1d, _0x235fa9)); }, Window_GameEnd[_0x3a6da1(0x7a4) + 'st'] = VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x316)][_0x3a6da1(0x943)][_0x3a6da1(0x9d7)][_0x3a6da1(0x3da) + 't'], Window_GameEnd[_0x3a6da1(0x49b)][_0x3a6da1(0xb6f) + _0x3a6da1(0xd20)] = function () { const _0x236cc7 = _0x3a6da1; this[_0x236cc7(0xa23) + _0x236cc7(0x782) + 'dList'](); }, Window_GameEnd['prototype'][_0x3a6da1(0xa23) + 'gineComman' + _0x3a6da1(0xd20)] = function () { const _0x32cfb2 = _0x3a6da1, _0x1ed8df = { 'bbblK': _0x32cfb2(0xe9a) }; for (const _0x5271d4 of Window_GameEnd['_commandLi' + 'st']) { if (_0x5271d4[_0x32cfb2(0x539)][_0x32cfb2(0xedc)](this)) { const _0x28a4e2 = _0x5271d4['Symbol']; let _0x51710c = _0x5271d4[_0x32cfb2(0x74b)]; if (['', _0x1ed8df['bbblK']][_0x32cfb2(0xa43)](_0x51710c)) _0x51710c = _0x5271d4['TextJS'][_0x32cfb2(0xedc)](this); const _0x16c6ff = _0x5271d4['EnableJS']['call'](this), _0x3d59e7 = _0x5271d4['ExtJS']['call'](this); this[_0x32cfb2(0x635)](_0x51710c, _0x28a4e2, _0x16c6ff, _0x3d59e7), this['setHandler'](_0x28a4e2, _0x5271d4[_0x32cfb2(0xd9a) + _0x32cfb2(0xb2c)]['bind'](this, _0x3d59e7)); } } }; function Window_ButtonAssist() { this['initialize'](...arguments); } Window_ButtonAssist[_0x3a6da1(0x49b)] = Object['create'](Window_Base[_0x3a6da1(0x49b)]), Window_ButtonAssist[_0x3a6da1(0x49b)][_0x3a6da1(0x3b0) + 'r'] = Window_ButtonAssist, Window_ButtonAssist[_0x3a6da1(0x49b)][_0x3a6da1(0xa40)] = function (_0x4b2af5) { const _0x356473 = _0x3a6da1; this['_data'] = {}, Window_Base[_0x356473(0x49b)]['initialize'][_0x356473(0xedc)](this, _0x4b2af5), this[_0x356473(0x9ed) + _0x356473(0xed1)](VisuMZ[_0x356473(0xc9f)][_0x356473(0x316)][_0x356473(0xb8a) + 'st'][_0x356473(0x5d0)] || 0x166 + -0x1937 * -0x1 + -0x1a9d * 0x1), this[_0x356473(0x6d0)](); }, Window_ButtonAssist['prototype'][_0x3a6da1(0x3b4) + _0x3a6da1(0xcdd)] = function () { const _0x5cdbb2 = _0x3a6da1, _0x547e53 = { 'MlVtr': function (_0x33613c, _0x488988) { return _0x33613c <= _0x488988; } }; _0x547e53[_0x5cdbb2(0x2f7)](this[_0x5cdbb2(0xbb2)]['fontSize'], 0x264f + 0xd51 + -0x668 * 0x8) && (this[_0x5cdbb2(0xbb2)][_0x5cdbb2(0x541)] += -0x1ab1 + -0x1b7 * -0x11 + -0x270); }, Window_ButtonAssist[_0x3a6da1(0x49b)][_0x3a6da1(0xa14) + 'aller'] = function () { const _0x2ffc6f = _0x3a6da1, _0xbb87d8 = { 'HsJGn': function (_0x4eaa46, _0x4a7206) { return _0x4eaa46 >= _0x4a7206; } }; _0xbb87d8[_0x2ffc6f(0x1ff)](this['contents'][_0x2ffc6f(0x541)], 0x7f5 + -0x280 * -0x5 + 0x191 * -0xd) && (this[_0x2ffc6f(0xbb2)][_0x2ffc6f(0x541)] -= 0x12dd + 0x151b + 0x2 * -0x13f9); }, Window_ButtonAssist['prototype'][_0x3a6da1(0xc16)] = function () { const _0x32e694 = _0x3a6da1; Window_Base[_0x32e694(0x49b)][_0x32e694(0xc16)][_0x32e694(0xedc)](this), this[_0x32e694(0xb45) + 'ext'](); }, Window_ButtonAssist[_0x3a6da1(0x49b)]['updatePadd' + 'ing'] = function () { const _0x5808a3 = _0x3a6da1, _0x1e05cb = { 'qzBzC': function (_0x30711a, _0x1a912e) { return _0x30711a !== _0x1a912e; }, 'jgIuM': 'button' }; this[_0x5808a3(0xd07)] = _0x1e05cb['qzBzC'](SceneManager[_0x5808a3(0xda5)][_0x5808a3(0xed2) + _0x5808a3(0x1082) + 'ion'](), _0x1e05cb[_0x5808a3(0x8c6)]) ? -0x1378 + 0xb1 * -0xf + 0x1dd7 : 0x1 * 0x138e + -0xc40 + -0x746; }, Window_ButtonAssist[_0x3a6da1(0x49b)][_0x3a6da1(0xb45) + _0x3a6da1(0x450)] = function () { const _0x13ed77 = _0x3a6da1, _0xe187e = { 'nbmFE': function (_0x4588b9, _0x2f9e23) { return _0x4588b9 <= _0x2f9e23; }, 'jeaiG': function (_0x5a2313, _0x5b6b78) { return _0x5a2313 !== _0x5b6b78; }, 'XzsfI': _0x13ed77(0x308), 'Hyfei': _0x13ed77(0x647) + _0x13ed77(0x50b), 'muFgk': _0x13ed77(0xbeb), 'aYgBV': 'buttonAssi' + _0x13ed77(0xac6) }, _0x5936d1 = SceneManager['_scene']; for (let _0x294b5e = -0x634 + -0x2100 + 0x2735; _0xe187e[_0x13ed77(0x638)](_0x294b5e, 0x8 * -0x43 + 0x1 * 0x97 + -0x5 * -0x4e); _0x294b5e++) { if (_0xe187e['jeaiG'](this['_data'][_0xe187e[_0x13ed77(0x90a)][_0x13ed77(0xfc8)](_0x294b5e)], _0x5936d1[_0xe187e[_0x13ed77(0x339)][_0x13ed77(0xfc8)](_0x294b5e)]())) return this[_0x13ed77(0x6d0)](); if (_0xe187e[_0x13ed77(0x210)](this[_0x13ed77(0xb4b)][_0xe187e[_0x13ed77(0x78b)][_0x13ed77(0xfc8)](_0x294b5e)], _0x5936d1[_0xe187e[_0x13ed77(0x1ea)]['format'](_0x294b5e)]())) return this[_0x13ed77(0x6d0)](); } }, Window_ButtonAssist[_0x3a6da1(0x49b)][_0x3a6da1(0x6d0)] = function () { const _0x1f6dce = _0x3a6da1, _0x22545a = { 'cHcgi': function (_0x2c4726, _0x136fda) { return _0x2c4726 <= _0x136fda; } }; this[_0x1f6dce(0xbb2)]['clear'](); for (let _0x36921a = -0x1a35 + 0x179 * 0xf + 0x41f; _0x22545a[_0x1f6dce(0x107c)](_0x36921a, -0x1 * 0x4c6 + 0x1222 * -0x1 + 0x16ed); _0x36921a++) { this[_0x1f6dce(0xa2c) + 't'](_0x36921a); } }, Window_ButtonAssist[_0x3a6da1(0x49b)][_0x3a6da1(0xa2c) + 't'] = function (_0x4903ab) { const _0x1238ee = _0x3a6da1, _0x3f42ae = { 'hLIap': function (_0x2d2ea8, _0x463888) { return _0x2d2ea8 / _0x463888; }, 'vqMtn': 'buttonAssi' + 'stKey%1', 'LlXJF': 'buttonAssi' + 'stText%1', 'TfDbf': _0x1238ee(0x308), 'KvNYe': 'text%1', 'vnirz': function (_0xd2ba5e, _0x34efd3) { return _0xd2ba5e === _0x34efd3; }, 'Ouxfa': _0x1238ee(0x647) + 'stOffset%1', 'zdGil': function (_0x2a47d8, _0x47ac17) { return _0x2a47d8 + _0x47ac17; }, 'iZxKp': function (_0x5baadf, _0x50d5de) { return _0x5baadf * _0x50d5de; }, 'XBFdj': function (_0x2e308a, _0x201ab2) { return _0x2e308a - _0x201ab2; } }, _0x4a78f7 = _0x3f42ae[_0x1238ee(0x581)](this[_0x1238ee(0x9d5)], -0x5cb * 0x5 + 0x135d * 0x2 + -0x2b * 0x3a), _0x24fe7f = SceneManager[_0x1238ee(0xda5)], _0x1e8c71 = _0x24fe7f[_0x3f42ae[_0x1238ee(0xa09)][_0x1238ee(0xfc8)](_0x4903ab)](), _0x14faae = _0x24fe7f[_0x3f42ae['LlXJF'][_0x1238ee(0xfc8)](_0x4903ab)](); this['_data'][_0x3f42ae[_0x1238ee(0xd01)][_0x1238ee(0xfc8)](_0x4903ab)] = _0x1e8c71, this['_data'][_0x3f42ae[_0x1238ee(0x79a)]['format'](_0x4903ab)] = _0x14faae; if (_0x3f42ae['vnirz'](_0x1e8c71, '')) return; if (_0x3f42ae['vnirz'](_0x14faae, '')) return; const _0x494e55 = _0x24fe7f[_0x3f42ae[_0x1238ee(0x529)][_0x1238ee(0xfc8)](_0x4903ab)](), _0x4ad278 = this[_0x1238ee(0xa37) + 'g'](), _0x7f6fed = _0x3f42ae['zdGil'](_0x3f42ae[_0x1238ee(0xd06)](_0x3f42ae[_0x1238ee(0x24c)](_0x4a78f7, _0x3f42ae['XBFdj'](_0x4903ab, 0x76f + 0x182c + -0xfcd * 0x2)), _0x4ad278), _0x494e55), _0x5e3655 = VisuMZ['CoreEngine'][_0x1238ee(0x316)]['ButtonAssi' + 'st'][_0x1238ee(0x646)]; this[_0x1238ee(0x9bf)](_0x5e3655[_0x1238ee(0xfc8)](_0x1e8c71, _0x14faae), _0x7f6fed, 0x2 * 0xd85 + -0x1420 + -0x6ea, _0x3f42ae[_0x1238ee(0x4ef)](_0x4a78f7, _0x3f42ae['iZxKp'](_0x4ad278, 0x1ca5 + 0xc6f + -0x2912))); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xd97) + _0x3a6da1(0xbd0) + _0x3a6da1(0xb54) + 'e'] = Game_Interpreter[_0x3a6da1(0x49b)][_0x3a6da1(0xeff) + _0x3a6da1(0xe5c)], Game_Interpreter[_0x3a6da1(0x49b)][_0x3a6da1(0xeff) + _0x3a6da1(0xe5c)] = function () { const _0x1614bf = _0x3a6da1, _0x5917d0 = { 'PPQsM': function (_0x4f5edc, _0x49c18d) { return _0x4f5edc !== _0x49c18d; } }; if (_0x5917d0['PPQsM']($gameTemp[_0x1614bf(0xa77) + 'ordinatesM' + _0x1614bf(0xe37)], undefined)) return VisuMZ[_0x1614bf(0xc9f)][_0x1614bf(0x8dc) + _0x1614bf(0x582) + _0x1614bf(0xd72)](); return VisuMZ[_0x1614bf(0xc9f)][_0x1614bf(0xd97) + _0x1614bf(0xbd0) + 'ateWaitMod' + 'e'][_0x1614bf(0xedc)](this); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x8dc) + _0x3a6da1(0x582) + _0x3a6da1(0xd72)] = function () { const _0x45a826 = _0x3a6da1, _0xe440b3 = { 'aXfZC': function (_0x3f56a5, _0x5838b0) { return _0x3f56a5 < _0x5838b0; }, 'ZOChZ': function (_0x3fe7a1, _0x4ac262) { return _0x3fe7a1 > _0x4ac262; }, 'wRhPG': _0x45a826(0x558), 'IfCPI': function (_0x29cc7c, _0x436179) { return _0x29cc7c !== _0x436179; } }, _0x336cff = $gameTemp[_0x45a826(0xa77) + 'ordinatesM' + _0x45a826(0xe37)] || -0xd * -0x188 + -0x193c + 0x554 * 0x1; (_0xe440b3[_0x45a826(0x1078)](_0x336cff, 0x1d1a + -0x38b * 0xb + 0x9df) || _0xe440b3['ZOChZ'](_0x336cff, 0x1f88 + 0xcbc + -0x18 * 0x1d4) || TouchInput[_0x45a826(0xd13) + 'd']() || Input[_0x45a826(0xa5a) + 'd'](_0xe440b3['wRhPG'])) && ($gameTemp[_0x45a826(0xa77) + 'ordinatesM' + _0x45a826(0xe37)] = undefined, Input[_0x45a826(0x7ee)](), TouchInput[_0x45a826(0x7ee)]()); const _0x1421b4 = $gameScreen['picture'](_0x336cff); return _0x1421b4 && (_0x1421b4['_x'] = TouchInput['_x'], _0x1421b4['_y'] = TouchInput['_y']), VisuMZ['CoreEngine'][_0x45a826(0x2f5) + _0x45a826(0x582) + _0x45a826(0xd72)](), _0xe440b3[_0x45a826(0xc50)]($gameTemp['_pictureCo' + _0x45a826(0x8ac) + _0x45a826(0xe37)], undefined); }, VisuMZ['CoreEngine']['updatePict' + _0x3a6da1(0x582) + 'ates'] = function () { const _0x363126 = _0x3a6da1, _0x567c58 = { 'IWTni': function (_0x468c05, _0x437bb7) { return _0x468c05 === _0x437bb7; } }, _0x27eab0 = SceneManager[_0x363126(0xda5)]; if (!_0x27eab0) return; !_0x27eab0[_0x363126(0xa77) + 'ordinatesW' + _0x363126(0x1014)] && (SoundManager[_0x363126(0xec9)](), _0x27eab0['_pictureCo' + _0x363126(0xa01) + _0x363126(0x1014)] = new Window_PictureCoordinates(), _0x27eab0[_0x363126(0xc5e)](_0x27eab0['_pictureCo' + _0x363126(0xa01) + _0x363126(0x1014)])), _0x567c58[_0x363126(0xbda)]($gameTemp['_pictureCo' + 'ordinatesM' + _0x363126(0xe37)], undefined) && (SoundManager[_0x363126(0x72e)](), _0x27eab0[_0x363126(0xd47) + 'd'](_0x27eab0[_0x363126(0xa77) + 'ordinatesW' + _0x363126(0x1014)]), _0x27eab0['_pictureCo' + _0x363126(0xa01) + 'indow'] = undefined); }; function _0x1e0c() { const _0x5d5d91 = ['JkUoq', 'getControl', 'umentTitle', 'Opacity', '1960rHiuYp', 'isClosing', '_buyWindow', 'ARRAYFUNC', 'teIcon_upd', 'Actor-%1-%', 'loACV', 'indow', 'LevelUpFul', 'toString', 'fjTyi', 'Interprete', 'mESzY', 'iiTcg', 'YesNM', 'NUMPAD8', 'XbErz', 'ger_proces', 'hakeStyle', 'DOFSo', 'MAX_GL_TEX', 'crollLeft', 'scrollDown', 'indowPaddi', 'ity', 'wZZln', 'fKiAE', '2|4|3|0|1', 'efzNF', 'UkNrO', 'Fvqeo', 'ilize\x20a\x20On', 'tonLayout', '\x20Text〙\x0a', 'stKey2', 'VOLUME_UP', '_stored_cr', 'cIUzG', 'lLBsV', 'BTB', 'tesetFix', 'ValueJS', 'MGqAw', 'ier\x20number', 'ilBCx', 'menu', 'Change', 'KRJCa', 'pitch', 'gaugeBackC', 'openness', 'MRF', 'oint', 'tOWVL', 'KZMLv', 'pictureId', 'isSmartEve', 'eraCheck', 'actor', 'numberWind', 'wtypeId', 'Phzwv', 'Scene_Shop', 'tilesetFla', 'maxScrollX', 'KeySHIFT', 'faces', 'hideButton', 'isPointAni', 'RZPOL', 'KRQqN', 'PHA', 'maxLevel', 'XJmCR', 'skillTypeW', 'eofzk', 'ColorSyste', 'CancelButt', 'sin', 'GSyCU', 'ize', 'isPhysical', 'OpenURL', 'kyGiD', 'orOYH', 'MODECHANGE', 'BABBF', 'dropItems', 'tHtDe', 'paramRate2', '4|6|0|3|5|', 'createComm', 'Vytgt', 'kTWbm', 'isisColor', 'SystemSetW', 'VylTf', '1.3.0', 'random', 'IlLQO', 'lGame', 'erasePictu', 'LxSQH', 'berInput_s', 'Down', 'YlgEp', 'uGoKK', 'aXfZC', 'stKey4', 'orGauge', 'mBTB', 'cHcgi', 'GGvWx', 'ndWindow', 'GetParamIc', 'leOne', 'CommandRec', 'ssistLocat', 'aced\x20over\x20', 'FzViL', 'activate', 'zFEXW', 'platform', 'SystemSetS', 'Color2', 'gplAO', 'leX', 'AnimationC', 'move', 'ouping', '_setupEven', 'dXdpW', 'xWker', 'jljmX', 'pxVsf', 'tepsMinimu', 'rocessDigi', 'createPoin', '\x20into\x20the\x20', 'IlsMn', 'fHCDa', 'eFxSw', 'kvQgz', 'LbLgB', 'dTJjN', 'bXWfd', '_list', 'Version', 'ageLoad', '_cancelBut', 'drawNewPar', 'animationB', '}\x0a\x20\x20\x20\x20\x20\x20\x20\x20', 'EndingID', 'left', 'riority', 'onAssistWi', 'ntCollisio', 'mationPlay', 'gakkV', 'Scene_Map_', 'none', 'rBgek', 'epadState', 'eJKLr', 'FPbKX', 'uOdbO', 'etach', 'original', 'pkFVL', 'vOtIL', 'LlfcC', 'nQThy', 'IbtOC', 'stKey3', 'nUI', '_editWindo', 'aYgBV', 'applyCoreE', 'scaleX', 'checkScrol', 'JohkC', 'catchExcep', 'jTPcR', 'ZhIif', 'nLNOk', 'nUTRk', '_actorWind', 'vHCXH', 'mationMV_u', 'NycOH', 'getBackgro', 'IRRUx', 'maxGold', 'QmhSn', 'xkcJN', 'OUTSINE', 'NumberRect', 'HsJGn', 'members', 'targetY', 'nwTGR', 'getInputMu', 'ProfileRec', '0|7|8|5', 'JOoBB', 'gainSilent', 'viewport', '0|1|2|3|4', 'YkfPX', 'MAT', 'wIZbt', 'reduce', 'fasOH', 'CqdUd', 'jeaiG', 'l_create', 'ZWJlT', 'reserveNew', 'setHome', 'CkpIr', 'ColorCrisi', 'command357', 'TestF7', 'mCTB', 'eBgmVolume', '〖〖〖\x20Map\x20%1', '_active', 'eyInput', 'Page', 'PictureFil', 'n_numRepea', 'JLEDB', 'gkkWA', 'QZRMe', 'F13', 'SELECT', 'AnimationS', 'lId', 'URL', '〘Show\x20Text', 'pageup', 'preter_com', 'NTEGER', 'targets', '_terminate', 'VERSION(%1', 'mainAreaHe', '_shakeDura', 'Chance', 'sorUp', 'tetags', 'axes', 'ified', 'HelpBgType', 'pritesetFi', 'preter_Plu', 'hingEnable', 'buLFl', 'ntrols', 'drawAllPar', 'GoldFontSi', 'UakBD', 'priteset', 'xparam', 'auxAnimati', 'tleSystem', 'DDRnU', 'TEJzH', 'itemSucces', 'MINUS', 'ExportCurM', 'siwZp', 'agesCoreEn', 'STRUCT', 'iZxKp', 'getCombine', 'hgJdl', 'abs', 'image-rend', 'in\x20%1\x20ms(s', 'ernalTextu', 'opView', 'JxDqN', 'rpNGw', 'LvExpGauge', 'Game_Event', 'ildjY', 'dRuXU', 'ler', 'ton_initia', 'Window_ref', 'l\x20Branch\x20S', 'WrsGQ', 'icYNY', 'numActions', 'wsPSR', 'VPUwP', 'KdoWa', 'KBSSr', '_battleFie', 'terminate', 'map', 'changeText', 'PLUS', 'RWqSk', 'VAhoM', 'rGCLE', 'eButtons', 'sEscape', 'RTgVP', 'FDuef', 'dMswv', 'Tilemap_ad', 'nlzWr', 'mhovL', 'layoutSett', 'ItemHeight', 'arRect', 'checkSubst', 'uRegR', 'eJJSd', 'ParseWeapo', 'vable', 'djirg', 'sellWindow', 'CRI', '_commandWi', 'resetBattl', '0|1|3|2|4', 'eInput_ref', 'mahPc', 'onDatabase', '_troopId', 'expParams', '2|3', 'fItDW', 'Gauge2', 'MDF', 'acter', 'TskCv', '_closing', '1|4|0|5|6|', '_coreEngin', 'Base_mainA', '_storedMap', 'LGLIq', 'VisuMZ\x20Cor', 'requestFau', 'tionCoreEn', 'otetags', 'WIN_OEM_RE', 'onButtonIm', 'anglePlus', '_movementD', 'process_Vi', 'Bitmap_blt', 'erty', 'setAttack', 'xWwqU', '\x20onto\x20this', 'taFromPlug', 'powerDownC', 'WIN_OEM_JU', 'aSlfj', 'DETACH_PIC', '_stored_mp', 'Rate1', 'scrollRigh', 'ZKbqS', 'y\x20Page\x22\x20fr', 'OfSceneMap', 'OCaCG', 'measureTex', 'STENCIL_BU', '_allTextHe', 'start', 'horizontal', 'BEAKR', 'eCoreEngin', 'style', 'WIN_OEM_CL', 'raslJ', 'mute', 'fNpnH', 'eact', 'DNLPz', 'oEsCQ', 'Back', 'INOUTQUAD', 'Name', 're_calcEas', 'apText', 'showPointA', 'updateScro', 'targetOpac', 'lution', 'fApgj', 'Input_setu', 'seAll', 'skingEnabl', 'Color', 'AudioChang', '_pagedownB', 'zrIkN', 'ConvertPar', 'playtestQu', 'setSkill', 'cmckp', 'dwIVh', 'updateDura', 'AXagf', 'LqESs', 'trim', 'on\x20does\x20no', 'IAL', 'DimColor2', '_displayY', 'ProfileBgT', '%1:\x20%2,\x20Pa', 'boxHeight', 'reshBack', 'iftR', 'BannedWord', 'ElaKi', '_updateDoc', 'command105', 'yScrollLin', 'usData', 'ItemStyle', 'ge1', 'ShowButton', '《《《\x20Page\x20%', '_refreshBa', 'TKzid', 'ttonLayout', 'rollerID', 'createCanc', 'Targets', 'PictureSho', 'FhImg', 'substring', 'JgOrr', 'setSize', 'updatePict', 'open', 'MlVtr', '_consumeIt', 'BUdUh', 'mallest\x20to', 'XParameter', 'Basic', 'elButton', 'flush', '_startNorm', 'tchMode', 'TURE_CONTA', 'or1', 'isOpenAndA', 'isNwjs', 'X:\x20%1', 'er_exit', 'TextPopupS', 'key%1', 'createCust', 'imageSmoot', 'smoothSele', '_dummyWind', 'entsOpacit', 'ParseSkill', 'Shake', 'bkMtq', 'nAdRP', 'itemHitImp', 'Game_Party', 'teset_deta', 'xjrdy', 'Settings', 'fEPJO', '_number', '6830nFPziO', 'WIN_OEM_AU', 'cessHandli', 'NnmcO', 'dowskin', 'showFauxAn', 'itemRect', 'Gold', 'SkillMenu', 'mVrRc', 'Base_helpA', 'exUBM', 'ojHnH', 'PyiHA', 'removePoin', 'ollBarBitm', 'INOUTQUART', '_anglePlus', 'Height', 'wFHkP', 'stOffset3', '_originalV', 'HEDCS', '_drawTextB', 'DZkOl', 'zkTVC', 'backOpacit', 'drawGauge', 'AdjustAngl', 'jKKXT', 'Window_Scr', '<%1\x20%2:[\x20]', 'Hyfei', 'foquJ', 'owHLK', 'resize', 'nEKtG', 'QJZXT', 'isAlive', 'pCbQb', 'sKZhx', 'overallWid', 'ARRAYSTRUC', 'BkgHC', 'INBACK', 'BlurFilter', 'isPressed', 'Yqwkt', 'eBhmi', 'GbKmP', 'targetEvaR', 'rbOBp', 'AarIr', '2558MVjRSI', 'goldWindow', 'RnRMJ', 'lastAnimat', 'createAnim', 'MikPM', 'getPointAn', 'oupingEx', 'tons', 'scale', 'allel', 'forceOutOf', 'rxYny', 'JMckM', 'phqIQ', 'parse', 'allowShift', 'isItemStyl', 'nJRFD', 'DtrRT', 'Quantity', 'Sprite_Bat', 'ParseAllNo', 'vertJS', 'jifHY', 'SaAfc', 'buyWindowR', 'HASH', 'LafoV', 'zHXoG', 'utyPG', 'isScrollBa', 'QQRju', 'ZSDDV', 'gineScreen', 'MDR', 'lBarBitmap', 'jADRj', 'aqieZ', 'PRESERVCON', 'createPage', 'isTpb', 'ingDamageS', 'holeDurati', '〘Common\x20Ev', 'er_loadWin', 'PmpKn', '_phase', 'jiLyE', 'SettingsCo', 'sLZXL', 'cwolk', 'XcqNy', 'puwhL', '_digitGrou', 'rOusA', 'isPlaytest', 'AntiZoomPi', 'Enemies', '_stored_ga', 'animationI', 'onSpriteTo', 'clearOnceP', 'onClick', 'EnableName', '_currentBg', '_scaleY', 'battleback', 'bgmVolume', 'eJsdO', '4|3|2|0|1', 'value', 'xBRda', 'nNotetags', 'gineShakeH', '_listWindo', 'CLEAR', 'astMode', 'yTest', 'MinDuratio', 'isBottomBu', 'updateScen', 'retchMode', 'cliyG', 'jLksO', 'yBtOS', 'paramMaxJS', 'slice', 'RDRSp', 'lSqvM', 'fadeSpeed', 'xviYw', 'wJKnT', 'zJyQS', 'events', 'Block', 'rollerButt', 'rallelInte', 'constructo', '1|3|7', 'ShowActorL', 'Pos', 'makeFontBi', 'FontSize', 'paintOpaci', 'retreat', '_srcBitmap', 'wOvdS', '_scrollDur', 'BgBwe', 'CLOSE_CURL', 'mAbb', 'ColorExpGa', '162jWdjKs', 'fXBKo', 'Bitmap_cle', 'FadeSpeed', '_drawTextO', 'setupBattl', 'EnableMask', 'PRINTSCREE', 'EKrdn', 'kseer', '_viewportS', 'raCheckDat', 'awActorSim', 'oXUfL', 'ols', 'ies', 'om\x20another', 'xYtXW', 'SRC_ALPHA', 'XHsRV', 'XhNPO', '_drawTextS', 'MenuBg', 'lTiming', 'VDsrw', '_baseSprit', 'SZFfm', 'CommandLis', 'msWindowRe', 'characters', 'ripfR', 'windowRect', 'coreEngine', 'cts', 'traitsPi', 'eCommand', 'eTextColor', 'Sprite_Sta', 'leRange', 'maxCols', 'filter', 'frzdk', 'RMJRR', 'okHfp', 'useDigitGr', 'PTB', '_muteSound', 'cCjHb', 'Window', 'OUTQUART', 'r_render', 'ctive', 'getGamepad', 'Enemy-%1-%', 'Sound', 'getLevel', 'sorDown', 'sorRight', '1|7|3|2|5', 'Origin', 'Weapon-%1-', 'isKeyItem', 'framesMin', 'ollable_up', 'nZdmX', 'drawCharac', 'JsiHz', 'eOrigin', 'DummyBgTyp', 'dFFRj', 'rdCFt', 'ssMoveComm', 'onSideButt', 'ionSprite', 'LKFfq', 'FromView', 'vowlu', 'isForFrien', 'ExtractStr', 'isMaskingE', 'uHSRQ', 'removeAnim', 'bmjlm', 'tsbal', 'eYpMd', 'qboAI', 'processTou', 'Sprite_Pic', 'pages', 'setupFont', 'leteTilese', 'setLastPlu', 'onEscapeSu', 'ZAByN', 'Window_Gol', 'hwvDm', 'ndow', 'yTestNewGa', 'lfnPd', 'currentLev', 'performMis', 'gJriV', 'oFxjO', 'e_initiali', 'onLayout', 'xtState', 'TPDrH', 'dfJDh', '{\x0a\x20\x20\x20\x20\x20\x20\x20\x20', 'SVvyQ', 'CkgxF', 'wYKLp', 'systemColo', 'alpha', 'thickness', 'apply', 'KNRWb', 'BhsrE', 'AccuracyBo', 'lzzij', 'Game_Actio', 'GroupDigit', 'reservePla', 'erBase_ini', 'traitObjec', 'IBEqU', 'aGndP', 'xparamFlat', 'isBusy', 'item', 'AutoScroll', 'operation', 'Plus1', 'reaTop', '0.00', 'updateMain', 'updateText', 'qFEyk', 'FBqsY', 'WgUeb', '\x20finish\x20in', 'MPOrH', 'Window_Tit', 'getKeyboar', 'ping', 'ext', 'Window_Num', 'wTguA', '_mp', 'smQrb', 'eTransitio', 'SHwYD', '228848cIUwUu', 'Gamepads', 'DrawItemBa', 'animations', 'setupRate', 'ymwfY', 're_scaleX', 'rsorDown', 'bKiPy', 'stKey5', 'ExportAllM', '\x20Text\x20oper', '%1%2', '_actor', 'rols', 'skunr', '_profileWi', 'eCancelBut', 'sorMove', 'drawText', 'NEAREST', 'pictures', 'bxGrN', 'WAMbS', 'mType', 'Umiqs', 'THCLi', 'iDMLk', 'DetachMapP', 'uDYgO', 'wText', 'checkPlaye', 'deLRH', 'ParseState', '_buttonAss', 'processDig', 'offOpacity', 'oned', 'Wait', 'type', 'CRSEL', 'hfDhI', 'createEnem', 'OkText', 'JMfNI', 'titles1', 'drawGameTi', 'jNMej', 'MvAnimatio', 'isGamepadA', 'BJCWJ', 'round', 'Biwoq', 'NPpPE', 'profileWin', 'jNDKI', 'DbPWu', 'DtOkS', 'GoldIcon', 'brrRM', 'ZpsLS', 'close', 'Button', 'Scene_Opti', 'wyyAU', 'SWnqB', '_loadSyste', 'QuRwY', 'prototype', 'arePageBut', 'n_initiali', 'Nghyf', 'toFixed', 'xparamPlus', 'ssed', 'thScroll', 'F7key', 'MAXMP', 'onInputOk', 'vhLPx', 'isOpen', 'onload', 'playBgs', 'StatusBgTy', 'FINAL', 'rite', 'startAnima', 'ioAmv', 'PxQrt', 'Scene_Menu', 'tect', 'ternalText', 'or2', 'or_setActo', 'loadBitmap', 'ohJFU', 'NUMPAD6', 'centerSpri', 'LXPUi', 'enemies', 'qLaQw', 'itypeId', 'terArea', 'Urvjp', 'Count', 'width', '_cacheScal', '_onDatabas', 'isGamepadC', 'FunctionNa', 'oLQAY', '_stored_hp', 'integer', 'tpColor', 're_show', 'TitleComma', 'fjpdj', 'FtrzD', 'powerUpCol', 'learnings', '%1\x20is\x20inco', 'ight', 'dSprite', 'adding', 'attleSyste', 'ing', 'advanced', 'removeOnce', 'mQQpW', 'NewGameCom', 'iZZQm', 'ateMinimum', 'Scene_Equi', 'moveRelati', 'reserveCom', 'ItUFg', 'meVolume', 'angle', 'setHandler', 'updatePlay', 'XLqll', 'setValue', 'IOwwB', 'BoxMargin', 'd_refresh', 'sing', 'Enemy', 'origin', 'hlWGV', 'learBugFix', 'jmfsU', 'thFix', 'XBFdj', 'PRQEI', 'destroyCor', '4|0|3|2|1', 'applyEasin', 'REC', 'version', 'zjoKu', 'swqAQ', 'stOk', 'MULTIPLY', 'BZOmK', 'gNUcR', 'ape', 'makeDeepCo', 'updatePoin', 'awBackgrou', 'levelUpRec', 'bgsVolume', 'ost', 'keyboard', 'FPwsQ', 'DTB', 'fDCfD', 'peZPU', 'Enable', 'createCont', 'TargetAngl', 'stKey%1', 'bUxDI', 'romAllTroo', 'eAVaM', 'PageChange', 'BTestItems', 'EsRXt', 'level', 'aysEscape', 'AGI', 'createBack', 'UYdOi', 'catch\x20(e)\x20', 'oEylz', 'tpGaugeCol', 'p_create', '_lastOrigi', 'mainFontSi', 'wsyzF', 'KEviu', 'PICvA', 'drawParamN', 'ENAUL', 'Cxkbl', 'fAMxn', 'hQJOY', 'Flat1', 'erInput', 'volume', 'mand111', 'Ouxfa', 'transform', 'KTcOZ', 'ZhwRg', 'Easing', 'maxHorz', 'eight', 'dKRAb', 'FFER_BIT', 'ayoutValid', 'ibDzn', 'rVisible', 'DYWzf', 'allelInter', 'duuhh', 'BarOffset', 'ShowJS', 'FuSKW', 'blt', 'up2', '_inputWind', '_repositio', 'DefaultMod', 'tLtfF', 'fontSize', 'xMtlv', 'kylsS', 'Control\x20Va', 'fromCharCo', 'retrieveFa', 'WKTkk', 'dWithEvent', 'ateEnemies', 'Sprite', '_scrollBar', 'lor1', 'onKeyDownK', 'rmfXE', 'vvILt', '%1:\x20Exit\x20', 'WPkcd', 'dBitmap', 'llBarSprit', 'pKNEr', 'rovedAccur', '0|2|1|4|3', 'bVXOz', 'cancel', 'tart', 'krqFJ', 'ihpcu', 'mryAU', '\x0a\x0a\x0a\x0a\x0a', 'HENgS', 'ShiftT_Tog', 'LockY', 'processHan', 'cos', '_pointAnim', 'ipt\x20〗〗〗\x0a\x0a', 'imings', 'updateLast', 'commandWin', 'SLEEP', 'popScene', 'GmpYG', 'tate', 'tion', 'DataManage', 'tGroupingE', 'IWGki', 'PEPuM', 'RtNHU', 'send', 'ngine', 'roopString', 'InputRect', 'Smooth', 'mREne', 'MyhcS', 'opacity', 'EditRect', 'titles2', 'F18', 'IconParam3', 'redraw', 'rocessTimi', 'Mute', 'hLIap', 'ureCoordin', 'INOUTELAST', 'calcCoreEa', 'tFHSn', 'addWindow', 'stText1', 'disable', 'WmIJM', 'xLvGaugeCo', 'gdsCN', 'exp', 'normal', 'writeText', 'LkBJq', 'fHOpr', 'ugeBackCol', 'Center', 'processSou', 'JPokc', 'EREOF', '_refreshPa', 'aTKiD', 'JhNeZ', '_hovered', 'vhibB', 'SwitchTogg', 'charCode', 'mImages', 'data/', 'MBoVN', 'Game_Battl', 'ShowScroll', 'cWtjt', 'ERSION', 'targetX', 'GoHGO', '_targetSca', 'PvkaY', 'isQCe', 'XGWBU', 'ineUpdateW', 'weXmr', 'ScreenReso', 'ents', 'dInputButt', 'rHome', 'setClickHa', '0|1|2|4|3', 'stTarget', 'INQUART', 'recoverAll', 'ocessTouch', 'Bar', 'KjBwV', 'LkSyn', 'Map%1.json', 'gineShakeV', 'vfKBd', 'oIQJD', 'log(e);\x0a\x20\x20', 'efaultStre', 'MSMMB', 'colSpacing', 'dowRect', 'XFRPP', 'ButtonLayo', 'ePageButto', 'nLayout', 'XeVSC', 'HsHuB', 'setEvent', 'gaugeLineH', 'WUrnj', 'pPcpP', 'VXmjy', 'show', 'GoldMax', 'NUMPAD2', 'BgType', 'xFiAz', 'DOWN', 'wait', 'ystem', 'processFau', 'VEYOr', 'boardEnd', 'TVNHQ', 'framesMax', 'processBac', 'offsetY', 'oUAON', 'StatusPara', 'NJNfw', '《《《\x20Event\x20', '0|5|2|6|8|', 'inBattle', '1\x20has\x20alre', 'ackgroundS', 'terpreters', '([\x5c+\x5c-]\x5cd+', '3|0|1|2|4', 'optionsWin', 'NUVjW', 'JqubV', 'orDBZ', 'kionY', 'LrApJ', 'tusBase_dr', 'llBarPosit', 'Graphics_c', 'rlCWJ', 'INeIa', 'LRGnh', 'setColorTo', 'ge_current', 'dZIqx', '\x20\x20}\x0a\x20\x20\x20\x20', 'exportAllT', 'VisuMZ_4_U', 'numRepeats', 'erpreters', 'eration\x20wi', 'ntTitle', 'blockWidth', 'TlLut', 'YrygN', 'AllTroops', 'MfSFh', 'xpGauge', 'CollisionP', '_rate', 'tyVuL', 'isMapScrol', 'BEqXJ', 'crollRight', 'UtsAn', 'WIN_OEM_CU', 'Matches', 'WIN_OEM_WS', 'applyForce', 'Scene_Game', 'paramY', 'startShake', 'alphabetic', 'riables\x20Sc', 'PteoY', 'ColorDeath', 'playTestF6', 'lVfxM', 'e_drawFace', 'ngine_Note', 'xdg-open', 'initCoreEa', 'ernControl', 'restore', 'VisuMZ_2_B', '_colorCach', 'Show\x20Scrol', 'nvas', 'CTeFV', 'gainGold', 'eEngine\x20Pi', 'Scene_Skil', 'XgAFo', 'setSideVie', 'Window_Sel', 'KYXdK', 'isLoopHori', 'vDoNT', 'PhPxQ', 'ParseItemN', 'PMZio', 'RjEpn', '_stored_po', 'e\x20Plugin\x20M', 'paramName', 'FUNC', 'tle', 'drawActorS', 'addCommand', 'paramFlatJ', '_pollGamep', 'nbmFE', 'object', 'ColorTPGau', '_timeDurat', 'er_onKeyDo', 'list', 'ptionsCore', 'okeRect', '_centerEle', 'LpEDp', 'hCEdP', 'lers', 'eShakeStyl', 'loadMapDat', 'TextFmt', 'buttonAssi', 'mirror', '_forcedBat', 'ist.\x0aIt\x20is', 'tScene', 'isFauxAnim', '7|1|4|3', 'sRate', 'SmartEvent', 'playEscape', 'tYQxB', 'setupButto', 'erCWN', 'initialBat', 'ItemBgType', 'strokeRect', 'cZDJv', 'ShowDevToo', 'RUDue', 'pressed', 'shake', 'ndler', 'bitmapHeig', 'OyVTs', 'buttonArea', 'movePageBu', 'TFkBu', 'xcwcS', 'bAqoE', 'Requests', 're_updateR', 'Scene_Name', 'mKlWX', 'leset\x20has\x20', 'Nhwef', 'gDQTS', 'ParallelIn', '》Comment《\x0a', 'addOncePar', 'updateOrig', 'goto', 'Bitmap', 'text', '_realScale', 'wcomi', 'BaUfY', 'FDMmU', 'hETDB', 'ment', 'addAnimati', 'sJUZr', 'ventChainR', 'lOXdN', 'status', 'ADD', 'ONE', '$dataMap', 'MainMenu', 'switchMode', 'mUvFO', ')([%％])>', 'addLoadLis', 'itmap', 'createScro', 'ybVFT', 'izuEM', 're_scaleY', 'deRect', 'TJeET', 'overrideMi', 'nJdbd', 'Zibil', '_paramPlus', 'YFqxM', 'itemHeight', 'repeat', 'FcYMo', 'Input', '_screenX', 'pAligned', 'updateMove', 'isUseModer', 'ParseArmor', 'ingGaugeSp', 'tgpKk', 'wtZDi', 'parameters', 'Plus', 'er_isGameA', 'createText', 'arse', 'erSprite', 'utline', 'hZxTB', 'Bitmap_ini', 'NPZBi', 'mhPvG', 'AhqeV', 'BlurStreng', 'OutsideMai', 'pEUtX', 'iasBW', 'Param', 'createTroo', 'n_itemHit', '_logWindow', 'executeLoa', 'SLASH', 'ltiButtonS', 'AnimationM', '6|9|0|8|4|', 'HiRNI', 'PJDqT', 'tHandlers', 'MAXHP', 'tePosition', 'jnBEe', 'maxTp', '4|2|0|3|1', 'active', 'Fxmnr', 'ZpxhS', 'PictureID', 'nbfVq', 'ShiftR_Tog', 'setLastGam', 'pJlaX', 'yEzIA', 'ncdAJ', '_textQueue', 're_initRot', 'IconSParam', 'Uqyst', 'WGHqv', 'Scene_Batt', 'resetFontS', 'nTFZp', 'refresh', 'SystemSetB', 'XmiDm', 'ubstitute', 'ParseEnemy', 'centerCame', 'HELP', 'originalJS', 'asin', 'dientFillR', 'InputBgTyp', 'rrored', 'rEffects', 'IyjUx', 'atypeId', 'showIncomp', '3|2|1|0|4', 'KVjUh', 'DNhZr', '2|4|0|3|1', 'ndSymbol', 'form', 'Game_Troop', '_startDecr', 'kHGLn', 'MArjV', 'Scene_Base', 'qOLQy', 'paramWidth', 'needsUpdat', 'e_drawChar', 'r_param', '_moveEasin', 'reposition', 'ngOkQ', 'centerX', 'valueOutli', 'rYMWj', 'VQIIK', 'BIhJx', 'code', 'xoCrs', 'SsEPK', 'e_update', 'TextCodeNi', 'checkCache', 'wEqPS', 'Input_poll', 'rukzi', '_offsetY', 'ate', 'ForceNoPla', 'Input_upda', 'QUJSp', 'startAutoN', 'mationMV_p', 'pPrDc', 'apStrings', '2|1', '_destroyCa', 'n/json', 'emStyle', 'refreshWit', 'BgFilename', 'Abbreviati', 'TextJS', 'ore!', 'ipWindow', 'registerCo', 'cter_proce', 'createFaux', 'ettings', 'msduG', 'floor', 'tUeqa', 'QwertyLayo', 'riggered', 'ipItem_isE', 'tdAMm', 'CCMkI', 'sqzMh', 'drawValue', 'select', 'INSINE', 'ightSideBu', 'evel', '_displayX', 'drawFace', 'pCaIe', 'boveLevel9', 'lLinked', '_stored_sy', 'clearForce', 'evade', 'playCancel', 'OUTELASTIC', 'oJUle', 'EcDJz', 'GdVmw', 'Icon', 'gineShakeO', 'printError', 'WIN_ICO_HE', 'arameters', 'andWindow', 'kUilE', 'mFTB', 'loadPictur', 'Hidden', 'mPTB', 'Spriteset_', 'eInput_ini', 'jWbGo', 'mOTB', 'QVRIZ', 'Flat2', 'sureTextWi', 'oYHyV', 'stemColor', 'ton', '_targetX', 'ButtonHeig', 'dimColor2', 'TextStr', 'ePosition', 'dThAR', 'cZcmO', 'DisplayedP', 'statusEqui', 'Move', 'ctures', '_stored_ma', 'categoryWi', 'diLqg', 'NDTsS', '_skillType', 'paramX', 'clamp', 'zjghl', 'ntAnimatio', '_statusWin', 'KMEuc', 'KEEP', 'TMCiW', 'GoldChange', 'endAnimati', 'Input_clea', 'PDR', 'GkGjC', 'mand122', 'GRD', 'Joztt', 'BjBBI', 'IFUyX', 'romAllMaps', 'ARK', 'etNotetags', '_commonEve', 'CTRL', 'terms', '_iconIndex', 'ateBy', 'embers', 'JUNJA', 'WmCxB', 'Key%1', 'ody', 'BarBodyCol', 'LESS_THAN', 'toLocaleSt', 'ApplyEasin', 'ZOOM', 'Total', 'xJZWl', 'targetBack', 'mNzsa', 'BTestWeapo', 'ility', 'gineComman', '_mainSprit', 'waiting', 'eHMnw', 'length', 'EXeQv', 'RevertPres', 'enemy', '_inputSpec', 'muFgk', 'tileWidth', 'STENCIL_TE', 'zfspc', 'reorder\x20th', 'xaKyM', 'Xeofp', '【%1】\x0a', 'CVRvd', 'ExportAllT', 'PositionX', 'name', 'Upper\x20Left', 'ALT', 'EAR', 'KvNYe', 'parseForce', '_image', 'return\x200', 'Title', 'owLayer', 'athColor', 'fillText', 'findSymbol', 'Class-%1-%', '_commandLi', 'onString', 'getCustomB', '_shakeSpee', 'match', '_levelUp', 'processCur', 'wnError', 'markCoreEn', 'addQueue', 'stText3', 'MultiKeyFm', 'cVbRN', 'helpAreaHe', 'cUnIS', 'jCbjj', 'CommandWid', 'stWindowSi', 'xDNLU', 'Hrsyn', 'JxlKG', 'skills', '_centerCam', 'cessTouch', 'sv_enemies', 'cmmGc', 'keyRepeatW', 'jaehY', 'JtKsr', 'VUhYy', 'PRINT', 'ColorHPGau', 'rzEWz', 'WithEvents', 'removeFaux', 'setDisplay', '_updateGam', 'TAjzj', 'tDekD', 'qrnbH', 'mLQsl', 'ttonMatch', 'wQcvM', '_lastX', 'zaasc', 'ntents', 'fytnm', 'aHRnR', 'unding', 'BRfii', 'IJdPM', 'Base_initi', 'dWords', 'IconParam4', 'GoldOverla', 'QJOMn', 'mentCoreEn', 'targetScal', 'setAnchor', 'ointAnimat', 'MoRoh', 'DEF', 'GiMyd', 'Game_Syste', 'gradientFi', 'eEngineMar', 'ent\x20%1:\x20%2', 'remove', '1|5|4|3|2|', 'mand105', 'ginCommand', 'lass', '\x20one.', '_subject', 'clear', 'sqrt', 'App', '(\x5cd+)>', 'MEV', '_height', 'jwXJr', 'enable', 'arallelInt', 'useFontWid', 'QazDK', 'IsMBK', 'dow', 'ndImages', 'berInput_p', '_saveFileI', 'ActorHPCol', 'OutlineCol', 'ENTER', 'RequireFoc', 'maxScrollb', 'IyKxA', 'ujePf', 'CcCwo', 'SnapshotOp', 'CancelText', 'State', 'ger_checkS', 'clearCache', 'CommonEven', 'seRange', 'split', 'RyzJQ', 'OptionsMen', 'join', 'enableDigi', 'leLoadTran', 'OffBarOpac', '\x20pages', 'PZJzb', 'ttonString', 'le_update', 'OPEN_CURLY', 'SdvLu', 'createChil', 'olor', 'mSTB', 'op\x20Text\x20op', 'ngine_jsQu', 'nControls', 'fQAap', 'oREfL', 'UNDERSCORE', 'cnLxg', 'odJJh', 'picture', 'omParamete', 'actorWindo', '_bgsBuffer', '_playtestF', 'tilesets', 'cQUGu', 'Keyboard', 'ExportStrF', 'CAPSLOCK', 'FfwHo', 'HRG', 'huuvS', 'bgs', 'ONE_MINUS_', 'Key', 'AOKSI', 'guardSkill', 'isMenuButt', 'dNlBn', 'crollDown', 'boardDelet', 'Container', 're_y', 'isPlaying', 'pdAIl', 'setAction', 'BaseTextur', 'aBopy', 'command122', 're_angle', 'JSfcW', 'TitlePicBu', 'XzHUW', 'hhGhv', 'Animation', 'qUdWv', 'isExpGauge', '_changeCla', '4|1|3', 'Text', 'ATK', 'SCALE_MODE', 'ckXwX', '_battlerNa', 'ByName', 'pictureBut', 'clearRect', 'leCommand_', 'Bitmap_res', 'updateAngl', 'JgdqN', 'ybrOf', 'stretch', 'isFullDocu', 'onMoveEnd', 'n_updateLa', '_coreEasin', 'itemHit', 'WLeyS', 'YYxMM', 'canEquip', '_hideTileS', '_dimmerSpr', 'KboTc', 'nRequests', 'setBattleS', 'iptLf', 'DATABASE', '_maxDigits', 'INCIRC', 'rwhXS', 'deactivate', 'NhLSb', 'xhABB', 'FTB', 'RTfRk', 'setY', 'ParseActor', 'tler_start', 'loadSystem', 'alReferenc', 'JPKZY', 'HcpZo', 'menuShowBu', 'pGaugeColo', 'jHVcg', 'MXvyV', '_lastIconI', 'ButtonSide', 'F23', 'dowLayer', 'snapForBac', 'NSATP', 'brGGE', 'nqULH', 'leY', 'ItemMenu', 'ams', 'Nedsa', 'ntainBanne', 'lpMode', 'keypress', 'otTSY', 'uiAreaWidt', 'jzsQY', 'RCwsr', 'mapId', 'HPEmZ', 'lHp', 'MaFqq', 'crollUp', 'ItemPaddin', 'offColor', 'pow', 'F10', 'zQmpu', 'TvmfL', 'cQMfQ', 'YkGjv', 'Playtest', 'getLastGam', 'gineShakeR', 'kedOffset', 'nmysW', 'KcjkL', 'dFilter', 'Formula', 'HANJA', 're_initBas', 'updateDocu', 'CccDn', 'framebuffe', 'ZXyNW', 'Loaded', 'ordinatesM', 'HelpRect', 'essage', 'ge_gaugeRa', 'pCSiY', 'REPLACE', 'cdYrt', 'VYdzQ', 'CRUhc', 'drawGameVe', 'isSceneMap', 'eva', 'BattleMana', 'TFXwC', 'SParamVoca', 'UGRGx', 'UaWQl', 'eBackgroun', 'GAokP', 'ImprovedAc', 'ntainer', 'fWHPR', 'rxtlv', 'ucSIi', 'gaugeHeigh', 'Event', 'jgIuM', 'er_initial', 'doesNameCo', 'uge2', 'tWidthNoRo', 'INQUAD', 'baseId', 'CategoryBg', 'ttonSideBu', 'xOsaV', 'Base_destr', 'IdRCw', 'ript\x20Error', 'DashToggle', 'addEventLi', 'YrDVO', 'meType', 'bHFnN', 'removeAllF', '%1\x27s\x20versi', 'cIlrX', 'HBSJw', 'UpdatePict', 'TPB\x20ACTIVE', 'veToResolu', 'QPBrJ', 'setCommonE', 'PNcFS', 'Sjxxw', 'jtmWr', 'pQcCz', 'UIdaX', 'ring', 'roopText', 'ObUpx', 'MvjGW', 'TPB\x20WAIT', 'This\x20scene', 'uration', 'IyXTY', 'dWidth', 'numberShow', 'tener', 'qHzbK', 'StatusEqui', 'pyUXx', 'getBattleS', '_onKeyDown', 'aBEaO', 'urPxf', 'ageRenderi', 'number', 'ActorRect', 'SideButton', '_anchor', '_paramBase', 'defaultInp', 'Sprite_Gau', 'RPGMAKER_V', 'stringKeyM', 'GfHsQ', 'sKbai', 're_x', '_onLoad', 'setX', 'gnsmC', 'GaugeColor', 'drawActorN', 'XzsfI', 'drawRightA', 'csHyN', 'Linear', '5|0|3|2|1|', 'impleStatu', '_registerK', 'NSLeD', 'connected', 'ListBgType', 'jISLI', 'arams', 'vertical', 'ATTN', 'TkOFc', 'consumable', 'normalColo', 'adjustBoxS', 'ayCenter', 'target', 'ewGame', 'LFQsc', 'checkSmart', 'mNames', 'Lnafz', 'drawGameSu', 'stener', 'VOLUME_DOW', '_optionsWi', 'Images', 'INEXPO', 'orz', 'tionSprite', 'aseDelay', 'enterEleme', 'HzyWD', 'pMJRy', 'push', 'worldTrans', 'mev', 'EVA', 'CMsnq', 'LINEAR', 'RkYmv', 'tChange', 'e_destroyC', 'ture_updat', 'laWFy', 'BHUsf', 'MKmMi', 'SXIYN', 'xnaUI', 'FDR', '\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20', 'TIBmt', 'getParamet', 'SET', 'MenuLayout', 'height', 'pendingCol', 'eysF6F7', 'ESC', 'bGJCt', 'sorMoveMod', 'WXqQz', 'contentsOp', 'zqvtg', 'RUKDt', 'iYANm', 'uttonPress', 'right', 'animationS', 'buttons', '〘Scrolling', 'fillStyle', 'REuAV', 'battleSyst', 'm_initiali', 'uge1', 'ShopMenu', 'imationLay', 'QgFMt', 'ureAntiZoo', 'date', '1|4|0|3|2', 'SUBTRACT', 'DummyRect', 'Bitmap_dra', 'utton', 'isInstance', 'isCursorMo', 'ttons', 'CeVrs', '_bgmBuffer', 'onerror', 'gSrPo', '\x20%3\x20plugin', 'dthwG', 'INOUTBOUNC', 'tntzj', 'sfkek', 'baseTextRe', 'ectable_pr', 'LBuQX', 'cript_%1.t', 'ge2', 'gineModifi', 'ckground', 'ePlusData', 'isOpening', 'vpyPX', 'JWvXZ', 'mainAreaTo', 'ParamName', 'META', 'isLoopVert', 'eters', 'PzNmE', 'PictureCoo', 'JJrvH', 'owRect', 'ColorManag', 'paramBaseA', 'uaTOd', 'deselect', 'ion', 'KeyboardIn', 'msBgType', 'PA1', 'FpNzb', 'PmclC', 'createTitl', 'ButtonFade', 'bZNnJ', 'encounterS', 'RightMenus', 'setMoveEas', 'PYONS', 'setTargetA', 'ParseClass', 'mentTitle', 'setupScrol', 'undOpacity', 'down2', 'RIeGe', 'PictureEas', 'shouldAuto', 'Sprite_Ani', 'NGZKf', 'okEqU', 'mzlPT', 'ALTGR', 'Troop%1', 'tab', 'OpenSpeed', 'gold', 'VemQk', 'mhp', 'TwJWd', 'YnJds', 'wWzTw', 'ListRect', 'laQXJ', 'GwfVj', 'OS_KEY', 'src', 'refreshScr', 'stypeId', 'EQdZl', 'ngine_Cont', 'ltJEv', 'mmand', 'subjectHit', 'ZJEdp', 'emRect', 'OptionsBgT', 'rChat', 'drawActorL', 'PictureEra', 'LZVId', 'nw.gui', 'drawTextEx', 'pos', 'eterFormul', 'fillRect', 'lder.', 'apXaY', 'moveMenuBu', 'XJigI', 'IconIndex', 'Ynuyc', 'LHhpx', 'current', 'ndList', 'vlOPs', 'itemEva', 'processPoi', 'rFqSy', 'hide', 'DlWAb', 'SceneManag', '_shouldPre', 'e_drawText', 'innerWidth', 'playOk', 'GameEnd', 'iiElT', 'leLastCont', 'ZxxnW', 'ZEPNz', 'ygnkQ', 'TCR', 'eRYHe', 'hadow', 'XAjFj', 'pRect', 'index', 'Scrolling', 'INOUTSINE', 'COMMA', 'nFwdr', 'SystemLoad', 'pSell_isEn', 'kPZER', 'SideView', 'bvoMX', 'beyXc', 'setBackgro', 'rmalColor', 'etup', 'XLwxn', 'ait', 'gsaRt', 'setupNewGa', 'currentCla', 'button', 'stKey1', 'ScreenShak', 'oZqOT', '%1:\x20%2\x20Scr', 'isGamepadB', '_fauxAnima', 'Scene_Item', 'VTMkV', 'createBuff', 'fetzI', 'WIN_ICO_00', 'ordinatesW', 'scaleY', 'iQUrq', 'CoJnI', 'mxCEn', 'QEaIl', 'hkzXo', 'lePictureC', 'vqMtn', 'Sprite_Act', 'YrSZx', 'jsonToZip', 'createButt', 'test', 'YfYtP', 'otation', 'Saved\x20file', 'GoldRect', 'ame', 'makeFontSm', 'rowSpacing', 'TILDE', 'monEventAl', 'areButtons', 'requestPoi', 'Graphics_d', 'hasEncrypt', 'IconParam6', 'JYUGp', 'tionQueue', 'INSERT', 'rBbMO', 'DimColor1', 'Rect', 'makeCoreEn', 'APpJn', 'ceil', 'phpHs', 'HIT', 'tnOvl', 'ton_update', 'EWdqz', 'isBottomHe', 'drawSegmen', 'gWbHJ', 'bjVlr', 'updateBack', 'initBasic', 'atbActive', 'MKtZJ', 'kPQvF', 'boardBacks', '_clickHand', 'itemLineRe', 'itemPaddin', 'initRotati', 'drawCircle', 'neColor', 'OaeOX', 'Fzkxf', 'NEfgK', 'setCoreEng', 'QYFna', 'initialize', 'miytE', 'initVisuMZ', 'includes', 'nOn', 'cursorDown', 'BACKSPACE', 'updateFram', 'overallHei', 'CorrectSki', 'ttmje', 'MRG', 'targetCont', 'zoomScale', 'currencyUn', 'lbvhK', 'onActorCha', 'Plugin\x20Man', 'xisMoved', 'hyOIp', 'lelInterpr', '_CoreEngin', 'acryr', 'wIdyz', 'param', '2|4|3|1|5|', 'isTriggere', 'edParams', 'NUMPAD5', '_width', 'RNEeh', 'result', '\x20plugin\x20pl', 'Base_creat', 'ngkqj', '_tempActor', 'auSoa', 'dowsHidden', 'zmVnR', 'WIN_OEM_FJ', 'playOncePa', 'FrEbP', 'stOffset2', 'untwg', 'paramRateJ', 'wCircle', 'ype', 'WIN_OEM_PA', 'KxGHO', 'clone', 'Rate', 'IDkVg', 'Window_Equ', 'rraGk', 'PictureRot', '_pictureCo', 'checkCoreE', 'mRateCoreE', 'omizeOne', 'sCoreEngin', 'bitmap', '_baseTextu', 'string', 'WhMwZ', 'tleGridSys', '_onKeyPres', 'OpenConsol', 'nabled', 'YphDT', 'skillId', 'smallParam', 'RIGHT', 'maxLvGauge', 'uxazT', 'ParamChang', 'npcqs', 'QBfNH', 'ngine_Func', 'sceneTermi', 'INOUTBACK', 'boxWidth', 'ItemRect', 'npFWi', 'itemWindow', 'Scene_Stat', 'nXSaY', 'drawBackgr', 'itChange', 'ULjpa', 'bZCgO', 'onLoad', 'preter', 'deflate', 'boardHandl', 'qcoWH', 'ationQueue', 'SEMICOLON', 'EkpzJ', 'goRSE', 'YbODz', 'CostColor', 'WIN_ICO_CL', 'ned', 'trings', 'EXCLAMATIO', 'lnYwi', 'WITQt', 'saveViewpo', 'Export\x20Map', 'title', 'SQmCn', 'skipBranch', 'zfzEd', 'rXRiw', 'dScrolling', 'List', 'RxfjA', 'VgObW', '_itemWindo', 'maxScrollY', 'INBOUNCE', 'RegExp', 'createWind', 'ancelButto', '_mapNameWi', 'uttonStrin', 'fyEBK', 'nkKby', 'BjSUw', 'Armor-%1-%', 'toUpperCas', 'JXkHi', 'wholeDurat', 'processEsc', 'stText%1', 'unDUX', 'FErHr', 'wTextOutli', 'omHnY', 'uoGBc', 'n_itemEva', 'DigitGroup', 'successRat', 'F20', 'wIDsY', 'initMember', 'ZYCEo', 'indowBg', 'ExkeZ', 'MlYXe', 'updateData', 'Window_Nam', 'fnXiE', 'resh', 'batch', 'eSystem', 'le_createS', 'asing', 'canUse', 'NweRQ', 'maLpa', 'FRHsO', 'moveCancel', 'lGcjR', 'esmYQ', 'altKey', 'dCSFI', 'NewGameBoo', 'UBAJN', '_goldWindo', 'ialKeyCode', 'Bitmap_str', '%2〙\x20%3%1', 'dShadow', 'log', 'Controller', 'Value', 'eBgmPan', 'JPekA', 'cursorRigh', 'CLKDw', 'XZbUy', 'vqgRK', 'Vert', 'determineS', 'SEblB', 'ctrl', 'cursorUp', 'SEL', 'CTB', 'WwOPZ', 'kPwvG', 'Xktlp', 'cursorLeft', 'Pixelated', 'tileHeight', '_stored_pe', 'troy', 'WIN_OEM_CO', 'padZero', 'ZWPvV', '\x20as\x20%1\x20in\x20', 'MPWsO', 'VzwZw', 'SwitchRand', 'IIUIO', 'tialize', 'Game_Scree', 'DcGLp', 'zTInN', 'StPeR', 'Ekvyw', 'DefaultSty', 'aced\x20on\x20th', 'PpSqX', 'priteset_d', '_pauseSign', 'iftT', 'mIcons', 'EQUALS', '_pressed', 'lEXjV', 'center', 'sted', 'vKjwh', 'ineScreenS', 'DELETE', 'Hygnf', 'Input_shou', '2|5|0|3|4|', 'dling', 'BaGIj', 'rsorUp', 'sion', '9|3|5|7|1|', 'ove', 'rJS', 'FtXdX', 'vYbPl', 'BjtYK', 'oundRect', 'updateOpac', 'savefileIn', 'Bitmap_gra', 'YgmHK', 'updateDash', 'min', 'ation', 'irrorOffse', '_inputStri', 'stWindowRe', 'GnZTn', 'end', '_targets', 'playTestSh', '0|3|2|4|1', 'down', 'updatePosi', 'ling\x20Text\x20', 'GXDvL', 'essed', 'updateKeyT', 'ShowItemBa', 'createDigi', 'innerHeigh', 'hpGaugeCol', 'F16', '_data', 'qKjaq', 'prites', 'xBIIG', 'textHeight', 'Exported_S', 'kVmup', 'crisisColo', 'atSVE', 'ateWaitMod', 'pmNdA', 'pace', 'setFrame', 'FYWmm', 'thLoV', 'ZMVHm', 'defineProp', 'ameText', 'seek', 'abHfx', 't\x20〗〗〗\x0a\x0a', 'Scene_Titl', 'jbbXd', 'HYPHEN_MIN', 'AMqKP', 'YSIAJ', 'setActionS', 'paramValue', 'tionChange', 'windowOpac', 'nvoRe', 'toLowerCas', 'iXDrx', 'idden', 'makeTarget', 'gType', 'makeComman', 'QMNXa', 'isEnabled', 'eSettings', 'CpvJQ', 'MapOncePar', 'tCode', 'ationSprit', 'clearStenc', 'playCursor', 'subject', 'kxPEU', 'Color1', 'lize', 'ontainer', 'runCombine', 'concat', 'Finish', 'iltqS', 'changeClas', 'ldqxz', 'GET', 'nCommandIn', 'Size', 'initButton', 'sorPageup', '1.4.4', 'ButtonAssi', 'utMode', 'Viewport', 'ions', 'Game_Temp_', 'tleSys', 'EcfmA', 'randomInt', 'RCwey', 'eBgsPitch', 'ckgroundJS', 'sVNao', 'SystemSetF', 'ParseTiles', 'Bitmap_mea', 'mcoYo', 'initCoreEn', 'tAnimation', 'NUMPAD3', 'PixelateIm', 'LoadError', 'qEfja', 'ffdFJ', 'dGameTroop', '_movementW', '_eventId', 'subtitle', 'ykdXo', 'note', 'pNote', 'SParameter', 'etDisplayP', 'Notetags', 'NAmWD', 'wQJmC', 'uaGnu', 'skin', 'ning', 'hGxXz', '_duration', 'contents', 'AnimationI', 'onlyfilena', 'PmzAY', 'tWidth', 'duration', 'gaugeRate', 'NONCONVERT', 'MWEXS', 'WARNING:\x20%', 'jsQuickFun', 'isNumpadPr', 'charAt', 'ical', 'JzZVM', 'CategoryRe', 'YHePR', 'xcAyR', 'jvWet', 'rMove', 'ctureIcon\x20', 'ezpKr', 'ConvertNum', 'incomplete', 'ADUIe', 'sUpJW', 'YpLqu', 'onCoreEngi', 'reaHeight', 'ExportStri', 'preter_upd', 'AllMaps', '_lastGamep', 'textColor', 'knqpk', '369060BRhpof', 'jUpsm', 'setMute', 'Window_Bas', 'expGaugeCo', 'IWTni', 'vElHJ', 'prepare', 'btitle', 'worfL', 'EQUAL', 'WASD', 'cBpCU', 'lerInputBu', 'Yvnna', 'playMiss', 'ANAtR', 'setupValue', '205EZdeUs', 'ZMaSU', 'BACK_QUOTE', 'ows', 'text%1', 'isNormalPr', 'top', 'scrollX', 'nimations', 'maxTurns', '_opacity', 'QhGqU', 'IGbbO', '_backgroun', '\x20flag\x20data', 'ePlus', '_target', '_balloonQu', 'ldPreventD', 'Bitmap_fil', 'alGame', 'LpCOD', 'setSideBut', 'Graphics_p', 'ndowRect', 'NcwOE', 'uvnZm', 'OuXWS', 'mainComman', 'F21', 'ColorCTGau', 'renderNoMa', 'OUTCIRC', 'getCoreEng', 'QvWse', 'ColorGauge', 'esolution', 'yYOYc', 'INER', 'gstYh', '〖〖〖\x20Troop\x20', 'ease\x20updat', 'makeDocume', '3|1|2|4|0', 'ObizP', 'zojJC', 'IZmwM', 'update', 'processKey', 'boardHome', 'ydoNM', 'operand', 'command355', 'overy', 'paramBase', 'ickFunctio', 'oEHpw', 'pZLjs', 'faceHeight', '_lastPlugi', 'F19', 'startNorma', 'erveNumber', 'create', 'ExtDisplay', '_stored_tp', 'SOsUD', 'getLastUse', 'ApxiN', 'kvddk', 'JxXGM', 'MPkVr', 'gVSlQ', 'xZlOl', 'e_createCo', 'windowPadd', 'pVLTb', 'JOIoO', '_margin', 'Window_Sho', 'QUESTION_M', 'ColorMaxLv', '\x5c.?\x5cd+)>', 'render', 'displayY', 'hpColor', 'gameTitle', '_onceParal', 'rEeZo', 'meCommonEv', 'GoldBgType', 'kground', 'quit', 'isSpecialC', '_playTestF', 'hJaTr', 'jLsHp', '_targetAnc', 'FromTroop', 'listWindow', 'offsetX', 'randomJS', 'storeMapDa', 'GgEGd', 'avSmx', 'IfCPI', 'fVNuk', '_create', 'ripts', 'IiaQr', 'LOTlX', 'WIN_OEM_BA', 'yxohD', 'Bonus', 'adjustSpri', 'hfaJP', 'teGamepadS', 'VisuMZ_1_O', 'gFDWk', 'addChild', 'IzMtT', 'CZNtA', 'ation\x20will', 'Unnamed', '_shakePowe', 'makeInputB', 'SUush', 'gAnglePlus', 'EfIrM', 'textWidth', 'fKzeJ', ')\x20{\x0a\x20\x20\x20\x20\x20\x20', 'ideView', '_isPlaytes', 'Sprite_des', 'helpWindow', 'houldMirro', 'turn', '_buttonTyp', '_targetOff', 'buttonY', 'F12', 'ectable_it', 'iconWidth', '6|3|2|1|4|', 'mETB', 'dGamepadTy', 'PKgUq', 'juxyR', '0|2|4|3|1', 'TimeProgre', '5|2|6|4|3|', 'NUMPAD4', 'YHGFd', 'UwFvz', 'RzORw', '\x20\x20\x20\x20\x20\x20\x20%2\x0a', 'pointX', 'tSize', 'ictureCont', 'startMove', 'brtwi', 'drawActorC', 'intAnimati', 'isMVAnimat', 'uxAnimatio', 'en-US', 'YIHTj', 'ent', 'playBgm', 'displayX', 'nationClea', 'RSecT', 'getInputBu', 'Window_Sta', 'paramRate', '_helpWindo', '_numberWin', 'vMepU', 'isCollided', 'Padding', 'vert', 'IconXParam', 'destroyed', 'CoreEngine', '_isButtonH', 'CbZWu', 'bJcxH', 'initialLev', 'Current\x20ti', 'eSSte', 'Game_Chara', '_hp', 'pleStatus', 'zontal', 'HOME', 'TextAsCode', 'ExtJS', '_storedSta', 'Mirror', '_spriteset', 'askQC', 'olgHT', 'SwitchActo', 'nImage', '_startPlay', 'inParamete', 'isWindowMa', 'EnemiesByR', 'CIRCUMFLEX', 'lError', '〙\x20Start', 'bNzlN', 'moNOB', 'StateIcons', 'STNGA', 'createMenu', 'OONvR', 'ocessCurso', 'QgDIC', 'lXHOT', 'Reposition', 'YUXmI', 'playBuzzer', '_context', 'filters', 'uoxiQ', 'fqsLM', 'OUTEXPO', 'OiRSx', 'hlyBB', 'ons_create', 'OXKqh', 'PreserveNu', 'dfYJD', 'e\x20plugin\x20l', 'ings', 'lkTxg', 'lor2', '7Looping', 'NYlHc', 'mbers', '_bitmap', 'THofI', 'hadows', 'SCROLL_LOC', 'gger', 'INOUTQUINT', 'Trigger', 'SPACE', 'maxVisible', 'iconHeight', 'SlotRect', 'and', 'EzMNH', 'stencilFun', 'leSystemID', 'contentsBa', 'OJOPn', 'currentVal', 'makeEncoun', 'ctrlKey', 'areTileSha', 'stSwitch', '_origin', 'outlineCol', '5|3|1|2|4|', 'onKeyDown', 'EDUic', 'kMrNA', 'Olqgo', 'deathColor', 'owRRE', 'easingType', 'expRate', '\x20largest\x20t', 'SHIFT', 'XuGhQ', 'Game_Map_s', 'updateAnch', 'statusWind', 'sorHomeEnd', 'TfDbf', 'ion〙%1', 'n_setAttac', 'setAnglePl', 'vent', 'zdGil', 'padding', 'seNaD', 'EVAL', 'uWJkp', 'prite', 'ypeId1', 'sShAt', 'PNZdL', 'XycWl', 'drawCurren', 'efault', 'setWindowP', 'isCancelle', 'etypeId', 'updateCurr', '_timerSpri', 'MAX_SAFE_I', 'OSEQH', 'textAlign', 'isDying', 'dxlBK', 'rpreter', '_gamepadWa', 'Window_Map', 'oOHXW', 'dList', 'IhWFF', 'a\x20Quick\x20JS', 'SEPARATOR', 'setMainFon', '_createWin', 'maxItems', 'tOpacity', 'aXSwW', 'xuIqU', 'qnFOG', 'scrollbarH', 'bNKlS', 'refreshDim', 'gine', 'zekQJ', 'ghRNW', 'makeAutoBa', 'omBackgrou', 'KIXWV', 'pagedown', 'MxWQB', 'meRepositi', 'gIMDl', 'Skill-%1-%', 'giaWg', '3830717CPwWNh', '_mirror', 'drawItem', 'loadIconBi', 'aBOpf', 'openingSpe', 'isActor', 'animationN', '\x20\x22%1\x22\x20Erro', 'Scene_Boot', 'NKGiF', 'rcjbs', 'updateBgsP', 'removeChil', 'cDAQb', 'EXSEL', 'LEFT', 'awActorLev', 'fMEJB', 'fsFXv', 'd\x20cannot\x20b', '_backSprit', 'SumHJ', 'DisplayLoc', 'onnected', 'CrisisRate', 'tCoreEngin', 'MTfWk', 'stOffset5', 'put', 'ColorNorma', 'contains', 'res', 'OmWlZ', 'JSON', '0|2|5|4|3|', 'Location', 'ingExText', 'PIPE', 'EnableJS', 'BTestAdded', 'llBarVisib', 'yyCfr', 'zGnrr', 'xjXwa', 'translucen', 'dIonR', 'ColorTPCos', 'loadWindow', 'OlELg', 'tton', '%1\x20%2', 'TzRge', 'drawTextTo', 'n.\x0aPlease\x20', 'Jsbjw', 'ates', 'nldVZ', '2322opBJDj', 'DftTg', 'tmap', 'isArrowPre', 'WlfUT', 'niqueTileE', 'DBYlA', 'checkPassa', 'AnimationQ', 'OPEN_BRACK', 'darwin', 'elExp', 'exit', '5|0|3|1|4|', 'nJVzB', 'NUM_LOCK', '_start', 'NON_FRAME', 'e_createTe', '\x20\x20\x20\x20if\x20($g', 'eFix', 'FromMap', 'Script\x20Err', 'yEkdX', 'F14', 'HavfM', 'IFLuC', 'updateSmoo', 'aZRmj', 'horz', '_name', 'ect', '_sellWindo', 'NrxMC', 'lid', 'Game_Inter', 'EZsKQ', 'ttom', 'CallHandle', 'vgrCh', 'retrievePo', 'Power', 'mIilr', 'TTmIj', 'e_drawIcon', 'ndRect', 'Manual', 'iOxCB', 'ainer', '_scene', 'ARRAYSTR', 'ncAKq', 'WIN_OEM_EN', 'ice\x20Select', 'xxHuL', 'shift', 'replace', 'cknames', 'aps', 'SCROLLBAR', 'globalAlph', 'Duration', '_TOUROKU', 'KwdXJ', '_encounter', 'vzXRh', 'qMvtQ', 'getColorDa', 'pDUWS', 'children', 'alwaysDash', '_statusPar', 'levelUp', '2|5|3|4|1|', 'makeAction', 'ndTimings', 'alize', '_pictureNa', 'gle', '12gxPHKh', 'stop', 'SjLsa', '_colorTone', 'rsion', 'wRect', 'werDownCol', 'aZXju', 'jqCdS', 'mation_pro', 'mrrLr', 'CLOSE_BRAC', 'qydjv', 'createSpri', 'OVVND', 'pixelated', '_statusEqu', 'curacySyst', 'mand355', 'params', 'IconParam0', 'gNWDy', 'setup', 'EventColli', 'lBarValues', 'pEventHand', 'ationFromC', 'Sprite_But', 'rintError', 'ght', 'JLHmi', 'faBut', 'save', 'dUDMq', 'ACCEPT', 'ColorMPGau', 'HYFth', '_makeFontN', 'itemBackCo', 'SOocJ', 'bind', 'CodeJS', 'Map%1', 'FeVsJ', 'Scene_Unli', '_downArrow', 'tID', 'NQIDq', '_clientAre', 'NonFrame', 'ter', 'scaleSprit', 'ngineDispl', 'loadGameIm', 'setEasingT', '_addShadow', 'Uwipg', 'SsrEX', 'OTB', 'riginal', 'OptionsRec', 'enabled', 'yLxvI', 'F6key', 'sform', 'displayNam', 'onNameOk', 'acity', 'Multiply', 'MCR', 'aZwuU', 'fEloS', 'PLAY', 'dimColor1', 'child_proc', 'abled', 'scrollLeft', 'ActorMPCol', 'showDevToo', 'IconParam7', 'wOoWe', 'calcEasing', 'visible', 'MGryZ', 'Name_refre', 'nchor', 'option', '_menuButto', 'ozgwP', 'tions', 'OZNXc', 'rTgoM', 'kZeOA', 'selectLast', 'EHJFL', 'pSideButto', 'titleComma', '0|2|1|3|4', 'battlerHue', 'Queue', 'RTbpq', 'StatusRect', 'SETTINGS', 'autoRemova', 'Acize', 'Subtitle', 'fQDxg', 'xAnimation', 'JnDaN', 'ANfGj', 'mVTPK', 'DOLLAR', '_textPopup', 'ectable_dr', 'CONVERT', 'rdinatesMo', 'ode', 'isRepeated', 'FnoWo', 'Layer', 'eqPtX', 'background', 'ontents', 'NUM', 'yojHR', 'YJFlF', 'pbuhB', 'BerjP', '_cache', 'VariableEv', 'teset', 'ntLayers', 'rVPXY', 'llBars', 'ModernCont', 'ARRAYJSON', '4|1|2|0|3', 'eJvMB', 'us_create', 'TbqPk', 'JKdon', 'BSDAb', 'DIVIDE', 'endAction', 'how', 'StartID', 'LaifJ', 'epadUsed', 'xparamRate', 'F24', '7lQpoCS', 'rfRbO', 'RzRQh', 'Mode', 'IconSet', 'OxJmw', 'zmijM', 'DLpwv', 'llRect', '0|1', 'KeyTAB', 'ngine_Sett', 'ateFrame', 'cyValue', '_animation', '_changingC', 'img/%1/', 'xHbgT', 'WdiMH', 'canAttack', '_showDevTo', 'stText4', 'KeyItemPro', '_upArrowSp', 'BzrXj', 'tMembers', 'KmPno', 'JJPNI', '_texture', '_refreshAr', 'STR', 'HWOWU', '_windowLay', 'ActorTPCol', 'pingEx', 'MVtht', 'stText2', '_sideButto', 'cessSoundT', 'kedBitmaps', 'targetObje', 'BuyRect', 'scrollbar', '_hideButto', '3|1|0|4|2', 'ger_update', 'OrXPs', 'damageColo', 'bitmapWidt', 'mVAxo', 'add', 'sparamPlus', 'jPvkK', 'updateOpen', 'PDZuv', 'hrtrs', 'nOffsetXMi', 'ickLoad', 'city', 'default', '_isWindow', 'yfzSd', 'CEV', 'XDcGR', 'EbbHO', 'Untitled', 'updateEffe', 'uKPKi', 'ce\x20Paralle', 'NUMPAD0', 'fTyKX', '_mode', 'ngine_Cust', 'r_setupNew', 'anchor', '\x20Function', 'yFrdx', 'framesPerC', 'pktEr', 'XParamVoca', 'changeAngl', 'cQHYj', 'pop', 'EscapeAlwa', '_opening', 'GnIkv', 'hor', 'wQtsC', 'vWfRR', 'upport', 'ons', 'awRNW', 'ParamArrow', 'max', 'EUzQa', 'BattleSyst', 'Base_isAni', '_setup', 'JOAzy', 'console.lo', 'paramPlus', 'sTKBd', 'responseTe', 'cITFu', 'aZdsH', 'orDmg', 'updateBgmP', 'Ljzyi', '2|1|0|5|3|', 'PopupWindo', 'LnxjI', 'GameCommon', 'playLoad', 'lMWEk', 'wvTiO', 'drawActorE', 'hKwiL', '0|2|4|1|3', 'msRect', 'JkmUm', 'undType', 'getButtonA', 'updateShad', 'PkSOb', 'sparamFlat', 'enter', 'tents', 'sparam', 'QUOTE', 'nsideFrame', 'Game_Actor', 'call', 'BlendMode', '_forcedTro', '_categoryW', 'vkRfm', 'll\x20finish\x20', 'tem', 'rgba(0,\x200,', 'setViewpor', 'oXqyH', 'eLoaded', 'rightArrow', 'sorLeft', 'RPNeS', 'descriptio', 'seVolume', 'isMaxLevel', '_pageupBut', 'SlotBgType', 'adjustPict', 'onus', 'xZOmO', 'uXkCJ', 'DetachBatt', 'bodyColor', 'oad', 'cursorPage', 'isSideButt', 'le_createC', 'win32', 'F22', '_action', 'PositionJS', 'rAffected', 'CreateBatt', 'updateWait', 'pan', 'eInput_pro', 'drawParamT', 'system', 'entEvent', 'raHnh', 'iority', 'getColor', '_scaleX', 'CnLKk', 'GMzyQ', 'obJFI', 'DebugConso', 'SFFnP', 'applicatio', 'Drawn', 'missed', 'tParam', 'VisuMZ_3_E', 'NameMenu', 'Base_updat', 'ontSize', 'hTlGV', 'STB', 'isOptionVa', 'catchUnkno', 'JJVKV', 'slotWindow', 'kxTYs', 'centerY', '_defaultSt', 'get', 'isHandled', 'ideButtonL', 'Game_Pictu', 'isSideView', 'AAFrD', 'destroy', 'NUMPAD1', 'Conditiona', 'sorPagedow', 'Grxgk', 'CommandBgT', 'removeAllP', 'CKTAB', '4|1|2|3|0', 'MaxDuratio', 'teIcon_loa', 'nge', 'setupCusto', 'keyMapper', 'QXMdj', 'ezgsb', 'Enemies130', 'omizeRange', 'createKeyJ', 'MiiGF', 'CqHJM', 'dtoEQ', 'KcCYC', 'lineHeight', 'ground', 'extDelay', 'HQdip', 'FwTBV', '_windowski', 'FavOP', 'ads', 'werUpColor', 'ENTER_SPEC', 'GLkzp', 'dText', 'wIiae', 'ingStandar', 'yDown', 'MOuSu', 'ingType', '_effectsCo', 'UfCbW', 'Items', 'keyCode', 'catchNorma', 'zshCQ', 'drawIconBy', 'dLFjk', 'iewport', 'eInput_cur', 'e_drawGame', 'drawIcon', 'fillAll', 'MAAna', '_text', 'k\x20Function', 'resetTextC', 'RowSpacing', 'mpGaugeCol', 'SHTJx', 'Sprites', 'Target', 'EXR', 'sVBUr', 'eventsXyNt', '826203MdSQAU', 'monEvent', 'oCshK', 'onAssistEn', 'deBxV', 'ColorMPCos', 'ureSetting', 'yVjyP', 'TRG', 'BTestArmor', 'ectable_cu', 'updatePadd', 'position', 'CUbfp', 'ite', 'setGuard', '_stored_no', 'WindowLaye', 'getLastPlu', 'destroyCon', 'smooth', 'TGR', 'Game', 'bQFqD', 'paramMax', 'isClosed', 'dowRows', 'CNT', '_MASSHOU', 'scaleMode', 'ndex', '\x20%1\x20ms(s)', 'imations', 'sgdAK', 'istWindow', 'IDs', 'zOKhH', 'eclared\x0aan', 'sparamRate', 'updateFaux', 'context', 'pdatePosit', 'wniZc', 'faceWidth', 'ert', 'CustomPara', 'AyasW', 'isSceneBat', 'EbgDv', 'F17', 'textSizeEx', 'qBETA', '\x20\x20console.', 'AMPERSAND', 'vhgwM', 'IEKPo', '_blank', 'oOtHe', '\x20Origin:\x20%', 'project\x20fo', 'HnwWa', 'rouping', 'dPYqB', 'suMZ_CoreE', '_slotWindo', 'createJsQu', 'owButton', 'iyGwq', '%1\x0a', 'boardDigit', 'Type', 'exportAllM', 'huPTe', 'CONTEXT_ME', 'sv_actors', 'zEmoD', 'Horz', 'FGLDw', 'Export\x20Tro', 'ctGaugeCol', '_screenY', 'l\x20Error', 'vkRgO', 'EpADu', '_createInt', 'updateTran', 'nPlaying', '_stored_ct', 'wXLbx', 'isAnimatio', 'GREATER_TH', 'mation_set', 'helpAreaTo', 'Actor', 'Battle_cre', 'ColorPower', 'updateRota', 'rqrSe', 'format', 'command111', 'lRect', 'PPPeV', 'TCKMQ', 'onInputBan', 'pagedownSh', 'Crerw', 'LNwPK', 'font', 'WAqiT', 'nuNDo', 'bJLCy', 'cfczQ', 'hit', 'Buttons', 'INQUINT', 'MWibH', 'WmxOz', '_lastScrol', 'QnrSi', 'PERCENT', 'bgm', 'AutoStretc', 'setActorHo', '_stored_de', 'DjvlI', 'OShWe', 'QuedE', 'woqzm', 'UqkSF', 'reEngine', 'ture_loadB', 'KeyUnliste', 'Rate2', 'ttonRect', 'yXTFE', 'OPEN_PAREN', 'QoL', 'Scene_Sing', 'drawGoldIt', 'XczrH', 'textBaseli', 'wrJWZ', 'setupCoreE', 'amsWindow', 'Animations', 'inputWindo', 'isInputtin', 'nedWords', 'oiIbX', 'hTextCodeS', 'ParamMax', 'parallaxes', 'LUK', 'ename', 'Playtest()', 'EnableNumb', 'stText5', 'TTSdw', 'requestMot', 'Plus2', 'ZGykx', 'PfJOt', 'NjhCV']; _0x1e0c = function () { return _0x5d5d91; }; return _0x1e0c(); } function Window_PictureCoordinates() { const _0xe2366 = _0x3a6da1; this[_0xe2366(0xa40)](...arguments); } Window_PictureCoordinates[_0x3a6da1(0x49b)] = Object[_0x3a6da1(0xc26)](Window_Base[_0x3a6da1(0x49b)]), Window_PictureCoordinates['prototype'][_0x3a6da1(0x3b0) + 'r'] = Window_PictureCoordinates, Window_PictureCoordinates[_0x3a6da1(0x49b)][_0x3a6da1(0xa40)] = function () { const _0x48bcd2 = _0x3a6da1, _0x52c121 = { 'OiRSx': 'nah' }; this['_lastOrigi' + 'n'] = _0x52c121[_0x48bcd2(0xccc)], this['_lastX'] = _0x52c121[_0x48bcd2(0xccc)], this['_lastY'] = _0x52c121[_0x48bcd2(0xccc)]; const _0x4ecc87 = this[_0x48bcd2(0x3de)](); Window_Base[_0x48bcd2(0x49b)][_0x48bcd2(0xa40)][_0x48bcd2(0xedc)](this, _0x4ecc87), this['setBackgro' + _0x48bcd2(0xed1)](-0x7a2 + 0x301 * 0x3 + -0x15f); }, Window_PictureCoordinates['prototype'][_0x3a6da1(0x3de)] = function () { const _0x431066 = _0x3a6da1, _0x35c69d = { 'eFxSw': function (_0x2a4a9e, _0xa578ff) { return _0x2a4a9e - _0xa578ff; } }; let _0x20df2b = -0x268 + 0x18 * -0x1e + 0x538, _0x2f8922 = _0x35c69d[_0x431066(0x109a)](Graphics[_0x431066(0x944)], this['lineHeight']()), _0xa24091 = Graphics[_0x431066(0x4c0)], _0x3e564c = this['lineHeight'](); return new Rectangle(_0x20df2b, _0x2f8922, _0xa24091, _0x3e564c); }, Window_PictureCoordinates[_0x3a6da1(0x49b)][_0x3a6da1(0xf71) + 'ing'] = function () { const _0x1fe351 = _0x3a6da1; this[_0x1fe351(0xd07)] = -0x2687 + 0xa55 + 0x1c32; }, Window_PictureCoordinates[_0x3a6da1(0x49b)][_0x3a6da1(0xc16)] = function () { const _0x16e7e0 = _0x3a6da1; Window_Base[_0x16e7e0(0x49b)][_0x16e7e0(0xc16)][_0x16e7e0(0xedc)](this), this['updateData'](); }, Window_PictureCoordinates['prototype'][_0x3a6da1(0xad6)] = function () { const _0x2ae280 = _0x3a6da1; if (!this[_0x2ae280(0x6ed) + 'e']()) return; this[_0x2ae280(0x6d0)](); }, Window_PictureCoordinates[_0x3a6da1(0x49b)][_0x3a6da1(0x6ed) + 'e'] = function () { const _0x1633a4 = _0x3a6da1, _0x1190b0 = { 'YrSZx': function (_0x1960ea, _0xcb8d35) { return _0x1960ea !== _0xcb8d35; } }, _0x1ffd9d = $gameTemp[_0x1633a4(0xa77) + _0x1633a4(0x8ac) + _0x1633a4(0xe37)], _0x355f84 = $gameScreen['picture'](_0x1ffd9d); return _0x355f84 ? _0x1190b0[_0x1633a4(0xa0b)](this[_0x1633a4(0x51b) + 'n'], _0x355f84[_0x1633a4(0xcef)]) || _0x1190b0[_0x1633a4(0xa0b)](this[_0x1633a4(0x7cf)], _0x355f84['_x']) || _0x1190b0['YrSZx'](this['_lastY'], _0x355f84['_y']) : ![]; }, Window_PictureCoordinates['prototype'][_0x3a6da1(0x6d0)] = function () { const _0x9c0b05 = _0x3a6da1, _0xf1f1fb = { 'JtKsr': _0x9c0b05(0xfa0) + '1', 'dFFRj': function (_0x35f714, _0x31a73a) { return _0x35f714 === _0x31a73a; }, 'rhxkG': _0x9c0b05(0x797), 'cZcmO': _0x9c0b05(0x592), 'BjSUw': _0x9c0b05(0x305), 'TbqPk': 'Y:\x20%1', 'oGXmO': _0x9c0b05(0x550), 'JLEDB': _0x9c0b05(0x558), 'TIBmt': function (_0x721ed9, _0x29850a) { return _0x721ed9 / _0x29850a; }, 'uDYgO': function (_0x2f540e, _0x250a94) { return _0x2f540e * _0x250a94; }, 'EHJFL': _0x9c0b05(0xb1e), 'dPYqB': function (_0x531153, _0x3f4573) { return _0x531153 - _0x3f4573; } }; this[_0x9c0b05(0xbb2)][_0x9c0b05(0x7ee)](); const _0x1b569f = $gameTemp[_0x9c0b05(0xa77) + _0x9c0b05(0x8ac) + _0x9c0b05(0xe37)], _0x3b7452 = $gameScreen['picture'](_0x1b569f); if (!_0x3b7452) return; this[_0x9c0b05(0x51b) + 'n'] = _0x3b7452[_0x9c0b05(0xcef)], this[_0x9c0b05(0x7cf)] = _0x3b7452['_x'], this['_lastY'] = _0x3b7452['_y']; const _0x290b75 = ColorManager['itemBackCo' + 'lor1'](); this[_0x9c0b05(0xbb2)]['fillRect'](0x363 * 0xb + -0x2 * -0x1051 + -0x45e3, 0x1cce + 0xd * 0x12 + -0x1db8, this[_0x9c0b05(0x9d5)], this['innerHeigh' + 't'], _0x290b75); const _0x14951d = _0xf1f1fb[_0x9c0b05(0x7c0)][_0x9c0b05(0xfc8)](_0xf1f1fb[_0x9c0b05(0x404)](_0x3b7452[_0x9c0b05(0xcef)], -0xd * -0x25 + 0x704 * 0x2 + -0xfe9) ? _0xf1f1fb['rhxkG'] : _0xf1f1fb[_0x9c0b05(0x74e)]), _0x256fac = _0xf1f1fb[_0x9c0b05(0xac0)][_0x9c0b05(0xfc8)](_0x3b7452['_x']), _0x1e2d10 = _0xf1f1fb[_0x9c0b05(0xe4e)]['format'](_0x3b7452['_y']), _0x4ba637 = _0xf1f1fb['oGXmO']['format'](TextManager[_0x9c0b05(0xc94) + _0x9c0b05(0x816)](_0xf1f1fb[_0x9c0b05(0x221)])); let _0x3dc4a4 = Math[_0x9c0b05(0x719)](_0xf1f1fb[_0x9c0b05(0x940)](this['innerWidth'], 0xa0d * 0x1 + 0x1 * 0xe1c + 0x1825 * -0x1)); this[_0x9c0b05(0x46a)](_0x14951d, _0xf1f1fb['uDYgO'](_0x3dc4a4, 0x364 + 0x1193 + 0x6fd * -0x3), -0xd5 * 0x1b + -0x8 * -0x1fc + 0x697, _0x3dc4a4), this[_0x9c0b05(0x46a)](_0x256fac, _0xf1f1fb[_0x9c0b05(0x474)](_0x3dc4a4, 0x1fab + 0x889 + -0x2833), 0x9 * -0x329 + -0x50f * -0x4 + 0x835 * 0x1, _0x3dc4a4, _0xf1f1fb[_0x9c0b05(0xe21)]), this[_0x9c0b05(0x46a)](_0x1e2d10, _0xf1f1fb[_0x9c0b05(0x474)](_0x3dc4a4, -0x377 * -0x2 + -0x1801 + 0x1115), -0xe45 + -0x1ff1 + 0x23 * 0x152, _0x3dc4a4, _0xf1f1fb['EHJFL']); const _0x210e33 = this[_0x9c0b05(0xf98)](_0x4ba637)['width'], _0x2575eb = _0xf1f1fb[_0x9c0b05(0xfa4)](this['innerWidth'], _0x210e33); this[_0x9c0b05(0x9bf)](_0x4ba637, _0x2575eb, 0x248e * -0x1 + -0xc96 + 0x3124, _0x210e33); }; function Window_TextPopup() { const _0x38fe87 = _0x3a6da1; this[_0x38fe87(0xa40)](...arguments); } Window_TextPopup[_0x3a6da1(0x49b)] = Object[_0x3a6da1(0xc26)](Window_Base['prototype']), Window_TextPopup[_0x3a6da1(0x49b)]['constructo' + 'r'] = Window_TextPopup, Window_TextPopup[_0x3a6da1(0xe29)] = { 'framesPerChar': VisuMZ[_0x3a6da1(0xc9f)]['Settings']['Window']['DurationPe' + _0x3a6da1(0x9ba)] ?? 0xb67 + -0xa96 + 0xd * -0x10 + 0.5, 'framesMin': VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x316)]['Window'][_0x3a6da1(0x39d) + 'n'] ?? -0x1c11 + -0x6 * -0x525 + -0x273, 'framesMax': VisuMZ['CoreEngine']['Settings'][_0x3a6da1(0x3ef)][_0x3a6da1(0xf2e) + 'n'] ?? 0x1 * -0x1fca + -0x185 * 0x5 + 0x288f }, Window_TextPopup[_0x3a6da1(0x49b)][_0x3a6da1(0xa40)] = function () { const _0xf806eb = _0x3a6da1, _0x20add1 = new Rectangle(0x23e9 + -0x16a7 + -0xd42, -0x1a2f + -0x797 + 0x21c6, -0xa9a * -0x2 + -0xc9a * 0x1 + -0x899, 0x8 * 0x4bc + -0x6 * -0x453 + 0x1f * -0x20f); Window_Base['prototype'][_0xf806eb(0xa40)][_0xf806eb(0xedc)](this, _0x20add1), this[_0xf806eb(0x103f)] = 0x1a5e + -0x4 * 0x6fe + 0x19a, this[_0xf806eb(0xf5b)] = '', this[_0xf806eb(0x6c8)] = [], this[_0xf806eb(0x63b) + 'ion'] = -0x1e0d + -0x1dc9 + 0x3bd6; }, Window_TextPopup[_0x3a6da1(0x49b)]['isAutoColo' + _0x3a6da1(0xefd)] = function () { return !![]; }, Window_TextPopup[_0x3a6da1(0x49b)][_0x3a6da1(0x7ad)] = function (_0x5372d5) { const _0x3f4394 = _0x3a6da1, _0x1310e3 = { 'dtoEQ': function (_0x1bd04d, _0x304aec) { return _0x1bd04d === _0x304aec; }, 'dThAR': function (_0x5b607b, _0x2013d0) { return _0x5b607b - _0x2013d0; } }; if (_0x1310e3[_0x3f4394(0xf3a)](this[_0x3f4394(0x6c8)][_0x1310e3[_0x3f4394(0x74d)](this[_0x3f4394(0x6c8)][_0x3f4394(0x786)], -0x1 * 0x107e + 0xde6 + 0x299)], _0x5372d5)) return; this[_0x3f4394(0x6c8)][_0x3f4394(0x92f)](_0x5372d5), SceneManager[_0x3f4394(0xda5)][_0x3f4394(0xc5e)](this); }, Window_TextPopup[_0x3a6da1(0x49b)][_0x3a6da1(0xc16)] = function () { const _0x5ab45e = _0x3a6da1; Window_Base['prototype']['update'][_0x5ab45e(0xedc)](this), this[_0x5ab45e(0x447)](), this[_0x5ab45e(0x2d3) + _0x5ab45e(0x56c)](); }, Window_TextPopup['prototype'][_0x3a6da1(0x447)] = function () { const _0x2b7c53 = _0x3a6da1, _0x363bd5 = { 'aZRmj': function (_0xd895ab, _0x15b07d) { return _0xd895ab !== _0x15b07d; }, 'pyUXx': function (_0x1de6d9, _0x432cd0) { return _0x1de6d9 <= _0x432cd0; }, 'PhPxQ': function (_0x18f315, _0x2057cd) { return _0x18f315 * _0x2057cd; }, 'LXPUi': function (_0xad031c, _0x42fad5) { return _0xad031c + _0x42fad5; }, 'BeEnh': function (_0x3f4c66, _0x5a1e07) { return _0x3f4c66 * _0x5a1e07; }, 'dIonR': function (_0x15d014, _0x28b7de) { return _0x15d014 * _0x28b7de; }, 'cwolk': function (_0xfd0d6e, _0x59797f) { return _0xfd0d6e / _0x59797f; }, 'IDkVg': function (_0x51052d, _0x341719) { return _0x51052d - _0x341719; }, 'ozgwP': function (_0x384b1b, _0x5f3688) { return _0x384b1b - _0x5f3688; } }; if (_0x363bd5[_0x2b7c53(0xd90)](this[_0x2b7c53(0xf5b)], '')) return; if (_0x363bd5[_0x2b7c53(0x8f3)](this[_0x2b7c53(0x6c8)]['length'], -0x1 * -0x7c3 + 0x7 * 0x44f + -0x25ec)) return; if (!this['isClosed']()) return; this[_0x2b7c53(0xf5b)] = this[_0x2b7c53(0x6c8)][_0x2b7c53(0xdab)](); const _0x34af4a = Window_TextPopup[_0x2b7c53(0xe29)], _0x38d320 = Math[_0x2b7c53(0xa25)](_0x363bd5[_0x2b7c53(0x62b)](this[_0x2b7c53(0xf5b)]['length'], _0x34af4a[_0x2b7c53(0xea6) + 'har'])); this[_0x2b7c53(0x63b) + _0x2b7c53(0x987)] = _0x38d320[_0x2b7c53(0x759)](_0x34af4a[_0x2b7c53(0x3fd)], _0x34af4a[_0x2b7c53(0x5d9)]); const _0x503ebb = this[_0x2b7c53(0xf98)](this['_text']); let _0x5b06e2 = _0x363bd5[_0x2b7c53(0x4b9)](_0x503ebb[_0x2b7c53(0x4c0)], _0x363bd5['BeEnh'](this[_0x2b7c53(0xa37) + 'g'](), 0x1a3b + -0xbf * -0x2 + -0x1bb7)); _0x5b06e2 += _0x363bd5['BeEnh']($gameSystem['windowPadd' + _0x2b7c53(0x4d4)](), 0x25d1 + 0x9 * 0x19b + -0x3442); let _0x2bc9c5 = Math[_0x2b7c53(0xeb6)](_0x503ebb[_0x2b7c53(0x944)], this['lineHeight']()); _0x2bc9c5 += _0x363bd5[_0x2b7c53(0xd68)]($gameSystem['windowPadd' + _0x2b7c53(0x4d4)](), -0x516 + 0xc * 0x288 + 0x1948 * -0x1); const _0x33f5b3 = Math[_0x2b7c53(0x48a)](_0x363bd5[_0x2b7c53(0x381)](_0x363bd5[_0x2b7c53(0xa73)](Graphics['width'], _0x5b06e2), 0x607 * 0x5 + 0x2493 + -0x215a * 0x2)), _0x21988d = Math['round'](_0x363bd5[_0x2b7c53(0x381)](_0x363bd5[_0x2b7c53(0xe1b)](Graphics[_0x2b7c53(0x944)], _0x2bc9c5), 0x112b + -0x56c + 0x1 * -0xbbd)), _0x385f41 = new Rectangle(_0x33f5b3, _0x21988d, _0x5b06e2, _0x2bc9c5); this['move'](_0x385f41['x'], _0x385f41['y'], _0x385f41[_0x2b7c53(0x4c0)], _0x385f41['height']), this[_0x2b7c53(0x509) + _0x2b7c53(0x5ad)](), this[_0x2b7c53(0x6d0)](), this[_0x2b7c53(0x2f6)](), SceneManager[_0x2b7c53(0xda5)][_0x2b7c53(0xc5e)](this); }, Window_TextPopup['prototype'][_0x3a6da1(0x6d0)] = function () { const _0x1a75aa = _0x3a6da1, _0x3cca44 = this[_0x1a75aa(0x96f) + 'ct'](); this[_0x1a75aa(0xbb2)][_0x1a75aa(0x7ee)](), this[_0x1a75aa(0x9bf)](this[_0x1a75aa(0xf5b)], _0x3cca44['x'], _0x3cca44['y'], _0x3cca44[_0x1a75aa(0x4c0)]); }, Window_TextPopup['prototype'][_0x3a6da1(0x2d3) + 'tion'] = function () { const _0x5a7fda = _0x3a6da1, _0x159a55 = { 'wXLbx': function (_0x12d43e, _0x3e6af0) { return _0x12d43e <= _0x3e6af0; } }; if (this[_0x5a7fda(0x977)]() || this[_0x5a7fda(0x100e)]()) return; if (_0x159a55['wXLbx'](this[_0x5a7fda(0x63b) + _0x5a7fda(0x987)], -0x15ea + 0x41 + 0x15a9)) return; this[_0x5a7fda(0x63b) + _0x5a7fda(0x987)]--, _0x159a55[_0x5a7fda(0xfbe)](this[_0x5a7fda(0x63b) + _0x5a7fda(0x987)], -0x1f * -0x6e + 0x2a8 + -0x5 * 0x332) && (this[_0x5a7fda(0x494)](), this[_0x5a7fda(0xf5b)] = ''); }, VisuMZ[_0x3a6da1(0x658) + 'ls'] = function (_0x5eb1c6) { const _0x27636e = _0x3a6da1, _0x13950e = { 'MXvyV': _0x27636e(0xa0e), 'lnYwi': function (_0x19d064, _0x196bbc) { return _0x19d064(_0x196bbc); }, 'BRfii': _0x27636e(0x9be), 'rTgoM': function (_0x117564, _0xfe9902, _0x449f44) { return _0x117564(_0xfe9902, _0x449f44); } }; if (Utils[_0x27636e(0xf18) + _0x27636e(0xd96)](_0x13950e[_0x27636e(0x87c)])) { var _0x25da13 = _0x13950e[_0x27636e(0xaa9)](require, _0x13950e[_0x27636e(0x7d5)])[_0x27636e(0x3ef)][_0x27636e(0xf1f)](); SceneManager['showDevToo' + 'ls'](); if (_0x5eb1c6) _0x13950e[_0x27636e(0xe1e)](setTimeout, _0x25da13['focus'][_0x27636e(0xdeb)](_0x25da13), 0x15 * 0x119 + 0x201c + -0x3599); } }, VisuMZ[_0x3a6da1(0x77a) + 'g'] = function (_0x37866c, _0x3367f1) { const _0x2f961a = _0x3a6da1, _0x7b991c = { 'hTlGV': 'LINEAR', 'TTmIj': _0x2f961a(0x723), 'RCwey': function (_0x46fd3e, _0x27b01d) { return _0x46fd3e + _0x27b01d; }, 'JJPNI': function (_0x2530b1, _0x4f94f0) { return _0x2530b1 * _0x4f94f0; }, 'oLQAY': function (_0x569586, _0x22670c) { return _0x569586 / _0x22670c; }, 'xkcJN': _0x2f961a(0x1fd), 'iYANm': function (_0x51e1c2, _0x3a937e) { return _0x51e1c2 / _0x3a937e; }, 'msduG': _0x2f961a(0x9e4), 'xnaUI': function (_0x465ed5, _0x28754a) { return _0x465ed5 * _0x28754a; }, 'wTguA': function (_0x2f12b8, _0x8e9046) { return _0x2f12b8 - _0x8e9046; }, 'qrnbH': _0x2f961a(0x8cb), 'eqPtX': 'OUTQUAD', 'hQJOY': function (_0x3053e1, _0x192d48) { return _0x3053e1 * _0x192d48; }, 'ibDzn': function (_0x261724, _0xbc9846) { return _0x261724 - _0xbc9846; }, 'jifHY': _0x2f961a(0x2be), 'gnsmC': function (_0x5486c6, _0x5d450c) { return _0x5486c6 < _0x5d450c; }, 'XuGhQ': function (_0xfa15e8, _0x3a25e4) { return _0xfa15e8 * _0x3a25e4; }, 'HBSJw': function (_0x2e2ccc, _0x5dda58) { return _0x2e2ccc + _0x5dda58; }, 'padPp': function (_0x2cc953, _0x235ac1) { return _0x2cc953 * _0x235ac1; }, 'FPbKX': function (_0x720c5b, _0x2fb09d) { return _0x720c5b * _0x2fb09d; }, 'KVjUh': 'INCUBIC', 'wbJcY': 'OUTCUBIC', 'hrtrs': function (_0x47e0c4, _0x5aa9c1) { return _0x47e0c4 - _0x5aa9c1; }, 'MArjV': function (_0x3a11f7, _0x53c01d) { return _0x3a11f7 + _0x53c01d; }, 'UaWQl': 'INOUTCUBIC', 'brtwi': function (_0x20198f, _0x158bdc) { return _0x20198f < _0x158bdc; }, 'BZOmK': function (_0x26aeac, _0xc54364) { return _0x26aeac * _0xc54364; }, 'csHyN': function (_0x274054, _0x819e81) { return _0x274054 + _0x819e81; }, 'RWqSk': function (_0x4f1d34, _0x2a140d) { return _0x4f1d34 * _0x2a140d; }, 'MiiGF': function (_0x3917d5, _0x628597) { return _0x3917d5 * _0x628597; }, 'jHFEf': _0x2f961a(0x5b3), 'LHhpx': function (_0x420c67, _0x422ad4) { return _0x420c67 * _0x422ad4; }, 'EsRXt': function (_0x32ddb3, _0x6ab064) { return _0x32ddb3 * _0x6ab064; }, 'jWbGo': _0x2f961a(0x3f0), 'WhMwZ': function (_0x353679, _0x1b0f44) { return _0x353679 - _0x1b0f44; }, 'dCSFI': function (_0x4a0b54, _0x2dcba8) { return _0x4a0b54 - _0x2dcba8; }, 'hVWcI': function (_0xbeb9b5, _0x4f6d24) { return _0xbeb9b5 * _0x4f6d24; }, 'YbODz': function (_0x53be42, _0x9f239d) { return _0x53be42 * _0x9f239d; }, 'iOxCB': _0x2f961a(0x329), 'JMfNI': function (_0x217e8e, _0x2c92d0) { return _0x217e8e < _0x2c92d0; }, 'IFLuC': function (_0x388ff8, _0x41a0a8) { return _0x388ff8 * _0x41a0a8; }, 'worfL': function (_0x3c9057, _0x14af66) { return _0x3c9057 * _0x14af66; }, 'zekQJ': function (_0x4eea41, _0xe91bc8) { return _0x4eea41 * _0xe91bc8; }, 'zmVnR': function (_0x122928, _0xa8c8d4) { return _0x122928 - _0xa8c8d4; }, 'cCjHb': function (_0x4c3ba6, _0x500ab4) { return _0x4c3ba6 * _0x500ab4; }, 'loACV': function (_0x214cc6, _0x191c31) { return _0x214cc6 * _0x191c31; }, 'QgFMt': function (_0x1878b4, _0x4a5dff) { return _0x1878b4 * _0x4a5dff; }, 'XDcGR': _0x2f961a(0xfd8), 'KZMLv': function (_0x4ddcb6, _0xe0be6d) { return _0x4ddcb6 * _0xe0be6d; }, 'kxPEU': function (_0x46ccf1, _0x3cf303) { return _0x46ccf1 * _0x3cf303; }, 'djygS': 'OUTQUINT', 'YrygN': function (_0x44b505, _0x1b20de) { return _0x44b505 * _0x1b20de; }, 'sKZhx': function (_0x318196, _0x306865) { return _0x318196 * _0x306865; }, 'UfCbW': function (_0x4b5dba, _0x178e82) { return _0x4b5dba * _0x178e82; }, 'KwdXJ': _0x2f961a(0xcde), 'oREfL': function (_0x460af6, _0x56409d) { return _0x460af6 - _0x56409d; }, 'RwCRF': function (_0x247e7c, _0x36d170) { return _0x247e7c < _0x36d170; }, 'PvkaY': function (_0x371b7c, _0x31ddb9) { return _0x371b7c * _0x31ddb9; }, 'jtfnj': function (_0x3997cd, _0x3dcd01) { return _0x3997cd * _0x3dcd01; }, 'FykVp': function (_0x3c6f10, _0x289894) { return _0x3c6f10 + _0x289894; }, 'lfnPd': function (_0xde09ef, _0x1bf536) { return _0xde09ef * _0x1bf536; }, 'EkpzJ': function (_0x499f26, _0x18a3dd) { return _0x499f26 * _0x18a3dd; }, 'jhTbN': _0x2f961a(0x928), 'cWtjt': function (_0x52adad, _0x229f3e) { return _0x52adad === _0x229f3e; }, 'nJVzB': _0x2f961a(0xccb), 'WmIJM': function (_0xc9e723, _0x2defe8) { return _0xc9e723 + _0x2defe8; }, 'IIUIO': function (_0x129117, _0x9cbd28) { return _0x129117 * _0x9cbd28; }, 'pZLjs': 'INOUTEXPO', 'kPQvF': function (_0x11f7c6, _0x3e5e80) { return _0x11f7c6 === _0x3e5e80; }, 'KRQqN': function (_0x3aee94, _0xbe2c44) { return _0x3aee94 * _0xbe2c44; }, 'thLoV': function (_0x56fe54, _0x3f12a1) { return _0x56fe54 * _0x3f12a1; }, 'rYMWj': function (_0x3d8686, _0x5c0b33) { return _0x3d8686 * _0x5c0b33; }, 'vAfVI': function (_0x5152a6, _0x2ee582) { return _0x5152a6 + _0x2ee582; }, 'IOfDU': _0x2f961a(0x86b), 'gstYh': function (_0xf59f04, _0x2553cf) { return _0xf59f04 / _0x2553cf; }, 'mYPon': function (_0x367559, _0x597d27) { return _0x367559 * _0x597d27; }, 'hyOIp': _0x2f961a(0xc07), 'PmclC': function (_0x252e6c, _0x1ef1a4) { return _0x252e6c - _0x1ef1a4; }, 'AXagf': 'INOUTCIRC', 'ZpxhS': function (_0x15354a, _0x1e846c) { return _0x15354a - _0x1e846c; }, 'vpyPX': function (_0x44775a, _0x3e01b1) { return _0x44775a * _0x3e01b1; }, 'PZJzb': function (_0x41b8ac, _0xa02df5) { return _0x41b8ac - _0xa02df5; }, 'aGndP': _0x2f961a(0x345), 'pxVsf': function (_0x70dbe7, _0x58ee1a) { return _0x70dbe7 * _0x58ee1a; }, 'eKIyI': function (_0x2c4019, _0x5392e8) { return _0x2c4019 * _0x5392e8; }, 'GGvWx': 'OUTBACK', 'bZCgO': function (_0x22bc16, _0x1d5746) { return _0x22bc16 + _0x1d5746; }, 'RxfjA': function (_0x4148c3, _0x3b35f8) { return _0x4148c3 * _0x3b35f8; }, 'TwJWd': function (_0x4a1968, _0x4e1c6) { return _0x4a1968 * _0x4e1c6; }, 'Xktlp': function (_0x2f027f, _0x175fcb) { return _0x2f027f + _0x175fcb; }, 'OShWe': _0x2f961a(0xa8f), 'bjVlr': function (_0xda13d5, _0x564644) { return _0xda13d5 < _0x564644; }, 'IbkpW': function (_0x58aedb, _0x1a0cd8) { return _0x58aedb * _0x1a0cd8; }, 'HQdip': function (_0x44ecb0, _0x1fedc5) { return _0x44ecb0 * _0x1fedc5; }, 'VemQk': function (_0x4c9536, _0x346860) { return _0x4c9536 - _0x346860; }, 'dxlBK': function (_0x58b373, _0x2e1f5d) { return _0x58b373 * _0x2e1f5d; }, 'nXSaY': function (_0x1472d0, _0x58dd7d) { return _0x1472d0 * _0x58dd7d; }, 'vKjwh': function (_0x5865d5, _0x31f610) { return _0x5865d5 + _0x31f610; }, 'vMepU': function (_0x10267a, _0x200ea3) { return _0x10267a * _0x200ea3; }, 'FDuef': function (_0xe82280, _0x2befaa) { return _0xe82280 + _0x2befaa; }, 'vzXRh': 'INELASTIC', 'gsaRt': function (_0x5370cf, _0x2e34d2) { return _0x5370cf === _0x2e34d2; }, 'vDoNT': function (_0x11a6ba, _0x142311) { return _0x11a6ba === _0x142311; }, 'tUeqa': function (_0x231f63, _0x101e7f) { return _0x231f63 / _0x101e7f; }, 'eYpMd': function (_0x5772eb, _0x2eed5b) { return _0x5772eb - _0x2eed5b; }, 'kozCP': function (_0x1b328f, _0x554d0b) { return _0x1b328f * _0x554d0b; }, 'XczrH': function (_0x45e4a3, _0x1dacf1) { return _0x45e4a3 * _0x1dacf1; }, 'SFFnP': function (_0x45b26e, _0x2c7666) { return _0x45b26e - _0x2c7666; }, 'EfIrM': function (_0x2be02a, _0xbf2ead) { return _0x2be02a * _0xbf2ead; }, 'MfSFh': _0x2f961a(0x72f), 'BvcYO': function (_0x1013b9, _0x3cd58b) { return _0x1013b9 * _0x3cd58b; }, 'JwIIL': function (_0xd4b525, _0x46d0b3) { return _0xd4b525 / _0x46d0b3; }, 'rBgek': function (_0x10f6ce, _0xa1d503) { return _0x10f6ce * _0xa1d503; }, 'Fxmnr': function (_0x1a4a8d, _0x27dce4) { return _0x1a4a8d * _0x27dce4; }, 'aXSwW': function (_0x152155, _0x226bd5) { return _0x152155 - _0x226bd5; }, 'cnLxg': function (_0x259e3c, _0x349995) { return _0x259e3c * _0x349995; }, 'EQdZl': _0x2f961a(0x583) + 'IC', 'ykdXo': function (_0x507fb3, _0x50541e) { return _0x507fb3 - _0x50541e; }, 'NhLSb': function (_0x616806, _0x476651) { return _0x616806 === _0x476651; }, 'vhLPx': function (_0x2b8d77, _0x752d22) { return _0x2b8d77 - _0x752d22; }, 'hETDB': function (_0x3b05b6, _0x190c28) { return _0x3b05b6 * _0x190c28; }, 'FrEbP': function (_0x2be663, _0x1a6da6) { return _0x2be663 / _0x1a6da6; }, 'Wjusv': function (_0x5dd826, _0x1b2b15) { return _0x5dd826 * _0x1b2b15; }, 'TFkBu': function (_0x598c78, _0x209ebd) { return _0x598c78 * _0x209ebd; }, 'bKiPy': function (_0x133cc2, _0x8ca597) { return _0x133cc2 * _0x8ca597; }, 'jHVcg': function (_0x52029d, _0x46a0da) { return _0x52029d * _0x46a0da; }, 'vzrQV': function (_0x5efa82, _0x28fdb1) { return _0x5efa82 / _0x28fdb1; }, 'sqzMh': function (_0x2196b0, _0x3b0fdd) { return _0x2196b0 - _0x3b0fdd; }, 'yEzIA': function (_0x50bac4, _0x9617c1) { return _0x50bac4 * _0x9617c1; }, 'rBuEE': function (_0x5ae3b9, _0x5d708f) { return _0x5ae3b9 + _0x5d708f; }, 'BoqQI': function (_0x21d717, _0x3c35a8) { return _0x21d717 * _0x3c35a8; }, 'CoJnI': function (_0x7dd265, _0x3e5ebe) { return _0x7dd265 * _0x3e5ebe; }, 'LDOcx': 'OUTBOUNCE', 'PzNmE': function (_0x2b8084, _0x2d816b) { return _0x2b8084 < _0x2d816b; }, 'dfJDh': function (_0x31a119, _0x2906c3) { return _0x31a119 / _0x2906c3; }, 'rzEWz': function (_0x132026, _0x17bb06) { return _0x132026 - _0x17bb06; }, 'rJaqV': function (_0x821b30, _0x51cbe9) { return _0x821b30 / _0x51cbe9; }, 'EYxNi': function (_0x1bf8a4, _0x2da00d) { return _0x1bf8a4 * _0x2da00d; }, 'jljmX': function (_0x3b3527, _0x4947b0) { return _0x3b3527 * _0x4947b0; }, 'BABBF': function (_0x4f60ba, _0x4e229f) { return _0x4f60ba < _0x4e229f; }, 'ngOkQ': function (_0x5861c4, _0x328da4) { return _0x5861c4 / _0x328da4; }, 'FkaaQ': function (_0x518498, _0x9ddbae) { return _0x518498 / _0x9ddbae; }, 'pdAIl': function (_0x694068, _0x5a701b) { return _0x694068 * _0x5a701b; }, 'rKrtw': _0x2f961a(0xab8), 'XHsRV': function (_0x3de086, _0x385fe8) { return _0x3de086 - _0x385fe8; }, 'oCshK': 'outbounce', 'YYxMM': _0x2f961a(0x96c) + 'E', 'CRUhc': function (_0x1a38ce, _0x29ef6b) { return _0x1a38ce < _0x29ef6b; }, 'Uwipg': 'inbounce', 'laWFy': function (_0x2ddd34, _0x5b0770) { return _0x2ddd34 - _0x5b0770; }, 'GLkzp': function (_0x39b635, _0xdb1c2) { return _0x39b635 * _0xdb1c2; } }; _0x3367f1 = _0x3367f1[_0x2f961a(0xac2) + 'e'](); var _0x20eec4 = -0x1ec5 * 0x1 + -0x1387 * 0x1 + 0x324d + 0.7015800000000001, _0x71cd8a = 0x33 * -0xe + -0xb3 * 0x8 + 0x862 + 0.7; switch (_0x3367f1) { case _0x7b991c[_0x2f961a(0xf16)]: return _0x37866c; case _0x7b991c[_0x2f961a(0xd9f)]: return _0x7b991c['RCwey'](_0x7b991c[_0x2f961a(0xe74)](-(-0x5ff + 0x3 * 0xa94 + -0x19bc), Math[_0x2f961a(0x562)](_0x7b991c[_0x2f961a(0xe74)](_0x37866c, _0x7b991c[_0x2f961a(0x4c5)](Math['PI'], 0x29 * -0xe2 + -0x3 * -0x6bb + 0x1003)))), -0xc5 * -0x5 + -0x398 * 0x1 + -0x8 * 0x8); case _0x7b991c[_0x2f961a(0x1fc)]: return Math[_0x2f961a(0x105b)](_0x7b991c[_0x2f961a(0xe74)](_0x37866c, _0x7b991c[_0x2f961a(0x94e)](Math['PI'], 0xfe0 + -0x2310 + 0x1332))); case _0x7b991c[_0x2f961a(0x718)]: return _0x7b991c['xnaUI'](-(-0x12e2 + -0x686 * -0x5 + -0x24a * 0x6 + 0.5), _0x7b991c[_0x2f961a(0x452)](Math[_0x2f961a(0x562)](_0x7b991c['xnaUI'](Math['PI'], _0x37866c)), -0xd76 + -0x8 * -0x3ee + -0x11f9)); case _0x7b991c[_0x2f961a(0x7cb)]: return _0x7b991c[_0x2f961a(0xe74)](_0x37866c, _0x37866c); case _0x7b991c[_0x2f961a(0xe3b)]: return _0x7b991c[_0x2f961a(0x524)](_0x37866c, _0x7b991c[_0x2f961a(0x533)](0x5c * 0x6a + -0x18d1 + 0x2b * -0x4f, _0x37866c)); case _0x7b991c[_0x2f961a(0x366)]: return _0x7b991c[_0x2f961a(0x907)](_0x37866c, 0xac1 + 0x133d + -0x1dfe + 0.5) ? _0x7b991c[_0x2f961a(0x524)](_0x7b991c['XuGhQ'](0x260f + 0x23a6 * 0x1 + 0x3e1 * -0x13, _0x37866c), _0x37866c) : _0x7b991c[_0x2f961a(0x8db)](-(-0x16d * -0x1 + 0x263 + -0x3cf), _0x7b991c['padPp'](_0x7b991c['wTguA'](0x22eb + -0x3 * -0x4b9 + -0x3112, _0x7b991c[_0x2f961a(0x1de)](0x384 * 0x5 + -0x13 * -0x12e + -0x13fe * 0x2, _0x37866c)), _0x37866c)); case _0x7b991c[_0x2f961a(0x6e1)]: return _0x7b991c[_0x2f961a(0x93d)](_0x7b991c[_0x2f961a(0x1de)](_0x37866c, _0x37866c), _0x37866c); case _0x7b991c['wbJcY']: var _0x28d6b2 = _0x7b991c[_0x2f961a(0xe90)](_0x37866c, -0x1b0c + 0x437 + 0x16d6); return _0x7b991c[_0x2f961a(0x6e9)](_0x7b991c[_0x2f961a(0x93d)](_0x7b991c['padPp'](_0x28d6b2, _0x28d6b2), _0x28d6b2), 0x11b6 + 0x18e0 + 0x2a95 * -0x1); case _0x7b991c[_0x2f961a(0x8bc)]: return _0x7b991c['brtwi'](_0x37866c, 0x1acd + 0x8d8 + -0x23a5 + 0.5) ? _0x7b991c[_0x2f961a(0x4fa)](_0x7b991c['FPbKX'](_0x7b991c[_0x2f961a(0x524)](0x31 * -0x15 + -0x139f + -0x4 * -0x5ea, _0x37866c), _0x37866c), _0x37866c) : _0x7b991c[_0x2f961a(0x90c)](_0x7b991c[_0x2f961a(0x524)](_0x7b991c[_0x2f961a(0x26a)](_0x7b991c[_0x2f961a(0x452)](_0x37866c, 0x1 * 0x1472 + -0x1ffb * 0x1 + -0x1 * -0xb8a), _0x7b991c['wTguA'](_0x7b991c['XuGhQ'](0x34c * 0xa + -0x1 * -0x9d + -0x5 * 0x6b7, _0x37866c), -0x76d + 0x1315 + 0x2 * -0x5d3)), _0x7b991c[_0x2f961a(0x533)](_0x7b991c[_0x2f961a(0xf38)](0x1f2f + -0x5e9 + -0x84 * 0x31, _0x37866c), 0x1 * -0x1f99 + -0xe40 + -0x22f * -0x15)), -0x6f * 0x56 + 0x1 * 0x602 + -0x1 * -0x1f49); case _0x7b991c['jHFEf']: return _0x7b991c['LHhpx'](_0x7b991c[_0x2f961a(0x511)](_0x7b991c[_0x2f961a(0xf38)](_0x37866c, _0x37866c), _0x37866c), _0x37866c); case _0x7b991c[_0x2f961a(0x740)]: var _0x28d6b2 = _0x7b991c[_0x2f961a(0xa7f)](_0x37866c, -0x1d4 * -0xf + 0x22a3 + 0xa9 * -0x5e); return _0x7b991c[_0x2f961a(0xae6)](0x1 * 0x3f0 + 0x3 * 0x8d3 + -0x1e68, _0x7b991c['hVWcI'](_0x7b991c['YbODz'](_0x7b991c[_0x2f961a(0x511)](_0x28d6b2, _0x28d6b2), _0x28d6b2), _0x28d6b2)); case _0x7b991c[_0x2f961a(0xda3)]: var _0x28d6b2 = _0x7b991c[_0x2f961a(0xe90)](_0x37866c, 0x1206 + 0xf32 * -0x1 + 0x3 * -0xf1); return _0x7b991c['JMfNI'](_0x37866c, -0x1f02 + -0x557 + 0x2459 + 0.5) ? _0x7b991c[_0x2f961a(0x93d)](_0x7b991c[_0x2f961a(0xd8e)](_0x7b991c[_0x2f961a(0xbde)](_0x7b991c[_0x2f961a(0xd2f)](0x1f53 + 0x20fc + -0x4047, _0x37866c), _0x37866c), _0x37866c), _0x37866c) : _0x7b991c[_0x2f961a(0xa66)](0x1dda + -0x3 * -0xd3 + -0x2052, _0x7b991c[_0x2f961a(0x3ee)](_0x7b991c['loACV'](_0x7b991c[_0x2f961a(0x95b)](_0x7b991c['XuGhQ'](0x22c7 + 0x1e7 * -0xd + 0x502 * -0x2, _0x28d6b2), _0x28d6b2), _0x28d6b2), _0x28d6b2)); case _0x7b991c[_0x2f961a(0xe98)]: return _0x7b991c[_0x2f961a(0x1043)](_0x7b991c[_0x2f961a(0xb7a)](_0x7b991c[_0x2f961a(0x524)](_0x7b991c[_0x2f961a(0xe74)](_0x37866c, _0x37866c), _0x37866c), _0x37866c), _0x37866c); case _0x7b991c['djygS']: var _0x28d6b2 = _0x7b991c['hrtrs'](_0x37866c, 0x2147 * 0x1 + -0x11a7 + -0x2b * 0x5d); return _0x7b991c[_0x2f961a(0x90c)](0xb8e + 0x1cdd + -0x286a, _0x7b991c[_0x2f961a(0x5ff)](_0x7b991c[_0x2f961a(0x341)](_0x7b991c[_0x2f961a(0xbde)](_0x7b991c[_0x2f961a(0xf4e)](_0x28d6b2, _0x28d6b2), _0x28d6b2), _0x28d6b2), _0x28d6b2)); case _0x7b991c[_0x2f961a(0xdb3)]: var _0x28d6b2 = _0x7b991c[_0x2f961a(0x821)](_0x37866c, -0x127 * -0x16 + 0x1010 + -0x2969); return _0x7b991c['RwCRF'](_0x37866c, 0x17b5 + -0x1571 + -0x244 + 0.5) ? _0x7b991c[_0x2f961a(0x1013)](_0x7b991c[_0x2f961a(0x5a7)](_0x7b991c[_0x2f961a(0xe74)](_0x7b991c['jtfnj'](_0x7b991c['xnaUI'](0x20ea + 0x463 * -0x5 + -0xaeb, _0x37866c), _0x37866c), _0x37866c), _0x37866c), _0x37866c) : _0x7b991c['FykVp'](-0x1355 + 0x258d * 0x1 + -0x1237, _0x7b991c[_0x2f961a(0x421)](_0x7b991c['EkpzJ'](_0x7b991c[_0x2f961a(0x5a7)](_0x7b991c[_0x2f961a(0xcfc)](_0x7b991c[_0x2f961a(0xbde)](0x2256 + 0x236 * -0x10 + 0x5e * 0x3, _0x28d6b2), _0x28d6b2), _0x28d6b2), _0x28d6b2), _0x28d6b2)); case _0x7b991c['jhTbN']: if (_0x7b991c[_0x2f961a(0x5a2)](_0x37866c, 0x1191 * -0x1 + -0x89 * -0x11 + 0x878)) return -0x1958 + 0x3 * 0x3d6 + 0xdd6; return Math['pow'](0x65d + -0x1278 + 0xc1d, _0x7b991c['BZOmK'](-0xe26 * -0x2 + 0xa98 + 0x2 * -0x136d, _0x7b991c[_0x2f961a(0x452)](_0x37866c, -0x253b + -0x1741 + -0xc19 * -0x5))); case _0x7b991c[_0x2f961a(0xd82)]: if (_0x7b991c[_0x2f961a(0x5a2)](_0x37866c, -0x11eb + 0xd94 + 0x22c * 0x2)) return -0x2173 + -0xb2a + 0x2c9e; return _0x7b991c[_0x2f961a(0x589)](-Math[_0x2f961a(0x897)](0x1419 + -0x1 * 0x2645 + 0x122e, _0x7b991c[_0x2f961a(0xb0d)](-(0xe2a * -0x1 + -0x26b7 + 0x17 * 0x24d), _0x37866c)), 0x1705 + -0x25ac * 0x1 + 0xea8); case _0x7b991c[_0x2f961a(0xc20)]: if (_0x7b991c[_0x2f961a(0xa33)](_0x37866c, 0x1 * -0x94 + 0x5 * -0x83 + 0x1 * 0x323) || _0x7b991c['cWtjt'](_0x37866c, -0x254 * 0xe + -0xbcb + -0x3 * -0xecc)) return _0x37866c; var _0x5272ec = _0x7b991c['BZOmK'](_0x37866c, -0x2253 + -0xb73 * 0x1 + 0x14 * 0x24a), _0x2ab2b5 = _0x7b991c[_0x2f961a(0x533)](_0x5272ec, 0x1e3f + -0xb2 * -0x37 + -0x447c); if (_0x7b991c[_0x2f961a(0x483)](_0x5272ec, -0xcf3 + -0x1 * -0x1c8e + -0xf9a)) return _0x7b991c[_0x2f961a(0x1053)](0x3b * -0x5b + -0x106 + 0x15ff + 0.5, Math[_0x2f961a(0x897)](-0x25b0 + 0x1964 + -0x13b * -0xa, _0x7b991c[_0x2f961a(0xb59)](0x4 * -0xa1 + -0x6 * -0x43 + -0xe * -0x12, _0x2ab2b5))); return _0x7b991c[_0x2f961a(0x6f5)](-0x644 + -0x1ed6 + 0x251a + 0.5, _0x7b991c['vAfVI'](-Math[_0x2f961a(0x897)](-0xa * -0x4b + -0x22ac + -0x2 * -0xfe0, _0x7b991c[_0x2f961a(0xaa3)](-(0x1c + -0x2639 + -0x2627 * -0x1), _0x2ab2b5)), -0x2cf * 0x6 + 0xd8f + 0x1 * 0x34d)); case _0x7b991c['IOfDU']: var _0x5272ec = _0x7b991c[_0x2f961a(0xc0e)](_0x37866c, -0x2003 + 0x1a83 + 0x1 * 0x581); return _0x7b991c['mYPon'](-(-0x1 * 0x742 + -0x13 * 0x2e + 0xaad), _0x7b991c[_0x2f961a(0xa7f)](Math[_0x2f961a(0x7ef)](_0x7b991c[_0x2f961a(0xa7f)](0x1440 + 0x1925 * 0x1 + -0x2d64, _0x7b991c[_0x2f961a(0x95b)](_0x5272ec, _0x37866c))), 0xe99 * 0x2 + 0x4bc + -0x5 * 0x6c9)); case _0x7b991c[_0x2f961a(0xa53)]: var _0x28d6b2 = _0x7b991c[_0x2f961a(0x98c)](_0x37866c, 0x43 * -0x1b + 0x198a + 0x1278 * -0x1); return Math[_0x2f961a(0x7ef)](_0x7b991c[_0x2f961a(0xa7f)](0x62b * -0x5 + -0x26f5 + 0x1 * 0x45cd, _0x7b991c[_0x2f961a(0xf38)](_0x28d6b2, _0x28d6b2))); case _0x7b991c[_0x2f961a(0x2d4)]: var _0x5272ec = _0x7b991c[_0x2f961a(0x26a)](_0x37866c, 0x1e1 + -0x7f7 + 0x618), _0x2ab2b5 = _0x7b991c['PmclC'](_0x5272ec, -0x1af * -0x4 + -0x130 + 0x1 * -0x58a); if (_0x7b991c[_0x2f961a(0x907)](_0x5272ec, -0x1 * -0x1ae7 + -0x26b * -0x2 + -0x1fbc)) return _0x7b991c[_0x2f961a(0x95b)](-(0x61 * 0x67 + -0xa63 * -0x3 + 0x10 * -0x463 + 0.5), _0x7b991c['ibDzn'](Math['sqrt'](_0x7b991c[_0x2f961a(0x6c0)](0x4 * 0x48e + 0x1cfd * 0x1 + -0x2f34, _0x7b991c['thLoV'](_0x5272ec, _0x5272ec))), -0xb * -0x30b + -0x25db + 0x463)); return _0x7b991c[_0x2f961a(0x978)](0xc0f + -0x93f * 0x1 + -0x2d0 + 0.5, _0x7b991c[_0x2f961a(0x6e9)](Math[_0x2f961a(0x7ef)](_0x7b991c['PZJzb'](-0xfac + 0x9 * -0x8d + 0x14a2, _0x7b991c['LHhpx'](_0x2ab2b5, _0x2ab2b5))), -0x503 * 0x1 + 0x26ce * 0x1 + 0x32 * -0xad)); case _0x7b991c[_0x2f961a(0x43d)]: return _0x7b991c[_0x2f961a(0x1093)](_0x7b991c['EkpzJ'](_0x37866c, _0x37866c), _0x7b991c[_0x2f961a(0x98c)](_0x7b991c['eKIyI'](_0x7b991c['MArjV'](_0x20eec4, 0x18d * -0x19 + 0x2 * 0x12c4 + 0x13e * 0x1), _0x37866c), _0x20eec4)); case _0x7b991c[_0x2f961a(0x107d)]: var _0x5272ec = _0x7b991c[_0x2f961a(0xa7f)](_0x7b991c[_0x2f961a(0x4c5)](_0x37866c, -0x202 * 0x9 + 0x228e + -0x107b), 0x1dde + -0x3 * 0xae5 + 0x13 * 0x26); return _0x7b991c['bZCgO'](_0x7b991c[_0x2f961a(0xab4)](_0x7b991c[_0x2f961a(0x9a8)](_0x5272ec, _0x5272ec), _0x7b991c[_0x2f961a(0x6e9)](_0x7b991c[_0x2f961a(0x9c9)](_0x7b991c[_0x2f961a(0xb00)](_0x20eec4, -0xf8a + 0x1036 + -0x9 * 0x13), _0x5272ec), _0x20eec4)), -0x1 * -0x602 + 0x1da1 + -0x23a2); break; case _0x7b991c[_0x2f961a(0xfe3)]: var _0x5272ec = _0x7b991c['thLoV'](_0x37866c, 0x24ae + -0x3 * 0xc23 + -0x43), _0x3d3fdb = _0x7b991c[_0x2f961a(0xae6)](_0x5272ec, 0x9cf * 0x3 + -0xf7d + -0xdee * 0x1), _0x308e0b = _0x7b991c['QgFMt'](_0x20eec4, 0xd6 + 0x7cf + -0x8a4 + 0.5249999999999999); if (_0x7b991c[_0x2f961a(0xa2e)](_0x5272ec, 0xb82 + -0x67 + -0x7 * 0x196)) return _0x7b991c[_0x2f961a(0xbde)](_0x7b991c['IbkpW'](_0x7b991c[_0x2f961a(0xf3f)](0x1c6 * -0x13 + 0x1cb5 * -0x1 + 0x3e67 + 0.5, _0x5272ec), _0x5272ec), _0x7b991c[_0x2f961a(0x9a6)](_0x7b991c[_0x2f961a(0x421)](_0x7b991c[_0x2f961a(0xa99)](_0x308e0b, -0x135 + -0x213e + 0x5a * 0x62), _0x5272ec), _0x308e0b)); return _0x7b991c[_0x2f961a(0xd1b)](-0x1c12 * 0x1 + -0x1 * -0xb26 + 0x10ec + 0.5, _0x7b991c[_0x2f961a(0x589)](_0x7b991c[_0x2f961a(0xa95)](_0x7b991c[_0x2f961a(0xa95)](_0x3d3fdb, _0x3d3fdb), _0x7b991c[_0x2f961a(0xb20)](_0x7b991c['vMepU'](_0x7b991c[_0x2f961a(0x270)](_0x308e0b, 0xdce + 0x666 + 0x1 * -0x1433), _0x3d3fdb), _0x308e0b)), -0x1678 + -0x94 * -0x1c + -0x17 * -0x46)); case _0x7b991c[_0x2f961a(0xdb5)]: if (_0x7b991c['gsaRt'](_0x37866c, -0x24a + 0x1a66 + -0x181c) || _0x7b991c[_0x2f961a(0x62a)](_0x37866c, -0x1 * 0x626 + 0x1cd2 + 0x1 * -0x16ab)) return _0x37866c; var _0x5272ec = _0x7b991c['tUeqa'](_0x37866c, 0x5 * -0x6e0 + 0x26f7 + 0x2 * -0x24b), _0x2ab2b5 = _0x7b991c[_0x2f961a(0x413)](_0x5272ec, 0x174e + -0x255 + -0x14f8), _0x54a18e = _0x7b991c[_0x2f961a(0x815)](-0x24cf + -0x212a + 0x6a * 0xa9, _0x71cd8a), _0x308e0b = _0x7b991c[_0x2f961a(0xcfc)](_0x7b991c['oLQAY'](_0x54a18e, _0x7b991c[_0x2f961a(0x9a8)](-0xb4c + -0x15c6 + -0x2 * -0x108a, Math['PI'])), Math['asin'](0x1cce + 0xc44 + -0x2911)); return -_0x7b991c['kozCP'](Math[_0x2f961a(0x897)](0x9c7 * -0x2 + -0x1c24 * 0x1 + 0x2fb4 * 0x1, _0x7b991c[_0x2f961a(0xe74)](-0x3 * 0x357 + 0x3b * 0x31 + 0x9e * -0x2, _0x2ab2b5)), Math[_0x2f961a(0x105b)](_0x7b991c[_0x2f961a(0x4c5)](_0x7b991c[_0x2f961a(0xff1)](_0x7b991c[_0x2f961a(0xf0d)](_0x2ab2b5, _0x308e0b), _0x7b991c[_0x2f961a(0xc67)](0x153 + 0x1 * -0x67f + 0x52e, Math['PI'])), _0x54a18e))); case _0x7b991c[_0x2f961a(0x601)]: var _0x54a18e = _0x7b991c['PZJzb'](-0x2 * -0xab4 + -0x2281 + 0xd * 0x102, _0x71cd8a), _0x5272ec = _0x7b991c['BvcYO'](_0x37866c, 0xbe9 * 0x1 + -0x1 * 0xeb7 + 0x3c * 0xc); if (_0x7b991c[_0x2f961a(0x9f2)](_0x37866c, 0x8b6 * 0x4 + -0x65 * 0x1f + 0x7 * -0x33b) || _0x7b991c[_0x2f961a(0x5a2)](_0x37866c, -0x178f + 0x874 + 0x78e * 0x2)) return _0x37866c; var _0x308e0b = _0x7b991c[_0x2f961a(0xf3f)](_0x7b991c['JwIIL'](_0x54a18e, _0x7b991c[_0x2f961a(0xc99)](-0x1f7 * 0x2 + -0x246c + -0x2 * -0x142e, Math['PI'])), Math[_0x2f961a(0x6d8)](0x6ae + -0x368 + 0x1 * -0x345)); return _0x7b991c[_0x2f961a(0xa99)](_0x7b991c[_0x2f961a(0x1db)](Math[_0x2f961a(0x897)](-0x6f9 + 0x1 * 0x1d03 + -0x1608, _0x7b991c[_0x2f961a(0x6bf)](-(0x1365 + -0x6bf + -0xc9c), _0x5272ec)), Math[_0x2f961a(0x105b)](_0x7b991c[_0x2f961a(0x71a)](_0x7b991c[_0x2f961a(0xf38)](_0x7b991c[_0x2f961a(0xd28)](_0x5272ec, _0x308e0b), _0x7b991c[_0x2f961a(0x823)](-0x1839 + 0xd * 0x59 + 0x13b6, Math['PI'])), _0x54a18e))), -0x1f0 * 0x14 + -0x1 * -0x139 + 0x2588); case _0x7b991c[_0x2f961a(0x9b2)]: var _0x54a18e = _0x7b991c[_0x2f961a(0xba5)](0x1c + 0xcbf * -0x2 + 0x1 * 0x1963, _0x71cd8a); if (_0x7b991c[_0x2f961a(0x86e)](_0x37866c, -0x3b3 * -0xa + -0x4ca + -0x80d * 0x4) || _0x7b991c[_0x2f961a(0xa33)](_0x37866c, -0x905 + 0x1 * 0x13fe + -0x75 * 0x18)) return _0x37866c; var _0x5272ec = _0x7b991c[_0x2f961a(0x93d)](_0x37866c, 0x1 * 0x23b1 + 0x230e + -0x46bd), _0x2ab2b5 = _0x7b991c[_0x2f961a(0x4a6)](_0x5272ec, -0xaaf + -0x1c6d + -0x24d * -0x11), _0x308e0b = _0x7b991c[_0x2f961a(0x676)](_0x7b991c[_0x2f961a(0xa69)](_0x54a18e, _0x7b991c['Wjusv'](0x25e5 + 0x25c5 + -0x4ba8, Math['PI'])), Math[_0x2f961a(0x6d8)](-0x12ad + -0x2595 + 0x3843)); if (_0x7b991c[_0x2f961a(0x483)](_0x5272ec, 0xd28 * 0x2 + 0x169f + -0x1877 * 0x2)) return _0x7b991c[_0x2f961a(0x661)](-(-0x254 * 0xb + 0x15a6 + 0x3f6 + 0.5), _0x7b991c[_0x2f961a(0x45f)](Math[_0x2f961a(0x897)](-0xec7 * -0x1 + -0x11e5 * 0x2 + 0x1 * 0x1505, _0x7b991c[_0x2f961a(0x87b)](0xaaf + -0x65 * -0x42 + -0x24af * 0x1, _0x2ab2b5)), Math[_0x2f961a(0x105b)](_0x7b991c['vzrQV'](_0x7b991c[_0x2f961a(0xaa1)](_0x7b991c[_0x2f961a(0x720)](_0x2ab2b5, _0x308e0b), _0x7b991c[_0x2f961a(0x6c6)](0x3 * -0x4e7 + -0x6b5 * -0x2 + 0x9 * 0x25, Math['PI'])), _0x54a18e)))); return _0x7b991c['rBuEE'](_0x7b991c['padPp'](_0x7b991c['BoqQI'](Math[_0x2f961a(0x897)](0x1df6 * -0x1 + -0xd4 * -0xf + 0x118c, _0x7b991c[_0x2f961a(0xaa3)](-(0xb1 * 0x1a + 0x6 * -0x1cd + 0x2 * -0x391), _0x2ab2b5)), Math['sin'](_0x7b991c[_0x2f961a(0x71a)](_0x7b991c[_0x2f961a(0x6bf)](_0x7b991c['VemQk'](_0x2ab2b5, _0x308e0b), _0x7b991c[_0x2f961a(0xa04)](-0x852 + -0x1c4c + 0x24a0, Math['PI'])), _0x54a18e))), 0xf18 + -0x108a + 0x2 * 0xb9 + 0.5), -0x1541 + -0x196d + 0x25 * 0x143); case _0x7b991c['LDOcx']: var _0x5272ec = _0x7b991c[_0x2f961a(0x94e)](_0x37866c, 0x1b3 * -0x6 + -0x1d2f + -0x13b1 * -0x2); if (_0x7b991c[_0x2f961a(0x97f)](_0x5272ec, _0x7b991c[_0x2f961a(0x42a)](-0x446 * -0x1 + 0x2f * 0x4f + 0x3 * -0x642, 0x1 * 0x233c + -0x166f * -0x1 + -0x39a9 + 0.75))) return _0x7b991c['vpyPX'](_0x7b991c[_0x2f961a(0x421)](-0x3 * 0x4f2 + -0x151d + 0x23fa + 0.5625, _0x5272ec), _0x5272ec); else { if (_0x7b991c[_0x2f961a(0xc88)](_0x5272ec, _0x7b991c['dfJDh'](-0xfc7 * 0x2 + 0x1fb2 + 0x22 * -0x1, -0x5e * 0x14 + 0x2 * 0x1385 + -0x1fb0 + 0.75))) { var _0x3d3fdb = _0x7b991c[_0x2f961a(0x7c4)](_0x5272ec, _0x7b991c['rJaqV'](-0x1 * 0x1abd + -0x1c41 + 0x36ff + 0.5, -0x5e3 + -0xeb4 * 0x2 + 0x234d + 0.75)); return _0x7b991c['WmIJM'](_0x7b991c['EYxNi'](_0x7b991c[_0x2f961a(0x1092)](0x1f8e + 0x704 + -0xcd9 * 0x3 + 0.5625, _0x3d3fdb), _0x3d3fdb), -0x3 * 0xa64 + -0x87 * -0x1a + 0x1176 + 0.75); } else { if (_0x7b991c[_0x2f961a(0x1063)](_0x5272ec, _0x7b991c[_0x2f961a(0x4c5)](0x11 * 0x10c + 0x1d15 + 0xa9 * -0x47 + 0.5, 0x113a + 0x1913 + -0x2a4b + 0.75))) { var _0x3d3fdb = _0x7b991c['PmclC'](_0x5272ec, _0x7b991c[_0x2f961a(0x6f2)](0x39 * -0x1 + -0x1fda + 0x2b * 0xbf + 0.25, -0x14a0 + -0x206 + 0x1d * 0xc8 + 0.75)); return _0x7b991c[_0x2f961a(0xa99)](_0x7b991c[_0x2f961a(0x676)](_0x7b991c['BZOmK'](0x55e + -0x3a * -0x1d + -0xbe9 * 0x1 + 0.5625, _0x3d3fdb), _0x3d3fdb), -0x14d * -0x1 + -0xd3d + 0x2fc * 0x4 + 0.9375); } else { var _0x3d3fdb = _0x7b991c['aXSwW'](_0x5272ec, _0x7b991c['FkaaQ'](-0xa * 0xa3 + -0x24b7 + 0x2b17 + 0.625, 0x18d * -0x9 + -0x1e40 + 0x2c37 + 0.75)); return _0x7b991c[_0x2f961a(0xb92)](_0x7b991c[_0x2f961a(0x83e)](_0x7b991c[_0x2f961a(0xf38)](-0x4 * -0x1c3 + -0xd5e + 0x659 + 0.5625, _0x3d3fdb), _0x3d3fdb), -0x13d0 + 0x962 * -0x1 + 0x1d32 * 0x1 + 0.984375); } } } case _0x7b991c['rKrtw']: var _0x507817 = _0x7b991c[_0x2f961a(0x3d2)](0x31 * 0xbb + -0xed5 * -0x1 + -0x329f, VisuMZ['ApplyEasin' + 'g'](_0x7b991c[_0x2f961a(0xba5)](-0x3 * 0x4dd + -0xc7 * 0x13 + 0x1d5d, _0x37866c), _0x7b991c[_0x2f961a(0xf68)])); return _0x507817; case _0x7b991c[_0x2f961a(0x861)]: if (_0x7b991c[_0x2f961a(0x8b4)](_0x37866c, 0x1 * -0x1363 + -0x4 * 0x841 + 0x3467 + 0.5)) var _0x507817 = _0x7b991c['jtfnj'](VisuMZ['ApplyEasin' + 'g'](_0x7b991c['PvkaY'](_0x37866c, 0xa12 + -0x21f8 + 0x17e8), _0x7b991c[_0x2f961a(0xdfb)]), 0x2f * -0xb5 + 0xc35 + 0x1506 + 0.5); else var _0x507817 = _0x7b991c['csHyN'](_0x7b991c[_0x2f961a(0x341)](VisuMZ['ApplyEasin' + 'g'](_0x7b991c[_0x2f961a(0x939)](_0x7b991c[_0x2f961a(0xf46)](_0x37866c, 0x17e5 * -0x1 + -0x15da + 0x2dc1), 0x1f26 + -0xdf8 + -0x112d * 0x1), _0x7b991c[_0x2f961a(0xf68)]), 0x4 * 0x35f + 0x2610 + 0x1 * -0x338c + 0.5), 0x9a * 0x10 + -0x881 * -0x4 + -0x2ba4 + 0.5); return _0x507817; default: return _0x37866c; } }, VisuMZ['GetParamIc' + 'on'] = function (_0x2dd496) { const _0x5e7040 = _0x3a6da1, _0x946abc = { 'CCMkI': function (_0x4b13a3, _0x5bcffa) { return _0x4b13a3(_0x5bcffa); }, 'VYdzQ': function (_0x2e3374, _0x2b0fe1) { return _0x2e3374 === _0x2b0fe1; }, 'FBqsY': 'MAXHP', 'YSIAJ': _0x5e7040(0x4a4), 'MWibH': _0x5e7040(0x84e), 'Biwoq': _0x5e7040(0x7e1), 'BKOIL': _0x5e7040(0x20b), 'KNRWb': function (_0x4f0055, _0x4469f5) { return _0x4f0055 === _0x4469f5; }, 'QEaIl': _0x5e7040(0x28b), 'xYtXW': function (_0x45de61, _0x5c56d7) { return _0x45de61 === _0x5c56d7; }, 'FeVsJ': _0x5e7040(0x514), 'olgHT': _0x5e7040(0xffe), 'gDQTS': _0x5e7040(0xa27), 'HWQQq': function (_0x6771c4, _0x4a47d7) { return _0x6771c4 === _0x4a47d7; }, 'WUrnj': _0x5e7040(0x932), 'sVNao': 'CRI', 'nbfVq': _0x5e7040(0xe97), 'CTeFV': function (_0x5bed6e, _0x49ff1a) { return _0x5bed6e === _0x49ff1a; }, 'DYWzf': _0x5e7040(0x7f2), 'vYbPl': function (_0x3d20fb, _0x2d67bb) { return _0x3d20fb === _0x2d67bb; }, 'Ynuyc': _0x5e7040(0x1040), 'OugxQ': _0x5e7040(0xf81), 'wQtsC': _0x5e7040(0x830), 'cUnIS': function (_0x519ab7, _0x24d211) { return _0x519ab7 === _0x24d211; }, 'FuKXz': _0x5e7040(0xa4b), 'KxGHO': _0x5e7040(0xf6e), 'OJOPn': function (_0x54277d, _0x41b4c1) { return _0x54277d === _0x41b4c1; }, 'PKgUq': 'TGR', 'LQpjp': function (_0x3f95d6, _0x2561d8) { return _0x3f95d6 === _0x2561d8; }, 'xBRda': 'GRD', 'MWClV': _0x5e7040(0x4f4), 'Olqgo': _0x5e7040(0x1054), 'YIHTj': function (_0x81f2f0, _0x1bd849) { return _0x81f2f0 === _0x1bd849; }, 'KpJhT': _0x5e7040(0xe08), 'tLtfF': function (_0x12dae1, _0x9cb6f3) { return _0x12dae1 === _0x9cb6f3; }, 'hCDEW': 'TCR', 'ZcWsk': function (_0x2181bb, _0xff1382) { return _0x2181bb === _0xff1382; }, 'LAPzH': _0x5e7040(0x763), 'ZpsLS': function (_0x25c3b1, _0x4bc71) { return _0x25c3b1 === _0x4bc71; }, 'KEviu': _0x5e7040(0x371), 'vHCXH': _0x5e7040(0x93e), 'GnIkv': _0x5e7040(0xf63) }; _0x2dd496 = _0x946abc[_0x5e7040(0x71f)](String, _0x2dd496)[_0x5e7040(0xac2) + 'e'](); const _0x1553e7 = VisuMZ['CoreEngine'][_0x5e7040(0x316)][_0x5e7040(0x6ad)]; if (_0x946abc[_0x5e7040(0x8b3)](_0x2dd496, _0x946abc[_0x5e7040(0x449)])) return _0x1553e7[_0x5e7040(0xdd7)]; if (_0x946abc[_0x5e7040(0x8b3)](_0x2dd496, _0x946abc[_0x5e7040(0xb64)])) return _0x1553e7['IconParam1']; if (_0x946abc['VYdzQ'](_0x2dd496, _0x946abc[_0x5e7040(0xfd9)])) return _0x1553e7['IconParam2']; if (_0x946abc['VYdzQ'](_0x2dd496, _0x946abc[_0x5e7040(0x48b)])) return _0x1553e7[_0x5e7040(0x57d)]; if (_0x946abc['VYdzQ'](_0x2dd496, _0x946abc['BKOIL'])) return _0x1553e7[_0x5e7040(0x7d9)]; if (_0x946abc[_0x5e7040(0x433)](_0x2dd496, _0x946abc[_0x5e7040(0xa06)])) return _0x1553e7['IconParam5']; if (_0x946abc['xYtXW'](_0x2dd496, _0x946abc[_0x5e7040(0xdee)])) return _0x1553e7[_0x5e7040(0xa1c)]; if (_0x946abc[_0x5e7040(0x433)](_0x2dd496, _0x946abc[_0x5e7040(0xcb1)])) return _0x1553e7[_0x5e7040(0xe12)]; if (_0x946abc[_0x5e7040(0x8b3)](_0x2dd496, _0x946abc[_0x5e7040(0x66a)])) return _0x1553e7[_0x5e7040(0xc9d) + '0']; if (_0x946abc['HWQQq'](_0x2dd496, _0x946abc[_0x5e7040(0x5ca)])) return _0x1553e7['IconXParam' + '1']; if (_0x946abc[_0x5e7040(0x3d0)](_0x2dd496, _0x946abc[_0x5e7040(0xb95)])) return _0x1553e7['IconXParam' + '2']; if (_0x946abc['HWQQq'](_0x2dd496, _0x946abc[_0x5e7040(0x6c2)])) return _0x1553e7[_0x5e7040(0xc9d) + '3']; if (_0x946abc[_0x5e7040(0x621)](_0x2dd496, _0x946abc[_0x5e7040(0x535)])) return _0x1553e7['IconXParam' + '4']; if (_0x946abc[_0x5e7040(0xb2e)](_0x2dd496, _0x946abc[_0x5e7040(0x9c8)])) return _0x1553e7['IconXParam' + '5']; if (_0x946abc[_0x5e7040(0xb2e)](_0x2dd496, _0x946abc['OugxQ'])) return _0x1553e7['IconXParam' + '6']; if (_0x946abc[_0x5e7040(0x3d0)](_0x2dd496, _0x946abc[_0x5e7040(0xeb0)])) return _0x1553e7[_0x5e7040(0xc9d) + '7']; if (_0x946abc[_0x5e7040(0x7b2)](_0x2dd496, _0x946abc['FuKXz'])) return _0x1553e7['IconXParam' + '8']; if (_0x946abc['VYdzQ'](_0x2dd496, _0x946abc[_0x5e7040(0xa70)])) return _0x1553e7['IconXParam' + '9']; if (_0x946abc[_0x5e7040(0xce9)](_0x2dd496, _0x946abc[_0x5e7040(0xc7a)])) return _0x1553e7[_0x5e7040(0x6ca) + '0']; if (_0x946abc['LQpjp'](_0x2dd496, _0x946abc[_0x5e7040(0x396)])) return _0x1553e7['IconSParam' + '1']; if (_0x946abc['HWQQq'](_0x2dd496, _0x946abc['MWClV'])) return _0x1553e7[_0x5e7040(0x6ca) + '2']; if (_0x946abc[_0x5e7040(0xce9)](_0x2dd496, _0x946abc[_0x5e7040(0xcf5)])) return _0x1553e7[_0x5e7040(0x6ca) + '3']; if (_0x946abc[_0x5e7040(0xc8e)](_0x2dd496, _0x946abc['KpJhT'])) return _0x1553e7[_0x5e7040(0x6ca) + '4']; if (_0x946abc[_0x5e7040(0x540)](_0x2dd496, _0x946abc['hCDEW'])) return _0x1553e7['IconSParam' + '5']; if (_0x946abc['ZcWsk'](_0x2dd496, _0x946abc['LAPzH'])) return _0x1553e7[_0x5e7040(0x6ca) + '6']; if (_0x946abc[_0x5e7040(0x493)](_0x2dd496, _0x946abc[_0x5e7040(0x51e)])) return _0x1553e7[_0x5e7040(0x6ca) + '7']; if (_0x946abc[_0x5e7040(0xce9)](_0x2dd496, _0x946abc[_0x5e7040(0x1f5)])) return _0x1553e7[_0x5e7040(0x6ca) + '8']; if (_0x946abc[_0x5e7040(0xb2e)](_0x2dd496, _0x946abc[_0x5e7040(0xeae)])) return _0x1553e7['IconSParam' + '9']; if (VisuMZ[_0x5e7040(0xc9f)][_0x5e7040(0xf93) + _0x5e7040(0xb1a)][_0x2dd496]) return VisuMZ[_0x5e7040(0xc9f)][_0x5e7040(0xf93) + _0x5e7040(0xb1a)][_0x2dd496] || -0x16f2 + 0x26 * 0x56 + 0xa2e; return -0x4 * -0x122 + -0x1c7b + 0x1 * 0x17f3; }, VisuMZ[_0x3a6da1(0xbc8) + 'berToStrin' + 'g'] = function (_0x31b7d4, _0x329811, _0x188fab) { const _0xcc646 = _0x3a6da1, _0xf8aec0 = { 'IlsMn': _0xcc646(0xb3f), 'IJdPM': function (_0x626a2d, _0x4bba13) { return _0x626a2d === _0x4bba13; }, 'MlYXe': function (_0x53fa92, _0x42e121) { return _0x53fa92 % _0x42e121; }, 'TskCv': function (_0x5e08d0, _0x472e56) { return _0x5e08d0 + _0x472e56; }, 'fHCDa': function (_0x253e1f, _0x1dc534) { return _0x253e1f(_0x1dc534); }, 'FRHsO': function (_0xff7eab, _0x394de3) { return _0xff7eab * _0x394de3; }, 'jiAfc': function (_0x362ab3, _0x276817) { return _0x362ab3 || _0x276817; }, 'JnLDo': function (_0x5984c3, _0x247fe2) { return _0x5984c3 !== _0x247fe2; }, 'duuhh': _0xcc646(0x6b9), 'knqpk': 'MAXMP', 'LpEDp': 'ATK', 'qydjv': _0xcc646(0x7e1), 'mLQsl': 'MAT', 'pJlaX': _0xcc646(0x28b), 'FwTBV': 'AGI', 'RZPOL': 'LUK', 'VWvhE': function (_0xda7a09, _0x53870d) { return _0xda7a09 === _0x53870d; }, 'VUhYy': _0xcc646(0x4c7), 'SHwYD': function (_0x3c4c5c, _0x398285) { return _0x3c4c5c + _0x398285; }, 'rqrSe': function (_0x10df50, _0x2c2131) { return _0x10df50 * _0x2c2131; } }, _0x58a9d6 = _0xf8aec0[_0xcc646(0x1098)][_0xcc646(0x80d)]('|'); let _0x460f2f = 0x1a90 + -0x191a + -0x176; while (!![]) { switch (_0x58a9d6[_0x460f2f++]) { case '0': if (_0xf8aec0[_0xcc646(0x7d6)](_0x188fab, undefined) && _0xf8aec0['IJdPM'](_0xf8aec0[_0xcc646(0xad5)](_0x31b7d4, -0x12f8 + 0x1346 * 0x1 + 0x1 * -0x4d), 0x141e + 0x1637 + 0x1 * -0x2a55)) return _0x31b7d4; continue; case '1': return _0xf8aec0[_0xcc646(0x28d)](_0xf8aec0['fHCDa'](String, _0xf8aec0[_0xcc646(0xae1)](_0x31b7d4, -0x1ee7 + -0x2596 + -0x1 * -0x44e1)[_0xcc646(0x49f)](_0x329811)), '%'); case '2': _0x329811 = _0xf8aec0['jiAfc'](_0x329811, 0x1f56 + 0x12b6 + -0x320c); continue; case '3': if (_0xf8aec0['JnLDo'](_0x188fab, undefined) && [_0xf8aec0[_0xcc646(0x537)], _0xf8aec0[_0xcc646(0xbd4)], _0xf8aec0[_0xcc646(0x641)], _0xf8aec0[_0xcc646(0xdcf)], _0xf8aec0[_0xcc646(0x7cc)], _0xf8aec0[_0xcc646(0x6c5)], _0xf8aec0[_0xcc646(0xf40)], _0xf8aec0[_0xcc646(0x1052)]]['includes'](_0xf8aec0[_0xcc646(0x1099)](String, _0x188fab)[_0xcc646(0xac2) + 'e']()[_0xcc646(0x2d6)]())) return _0x31b7d4; continue; case '4': if (VisuMZ[_0xcc646(0xc9f)][_0xcc646(0xf93) + 'mAbb'][_0x188fab]) return _0xf8aec0['VWvhE'](VisuMZ['CoreEngine'][_0xcc646(0xf93) + 'mType'][_0x188fab], _0xf8aec0[_0xcc646(0x7c1)]) ? _0x31b7d4 : _0xf8aec0[_0xcc646(0x456)](_0xf8aec0['fHCDa'](String, _0xf8aec0[_0xcc646(0xfc7)](_0x31b7d4, 0x1708 + -0xb76 + -0xb2e)[_0xcc646(0x49f)](_0x329811)), '%'); continue; }break; } }, VisuMZ[_0x3a6da1(0x438) + 's'] = function (_0x122144) { const _0x4758f2 = _0x3a6da1, _0x1e8e22 = { 'WITQt': function (_0x1a8069, _0x1c13f1) { return _0x1a8069 === _0x1c13f1; }, 'KIXWV': function (_0x28b8c2, _0x143b66) { return _0x28b8c2 === _0x143b66; }, 'XcqNy': function (_0x40a967, _0x149f3f) { return _0x40a967 - _0x149f3f; }, 'yXTFE': function (_0x31736d, _0x22adeb) { return _0x31736d + _0x22adeb; }, 'dZIqx': function (_0x3ada8b, _0x4318f9) { return _0x3ada8b(_0x4318f9); }, 'UeaEC': function (_0x7a7d4, _0x496896) { return _0x7a7d4 === _0x496896; }, 'tgpKk': function (_0x8d43c6, _0x4aa123) { return _0x8d43c6 + _0x4aa123; }, 'gWbHJ': function (_0xaa6868, _0xbea4f3) { return _0xaa6868(_0xbea4f3); }, 'dfYJD': function (_0x15f1a3, _0x2921ef) { return _0x15f1a3(_0x2921ef); }, 'JoJVZ': function (_0x42ea2f, _0xe3a31b) { return _0x42ea2f(_0xe3a31b); }, 'EDONm': function (_0x56b572, _0x205f47) { return _0x56b572 !== _0x205f47; }, 'BaGIj': _0x4758f2(0xa7e), 'JxlKG': _0x4758f2(0xc8d) }; _0x122144 = _0x1e8e22['JoJVZ'](String, _0x122144); if (!_0x122144) return _0x122144; if (_0x1e8e22['EDONm'](typeof _0x122144, _0x1e8e22[_0x4758f2(0xb27)])) return _0x122144; const _0x311b35 = VisuMZ['CoreEngine'][_0x4758f2(0x316)][_0x4758f2(0xfee)][_0x4758f2(0xacd) + 'ingLocale'] || _0x1e8e22[_0x4758f2(0x7b8)], _0x800edf = { 'maximumFractionDigits': 0x6 }; _0x122144 = _0x122144[_0x4758f2(0xdac)](/\[(.*?)\]/g, (_0x30d71a, _0x3a8f44) => { const _0x2c72ee = _0x4758f2; return VisuMZ[_0x2c72ee(0xcd0) + 'mbers'](_0x3a8f44, '[', ']'); }), _0x122144 = _0x122144[_0x4758f2(0xdac)](/<(.*?)>/g, (_0x4a14b3, _0x5ed64c) => { const _0x4aafe0 = _0x4758f2; return VisuMZ[_0x4aafe0(0xcd0) + _0x4aafe0(0xcd8)](_0x5ed64c, '<', '>'); }), _0x122144 = _0x122144['replace'](/\{\{(.*?)\}\}/g, (_0x4a45e5, _0x2821ac) => { const _0x39136d = _0x4758f2; return VisuMZ['PreserveNu' + _0x39136d(0xcd8)](_0x2821ac, '', ''); }), _0x122144 = _0x122144[_0x4758f2(0xdac)](/(\d+\.?\d*)/g, (_0x58597a, _0x19b012) => { const _0xcfbc7e = _0x4758f2; let _0x3f6cf9 = _0x19b012; if (_0x1e8e22[_0xcfbc7e(0xaaa)](_0x3f6cf9[0x12b * 0x17 + -0x261e + -0x1 * -0xb41], '0')) return _0x3f6cf9; if (_0x1e8e22[_0xcfbc7e(0xd33)](_0x3f6cf9[_0x1e8e22[_0xcfbc7e(0x382)](_0x3f6cf9[_0xcfbc7e(0x786)], 0x75 * -0x3e + 0x1394 + 0x1 * 0x8c3)], '.')) return _0x1e8e22[_0xcfbc7e(0xfec)](_0x1e8e22[_0xcfbc7e(0x5f5)](Number, _0x3f6cf9)['toLocaleSt' + _0xcfbc7e(0x8e6)](_0x311b35, _0x800edf), '.'); else return _0x1e8e22['UeaEC'](_0x3f6cf9[_0x1e8e22[_0xcfbc7e(0x382)](_0x3f6cf9[_0xcfbc7e(0x786)], -0x1dd2 + -0x1 * -0x1f2b + -0x158)], ',') ? _0x1e8e22[_0xcfbc7e(0x69b)](_0x1e8e22[_0xcfbc7e(0xa2d)](Number, _0x3f6cf9)[_0xcfbc7e(0x779) + _0xcfbc7e(0x8e6)](_0x311b35, _0x800edf), ',') : _0x1e8e22[_0xcfbc7e(0xcd1)](Number, _0x3f6cf9)[_0xcfbc7e(0x779) + _0xcfbc7e(0x8e6)](_0x311b35, _0x800edf); }); let _0x1bc819 = -0x233 + 0x6d * -0x33 + 0x17ed; while (_0x1bc819--) { _0x122144 = VisuMZ[_0x4758f2(0x788) + _0x4758f2(0xc25) + 's'](_0x122144); } return _0x122144; }, VisuMZ[_0x3a6da1(0xcd0) + _0x3a6da1(0xcd8)] = function (_0x750b27, _0xb6ff55, _0x389d32) { const _0x353a00 = _0x3a6da1, _0x4776cb = { 'aqieZ': '%2%1%3' }; return _0x750b27 = _0x750b27[_0x353a00(0xdac)](/(\d)/gi, (_0x3a4996, _0x5bd7f2) => (_0x353a00(0x375) + _0x353a00(0x22f) + ')')[_0x353a00(0xfc8)](Number(_0x5bd7f2))), _0x4776cb[_0x353a00(0x374)][_0x353a00(0xfc8)](_0x750b27, _0xb6ff55, _0x389d32); }, VisuMZ[_0x3a6da1(0x788) + _0x3a6da1(0xc25) + 's'] = function (_0x8e311a) { return _0x8e311a = _0x8e311a['replace'](/PRESERVCONVERSION\((\d+)\)/gi, (_0xad5074, _0x298b2f) => Number(parseInt(_0x298b2f))), _0x8e311a; }, VisuMZ['openURL'] = function (_0x59c79) { const _0x21e419 = _0x3a6da1, _0x5097fd = { 'aZdsH': _0x21e419(0xf9e), 'TMCiW': function (_0x517d96, _0x37358e) { return _0x517d96 == _0x37358e; }, 'rwhXS': _0x21e419(0xd7e), 'mcoYo': 'open', 'YgmHK': _0x21e419(0xef9), 'MkvgQ': _0x21e419(0x2b1), 'aBOpf': _0x21e419(0x619), 'DbPWu': function (_0x4e34b5, _0x2491d8) { return _0x4e34b5(_0x2491d8); }, 'YpLqu': _0x21e419(0xe0d) + 'ess', 'EzMNH': function (_0xefe571, _0xc0b52a) { return _0xefe571 + _0xc0b52a; } }; SoundManager[_0x21e419(0x9d6)](); if (!Utils[_0x21e419(0x304)]()) { const _0x3bf5da = window['open'](_0x59c79, _0x5097fd[_0x21e419(0xec1)]); } else { const _0x1c50a7 = _0x5097fd[_0x21e419(0x75f)](process[_0x21e419(0x1087)], _0x5097fd[_0x21e419(0x86c)]) ? _0x5097fd[_0x21e419(0xb99)] : _0x5097fd[_0x21e419(0x75f)](process['platform'], _0x5097fd[_0x21e419(0xb34)]) ? _0x5097fd['MkvgQ'] : _0x5097fd[_0x21e419(0xd3e)]; _0x5097fd[_0x21e419(0x48f)](require, _0x5097fd[_0x21e419(0xbcc)])['exec'](_0x5097fd['EzMNH'](_0x5097fd[_0x21e419(0xce5)](_0x1c50a7, '\x20'), _0x59c79)); } }, VisuMZ[_0x3a6da1(0xf37) + 'S'] = function (_0x5ed416, _0x32483a) { const _0x17ff9c = _0x3a6da1, _0x4e8d5a = { 'obJFI': function (_0x51c354, _0x547ac) { return _0x51c354 !== _0x547ac; }, 'qUdWv': _0x17ff9c(0x1012) + '2', 'JMckM': function (_0x15f99b, _0xc86505) { return _0x15f99b !== _0xc86505; }, 'deLRH': _0x17ff9c(0x7a3) + '2', 'BjtYK': function (_0x43fabe, _0x27e6be) { return _0x43fabe !== _0x27e6be; }, 'xoCrs': function (_0x94609c, _0x18b21e) { return _0x94609c !== _0x18b21e; }, 'utyPG': _0x17ff9c(0xd38) + '2', 'LgAwC': 'Item-%1-%2', 'ERxxx': function (_0x135f55, _0x3a1d2e) { return _0x135f55 === _0x3a1d2e; }, 'nwTGR': _0x17ff9c(0x3fb) + '%2', 'fnXiE': function (_0x3d6363, _0x135253) { return _0x3d6363 !== _0x135253; }, 'zEmoD': function (_0x4a7c0a, _0x1aebf8) { return _0x4a7c0a > _0x1aebf8; }, 'rUIrP': _0x17ff9c(0xac1) + '2', 'dwIVh': function (_0x3580d9, _0x2dcd9a) { return _0x3580d9 !== _0x2dcd9a; }, 'SaAfc': _0x17ff9c(0x3f4) + '2', 'FnoWo': function (_0x1df920, _0x28902f) { return _0x1df920 !== _0x28902f; }, 'dRuXU': function (_0x6162ac, _0x2dac18) { return _0x6162ac !== _0x2dac18; }, 'PcATq': 'State-%1-%' + '2' }; if (!_0x5ed416) return ''; const _0x192d99 = _0x5ed416[_0x17ff9c(0x8cc)] || _0x5ed416['id']; let _0x3ff94e = ''; return _0x4e8d5a['obJFI'](_0x5ed416[_0x17ff9c(0xca3) + 'el'], undefined) && _0x4e8d5a[_0x17ff9c(0xf0b)](_0x5ed416['nickname'], undefined) && (_0x3ff94e = _0x4e8d5a[_0x17ff9c(0x849)][_0x17ff9c(0xfc8)](_0x192d99, _0x32483a)), _0x4e8d5a['JMckM'](_0x5ed416[_0x17ff9c(0x287)], undefined) && _0x4e8d5a[_0x17ff9c(0x35b)](_0x5ed416[_0x17ff9c(0x4ce)], undefined) && (_0x3ff94e = _0x4e8d5a[_0x17ff9c(0x477)][_0x17ff9c(0xfc8)](_0x192d99, _0x32483a)), _0x4e8d5a[_0x17ff9c(0xb2f)](_0x5ed416[_0x17ff9c(0x9b1)], undefined) && _0x4e8d5a[_0x17ff9c(0x6f9)](_0x5ed416['requiredWt' + _0x17ff9c(0xd0c)], undefined) && (_0x3ff94e = _0x4e8d5a[_0x17ff9c(0x36c)][_0x17ff9c(0xfc8)](_0x192d99, _0x32483a)), _0x4e8d5a[_0x17ff9c(0x35b)](_0x5ed416[_0x17ff9c(0x4bc)], undefined) && _0x4e8d5a['obJFI'](_0x5ed416[_0x17ff9c(0x919)], undefined) && (_0x3ff94e = _0x4e8d5a['LgAwC'][_0x17ff9c(0xfc8)](_0x192d99, _0x32483a)), _0x4e8d5a['obJFI'](_0x5ed416[_0x17ff9c(0x1049)], undefined) && _0x4e8d5a['ERxxx'](_0x5ed416['etypeId'], -0x12b2 * -0x1 + -0xb6b + -0x746) && (_0x3ff94e = _0x4e8d5a[_0x17ff9c(0x202)]['format'](_0x192d99, _0x32483a)), _0x4e8d5a[_0x17ff9c(0xad8)](_0x5ed416[_0x17ff9c(0x6de)], undefined) && _0x4e8d5a[_0x17ff9c(0xfb1)](_0x5ed416[_0x17ff9c(0xd14)], -0x26a + -0x6 * 0x2f8 + 0x143b * 0x1) && (_0x3ff94e = _0x4e8d5a['rUIrP']['format'](_0x192d99, _0x32483a)), _0x4e8d5a[_0x17ff9c(0x35b)](_0x5ed416[_0x17ff9c(0x1064)], undefined) && _0x4e8d5a[_0x17ff9c(0x2d2)](_0x5ed416[_0x17ff9c(0xe25)], undefined) && (_0x3ff94e = _0x4e8d5a[_0x17ff9c(0x367)][_0x17ff9c(0xfc8)](_0x192d99, _0x32483a)), _0x4e8d5a[_0x17ff9c(0xe39)](_0x5ed416[_0x17ff9c(0xe2a) + _0x17ff9c(0x3d6)], undefined) && _0x4e8d5a[_0x17ff9c(0x259)](_0x5ed416[_0x17ff9c(0xbf0)], undefined) && (_0x3ff94e = _0x4e8d5a['PcATq'][_0x17ff9c(0xfc8)](_0x192d99, _0x32483a)), _0x3ff94e; }, Game_Picture[_0x3a6da1(0x49b)][_0x3a6da1(0xea3)] = function () { const _0x110077 = _0x3a6da1; return this[_0x110077(0x8fc)]; }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xf22) + _0x3a6da1(0x8a6) + 'ic'] = Game_Picture[_0x3a6da1(0x49b)][_0x3a6da1(0xa30)], Game_Picture[_0x3a6da1(0x49b)][_0x3a6da1(0xa30)] = function () { const _0x4db4d6 = _0x3a6da1; VisuMZ[_0x4db4d6(0xc9f)]['Game_Pictu' + _0x4db4d6(0x8a6) + 'ic'][_0x4db4d6(0xedc)](this), this['_anchor'] = { 'x': 0x0, 'y': 0x0 }, this[_0x4db4d6(0xc48) + _0x4db4d6(0xeaf)] = { 'x': 0x0, 'y': 0x0 }; }, VisuMZ['CoreEngine'][_0x3a6da1(0xf22) + 're_updateM' + _0x3a6da1(0xb2b)] = Game_Picture[_0x3a6da1(0x49b)][_0x3a6da1(0x697)], Game_Picture['prototype']['updateMove'] = function () { const _0x3d5b3a = _0x3a6da1, _0x5bcce5 = { 'JOoBB': function (_0x4a83d3, _0x1270a4) { return _0x4a83d3 > _0x1270a4; }, 'Sjxxw': function (_0x3c6295, _0x116201) { return _0x3c6295 <= _0x116201; }, 'izuEM': _0x3d5b3a(0xd81) + '2' }; this[_0x3d5b3a(0xcfe) + 'or'](); const _0x8f87f7 = this[_0x3d5b3a(0xbb1)]; VisuMZ['CoreEngine']['Game_Pictu' + 're_updateM' + _0x3d5b3a(0xb2b)][_0x3d5b3a(0xedc)](this); if (_0x5bcce5[_0x3d5b3a(0x206)](_0x8f87f7, 0x2 * -0xd61 + 0x14 * -0xd1 + 0x2b16) && _0x5bcce5[_0x3d5b3a(0x8e2)](this[_0x3d5b3a(0xbb1)], -0x267c + 0xe54 + -0x1828 * -0x1)) { const _0x45c7d1 = _0x5bcce5[_0x3d5b3a(0x688)]['split']('|'); let _0x2956ee = 0x494 + 0x20b1 + -0x1d * 0x149; while (!![]) { switch (_0x45c7d1[_0x2956ee++]) { case '0': this['_y'] = this['_targetY']; continue; case '1': this[_0x3d5b3a(0x390)] = this[_0x3d5b3a(0x5a6) + _0x3d5b3a(0x885)]; continue; case '2': this['_anchor'] && (this[_0x3d5b3a(0x8fc)]['x'] = this['_targetAnc' + _0x3d5b3a(0xeaf)]['x'], this[_0x3d5b3a(0x8fc)]['y'] = this['_targetAnc' + 'hor']['y']); continue; case '3': this[_0x3d5b3a(0xf08)] = this[_0x3d5b3a(0x5a6) + _0x3d5b3a(0x108b)]; continue; case '4': this[_0x3d5b3a(0xbf1)] = this['_targetOpa' + _0x3d5b3a(0xe93)]; continue; case '5': this['_x'] = this[_0x3d5b3a(0x748)]; continue; }break; } } }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0xf22) + _0x3a6da1(0x4c9)] = Game_Picture[_0x3a6da1(0x49b)][_0x3a6da1(0x5cd)], Game_Picture['prototype'][_0x3a6da1(0x5cd)] = function (_0x33072a, _0x3a3101, _0x41f2e6, _0x29bd81, _0x3c58bb, _0x1a4b90, _0x3d24ee, _0x6c436d) { const _0xc3359e = _0x3a6da1; VisuMZ[_0xc3359e(0xc9f)][_0xc3359e(0xf22) + _0xc3359e(0x4c9)][_0xc3359e(0xedc)](this, _0x33072a, _0x3a3101, _0x41f2e6, _0x29bd81, _0x3c58bb, _0x1a4b90, _0x3d24ee, _0x6c436d), this[_0xc3359e(0x7de)]([{ 'x': 0x0, 'y': 0x0 }, { 'x': 0.5, 'y': 0.5 }][_0x3a3101] || { 'x': 0x0, 'y': 0x0 }); }, VisuMZ['CoreEngine'][_0x3a6da1(0xf22) + 're_move'] = Game_Picture[_0x3a6da1(0x49b)][_0x3a6da1(0x108d)], Game_Picture[_0x3a6da1(0x49b)][_0x3a6da1(0x108d)] = function (_0x1e0e6f, _0x22ec13, _0x22aaad, _0x1a07f6, _0x2c1507, _0x1b6fb2, _0x42cc75, _0x5e5589, _0x47ac2a) { const _0x3ca600 = _0x3a6da1; VisuMZ[_0x3ca600(0xc9f)]['Game_Pictu' + 're_move'][_0x3ca600(0xedc)](this, _0x1e0e6f, _0x22ec13, _0x22aaad, _0x1a07f6, _0x2c1507, _0x1b6fb2, _0x42cc75, _0x5e5589, _0x47ac2a), this[_0x3ca600(0x994) + _0x3ca600(0xe18)]([{ 'x': 0x0, 'y': 0x0 }, { 'x': 0.5, 'y': 0.5 }][_0x1e0e6f] || { 'x': 0x0, 'y': 0x0 }); }, Game_Picture['prototype'][_0x3a6da1(0xcfe) + 'or'] = function () { const _0x48edbd = _0x3a6da1, _0x530b07 = { 'phqIQ': function (_0x3bc51a, _0x5b714c) { return _0x3bc51a > _0x5b714c; } }; _0x530b07[_0x48edbd(0x35c)](this[_0x48edbd(0xbb1)], 0x19c5 * 0x1 + -0x251d * 0x1 + 0xb58) && (this[_0x48edbd(0x8fc)]['x'] = this[_0x48edbd(0x4f3) + 'g'](this['_anchor']['x'], this[_0x48edbd(0xc48) + _0x48edbd(0xeaf)]['x']), this[_0x48edbd(0x8fc)]['y'] = this[_0x48edbd(0x4f3) + 'g'](this[_0x48edbd(0x8fc)]['y'], this[_0x48edbd(0xc48) + _0x48edbd(0xeaf)]['y'])); }, Game_Picture[_0x3a6da1(0x49b)][_0x3a6da1(0x7de)] = function (_0x102b66) { const _0x338e43 = _0x3a6da1; this[_0x338e43(0x8fc)] = _0x102b66, this['_targetAnc' + _0x338e43(0xeaf)] = JsonEx[_0x338e43(0x4fd) + 'py'](this[_0x338e43(0x8fc)]); }, Game_Picture[_0x3a6da1(0x49b)][_0x3a6da1(0x994) + _0x3a6da1(0xe18)] = function (_0x123bba) { const _0x57c67a = _0x3a6da1; this[_0x57c67a(0xc48) + _0x57c67a(0xeaf)] = _0x123bba; }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x416) + _0x3a6da1(0x938) + _0x3a6da1(0x402)] = Sprite_Picture[_0x3a6da1(0x49b)][_0x3a6da1(0x66e) + 'in'], Sprite_Picture[_0x3a6da1(0x49b)][_0x3a6da1(0x66e) + 'in'] = function () { const _0x2444f7 = _0x3a6da1, _0x5d01f3 = this[_0x2444f7(0x825)](); !_0x5d01f3[_0x2444f7(0xea3)]() ? VisuMZ[_0x2444f7(0xc9f)][_0x2444f7(0x416) + 'ture_updat' + _0x2444f7(0x402)]['call'](this) : (this[_0x2444f7(0xea3)]['x'] = _0x5d01f3['anchor']()['x'], this['anchor']['y'] = _0x5d01f3[_0x2444f7(0xea3)]()['y']); }, Game_Action[_0x3a6da1(0x49b)]['setEnemyAc' + _0x3a6da1(0x56c)] = function (_0x2648cb) { const _0x2f31bd = _0x3a6da1, _0x1f713b = { 'OrXPs': function (_0x350c47, _0x5e4e59) { return _0x350c47 === _0x5e4e59; }, 'wOoWe': function (_0x323876, _0x2bec8e) { return _0x323876 !== _0x2bec8e; } }; if (_0x2648cb) { const _0x50031f = _0x2648cb[_0x2f31bd(0xa85)]; if (_0x1f713b[_0x2f31bd(0xe87)](_0x50031f, 0x23fa + -0x12e8 + -0x101 * 0x11) && _0x1f713b['wOoWe'](this[_0x2f31bd(0xb79)]()['attackSkil' + _0x2f31bd(0x227)](), -0x24ce * -0x1 + -0x8 * 0xa3 + -0x1 * 0x1fb5)) this[_0x2f31bd(0x29f)](); else _0x1f713b[_0x2f31bd(0xe87)](_0x50031f, 0x2288 + -0x29 * 0x16 + 0x7c * -0x40) && _0x1f713b[_0x2f31bd(0xe13)](this['subject']()[_0x2f31bd(0x836) + 'Id'](), 0x131f + -0x1 * -0xd8c + -0x20a9) ? this[_0x2f31bd(0xf75)]() : this[_0x2f31bd(0x2d0)](_0x50031f); } else this[_0x2f31bd(0x7ee)](); }, Game_Actor[_0x3a6da1(0x49b)]['usableSkil' + 'ls'] = function () { const _0x556090 = _0x3a6da1; return this[_0x556090(0x7b9)]()[_0x556090(0x3e7)](_0x322f91 => this[_0x556090(0xade)](_0x322f91) && this['skillTypes']()['includes'](_0x322f91[_0x556090(0x9b1)])); }, Window_Base[_0x3a6da1(0x49b)]['createDimm' + _0x3a6da1(0x6a2)] = function () { const _0x5bd193 = _0x3a6da1; this[_0x5bd193(0x864) + _0x5bd193(0xf74)] = new Sprite(), this[_0x5bd193(0x864) + _0x5bd193(0xf74)][_0x5bd193(0xa7c)] = new Bitmap(-0x1 * 0xefd + -0x198d + 0x288a, -0x19cf + -0x246e + 0x8d * 0x71), this[_0x5bd193(0x864) + _0x5bd193(0xf74)]['x'] = 0x1 * 0x1dc5 + 0x31 * 0x9d + -0x3bd2, this['addChildTo' + _0x5bd193(0x2bd)](this['_dimmerSpr' + _0x5bd193(0xf74)]); }, Window_Base[_0x3a6da1(0x49b)][_0x3a6da1(0xd2d) + 'merBitmap'] = function () { const _0x30ace8 = _0x3a6da1, _0x376788 = { 'FWRlJ': function (_0x2c6dfe, _0x307ade) { return _0x2c6dfe - _0x307ade; }, 'ttmje': function (_0x25143b, _0x2d7e2a) { return _0x25143b * _0x2d7e2a; } }; if (this['_dimmerSpr' + _0x30ace8(0xf74)]) { const _0x2c60c5 = this[_0x30ace8(0x864) + _0x30ace8(0xf74)][_0x30ace8(0xa7c)], _0x15ef02 = this['width'], _0x423889 = this[_0x30ace8(0x944)], _0x5b9acb = this[_0x30ace8(0xd07)], _0x216ed3 = ColorManager[_0x30ace8(0xe0c)](), _0x39ca49 = ColorManager['dimColor2'](); _0x2c60c5[_0x30ace8(0x33c)](_0x15ef02, _0x423889), _0x2c60c5['gradientFi' + _0x30ace8(0xe61)](0x24f3 + -0x346 + -0x25 * 0xe9, -0x2534 * 0x1 + -0x7 * 0xcf + -0x2add * -0x1, _0x15ef02, _0x5b9acb, _0x39ca49, _0x216ed3, !![]), _0x2c60c5['fillRect'](0xff7 + 0x1329 + -0x119 * 0x20, _0x5b9acb, _0x15ef02, _0x376788['FWRlJ'](_0x423889, _0x376788[_0x30ace8(0xa4a)](_0x5b9acb, 0x67 * -0x43 + -0xa42 + 0x2dd * 0xd)), _0x216ed3), _0x2c60c5['gradientFi' + _0x30ace8(0xe61)](0xc87 + -0x1 * 0xdcd + 0x146, _0x376788['FWRlJ'](_0x423889, _0x5b9acb), _0x15ef02, _0x5b9acb, _0x216ed3, _0x39ca49, !![]), this['_dimmerSpr' + _0x30ace8(0xf74)][_0x30ace8(0xb57)](-0xb * 0x103 + -0x1 * 0xf21 + 0x1a42, 0x7fd * 0x1 + 0x1304 + 0x1b01 * -0x1, _0x15ef02, _0x423889); } }, Game_Actor['prototype'][_0x3a6da1(0xd31) + 'ttleAction' + 's'] = function () { const _0x4aa0cd = _0x3a6da1, _0x852aab = { 'CqHJM': function (_0x10fb33, _0x72b951) { return _0x10fb33 < _0x72b951; }, 'JBaBa': function (_0x1ffdc7, _0x2928ef) { return _0x1ffdc7 > _0x2928ef; }, 'QPBrJ': _0x4aa0cd(0x784) }; for (let _0x437b71 = 0x1f * -0x101 + -0x3ce * 0x7 + 0x1 * 0x39c1; _0x852aab[_0x4aa0cd(0xf39)](_0x437b71, this[_0x4aa0cd(0x260)]()); _0x437b71++) { const _0x3e8ad1 = this[_0x4aa0cd(0xdbe) + _0x4aa0cd(0xab3)](); let _0x3e48cd = Number['MIN_SAFE_I' + _0x4aa0cd(0x22c)]; this[_0x4aa0cd(0x83f)](_0x437b71, _0x3e8ad1[0xe6d + -0xf63 + 0x3 * 0x52]); for (const _0x25212b of _0x3e8ad1) { const _0x9b4ed1 = _0x25212b['evaluate'](); _0x852aab['JBaBa'](_0x9b4ed1, _0x3e48cd) && (_0x3e48cd = _0x9b4ed1, this['setAction'](_0x437b71, _0x25212b)); } } this[_0x4aa0cd(0xb65) + _0x4aa0cd(0x56b)](_0x852aab[_0x4aa0cd(0x8df)]); }, Window_BattleItem['prototype'][_0x3a6da1(0xb71)] = function (_0x3e3868) { const _0x499c14 = _0x3a6da1; return BattleManager[_0x499c14(0x1047)]() ? BattleManager['actor']()[_0x499c14(0xade)](_0x3e3868) : Window_ItemList[_0x499c14(0x49b)][_0x499c14(0xb71)][_0x499c14(0xedc)](this, _0x3e3868); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x1d9) + 'createSpri' + _0x3a6da1(0x1035)] = Scene_Map[_0x3a6da1(0x49b)][_0x3a6da1(0xdd0) + 'teset'], Scene_Map['prototype'][_0x3a6da1(0xdd0) + 'teset'] = function () { const _0x1d8b78 = _0x3a6da1; VisuMZ['CoreEngine'][_0x1d8b78(0x1d9) + _0x1d8b78(0xdd0) + _0x1d8b78(0x1035)]['call'](this); const _0x2c5013 = this[_0x1d8b78(0xcaf)][_0x1d8b78(0xd16) + 'te']; if (_0x2c5013) this[_0x1d8b78(0xc5e)](_0x2c5013); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x6cd) + 'le_createS' + _0x3a6da1(0x238) + 'x'] = Scene_Battle[_0x3a6da1(0x49b)][_0x3a6da1(0xdd0) + _0x3a6da1(0xe45)], Scene_Battle[_0x3a6da1(0x49b)]['createSpri' + _0x3a6da1(0xe45)] = function () { const _0xa1d841 = _0x3a6da1; VisuMZ['CoreEngine'][_0xa1d841(0x6cd) + _0xa1d841(0xadc) + 'pritesetFi' + 'x'][_0xa1d841(0xedc)](this); const _0x23a133 = this['_spriteset'][_0xa1d841(0xd16) + 'te']; if (_0x23a133) this[_0xa1d841(0xc5e)](_0x23a133); }, Sprite_Actor['prototype']['update'] = function () { const _0x913de4 = _0x3a6da1, _0x23d9b1 = { 'hVtPf': function (_0x3ba360, _0x4dc4bd) { return _0x3ba360 !== _0x4dc4bd; } }; Sprite_Battler[_0x913de4(0x49b)][_0x913de4(0xc16)][_0x913de4(0xedc)](this), this[_0x913de4(0xed3) + 'ow'](); if (this[_0x913de4(0x464)]) this['updateMoti' + 'on'](); else _0x23d9b1['hVtPf'](this[_0x913de4(0x851) + 'me'], '') && (this['_battlerNa' + 'me'] = ''); }, Window[_0x3a6da1(0x49b)][_0x3a6da1(0xe76) + 'rows'] = function () { const _0x44dd0d = _0x3a6da1, _0x3926f4 = { 'EyOqg': function (_0x539e35, _0x196981) { return _0x539e35 / _0x196981; }, 'TAKgU': function (_0x2c6299, _0xad6814) { return _0x2c6299 + _0xad6814; }, 'NUVjW': function (_0x37e679, _0x1f3a62) { return _0x37e679 + _0x1f3a62; }, 'MGqAw': function (_0x19e813, _0x48344b) { return _0x19e813 + _0x48344b; }, 'RAPpd': function (_0x5c22b3, _0x192f5e) { return _0x5c22b3 + _0x192f5e; }, 'puwhL': function (_0x538dea, _0x120ec3) { return _0x538dea - _0x120ec3; } }, _0x10c7e1 = this[_0x44dd0d(0xa5d)], _0x53a5b4 = this['_height'], _0x51078 = -0x1 * -0x2a1 + 0x5e9 + -0x872, _0x15e873 = _0x3926f4['EyOqg'](_0x51078, -0x1f7 * 0x1 + 0x2c5 * 0x2 + -0x1 * 0x391), _0x3d1794 = _0x3926f4['TAKgU'](0x1 * -0x5c7 + 0x2482 + -0x199 * 0x13, _0x51078), _0x2ec59a = _0x3926f4[_0x44dd0d(0x5e8)](0x14d8 + -0x15 * -0x177 + 0xb * -0x4b1, _0x51078); this[_0x44dd0d(0xdf0) + _0x44dd0d(0x54a)][_0x44dd0d(0xa7c)] = this['_windowski' + 'n'], this[_0x44dd0d(0xdf0) + _0x44dd0d(0x54a)][_0x44dd0d(0xea3)]['x'] = -0x21 * -0x127 + -0xd7e + 0x1 * -0x1889 + 0.5, this['_downArrow' + _0x44dd0d(0x54a)]['anchor']['y'] = 0x3 * -0x36a + -0x43 * -0x69 + -0x1 * 0x113d + 0.5, this[_0x44dd0d(0xdf0) + _0x44dd0d(0x54a)][_0x44dd0d(0xb57)](_0x3926f4[_0x44dd0d(0x5e8)](_0x3d1794, _0x15e873), _0x3926f4[_0x44dd0d(0x1037)](_0x3926f4['RAPpd'](_0x2ec59a, _0x15e873), _0x51078), _0x51078, _0x15e873), this[_0x44dd0d(0xdf0) + _0x44dd0d(0x54a)]['move'](Math[_0x44dd0d(0x48a)](_0x3926f4['EyOqg'](_0x10c7e1, -0xd28 + -0x1898 + 0x25c2)), Math[_0x44dd0d(0x48a)](_0x3926f4[_0x44dd0d(0x383)](_0x53a5b4, _0x15e873))), this[_0x44dd0d(0xe70) + _0x44dd0d(0x4ac)][_0x44dd0d(0xa7c)] = this[_0x44dd0d(0xf41) + 'n'], this[_0x44dd0d(0xe70) + _0x44dd0d(0x4ac)][_0x44dd0d(0xea3)]['x'] = -0xb0b + -0x185 * 0x2 + -0xe15 * -0x1 + 0.5, this[_0x44dd0d(0xe70) + _0x44dd0d(0x4ac)][_0x44dd0d(0xea3)]['y'] = 0x1 * -0x1928 + 0xeda + 0xa4e + 0.5, this[_0x44dd0d(0xe70) + _0x44dd0d(0x4ac)][_0x44dd0d(0xb57)](_0x3926f4['RAPpd'](_0x3d1794, _0x15e873), _0x2ec59a, _0x51078, _0x15e873), this[_0x44dd0d(0xe70) + _0x44dd0d(0x4ac)][_0x44dd0d(0x108d)](Math[_0x44dd0d(0x48a)](_0x3926f4['EyOqg'](_0x10c7e1, -0x52 * 0x33 + -0x13d5 * -0x1 + 0x37d * -0x1)), Math['round'](_0x15e873)); }, Window[_0x3a6da1(0x49b)][_0x3a6da1(0x596) + 'useSign'] = function () { const _0xf5b277 = _0x3a6da1, _0x1d07cc = { 'uoGBc': function (_0x35abef, _0x54f008) { return _0x35abef / _0x54f008; } }, _0x1cf7da = 0x1 * 0x252a + 0xc88 + -0x3122 * 0x1, _0x25ad8a = 0x1 * 0x1d1d + -0x893 + -0x142a, _0x29e26c = 0x24d * -0x5 + -0xe23 + 0x19bc; this[_0xf5b277(0xb18) + _0xf5b277(0x54a)]['bitmap'] = this[_0xf5b277(0xf41) + 'n'], this[_0xf5b277(0xb18) + _0xf5b277(0x54a)][_0xf5b277(0xea3)]['x'] = -0x1a49 + -0x6 * 0x2c2 + -0x33 * -0xd7 + 0.5, this['_pauseSign' + _0xf5b277(0x54a)][_0xf5b277(0xea3)]['y'] = -0xe1e + -0x2108 + 0x2f27, this[_0xf5b277(0xb18) + _0xf5b277(0x54a)][_0xf5b277(0x108d)](Math[_0xf5b277(0x48a)](_0x1d07cc[_0xf5b277(0xacb)](this[_0xf5b277(0xa5d)], 0xc88 + -0x170a * 0x1 + 0xa84)), this[_0xf5b277(0x7f3)]), this['_pauseSign' + _0xf5b277(0x54a)][_0xf5b277(0xb57)](_0x1cf7da, _0x25ad8a, _0x29e26c, _0x29e26c), this[_0xf5b277(0xb18) + 'Sprite'][_0xf5b277(0x430)] = 0x1d5 * 0xa + -0x47 * -0x71 + 0x30aa * -0x1; }, Window[_0x3a6da1(0x49b)]['_updateFil' + _0x3a6da1(0x4bd)] = function () { const _0x5a0580 = _0x3a6da1, _0x3a05e7 = { 'CkpIr': function (_0x586500, _0x1ba44b) { return _0x586500 + _0x1ba44b; }, 'nldVZ': function (_0x91ac7, _0x2d2192) { return _0x91ac7 * _0x2d2192; }, 'tnOvl': function (_0x394bb5, _0x373dbd) { return _0x394bb5 * _0x373dbd; } }, _0x2a237a = this[_0x5a0580(0xdf3) + 'a'][_0x5a0580(0x930) + _0x5a0580(0x6e5)][_0x5a0580(0x432)](new Point(-0x3cf + 0x16 * -0xa3 + 0x1 * 0x11d1, -0x1ac4 + 0xa63 + 0x257 * 0x7)), _0x3c3706 = this[_0x5a0580(0xdf3) + 'a']['filterArea']; _0x3c3706['x'] = _0x3a05e7[_0x5a0580(0x215)](_0x2a237a['x'], this[_0x5a0580(0x4ea)]['x']), _0x3c3706['y'] = _0x3a05e7[_0x5a0580(0x215)](_0x2a237a['y'], this['origin']['y']), _0x3c3706[_0x5a0580(0x4c0)] = Math[_0x5a0580(0xa25)](_0x3a05e7[_0x5a0580(0xd73)](this[_0x5a0580(0x9d5)], this[_0x5a0580(0x357)]['x'])), _0x3c3706[_0x5a0580(0x944)] = Math[_0x5a0580(0xa25)](_0x3a05e7[_0x5a0580(0xa28)](this[_0x5a0580(0xb48) + 't'], this[_0x5a0580(0x357)]['y'])); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x25c) + _0x3a6da1(0x2de)] = Window['prototype']['_refreshBa' + 'ck'], Window['prototype'][_0x3a6da1(0x2ea) + 'ck'] = function () { const _0x8f78c6 = _0x3a6da1, _0x4920b8 = { 'yYOYc': function (_0x4eca5c, _0x234084) { return _0x4eca5c - _0x234084; }, 'PPPeV': function (_0x589652, _0x95410f) { return _0x589652 * _0x95410f; }, 'nuNDo': function (_0x2b5454, _0x56f2e2) { return _0x2b5454 - _0x56f2e2; }, 'dSwSY': function (_0x389ff6, _0x515e16) { return _0x389ff6 * _0x515e16; }, 'nQThy': function (_0x5a1599, _0x287bce) { return _0x5a1599 / _0x287bce; }, 'UwFvz': function (_0x28fcd3, _0x1fa067) { return _0x28fcd3 / _0x1fa067; }, 'iXDrx': function (_0x57b487, _0x5eb0ae) { return _0x57b487 / _0x5eb0ae; } }, _0x105fd7 = VisuMZ[_0x8f78c6(0xc9f)]['Settings']['Window'][_0x8f78c6(0xa49) + 'nBleeding'] ?? !![]; if (!_0x105fd7) return VisuMZ[_0x8f78c6(0xc9f)]['Window_ref' + _0x8f78c6(0x2de)][_0x8f78c6(0xedc)](this); const _0x32d411 = this[_0x8f78c6(0xc35)], _0x500e66 = Math['max'](-0x336 + -0x2260 + 0x2596, _0x4920b8[_0x8f78c6(0xc0c)](this[_0x8f78c6(0xa5d)], _0x4920b8[_0x8f78c6(0xfcb)](_0x32d411, 0xfa8 + -0x1ffe + 0x4 * 0x416))), _0x49959a = Math['max'](-0x4ef * 0x3 + 0x10ba + -0x1ed, _0x4920b8[_0x8f78c6(0xfd3)](this[_0x8f78c6(0x7f3)], _0x4920b8['dSwSY'](_0x32d411, 0x2ef * 0x5 + 0x2062 + -0x2f0b))), _0x408f1d = this[_0x8f78c6(0xd4f) + 'e'], _0x5362c2 = _0x408f1d[_0x8f78c6(0xdb9)][0x897 + 0x123 * 0x17 + -0x22bc]; _0x408f1d[_0x8f78c6(0xa7c)] = this['_windowski' + 'n'], _0x408f1d[_0x8f78c6(0xb57)](0x443 * 0x4 + -0x21f8 + 0x4 * 0x43b, -0x23 + 0xc5 * -0xd + 0xa24, 0x247b + -0xd66 + -0x16b5, -0x11cd + -0x2 * -0xf49 + -0xc65), _0x408f1d[_0x8f78c6(0x108d)](_0x32d411, _0x32d411), _0x408f1d['scale']['x'] = _0x4920b8[_0x8f78c6(0x1e5)](_0x500e66, 0x1b55 * 0x1 + 0x1d * 0x6b + -0x2714), _0x408f1d[_0x8f78c6(0x357)]['y'] = _0x4920b8[_0x8f78c6(0x1e5)](_0x49959a, 0x1074 + -0x25d8 + -0xc7 * -0x1c), _0x5362c2['bitmap'] = this[_0x8f78c6(0xf41) + 'n'], _0x5362c2['setFrame'](0x1ee7 + -0x14f * 0x1d + -0x2c * -0x29, 0x1294 * 0x2 + -0x1596 + -0xf32, -0x1066 + 0x85 * 0x32 + -0x934, 0x13b5 + -0x73b * -0x1 + -0x154 * 0x14), _0x5362c2[_0x8f78c6(0x108d)](0x1b70 + 0x1529 + -0x3099, 0x223 * 0x9 + -0x7 * -0x257 + -0x1 * 0x239c, _0x500e66, _0x49959a), _0x5362c2['scale']['x'] = _0x4920b8[_0x8f78c6(0xc81)](0x2014 + 0x7 * -0x556 + -0x547 * -0x1, _0x408f1d[_0x8f78c6(0x357)]['x']), _0x5362c2['scale']['y'] = _0x4920b8[_0x8f78c6(0xb6b)](-0x1bb5 + -0xba3 + 0x2759, _0x408f1d[_0x8f78c6(0x357)]['y']), _0x408f1d[_0x8f78c6(0x5f3) + 'ne'](this[_0x8f78c6(0xdc6)]); }, Game_Temp['prototype'][_0x3a6da1(0xa8e) + 'nationClea' + 'rEffects'] = function () { const _0xf405a3 = _0x3a6da1; this[_0xf405a3(0xe67) + _0xf405a3(0xe26)] = [], this['_fauxAnima' + _0xf405a3(0xa1e)] = [], this[_0xf405a3(0x563) + _0xf405a3(0xa9f)] = [], this[_0xf405a3(0xbf8) + 'eue'] = []; }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x6ea) + _0x3a6da1(0x22e) + _0x3a6da1(0x108c) + _0x3a6da1(0x4ec)] = Scene_Base[_0x3a6da1(0x49b)][_0x3a6da1(0x266)], Scene_Base[_0x3a6da1(0x49b)][_0x3a6da1(0x266)] = function () { const _0x5d4177 = _0x3a6da1; if ($gameTemp) $gameTemp[_0x5d4177(0xa8e) + _0x5d4177(0xc92) + _0x5d4177(0x6dc)](); VisuMZ['CoreEngine'][_0x5d4177(0x6ea) + _0x5d4177(0x22e) + _0x5d4177(0x108c) + _0x5d4177(0x4ec)][_0x5d4177(0xedc)](this); }, Bitmap[_0x3a6da1(0x49b)]['measureTex' + _0x3a6da1(0x8ca) + 'unding'] = function (_0x978fbe) { const _0x343b6c = _0x3a6da1, _0x39ffcf = this[_0x343b6c(0xf8e)]; _0x39ffcf[_0x343b6c(0xde3)](), _0x39ffcf[_0x343b6c(0xfd1)] = this[_0x343b6c(0xde8) + _0x343b6c(0xb5c)](); const _0x20ba6b = _0x39ffcf[_0x343b6c(0x2ae) + 't'](_0x978fbe)[_0x343b6c(0x4c0)]; return _0x39ffcf[_0x343b6c(0x61c)](), _0x20ba6b; }, Window_Message[_0x3a6da1(0x49b)][_0x3a6da1(0xc68)] = function (_0x234635) { const _0x4a018e = _0x3a6da1; return this[_0x4a018e(0x7f7) + _0x4a018e(0x4ee)]() ? this['contents'][_0x4a018e(0x2ae) + 'tWidthNoRo' + _0x4a018e(0x7d4)](_0x234635) : Window_Base[_0x4a018e(0x49b)][_0x4a018e(0xc68)]['call'](this, _0x234635); }, Window_Message[_0x3a6da1(0x49b)][_0x3a6da1(0x7f7) + 'thFix'] = function () { const _0x592fb5 = _0x3a6da1; return VisuMZ[_0x592fb5(0xc9f)][_0x592fb5(0x316)][_0x592fb5(0xfee)]['FontWidthF' + 'ix'] ?? !![]; }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x437) + _0x3a6da1(0x220) + 'ts'] = Game_Action['prototype']['numRepeats'], Game_Action[_0x3a6da1(0x49b)][_0x3a6da1(0x5f9)] = function () { const _0x5e6da = _0x3a6da1; return this[_0x5e6da(0x440)]() ? VisuMZ[_0x5e6da(0xc9f)][_0x5e6da(0x437) + _0x5e6da(0x220) + 'ts'][_0x5e6da(0xedc)](this) : 0x1240 + 0x5 * 0x254 + -0x1de4; }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x437) + _0x3a6da1(0xd03) + 'k'] = Game_Action[_0x3a6da1(0x49b)][_0x3a6da1(0x29f)], Game_Action[_0x3a6da1(0x49b)][_0x3a6da1(0x29f)] = function () { const _0xeae535 = _0x3a6da1; this[_0xeae535(0xb79)]() && this[_0xeae535(0xb79)]()[_0xeae535(0xe6c)]() ? VisuMZ[_0xeae535(0xc9f)][_0xeae535(0x437) + _0xeae535(0xd03) + 'k'][_0xeae535(0xedc)](this) : this[_0xeae535(0x7ee)](); }, Sprite_Name['prototype']['bitmapHeig' + 'ht'] = function () { return -0x430 * -0x2 + -0x1d37 + 0x1 * 0x14fb; }, Sprite_Name[_0x3a6da1(0x49b)][_0x3a6da1(0x57e)] = function () { const _0x2bb5d8 = _0x3a6da1, _0x5e412d = { 'DlWAb': function (_0x2a5c3e, _0x222a71) { return _0x2a5c3e - _0x222a71; }, 'PteoY': _0x2bb5d8(0x10a7) }, _0x1f0001 = this['name'](), _0x95ecf1 = this['bitmapWidt' + 'h'](), _0x1a2671 = this[_0x2bb5d8(0x65d) + 'ht'](); this[_0x2bb5d8(0x418)](), this[_0x2bb5d8(0xa7c)][_0x2bb5d8(0x7ee)](), this[_0x2bb5d8(0xa7c)]['drawTextTo' + _0x2bb5d8(0x696)](_0x1f0001, -0x1204 + -0x12f3 + 0x24fb, 0xa7f + 0x401 + -0x740 * 0x2, _0x5e412d[_0x2bb5d8(0x9d1)](_0x95ecf1, -0x2513 + 0x956 + 0x1bc7), _0x1a2671, _0x5e412d[_0x2bb5d8(0x613)]); }, Bitmap[_0x3a6da1(0x49b)][_0x3a6da1(0xd6f) + 'pAligned'] = function (_0x448eac, _0x3d88ac, _0x1a2ac9, _0xa02ac7, _0x53df8f, _0x28c9c3) { const _0x43199f = _0x3a6da1, _0x2b0d47 = { 'QKrva': function (_0x1a353e, _0x388e69) { return _0x1a353e || _0x388e69; }, 'hJaTr': function (_0x1e07d5, _0x3645dc) { return _0x1e07d5 + _0x3645dc; }, 'ngkqj': function (_0x5d7e15, _0x5eac7b) { return _0x5d7e15 + _0x5eac7b; }, 'nTFZp': function (_0x440604, _0x1ab428) { return _0x440604 / _0x1ab428; }, 'jLsHp': function (_0x30ff5a, _0x33eeb1) { return _0x30ff5a * _0x33eeb1; }, 'WrsGQ': function (_0x55504b, _0x213ff3) { return _0x55504b === _0x213ff3; }, 'RzRQh': _0x43199f(0xb1e), 'iyGwq': function (_0x5bf951, _0x399b83) { return _0x5bf951 / _0x399b83; }, 'JvylH': 'right', 'SXIYN': _0x43199f(0x611) }, _0x2763a8 = this[_0x43199f(0xf8e)], _0x3b5cac = _0x2763a8[_0x43199f(0xdb0) + 'a']; _0xa02ac7 = _0x2b0d47['QKrva'](_0xa02ac7, -0x3d4ebe98 + -0x5a14069c + -0x15 * -0x13663a27); let _0x5a9a4c = _0x3d88ac, _0x540dd8 = Math['round'](_0x2b0d47[_0x43199f(0xc46)](_0x2b0d47[_0x43199f(0xa62)](_0x1a2ac9, _0x2b0d47[_0x43199f(0x6cf)](0x1 * -0x29c + -0x9e6 + 0xc9a * 0x1, 0x128c + 0x2227 + -0x34b1)), _0x2b0d47[_0x43199f(0xc47)](this['fontSize'], -0x1425 * -0x1 + -0x502 + -0xf23 + 0.35))); _0x2b0d47[_0x43199f(0x25e)](_0x28c9c3, _0x2b0d47[_0x43199f(0xe5b)]) && (_0x5a9a4c += _0x2b0d47[_0x43199f(0xfa9)](_0xa02ac7, 0xd22 + 0x1878 + -0x1 * 0x2598)), _0x2b0d47[_0x43199f(0x25e)](_0x28c9c3, _0x2b0d47['JvylH']) && (_0x5a9a4c += _0xa02ac7), _0x2763a8[_0x43199f(0xde3)](), _0x2763a8[_0x43199f(0xfd1)] = this[_0x43199f(0xde8) + _0x43199f(0xb5c)](), _0x2763a8[_0x43199f(0xd19)] = _0x28c9c3, _0x2763a8[_0x43199f(0xff2) + 'ne'] = _0x2b0d47[_0x43199f(0x93c)], _0x2763a8[_0x43199f(0xdb0) + 'a'] = -0xa * 0x313 + 0x1f6 + -0x1cc9 * -0x1, this[_0x43199f(0x3c3) + _0x43199f(0x6a3)](_0x448eac, _0x5a9a4c, _0x540dd8, _0xa02ac7), _0x2763a8['globalAlph' + 'a'] = _0x3b5cac, this[_0x43199f(0x330) + _0x43199f(0x776)](_0x448eac, _0x5a9a4c, _0x540dd8, _0xa02ac7), _0x2763a8[_0x43199f(0x61c)](), this['_baseTextu' + 're'][_0x43199f(0xc16)](); }, VisuMZ['CoreEngine'][_0x3a6da1(0x8b8) + 'ger_checkS' + _0x3a6da1(0x6d3)] = BattleManager[_0x3a6da1(0x278) + 'itute'], BattleManager[_0x3a6da1(0x278) + 'itute'] = function (_0x33ab23) { const _0x10c061 = _0x3a6da1; if (this[_0x10c061(0xefb)][_0x10c061(0x40c) + 'd']()) return ![]; return VisuMZ[_0x10c061(0xc9f)][_0x10c061(0x8b8) + _0x10c061(0x809) + 'ubstitute'][_0x10c061(0xedc)](this, _0x33ab23); }, BattleManager[_0x3a6da1(0xe52)] = function () { const _0x1ccc6d = _0x3a6da1, _0x87917b = { 'hCEdP': _0x1ccc6d(0xc70), 'CLKDw': function (_0x214010, _0x3a2824) { return _0x214010 === _0x3a2824; } }; if (this[_0x1ccc6d(0x7ed)]) this[_0x1ccc6d(0x6b0)]['endAction'](this[_0x1ccc6d(0x7ed)]); this[_0x1ccc6d(0x37d)] = _0x87917b[_0x1ccc6d(0x642)], this['_subject'] && _0x87917b[_0x1ccc6d(0xaf4)](this[_0x1ccc6d(0x7ed)][_0x1ccc6d(0x260)](), 0x1 * 0xe51 + 0x1f17 + 0x16b4 * -0x2) && (this['endBattler' + 'Actions'](this[_0x1ccc6d(0x7ed)]), this[_0x1ccc6d(0x7ed)] = null); }, Bitmap['prototype']['_startLoad' + _0x3a6da1(0x4d4)] = function () { const _0x1a6aef = _0x3a6da1, _0x357227 = { 'fyEBK': _0x1a6aef(0xa59) + '0', 'xWwqU': function (_0x3b30fa, _0x18e009) { return _0x3b30fa > _0x18e009; }, 'MaFqq': 'loading' }, _0x38642a = _0x357227[_0x1a6aef(0xabe)][_0x1a6aef(0x80d)]('|'); let _0x2de6c6 = -0x1 * 0x60b + -0x12 * -0xea + -0xcd * 0xd; while (!![]) { switch (_0x38642a[_0x2de6c6++]) { case '0': Utils[_0x1a6aef(0xa1b) + 'edImages']() ? this[_0x1a6aef(0x6e7) + 'ypting']() : (this[_0x1a6aef(0x79c)][_0x1a6aef(0x9af)] = this['_url'], ![] && _0x357227[_0x1a6aef(0x2a0)](this['_image'][_0x1a6aef(0x4c0)], 0x4 * 0x3a9 + 0x5c2 * 0x5 + -0x2b6e) && (this[_0x1a6aef(0x79c)][_0x1a6aef(0x4a8)] = null, this[_0x1a6aef(0x905)]())); continue; case '1': this[_0x1a6aef(0x70b) + _0x1a6aef(0x620)](); continue; case '2': this[_0x1a6aef(0x79c)] = new Image(); continue; case '3': this['_image']['onerror'] = this['_onError']['bind'](this); continue; case '4': this['_image'][_0x1a6aef(0x4a8)] = this[_0x1a6aef(0x905)][_0x1a6aef(0xdeb)](this); continue; case '5': this['_loadingSt' + _0x1a6aef(0x702)] = _0x357227[_0x1a6aef(0x893)]; continue; }break; } }, Scene_Skill[_0x3a6da1(0x49b)][_0x3a6da1(0xa50) + _0x3a6da1(0xf30)] = function () { const _0x175424 = _0x3a6da1, _0x31cb72 = { 'yojHR': '2|1|4|3|0' }, _0x24f868 = _0x31cb72[_0x175424(0xe3f)][_0x175424(0x80d)]('|'); let _0x21d5db = 0x1d08 + -0x2ea * 0x9 + -0x2ce; while (!![]) { switch (_0x24f868[_0x21d5db++]) { case '0': this['_skillType' + _0x175424(0x3ef)][_0x175424(0x1085)](); continue; case '1': this['refreshAct' + 'or'](); continue; case '2': Scene_MenuBase[_0x175424(0x49b)]['onActorCha' + 'nge']['call'](this); continue; case '3': this[_0x175424(0xab6) + 'w'][_0x175424(0x986)](); continue; case '4': this[_0x175424(0xab6) + 'w'][_0x175424(0x86d)](); continue; }break; } }, Scene_Skill[_0x3a6da1(0x49b)][_0x3a6da1(0x49c) + 'tonsEnable' + 'd'] = function () { const _0x41c902 = _0x3a6da1; return this[_0x41c902(0x757) + _0x41c902(0x3ef)] && this[_0x41c902(0x757) + _0x41c902(0x3ef)]['active']; }, Game_Map[_0x3a6da1(0x49b)][_0x3a6da1(0xd7b) + 'ge'] = function (_0x30af58, _0x35aef7, _0x3b7412) { const _0x33bed6 = _0x3a6da1, _0x271411 = { 'uOdbO': function (_0x520b76, _0x5755fd) { return _0x520b76 === _0x5755fd; }, 'hRNTl': function (_0x13bb46, _0x114a57) { return _0x13bb46 === _0x114a57; }, 'EbbHO': function (_0x4c4a93, _0x148019) { return _0x4c4a93 + _0x148019; }, 'okEqU': _0x33bed6(0xca4) + _0x33bed6(0x668) + _0x33bed6(0xbc9) + _0x33bed6(0xbf5) + '.', 'KcCYC': 'Click\x20\x22Cop' + _0x33bed6(0x2ab) + _0x33bed6(0x3cf) + '\x20tileset\x27s' + _0x33bed6(0x814), 'NFrPq': 'and\x20add\x20it' + _0x33bed6(0x2a1) + _0x33bed6(0x7ec), 'AJrHY': function (_0x990f04, _0x2acd90) { return _0x990f04(_0x2acd90); }, 'wQcvM': function (_0x48dfa2, _0x5827bc) { return _0x48dfa2 !== _0x5827bc; }, 'qHzbK': function (_0x3b8e12, _0x5a36a7) { return _0x3b8e12 & _0x5a36a7; }, 'cZDJv': function (_0x49fc94, _0x18a7e5) { return _0x49fc94 === _0x18a7e5; }, 'huuvS': function (_0x51329c, _0x3d3b54) { return _0x51329c & _0x3d3b54; }, 'EpADu': function (_0x59dabc, _0x51479c) { return _0x59dabc & _0x51479c; } }, _0x578ca9 = this[_0x33bed6(0x104c) + 'gs'](), _0x5db26e = this['allTiles'](_0x30af58, _0x35aef7); for (const _0x441f65 of _0x5db26e) { const _0x3a77be = _0x578ca9[_0x441f65]; if (_0x271411[_0x33bed6(0x1df)](_0x3a77be, undefined) || _0x271411['hRNTl'](_0x3a77be, null)) { if ($gameTemp['isPlaytest']() && !DataManager['isEventTes' + 't']()) { let _0x571eeb = _0x271411[_0x33bed6(0xe99)](_0x271411[_0x33bed6(0x99f)], '\x0a'); _0x571eeb += _0x271411[_0x33bed6(0xe99)](_0x271411[_0x33bed6(0xf3b)], '\x0a'), _0x571eeb += _0x271411['NFrPq'], this[_0x33bed6(0x6df) + 'leteTilese' + 'tError']() ? (_0x271411['AJrHY'](alert, _0x571eeb), SceneManager[_0x33bed6(0xd80)]()) : (console[_0x33bed6(0xaee)](_0x571eeb), !$gameTemp['_showDevTo' + _0x33bed6(0x3cd)] && ($gameTemp[_0x33bed6(0xe6d) + 'ols'] = !![], SceneManager[_0x33bed6(0xe11) + 'ls']())); } } if (_0x271411[_0x33bed6(0x7ce)](_0x271411[_0x33bed6(0x8f1)](_0x3a77be, 0x17 * -0x6d + -0x20bc + 0x2a97 * 0x1), -0x61 * 0x43 + 0x174e + 0xd * 0x29)) continue; if (_0x271411[_0x33bed6(0x657)](_0x271411[_0x33bed6(0x831)](_0x3a77be, _0x3b7412), 0x186f + 0x3 * 0xcf2 + 0x3f45 * -0x1)) return !![]; if (_0x271411[_0x33bed6(0x657)](_0x271411[_0x33bed6(0xfb9)](_0x3a77be, _0x3b7412), _0x3b7412)) return ![]; } return ![]; }, Game_Map[_0x3a6da1(0x49b)][_0x3a6da1(0x6df) + _0x3a6da1(0x419) + 'tError'] = function () { const _0x3757bd = _0x3a6da1; if (Imported[_0x3757bd(0xf12) + _0x3757bd(0x67a) + _0x3757bd(0x2ba)]) return !![]; if (Imported[_0x3757bd(0x5f8) + _0x3757bd(0xd79) + 'ffects']) return !![]; return ![]; }, Sprite_Animation[_0x3a6da1(0x49b)][_0x3a6da1(0xaab) + 'rt'] = function (_0x48c870) { const _0x3a645a = _0x3a6da1; !this[_0x3a645a(0x32e) + _0x3a645a(0xf55)] && (this[_0x3a645a(0x32e) + _0x3a645a(0xf55)] = _0x48c870['gl'][_0x3a645a(0x941) + 'er'](_0x48c870['gl']['VIEWPORT'])); }, VisuMZ[_0x3a6da1(0xc9f)][_0x3a6da1(0x1d9) + _0x3a6da1(0x99c) + 'save'] = Scene_Map[_0x3a6da1(0x49b)][_0x3a6da1(0x99c) + _0x3a6da1(0xde3)], Scene_Map['prototype'][_0x3a6da1(0x99c) + 'save'] = function () { const _0xdddfbf = _0x3a6da1, _0x5e630f = { 'gKeQy': 'Scene_Titl' + 'e', 'LnxjI': 'Scene_Load', 'ANfGj': 'Scene_Titl' + _0xdddfbf(0x455) + 'n', 'NXjWe': _0xdddfbf(0xfef) + _0xdddfbf(0x812) + 'sition' }, _0x9de378 = SceneManager['_previousC' + _0xdddfbf(0x7eb)][_0xdddfbf(0x796)]; if ([_0x5e630f['gKeQy'], _0x5e630f[_0xdddfbf(0xec7)], _0x5e630f[_0xdddfbf(0xe30)], _0x5e630f['NXjWe']]['includes'](_0x9de378)) return ![]; return VisuMZ['CoreEngine'][_0xdddfbf(0x1d9) + _0xdddfbf(0x99c) + _0xdddfbf(0xde3)][_0xdddfbf(0xedc)](this); };